Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x17e8 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4ff): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc29): mpers-mx32/msqid_ds_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xab4): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3d4): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x108d): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0xa02): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x377): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x272): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe87): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4a3): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ed): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf6f): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x91d): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7c1): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbf3): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0x6f1): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd8f): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xcfa): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x420): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x46c): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x383): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xc14): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x1017): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xe97): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2de): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x42): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb9c): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x1161): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xec2): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xb5e): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x295): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0x3cc): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0x1077): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x794): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xce9): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xbd9): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x38b): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xa90): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x4f2): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0xfc4): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x816): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x12d): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x10c6): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x96a): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x9db): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0xe27): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x1be): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0xd4c): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x625): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x210): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x103d): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x802): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x88f): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x23e): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xee8): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xd5c): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x16e): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x72c): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xaf0): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x105b): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x3f0): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xcbf): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0xa47): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x27c): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x830): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0xb7e): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x498): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x32a): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x39f): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5d7): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0x10a0): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0xe80): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x24a): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x5eb): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x282): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xef7): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x705): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0xc64): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x1ab): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xf56): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x394): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xa39): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x1110): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x4dd): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0xfeb): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0xa53): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x432): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0xb34): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x5c6): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x262): __kernel_mode_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 24
    <539>   DW_AT_decl_column : 22
    <53a>   DW_AT_type        : <0x2b>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x253): __kernel_pid_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 28
    <545>   DW_AT_decl_column : 14
    <546>   DW_AT_type        : <0x64>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x6cb): __kernel_uid32_t
    <54f>   DW_AT_decl_file   : 15
    <550>   DW_AT_decl_line   : 49
    <551>   DW_AT_decl_column : 22
    <552>   DW_AT_type        : <0x2b>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x66a): __kernel_gid32_t
    <55b>   DW_AT_decl_file   : 15
    <55c>   DW_AT_decl_line   : 50
    <55d>   DW_AT_decl_column : 22
    <55e>   DW_AT_type        : <0x2b>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0x9e8): __kernel_time_t
    <567>   DW_AT_decl_file   : 15
    <568>   DW_AT_decl_line   : 89
    <569>   DW_AT_decl_column : 25
    <56a>   DW_AT_type        : <0x51a>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x3fe): kernel_long_t
    <573>   DW_AT_decl_file   : 16
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 25
    <576>   DW_AT_type        : <0x51a>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x90e): kernel_ulong_t
    <57f>   DW_AT_decl_file   : 16
    <580>   DW_AT_decl_line   : 17
    <581>   DW_AT_decl_column : 26
    <582>   DW_AT_type        : <0x526>
 <1><586>: Abbrev Number: 3 (DW_TAG_const_type)
    <587>   DW_AT_type        : <0x57a>
 <1><58b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <58c>   DW_AT_name        : (indirect string, offset: 0xc82): list_item
    <590>   DW_AT_byte_size   : 8
    <591>   DW_AT_decl_file   : 17
    <592>   DW_AT_decl_line   : 92
    <593>   DW_AT_decl_column : 8
    <594>   DW_AT_sibling     : <0x5b7>
 <2><598>: Abbrev Number: 9 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x115c): prev
    <59d>   DW_AT_decl_file   : 17
    <59e>   DW_AT_decl_line   : 93
    <59f>   DW_AT_decl_column : 20
    <5a0>   DW_AT_type        : <0x5b7>
    <5a4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x114b): next
    <5ac>   DW_AT_decl_file   : 17
    <5ad>   DW_AT_decl_line   : 94
    <5ae>   DW_AT_decl_column : 20
    <5af>   DW_AT_type        : <0x5b7>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b6>: Abbrev Number: 0
 <1><5b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5b8>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x58b>
 <1><5bd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x8e6): sysent
    <5c2>   DW_AT_byte_size   : 20
    <5c3>   DW_AT_decl_file   : 18
    <5c4>   DW_AT_decl_line   : 13
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_sibling     : <0x616>
 <2><5ca>: Abbrev Number: 9 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x10b7): nargs
    <5cf>   DW_AT_decl_file   : 18
    <5d0>   DW_AT_decl_line   : 14
    <5d1>   DW_AT_decl_column : 11
    <5d2>   DW_AT_type        : <0x2b>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d9>: Abbrev Number: 9 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x9f8): sys_flags
    <5de>   DW_AT_decl_file   : 18
    <5df>   DW_AT_decl_line   : 15
    <5e0>   DW_AT_decl_column : 6
    <5e1>   DW_AT_type        : <0x64>
    <5e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e8>: Abbrev Number: 18 (DW_TAG_member)
    <5e9>   DW_AT_name        : sen
    <5ed>   DW_AT_decl_file   : 18
    <5ee>   DW_AT_decl_line   : 16
    <5ef>   DW_AT_decl_column : 6
    <5f0>   DW_AT_type        : <0x64>
    <5f4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f7>: Abbrev Number: 9 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x321): sys_func
    <5fc>   DW_AT_decl_file   : 18
    <5fd>   DW_AT_decl_line   : 17
    <5fe>   DW_AT_decl_column : 8
    <5ff>   DW_AT_type        : <0x894>
    <603>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><606>: Abbrev Number: 9 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x28c): sys_name
    <60b>   DW_AT_decl_file   : 18
    <60c>   DW_AT_decl_line   : 18
    <60d>   DW_AT_decl_column : 14
    <60e>   DW_AT_type        : <0x1c2>
    <612>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><615>: Abbrev Number: 0
 <1><616>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <617>   DW_AT_prototyped  : 1
    <618>   DW_AT_type        : <0x64>
    <61c>   DW_AT_sibling     : <0x626>
 <2><620>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <621>   DW_AT_type        : <0x626>
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x631>
 <1><62c>: Abbrev Number: 3 (DW_TAG_const_type)
    <62d>   DW_AT_type        : <0x626>
 <1><631>: Abbrev Number: 21 (DW_TAG_structure_type)
    <632>   DW_AT_name        : tcb
    <636>   DW_AT_byte_size   : 304
    <638>   DW_AT_decl_file   : 19
    <639>   DW_AT_decl_line   : 262
    <63b>   DW_AT_decl_column : 8
    <63c>   DW_AT_sibling     : <0x894>
 <2><640>: Abbrev Number: 22 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x4ec): flags
    <645>   DW_AT_decl_file   : 19
    <646>   DW_AT_decl_line   : 263
    <648>   DW_AT_decl_column : 6
    <649>   DW_AT_type        : <0x64>
    <64d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><650>: Abbrev Number: 23 (DW_TAG_member)
    <651>   DW_AT_name        : pid
    <655>   DW_AT_decl_file   : 19
    <656>   DW_AT_decl_line   : 264
    <658>   DW_AT_decl_column : 6
    <659>   DW_AT_type        : <0x64>
    <65d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><660>: Abbrev Number: 22 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x57): qual_flg
    <665>   DW_AT_decl_file   : 19
    <666>   DW_AT_decl_line   : 265
    <668>   DW_AT_decl_column : 6
    <669>   DW_AT_type        : <0x64>
    <66d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><670>: Abbrev Number: 22 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x3b8): currpers
    <675>   DW_AT_decl_file   : 19
    <676>   DW_AT_decl_line   : 267
    <678>   DW_AT_decl_column : 15
    <679>   DW_AT_type        : <0x2b>
    <67d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><680>: Abbrev Number: 22 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0xbd1): u_error
    <685>   DW_AT_decl_file   : 19
    <686>   DW_AT_decl_line   : 269
    <688>   DW_AT_decl_column : 16
    <689>   DW_AT_type        : <0x37>
    <68d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><690>: Abbrev Number: 22 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <695>   DW_AT_decl_file   : 19
    <696>   DW_AT_decl_line   : 270
    <698>   DW_AT_decl_column : 17
    <699>   DW_AT_type        : <0x57a>
    <69d>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6a0>: Abbrev Number: 22 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0xc0a): true_scno
    <6a5>   DW_AT_decl_file   : 19
    <6a6>   DW_AT_decl_line   : 271
    <6a8>   DW_AT_decl_column : 17
    <6a9>   DW_AT_type        : <0x57a>
    <6ad>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6b0>: Abbrev Number: 22 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x195): u_arg
    <6b5>   DW_AT_decl_file   : 19
    <6b6>   DW_AT_decl_line   : 272
    <6b8>   DW_AT_decl_column : 17
    <6b9>   DW_AT_type        : <0x9c4>
    <6bd>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6c0>: Abbrev Number: 22 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xa0f): u_rval
    <6c5>   DW_AT_decl_file   : 19
    <6c6>   DW_AT_decl_line   : 273
    <6c8>   DW_AT_decl_column : 16
    <6c9>   DW_AT_type        : <0x56e>
    <6cd>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xb50): sys_func_rval
    <6d5>   DW_AT_decl_file   : 19
    <6d6>   DW_AT_decl_line   : 274
    <6d8>   DW_AT_decl_column : 6
    <6d9>   DW_AT_type        : <0x64>
    <6dd>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6e0>: Abbrev Number: 22 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xd76): curcol
    <6e5>   DW_AT_decl_file   : 19
    <6e6>   DW_AT_decl_line   : 275
    <6e8>   DW_AT_decl_column : 6
    <6e9>   DW_AT_type        : <0x64>
    <6ed>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6f0>: Abbrev Number: 22 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0xa21): outf
    <6f5>   DW_AT_decl_file   : 19
    <6f6>   DW_AT_decl_line   : 276
    <6f8>   DW_AT_decl_column : 8
    <6f9>   DW_AT_type        : <0x407>
    <6fd>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><700>: Abbrev Number: 22 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0xf95): staged_output_data
    <705>   DW_AT_decl_file   : 19
    <706>   DW_AT_decl_line   : 277
    <708>   DW_AT_decl_column : 29
    <709>   DW_AT_type        : <0x9da>
    <70d>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><710>: Abbrev Number: 22 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xb1b): auxstr
    <715>   DW_AT_decl_file   : 19
    <716>   DW_AT_decl_line   : 279
    <718>   DW_AT_decl_column : 14
    <719>   DW_AT_type        : <0x1c2>
    <71d>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><720>: Abbrev Number: 22 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x174): _priv_data
    <725>   DW_AT_decl_file   : 19
    <726>   DW_AT_decl_line   : 280
    <728>   DW_AT_decl_column : 8
    <729>   DW_AT_type        : <0xc6>
    <72d>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><730>: Abbrev Number: 22 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0xcaf): _free_priv_data
    <735>   DW_AT_decl_file   : 19
    <736>   DW_AT_decl_line   : 281
    <738>   DW_AT_decl_column : 9
    <739>   DW_AT_type        : <0x9ec>
    <73d>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><740>: Abbrev Number: 22 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x185): s_ent
    <745>   DW_AT_decl_file   : 19
    <746>   DW_AT_decl_line   : 282
    <748>   DW_AT_decl_column : 23
    <749>   DW_AT_type        : <0x9f2>
    <74d>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><750>: Abbrev Number: 22 (DW_TAG_member)
    <751>   DW_AT_name        : (indirect string, offset: 0x30): s_prev_ent
    <755>   DW_AT_decl_file   : 19
    <756>   DW_AT_decl_line   : 285
    <758>   DW_AT_decl_column : 23
    <759>   DW_AT_type        : <0x9f2>
    <75d>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><761>: Abbrev Number: 22 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x3ad): inject_vec
    <766>   DW_AT_decl_file   : 19
    <767>   DW_AT_decl_line   : 286
    <769>   DW_AT_decl_column : 22
    <76a>   DW_AT_type        : <0x9fd>
    <76e>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0x839): stime
    <777>   DW_AT_decl_file   : 19
    <778>   DW_AT_decl_line   : 287
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x133>
    <77f>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><783>: Abbrev Number: 22 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x3c1): ltime
    <788>   DW_AT_decl_file   : 19
    <789>   DW_AT_decl_line   : 288
    <78b>   DW_AT_decl_column : 18
    <78c>   DW_AT_type        : <0x133>
    <790>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><794>: Abbrev Number: 22 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0x107e): atime
    <799>   DW_AT_decl_file   : 19
    <79a>   DW_AT_decl_line   : 289
    <79c>   DW_AT_decl_column : 18
    <79d>   DW_AT_type        : <0x133>
    <7a1>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><7a5>: Abbrev Number: 22 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x4e6): etime
    <7aa>   DW_AT_decl_file   : 19
    <7ab>   DW_AT_decl_line   : 290
    <7ad>   DW_AT_decl_column : 18
    <7ae>   DW_AT_type        : <0x133>
    <7b2>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7b6>: Abbrev Number: 22 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xde4): delay_expiration_time
    <7bb>   DW_AT_decl_file   : 19
    <7bc>   DW_AT_decl_line   : 291
    <7be>   DW_AT_decl_column : 18
    <7bf>   DW_AT_type        : <0x133>
    <7c3>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7c7>: Abbrev Number: 22 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x3b): pid_ns
    <7cc>   DW_AT_decl_file   : 19
    <7cd>   DW_AT_decl_line   : 298
    <7cf>   DW_AT_decl_column : 15
    <7d0>   DW_AT_type        : <0x2b>
    <7d4>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7d8>: Abbrev Number: 22 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0xfd1): last_dirfd
    <7dd>   DW_AT_decl_file   : 19
    <7de>   DW_AT_decl_line   : 301
    <7e0>   DW_AT_decl_column : 6
    <7e1>   DW_AT_type        : <0x64>
    <7e5>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7e9>: Abbrev Number: 22 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0xff7): mmap_cache
    <7ee>   DW_AT_decl_file   : 19
    <7ef>   DW_AT_decl_line   : 304
    <7f1>   DW_AT_decl_column : 23
    <7f2>   DW_AT_type        : <0xa19>
    <7f6>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7fa>: Abbrev Number: 22 (DW_TAG_member)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xbe0): wait_data_idx
    <7ff>   DW_AT_decl_file   : 19
    <800>   DW_AT_decl_line   : 311
    <802>   DW_AT_decl_column : 9
    <803>   DW_AT_type        : <0x122>
    <807>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><80b>: Abbrev Number: 22 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0xb22): delayed_wait_data
    <810>   DW_AT_decl_file   : 19
    <811>   DW_AT_decl_line   : 313
    <813>   DW_AT_decl_column : 24
    <814>   DW_AT_type        : <0xa25>
    <818>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><81c>: Abbrev Number: 22 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xb92): wait_list
    <821>   DW_AT_decl_file   : 19
    <822>   DW_AT_decl_line   : 314
    <824>   DW_AT_decl_column : 19
    <825>   DW_AT_type        : <0x58b>
    <829>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><82d>: Abbrev Number: 22 (DW_TAG_member)
    <82e>   DW_AT_name        : (indirect string, offset: 0x71d): vcpu_info_list
    <832>   DW_AT_decl_file   : 19
    <833>   DW_AT_decl_line   : 318
    <835>   DW_AT_decl_column : 20
    <836>   DW_AT_type        : <0xa31>
    <83a>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><83e>: Abbrev Number: 22 (DW_TAG_member)
    <83f>   DW_AT_name        : (indirect string, offset: 0xd41): unwind_ctx
    <843>   DW_AT_decl_file   : 19
    <844>   DW_AT_decl_line   : 322
    <846>   DW_AT_decl_column : 8
    <847>   DW_AT_type        : <0xc6>
    <84b>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><84f>: Abbrev Number: 22 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0x4d0): unwind_queue
    <854>   DW_AT_decl_file   : 19
    <855>   DW_AT_decl_line   : 323
    <857>   DW_AT_decl_column : 25
    <858>   DW_AT_type        : <0xa3d>
    <85c>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><860>: Abbrev Number: 22 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0x169): comm
    <865>   DW_AT_decl_file   : 19
    <866>   DW_AT_decl_line   : 327
    <868>   DW_AT_decl_column : 7
    <869>   DW_AT_type        : <0xa43>
    <86d>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><871>: Abbrev Number: 22 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x220): start_prc
    <876>   DW_AT_decl_file   : 19
    <877>   DW_AT_decl_line   : 329
    <879>   DW_AT_decl_column : 16
    <87a>   DW_AT_type        : <0x37>
    <87e>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><882>: Abbrev Number: 22 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x1052): pre_comm
    <887>   DW_AT_decl_file   : 19
    <888>   DW_AT_decl_line   : 330
    <88a>   DW_AT_decl_column : 7
    <88b>   DW_AT_type        : <0xa43>
    <88f>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><893>: Abbrev Number: 0
 <1><894>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <895>   DW_AT_byte_size   : 4
    <896>   DW_AT_type        : <0x616>
 <1><89a>: Abbrev Number: 4 (DW_TAG_typedef)
    <89b>   DW_AT_name        : (indirect string, offset: 0x5b8): struct_sysent
    <89f>   DW_AT_decl_file   : 18
    <8a0>   DW_AT_decl_line   : 19
    <8a1>   DW_AT_decl_column : 3
    <8a2>   DW_AT_type        : <0x5bd>
 <1><8a6>: Abbrev Number: 3 (DW_TAG_const_type)
    <8a7>   DW_AT_type        : <0x89a>
 <1><8ab>: Abbrev Number: 11 (DW_TAG_variable)
    <8ac>   DW_AT_name        : (indirect string, offset: 0xdd0): current_personality
    <8b0>   DW_AT_decl_file   : 19
    <8b1>   DW_AT_decl_line   : 158
    <8b2>   DW_AT_decl_column : 17
    <8b3>   DW_AT_type        : <0x2b>
    <8b7>   DW_AT_external    : 1
    <8b8>   DW_AT_declaration : 1
 <1><8b9>: Abbrev Number: 11 (DW_TAG_variable)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x87e): current_wordsize
    <8be>   DW_AT_decl_file   : 19
    <8bf>   DW_AT_decl_line   : 171
    <8c0>   DW_AT_decl_column : 17
    <8c1>   DW_AT_type        : <0x2b>
    <8c5>   DW_AT_external    : 1
    <8c6>   DW_AT_declaration : 1
 <1><8c7>: Abbrev Number: 11 (DW_TAG_variable)
    <8c8>   DW_AT_name        : (indirect string, offset: 0xaf9): current_klongsize
    <8cc>   DW_AT_decl_file   : 19
    <8cd>   DW_AT_decl_line   : 176
    <8ce>   DW_AT_decl_column : 17
    <8cf>   DW_AT_type        : <0x2b>
    <8d3>   DW_AT_external    : 1
    <8d4>   DW_AT_declaration : 1
 <1><8d5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xd18): ioctlent
    <8da>   DW_AT_byte_size   : 8
    <8db>   DW_AT_decl_file   : 19
    <8dc>   DW_AT_decl_line   : 217
    <8dd>   DW_AT_decl_column : 16
    <8de>   DW_AT_sibling     : <0x901>
 <2><8e2>: Abbrev Number: 9 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0xfbd): symbol
    <8e7>   DW_AT_decl_file   : 19
    <8e8>   DW_AT_decl_line   : 218
    <8e9>   DW_AT_decl_column : 14
    <8ea>   DW_AT_type        : <0x1c2>
    <8ee>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f1>: Abbrev Number: 9 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0xd99): code
    <8f6>   DW_AT_decl_file   : 19
    <8f7>   DW_AT_decl_line   : 219
    <8f8>   DW_AT_decl_column : 15
    <8f9>   DW_AT_type        : <0x2b>
    <8fd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><900>: Abbrev Number: 0
 <1><901>: Abbrev Number: 4 (DW_TAG_typedef)
    <902>   DW_AT_name        : (indirect string, offset: 0xcd9): struct_ioctlent
    <906>   DW_AT_decl_file   : 19
    <907>   DW_AT_decl_line   : 220
    <908>   DW_AT_decl_column : 3
    <909>   DW_AT_type        : <0x8d5>
 <1><90d>: Abbrev Number: 3 (DW_TAG_const_type)
    <90e>   DW_AT_type        : <0x901>
 <1><912>: Abbrev Number: 8 (DW_TAG_structure_type)
    <913>   DW_AT_name        : (indirect string, offset: 0x872): inject_data
    <917>   DW_AT_byte_size   : 10
    <918>   DW_AT_decl_file   : 19
    <919>   DW_AT_decl_line   : 241
    <91a>   DW_AT_decl_column : 8
    <91b>   DW_AT_sibling     : <0x97a>
 <2><91f>: Abbrev Number: 9 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0x4ec): flags
    <924>   DW_AT_decl_file   : 19
    <925>   DW_AT_decl_line   : 242
    <926>   DW_AT_decl_column : 10
    <927>   DW_AT_type        : <0xeb>
    <92b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><92e>: Abbrev Number: 9 (DW_TAG_member)
    <92f>   DW_AT_name        : (indirect string, offset: 0x99c): signo
    <933>   DW_AT_decl_file   : 19
    <934>   DW_AT_decl_line   : 243
    <935>   DW_AT_decl_column : 10
    <936>   DW_AT_type        : <0xeb>
    <93a>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><93d>: Abbrev Number: 9 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0xfb): rval_idx
    <942>   DW_AT_decl_file   : 19
    <943>   DW_AT_decl_line   : 244
    <944>   DW_AT_decl_column : 11
    <945>   DW_AT_type        : <0xf7>
    <949>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><94c>: Abbrev Number: 9 (DW_TAG_member)
    <94d>   DW_AT_name        : (indirect string, offset: 0xd6c): delay_idx
    <951>   DW_AT_decl_file   : 19
    <952>   DW_AT_decl_line   : 245
    <953>   DW_AT_decl_column : 11
    <954>   DW_AT_type        : <0xf7>
    <958>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><95b>: Abbrev Number: 9 (DW_TAG_member)
    <95c>   DW_AT_name        : (indirect string, offset: 0x617): poke_idx
    <960>   DW_AT_decl_file   : 19
    <961>   DW_AT_decl_line   : 246
    <962>   DW_AT_decl_column : 11
    <963>   DW_AT_type        : <0xf7>
    <967>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><96a>: Abbrev Number: 9 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <96f>   DW_AT_decl_file   : 19
    <970>   DW_AT_decl_line   : 247
    <971>   DW_AT_decl_column : 11
    <972>   DW_AT_type        : <0xf7>
    <976>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><979>: Abbrev Number: 0
 <1><97a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <97b>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <97f>   DW_AT_byte_size   : 16
    <980>   DW_AT_decl_file   : 19
    <981>   DW_AT_decl_line   : 250
    <982>   DW_AT_decl_column : 8
    <983>   DW_AT_sibling     : <0x9c4>
 <2><987>: Abbrev Number: 9 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0xaae): first
    <98c>   DW_AT_decl_file   : 19
    <98d>   DW_AT_decl_line   : 251
    <98e>   DW_AT_decl_column : 11
    <98f>   DW_AT_type        : <0xf7>
    <993>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><996>: Abbrev Number: 9 (DW_TAG_member)
    <997>   DW_AT_name        : (indirect string, offset: 0x1185): last
    <99b>   DW_AT_decl_file   : 19
    <99c>   DW_AT_decl_line   : 252
    <99d>   DW_AT_decl_column : 11
    <99e>   DW_AT_type        : <0xf7>
    <9a2>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><9a5>: Abbrev Number: 9 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x3c7): step
    <9aa>   DW_AT_decl_file   : 19
    <9ab>   DW_AT_decl_line   : 253
    <9ac>   DW_AT_decl_column : 11
    <9ad>   DW_AT_type        : <0xf7>
    <9b1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9b4>: Abbrev Number: 9 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x1150): data
    <9b9>   DW_AT_decl_file   : 19
    <9ba>   DW_AT_decl_line   : 254
    <9bb>   DW_AT_decl_column : 21
    <9bc>   DW_AT_type        : <0x912>
    <9c0>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9c3>: Abbrev Number: 0
 <1><9c4>: Abbrev Number: 15 (DW_TAG_array_type)
    <9c5>   DW_AT_type        : <0x57a>
    <9c9>   DW_AT_sibling     : <0x9d4>
 <2><9cd>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9ce>   DW_AT_type        : <0x2b>
    <9d2>   DW_AT_upper_bound : 5
 <2><9d3>: Abbrev Number: 0
 <1><9d4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d5>   DW_AT_name        : (indirect string, offset: 0xf95): staged_output_data
    <9d9>   DW_AT_declaration : 1
 <1><9da>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9db>   DW_AT_byte_size   : 4
    <9dc>   DW_AT_type        : <0x9d4>
 <1><9e0>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9e1>   DW_AT_prototyped  : 1
    <9e2>   DW_AT_sibling     : <0x9ec>
 <2><9e6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9e7>   DW_AT_type        : <0xc6>
 <2><9eb>: Abbrev Number: 0
 <1><9ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9e0>
 <1><9f2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f3>   DW_AT_byte_size   : 4
    <9f4>   DW_AT_type        : <0x8a6>
 <1><9f8>: Abbrev Number: 3 (DW_TAG_const_type)
    <9f9>   DW_AT_type        : <0x9f2>
 <1><9fd>: Abbrev Number: 15 (DW_TAG_array_type)
    <9fe>   DW_AT_type        : <0xa0d>
    <a02>   DW_AT_sibling     : <0xa0d>
 <2><a06>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a07>   DW_AT_type        : <0x2b>
    <a0b>   DW_AT_upper_bound : 2
 <2><a0c>: Abbrev Number: 0
 <1><a0d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0x97a>
 <1><a13>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a14>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <a18>   DW_AT_declaration : 1
 <1><a19>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1a>   DW_AT_byte_size   : 4
    <a1b>   DW_AT_type        : <0xa13>
 <1><a1f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a20>   DW_AT_name        : (indirect string, offset: 0x3e2): tcb_wait_data
    <a24>   DW_AT_declaration : 1
 <1><a25>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_type        : <0xa1f>
 <1><a2b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a2c>   DW_AT_name        : (indirect string, offset: 0x15f): vcpu_info
    <a30>   DW_AT_declaration : 1
 <1><a31>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a32>   DW_AT_byte_size   : 4
    <a33>   DW_AT_type        : <0xa2b>
 <1><a37>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a38>   DW_AT_name        : (indirect string, offset: 0xf79): unwind_queue_t
    <a3c>   DW_AT_declaration : 1
 <1><a3d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a3e>   DW_AT_byte_size   : 4
    <a3f>   DW_AT_type        : <0xa37>
 <1><a43>: Abbrev Number: 15 (DW_TAG_array_type)
    <a44>   DW_AT_type        : <0xdf>
    <a48>   DW_AT_sibling     : <0xa53>
 <2><a4c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a4d>   DW_AT_type        : <0x2b>
    <a51>   DW_AT_upper_bound : 15
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 10 (DW_TAG_variable)
    <a54>   DW_AT_name        : (indirect string, offset: 0xc1d): stub_sysent
    <a58>   DW_AT_decl_file   : 19
    <a59>   DW_AT_decl_line   : 405
    <a5b>   DW_AT_decl_column : 28
    <a5c>   DW_AT_type        : <0x8a6>
    <a60>   DW_AT_external    : 1
    <a61>   DW_AT_declaration : 1
 <1><a62>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a63>   DW_AT_name        : (indirect string, offset: 0x1133): xlat_type
    <a67>   DW_AT_encoding    : 7	(unsigned)
    <a68>   DW_AT_byte_size   : 4
    <a69>   DW_AT_type        : <0x2b>
    <a6d>   DW_AT_decl_file   : 20
    <a6e>   DW_AT_decl_line   : 13
    <a6f>   DW_AT_decl_column : 6
    <a70>   DW_AT_sibling     : <0xa87>
 <2><a74>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a75>   DW_AT_name        : (indirect string, offset: 0x2e7): XT_NORMAL
    <a79>   DW_AT_const_value : 0
 <2><a7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0xcf0): XT_SORTED
    <a7f>   DW_AT_const_value : 1
 <2><a80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0xe5c): XT_INDEXED
    <a85>   DW_AT_const_value : 2
 <2><a86>: Abbrev Number: 0
 <1><a87>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a88>   DW_AT_name        : (indirect string, offset: 0xc59): xlat_style
    <a8c>   DW_AT_encoding    : 7	(unsigned)
    <a8d>   DW_AT_byte_size   : 4
    <a8e>   DW_AT_type        : <0x2b>
    <a92>   DW_AT_decl_file   : 20
    <a93>   DW_AT_decl_line   : 19
    <a94>   DW_AT_decl_column : 6
    <a95>   DW_AT_sibling     : <0xac4>
 <2><a99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a9e>   DW_AT_const_value : 0
 <2><a9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0xc8c): XLAT_STYLE_RAW
    <aa4>   DW_AT_const_value : 1
 <2><aa5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x10fe): XLAT_STYLE_ABBREV
    <aaa>   DW_AT_const_value : 2
 <2><aab>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x30e): XLAT_STYLE_VERBOSE
    <ab0>   DW_AT_const_value : 3
 <2><ab1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x1a): XLAT_STYLE_FMT_X
    <ab6>   DW_AT_const_value : 0
 <2><ab7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x9): XLAT_STYLE_FMT_U
    <abc>   DW_AT_const_value : 4
 <2><abd>: Abbrev Number: 26 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x1174): XLAT_STYLE_FMT_D
    <ac2>   DW_AT_const_value : 8
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x34a): xlat_data
    <ac9>   DW_AT_byte_size   : 16
    <aca>   DW_AT_decl_file   : 20
    <acb>   DW_AT_decl_line   : 51
    <acc>   DW_AT_decl_column : 8
    <acd>   DW_AT_sibling     : <0xaf0>
 <2><ad1>: Abbrev Number: 18 (DW_TAG_member)
    <ad2>   DW_AT_name        : val
    <ad6>   DW_AT_decl_file   : 20
    <ad7>   DW_AT_decl_line   : 52
    <ad8>   DW_AT_decl_column : 11
    <ad9>   DW_AT_type        : <0x10f>
    <add>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae0>: Abbrev Number: 18 (DW_TAG_member)
    <ae1>   DW_AT_name        : str
    <ae5>   DW_AT_decl_file   : 20
    <ae6>   DW_AT_decl_line   : 53
    <ae7>   DW_AT_decl_column : 14
    <ae8>   DW_AT_type        : <0x1c2>
    <aec>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 3 (DW_TAG_const_type)
    <af1>   DW_AT_type        : <0xac4>
 <1><af5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <af6>   DW_AT_name        : (indirect string, offset: 0x2b): xlat
    <afa>   DW_AT_byte_size   : 24
    <afb>   DW_AT_decl_file   : 20
    <afc>   DW_AT_decl_line   : 56
    <afd>   DW_AT_decl_column : 8
    <afe>   DW_AT_sibling     : <0xb4e>
 <2><b02>: Abbrev Number: 9 (DW_TAG_member)
    <b03>   DW_AT_name        : (indirect string, offset: 0x1150): data
    <b07>   DW_AT_decl_file   : 20
    <b08>   DW_AT_decl_line   : 57
    <b09>   DW_AT_decl_column : 26
    <b0a>   DW_AT_type        : <0xb53>
    <b0e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b11>: Abbrev Number: 9 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0x8da): flags_strsz
    <b16>   DW_AT_decl_file   : 20
    <b17>   DW_AT_decl_line   : 58
    <b18>   DW_AT_decl_column : 9
    <b19>   DW_AT_type        : <0x122>
    <b1d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b20>: Abbrev Number: 9 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0xbee): size
    <b25>   DW_AT_decl_file   : 20
    <b26>   DW_AT_decl_line   : 59
    <b27>   DW_AT_decl_column : 11
    <b28>   DW_AT_type        : <0x103>
    <b2c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b2f>: Abbrev Number: 9 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0x190): type
    <b34>   DW_AT_decl_file   : 20
    <b35>   DW_AT_decl_line   : 60
    <b36>   DW_AT_decl_column : 17
    <b37>   DW_AT_type        : <0xa62>
    <b3b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b3e>: Abbrev Number: 9 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x771): flags_mask
    <b43>   DW_AT_decl_file   : 20
    <b44>   DW_AT_decl_line   : 61
    <b45>   DW_AT_decl_column : 11
    <b46>   DW_AT_type        : <0x10f>
    <b4a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b4d>: Abbrev Number: 0
 <1><b4e>: Abbrev Number: 3 (DW_TAG_const_type)
    <b4f>   DW_AT_type        : <0xaf5>
 <1><b53>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b54>   DW_AT_byte_size   : 4
    <b55>   DW_AT_type        : <0xaf0>
 <1><b59>: Abbrev Number: 15 (DW_TAG_array_type)
    <b5a>   DW_AT_type        : <0xb4e>
    <b5e>   DW_AT_sibling     : <0xb64>
 <2><b62>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b63>: Abbrev Number: 0
 <1><b64>: Abbrev Number: 3 (DW_TAG_const_type)
    <b65>   DW_AT_type        : <0xb59>
 <1><b69>: Abbrev Number: 10 (DW_TAG_variable)
    <b6a>   DW_AT_name        : (indirect string, offset: 0xed5): addrfams
    <b6e>   DW_AT_decl_file   : 19
    <b6f>   DW_AT_decl_line   : 411
    <b71>   DW_AT_decl_column : 26
    <b72>   DW_AT_type        : <0xb64>
    <b76>   DW_AT_external    : 1
    <b77>   DW_AT_declaration : 1
 <1><b78>: Abbrev Number: 10 (DW_TAG_variable)
    <b79>   DW_AT_name        : (indirect string, offset: 0xda9): arp_hardware_types
    <b7d>   DW_AT_decl_file   : 19
    <b7e>   DW_AT_decl_line   : 412
    <b80>   DW_AT_decl_column : 26
    <b81>   DW_AT_type        : <0xb64>
    <b85>   DW_AT_external    : 1
    <b86>   DW_AT_declaration : 1
 <1><b87>: Abbrev Number: 10 (DW_TAG_variable)
    <b88>   DW_AT_name        : (indirect string, offset: 0x1084): at_flags
    <b8c>   DW_AT_decl_file   : 19
    <b8d>   DW_AT_decl_line   : 413
    <b8f>   DW_AT_decl_column : 26
    <b90>   DW_AT_type        : <0xb64>
    <b94>   DW_AT_external    : 1
    <b95>   DW_AT_declaration : 1
 <1><b96>: Abbrev Number: 10 (DW_TAG_variable)
    <b97>   DW_AT_name        : (indirect string, offset: 0x4ae): clocknames
    <b9b>   DW_AT_decl_file   : 19
    <b9c>   DW_AT_decl_line   : 414
    <b9e>   DW_AT_decl_column : 26
    <b9f>   DW_AT_type        : <0xb64>
    <ba3>   DW_AT_external    : 1
    <ba4>   DW_AT_declaration : 1
 <1><ba5>: Abbrev Number: 10 (DW_TAG_variable)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x1045): dirent_types
    <baa>   DW_AT_decl_file   : 19
    <bab>   DW_AT_decl_line   : 415
    <bad>   DW_AT_decl_column : 26
    <bae>   DW_AT_type        : <0xb64>
    <bb2>   DW_AT_external    : 1
    <bb3>   DW_AT_declaration : 1
 <1><bb4>: Abbrev Number: 10 (DW_TAG_variable)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x92b): ethernet_protocols
    <bb9>   DW_AT_decl_file   : 19
    <bba>   DW_AT_decl_line   : 416
    <bbc>   DW_AT_decl_column : 26
    <bbd>   DW_AT_type        : <0xb64>
    <bc1>   DW_AT_external    : 1
    <bc2>   DW_AT_declaration : 1
 <1><bc3>: Abbrev Number: 10 (DW_TAG_variable)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x67b): inet_protocols
    <bc8>   DW_AT_decl_file   : 19
    <bc9>   DW_AT_decl_line   : 417
    <bcb>   DW_AT_decl_column : 26
    <bcc>   DW_AT_type        : <0xb64>
    <bd0>   DW_AT_external    : 1
    <bd1>   DW_AT_declaration : 1
 <1><bd2>: Abbrev Number: 10 (DW_TAG_variable)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x2d4): evdev_abs
    <bd7>   DW_AT_decl_file   : 19
    <bd8>   DW_AT_decl_line   : 418
    <bda>   DW_AT_decl_column : 26
    <bdb>   DW_AT_type        : <0xb64>
    <bdf>   DW_AT_external    : 1
    <be0>   DW_AT_declaration : 1
 <1><be1>: Abbrev Number: 10 (DW_TAG_variable)
    <be2>   DW_AT_name        : (indirect string, offset: 0x766): audit_arch
    <be6>   DW_AT_decl_file   : 19
    <be7>   DW_AT_decl_line   : 419
    <be9>   DW_AT_decl_column : 26
    <bea>   DW_AT_type        : <0xb64>
    <bee>   DW_AT_external    : 1
    <bef>   DW_AT_declaration : 1
 <1><bf0>: Abbrev Number: 10 (DW_TAG_variable)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bf5>   DW_AT_decl_file   : 19
    <bf6>   DW_AT_decl_line   : 420
    <bf8>   DW_AT_decl_column : 26
    <bf9>   DW_AT_type        : <0xb64>
    <bfd>   DW_AT_external    : 1
    <bfe>   DW_AT_declaration : 1
 <1><bff>: Abbrev Number: 10 (DW_TAG_variable)
    <c00>   DW_AT_name        : (indirect string, offset: 0x48f): iffflags
    <c04>   DW_AT_decl_file   : 19
    <c05>   DW_AT_decl_line   : 421
    <c07>   DW_AT_decl_column : 26
    <c08>   DW_AT_type        : <0xb64>
    <c0c>   DW_AT_external    : 1
    <c0d>   DW_AT_declaration : 1
 <1><c0e>: Abbrev Number: 10 (DW_TAG_variable)
    <c0f>   DW_AT_name        : (indirect string, offset: 0xc9b): ip_type_of_services
    <c13>   DW_AT_decl_file   : 19
    <c14>   DW_AT_decl_line   : 422
    <c16>   DW_AT_decl_column : 26
    <c17>   DW_AT_type        : <0xb64>
    <c1b>   DW_AT_external    : 1
    <c1c>   DW_AT_declaration : 1
 <1><c1d>: Abbrev Number: 10 (DW_TAG_variable)
    <c1e>   DW_AT_name        : (indirect string, offset: 0x6f9): ipc_private
    <c22>   DW_AT_decl_file   : 19
    <c23>   DW_AT_decl_line   : 423
    <c25>   DW_AT_decl_column : 26
    <c26>   DW_AT_type        : <0xb64>
    <c2a>   DW_AT_external    : 1
    <c2b>   DW_AT_declaration : 1
 <1><c2c>: Abbrev Number: 10 (DW_TAG_variable)
    <c2d>   DW_AT_name        : (indirect string, offset: 0x335): msg_flags
    <c31>   DW_AT_decl_file   : 19
    <c32>   DW_AT_decl_line   : 424
    <c34>   DW_AT_decl_column : 26
    <c35>   DW_AT_type        : <0xb64>
    <c39>   DW_AT_external    : 1
    <c3a>   DW_AT_declaration : 1
 <1><c3b>: Abbrev Number: 10 (DW_TAG_variable)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x104): netlink_protocols
    <c40>   DW_AT_decl_file   : 19
    <c41>   DW_AT_decl_line   : 425
    <c43>   DW_AT_decl_column : 26
    <c44>   DW_AT_type        : <0xb64>
    <c48>   DW_AT_external    : 1
    <c49>   DW_AT_declaration : 1
 <1><c4a>: Abbrev Number: 10 (DW_TAG_variable)
    <c4b>   DW_AT_name        : (indirect string, offset: 0xfa8): nl_bridge_vlan_flags
    <c4f>   DW_AT_decl_file   : 19
    <c50>   DW_AT_decl_line   : 426
    <c52>   DW_AT_decl_column : 26
    <c53>   DW_AT_type        : <0xb64>
    <c57>   DW_AT_external    : 1
    <c58>   DW_AT_declaration : 1
 <1><c59>: Abbrev Number: 10 (DW_TAG_variable)
    <c5a>   DW_AT_name        : (indirect string, offset: 0xe45): nl_netfilter_msg_types
    <c5e>   DW_AT_decl_file   : 19
    <c5f>   DW_AT_decl_line   : 427
    <c61>   DW_AT_decl_column : 26
    <c62>   DW_AT_type        : <0xb64>
    <c66>   DW_AT_external    : 1
    <c67>   DW_AT_declaration : 1
 <1><c68>: Abbrev Number: 10 (DW_TAG_variable)
    <c69>   DW_AT_name        : (indirect string, offset: 0x471): nl_route_types
    <c6d>   DW_AT_decl_file   : 19
    <c6e>   DW_AT_decl_line   : 428
    <c70>   DW_AT_decl_column : 26
    <c71>   DW_AT_type        : <0xb64>
    <c75>   DW_AT_external    : 1
    <c76>   DW_AT_declaration : 1
 <1><c77>: Abbrev Number: 10 (DW_TAG_variable)
    <c78>   DW_AT_name        : (indirect string, offset: 0xf0c): open_access_modes
    <c7c>   DW_AT_decl_file   : 19
    <c7d>   DW_AT_decl_line   : 429
    <c7f>   DW_AT_decl_column : 26
    <c80>   DW_AT_type        : <0xb64>
    <c84>   DW_AT_external    : 1
    <c85>   DW_AT_declaration : 1
 <1><c86>: Abbrev Number: 10 (DW_TAG_variable)
    <c87>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c8b>   DW_AT_decl_file   : 19
    <c8c>   DW_AT_decl_line   : 430
    <c8e>   DW_AT_decl_column : 26
    <c8f>   DW_AT_type        : <0xb64>
    <c93>   DW_AT_external    : 1
    <c94>   DW_AT_declaration : 1
 <1><c95>: Abbrev Number: 10 (DW_TAG_variable)
    <c96>   DW_AT_name        : (indirect string, offset: 0xccc): perf_type_id
    <c9a>   DW_AT_decl_file   : 19
    <c9b>   DW_AT_decl_line   : 431
    <c9d>   DW_AT_decl_column : 26
    <c9e>   DW_AT_type        : <0xb64>
    <ca2>   DW_AT_external    : 1
    <ca3>   DW_AT_declaration : 1
 <1><ca4>: Abbrev Number: 10 (DW_TAG_variable)
    <ca5>   DW_AT_name        : (indirect string, offset: 0xede): pollflags
    <ca9>   DW_AT_decl_file   : 19
    <caa>   DW_AT_decl_line   : 432
    <cac>   DW_AT_decl_column : 26
    <cad>   DW_AT_type        : <0xb64>
    <cb1>   DW_AT_external    : 1
    <cb2>   DW_AT_declaration : 1
 <1><cb3>: Abbrev Number: 10 (DW_TAG_variable)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x60b): ptrace_cmds
    <cb8>   DW_AT_decl_file   : 19
    <cb9>   DW_AT_decl_line   : 433
    <cbb>   DW_AT_decl_column : 26
    <cbc>   DW_AT_type        : <0xb64>
    <cc0>   DW_AT_external    : 1
    <cc1>   DW_AT_declaration : 1
 <1><cc2>: Abbrev Number: 10 (DW_TAG_variable)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x863): resource_flags
    <cc7>   DW_AT_decl_file   : 19
    <cc8>   DW_AT_decl_line   : 434
    <cca>   DW_AT_decl_column : 26
    <ccb>   DW_AT_type        : <0xb64>
    <ccf>   DW_AT_external    : 1
    <cd0>   DW_AT_declaration : 1
 <1><cd1>: Abbrev Number: 10 (DW_TAG_variable)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x2aa): route_nexthop_flags
    <cd6>   DW_AT_decl_file   : 19
    <cd7>   DW_AT_decl_line   : 435
    <cd9>   DW_AT_decl_column : 26
    <cda>   DW_AT_type        : <0xb64>
    <cde>   DW_AT_external    : 1
    <cdf>   DW_AT_declaration : 1
 <1><ce0>: Abbrev Number: 10 (DW_TAG_variable)
    <ce1>   DW_AT_name        : (indirect string, offset: 0xf33): routing_protocols
    <ce5>   DW_AT_decl_file   : 19
    <ce6>   DW_AT_decl_line   : 436
    <ce8>   DW_AT_decl_column : 26
    <ce9>   DW_AT_type        : <0xb64>
    <ced>   DW_AT_external    : 1
    <cee>   DW_AT_declaration : 1
 <1><cef>: Abbrev Number: 10 (DW_TAG_variable)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x480): routing_scopes
    <cf4>   DW_AT_decl_file   : 19
    <cf5>   DW_AT_decl_line   : 437
    <cf7>   DW_AT_decl_column : 26
    <cf8>   DW_AT_type        : <0xb64>
    <cfc>   DW_AT_external    : 1
    <cfd>   DW_AT_declaration : 1
 <1><cfe>: Abbrev Number: 10 (DW_TAG_variable)
    <cff>   DW_AT_name        : (indirect string, offset: 0xe33): routing_table_ids
    <d03>   DW_AT_decl_file   : 19
    <d04>   DW_AT_decl_line   : 438
    <d06>   DW_AT_decl_column : 26
    <d07>   DW_AT_type        : <0xb64>
    <d0b>   DW_AT_external    : 1
    <d0c>   DW_AT_declaration : 1
 <1><d0d>: Abbrev Number: 10 (DW_TAG_variable)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x6bd): routing_types
    <d12>   DW_AT_decl_file   : 19
    <d13>   DW_AT_decl_line   : 439
    <d15>   DW_AT_decl_column : 26
    <d16>   DW_AT_type        : <0xb64>
    <d1a>   DW_AT_external    : 1
    <d1b>   DW_AT_declaration : 1
 <1><d1c>: Abbrev Number: 10 (DW_TAG_variable)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x1b4): rwf_flags
    <d21>   DW_AT_decl_file   : 19
    <d22>   DW_AT_decl_line   : 440
    <d24>   DW_AT_decl_column : 26
    <d25>   DW_AT_type        : <0xb64>
    <d29>   DW_AT_external    : 1
    <d2a>   DW_AT_declaration : 1
 <1><d2b>: Abbrev Number: 10 (DW_TAG_variable)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x89b): seccomp_filter_flags
    <d30>   DW_AT_decl_file   : 19
    <d31>   DW_AT_decl_line   : 441
    <d33>   DW_AT_decl_column : 26
    <d34>   DW_AT_type        : <0xb64>
    <d38>   DW_AT_external    : 1
    <d39>   DW_AT_declaration : 1
 <1><d3a>: Abbrev Number: 10 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x2f1): seccomp_ret_action
    <d3f>   DW_AT_decl_file   : 19
    <d40>   DW_AT_decl_line   : 442
    <d42>   DW_AT_decl_column : 26
    <d43>   DW_AT_type        : <0xb64>
    <d47>   DW_AT_external    : 1
    <d48>   DW_AT_declaration : 1
 <1><d49>: Abbrev Number: 10 (DW_TAG_variable)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x44c): setns_types
    <d4e>   DW_AT_decl_file   : 19
    <d4f>   DW_AT_decl_line   : 443
    <d51>   DW_AT_decl_column : 26
    <d52>   DW_AT_type        : <0xb64>
    <d56>   DW_AT_external    : 1
    <d57>   DW_AT_declaration : 1
 <1><d58>: Abbrev Number: 10 (DW_TAG_variable)
    <d59>   DW_AT_name        : (indirect string, offset: 0xeca): sg_io_info
    <d5d>   DW_AT_decl_file   : 19
    <d5e>   DW_AT_decl_line   : 444
    <d60>   DW_AT_decl_column : 26
    <d61>   DW_AT_type        : <0xb64>
    <d65>   DW_AT_external    : 1
    <d66>   DW_AT_declaration : 1
 <1><d67>: Abbrev Number: 10 (DW_TAG_variable)
    <d68>   DW_AT_name        : (indirect string, offset: 0xc41): socketlayers
    <d6c>   DW_AT_decl_file   : 19
    <d6d>   DW_AT_decl_line   : 445
    <d6f>   DW_AT_decl_column : 26
    <d70>   DW_AT_type        : <0xb64>
    <d74>   DW_AT_external    : 1
    <d75>   DW_AT_declaration : 1
 <1><d76>: Abbrev Number: 10 (DW_TAG_variable)
    <d77>   DW_AT_name        : (indirect string, offset: 0xe1d): socktypes
    <d7b>   DW_AT_decl_file   : 19
    <d7c>   DW_AT_decl_line   : 446
    <d7e>   DW_AT_decl_column : 26
    <d7f>   DW_AT_type        : <0xb64>
    <d83>   DW_AT_external    : 1
    <d84>   DW_AT_declaration : 1
 <1><d85>: Abbrev Number: 10 (DW_TAG_variable)
    <d86>   DW_AT_name        : (indirect string, offset: 0xb0b): tcp_state_flags
    <d8a>   DW_AT_decl_file   : 19
    <d8b>   DW_AT_decl_line   : 447
    <d8d>   DW_AT_decl_column : 26
    <d8e>   DW_AT_type        : <0xb64>
    <d92>   DW_AT_external    : 1
    <d93>   DW_AT_declaration : 1
 <1><d94>: Abbrev Number: 10 (DW_TAG_variable)
    <d95>   DW_AT_name        : (indirect string, offset: 0x79b): tcp_states
    <d99>   DW_AT_decl_file   : 19
    <d9a>   DW_AT_decl_line   : 448
    <d9c>   DW_AT_decl_column : 26
    <d9d>   DW_AT_type        : <0xb64>
    <da1>   DW_AT_external    : 1
    <da2>   DW_AT_declaration : 1
 <1><da3>: Abbrev Number: 10 (DW_TAG_variable)
    <da4>   DW_AT_name        : (indirect string, offset: 0x10e1): whence_codes
    <da8>   DW_AT_decl_file   : 19
    <da9>   DW_AT_decl_line   : 449
    <dab>   DW_AT_decl_column : 26
    <dac>   DW_AT_type        : <0xb64>
    <db0>   DW_AT_external    : 1
    <db1>   DW_AT_declaration : 1
 <1><db2>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <db3>   DW_AT_encoding    : 7	(unsigned)
    <db4>   DW_AT_byte_size   : 4
    <db5>   DW_AT_type        : <0x2b>
    <db9>   DW_AT_decl_file   : 19
    <dba>   DW_AT_decl_line   : 510
    <dbc>   DW_AT_decl_column : 14
    <dbd>   DW_AT_sibling     : <0xdd4>
 <2><dc1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xa16): CFLAG_NONE
    <dc6>   DW_AT_const_value : 0
 <2><dc7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x93e): CFLAG_ONLY_STATS
    <dcc>   DW_AT_const_value : 1
 <2><dcd>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dce>   DW_AT_name        : (indirect string, offset: 0xc4e): CFLAG_BOTH
    <dd2>   DW_AT_const_value : 2
 <2><dd3>: Abbrev Number: 0
 <1><dd4>: Abbrev Number: 28 (DW_TAG_typedef)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x1194): cflag_t
    <dd9>   DW_AT_decl_file   : 19
    <dda>   DW_AT_decl_line   : 514
    <ddc>   DW_AT_decl_column : 3
    <ddd>   DW_AT_type        : <0xdb2>
 <1><de1>: Abbrev Number: 10 (DW_TAG_variable)
    <de2>   DW_AT_name        : (indirect string, offset: 0xd66): cflag
    <de6>   DW_AT_decl_file   : 19
    <de7>   DW_AT_decl_line   : 515
    <de9>   DW_AT_decl_column : 16
    <dea>   DW_AT_type        : <0xdd4>
    <dee>   DW_AT_external    : 1
    <def>   DW_AT_declaration : 1
 <1><df0>: Abbrev Number: 10 (DW_TAG_variable)
    <df1>   DW_AT_name        : (indirect string, offset: 0x17f): Tflag
    <df5>   DW_AT_decl_file   : 19
    <df6>   DW_AT_decl_line   : 516
    <df8>   DW_AT_decl_column : 13
    <df9>   DW_AT_type        : <0x50e>
    <dfd>   DW_AT_external    : 1
    <dfe>   DW_AT_declaration : 1
 <1><dff>: Abbrev Number: 10 (DW_TAG_variable)
    <e00>   DW_AT_name        : (indirect string, offset: 0x80a): Tflag_scale
    <e04>   DW_AT_decl_file   : 19
    <e05>   DW_AT_decl_line   : 517
    <e07>   DW_AT_decl_column : 12
    <e08>   DW_AT_type        : <0x64>
    <e0c>   DW_AT_external    : 1
    <e0d>   DW_AT_declaration : 1
 <1><e0e>: Abbrev Number: 10 (DW_TAG_variable)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x8b0): Tflag_width
    <e13>   DW_AT_decl_file   : 19
    <e14>   DW_AT_decl_line   : 518
    <e16>   DW_AT_decl_column : 12
    <e17>   DW_AT_type        : <0x64>
    <e1b>   DW_AT_external    : 1
    <e1c>   DW_AT_declaration : 1
 <1><e1d>: Abbrev Number: 10 (DW_TAG_variable)
    <e1e>   DW_AT_name        : (indirect string, offset: 0xebc): iflag
    <e22>   DW_AT_decl_file   : 19
    <e23>   DW_AT_decl_line   : 519
    <e25>   DW_AT_decl_column : 13
    <e26>   DW_AT_type        : <0x50e>
    <e2a>   DW_AT_external    : 1
    <e2b>   DW_AT_declaration : 1
 <1><e2c>: Abbrev Number: 10 (DW_TAG_variable)
    <e2d>   DW_AT_name        : (indirect string, offset: 0x64b): count_wallclock
    <e31>   DW_AT_decl_file   : 19
    <e32>   DW_AT_decl_line   : 520
    <e34>   DW_AT_decl_column : 13
    <e35>   DW_AT_type        : <0x50e>
    <e39>   DW_AT_external    : 1
    <e3a>   DW_AT_declaration : 1
 <1><e3b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x49): path_set_item
    <e40>   DW_AT_byte_size   : 4
    <e41>   DW_AT_decl_file   : 19
    <e42>   DW_AT_decl_line   : 522
    <e44>   DW_AT_decl_column : 8
    <e45>   DW_AT_sibling     : <0xe5a>
 <2><e49>: Abbrev Number: 22 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e4e>   DW_AT_decl_file   : 19
    <e4f>   DW_AT_decl_line   : 523
    <e51>   DW_AT_decl_column : 14
    <e52>   DW_AT_type        : <0x1c2>
    <e56>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e59>: Abbrev Number: 0
 <1><e5a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x7a6): path_set
    <e5f>   DW_AT_byte_size   : 12
    <e60>   DW_AT_decl_file   : 19
    <e61>   DW_AT_decl_line   : 527
    <e63>   DW_AT_decl_column : 15
    <e64>   DW_AT_sibling     : <0xe99>
 <2><e68>: Abbrev Number: 22 (DW_TAG_member)
    <e69>   DW_AT_name        : (indirect string, offset: 0x734): paths_selected
    <e6d>   DW_AT_decl_file   : 19
    <e6e>   DW_AT_decl_line   : 528
    <e70>   DW_AT_decl_column : 24
    <e71>   DW_AT_type        : <0xe99>
    <e75>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e78>: Abbrev Number: 22 (DW_TAG_member)
    <e79>   DW_AT_name        : (indirect string, offset: 0x10d4): num_selected
    <e7d>   DW_AT_decl_file   : 19
    <e7e>   DW_AT_decl_line   : 529
    <e80>   DW_AT_decl_column : 9
    <e81>   DW_AT_type        : <0x122>
    <e85>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e88>: Abbrev Number: 22 (DW_TAG_member)
    <e89>   DW_AT_name        : (indirect string, offset: 0xbee): size
    <e8d>   DW_AT_decl_file   : 19
    <e8e>   DW_AT_decl_line   : 530
    <e90>   DW_AT_decl_column : 9
    <e91>   DW_AT_type        : <0x122>
    <e95>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e98>: Abbrev Number: 0
 <1><e99>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e9a>   DW_AT_byte_size   : 4
    <e9b>   DW_AT_type        : <0xe3b>
 <1><e9f>: Abbrev Number: 10 (DW_TAG_variable)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x1123): global_path_set
    <ea4>   DW_AT_decl_file   : 19
    <ea5>   DW_AT_decl_line   : 531
    <ea7>   DW_AT_decl_column : 3
    <ea8>   DW_AT_type        : <0xe5a>
    <eac>   DW_AT_external    : 1
    <ead>   DW_AT_declaration : 1
 <1><eae>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x1020): xflag_opts
    <eb3>   DW_AT_encoding    : 7	(unsigned)
    <eb4>   DW_AT_byte_size   : 4
    <eb5>   DW_AT_type        : <0x2b>
    <eb9>   DW_AT_decl_file   : 19
    <eba>   DW_AT_decl_line   : 533
    <ebc>   DW_AT_decl_column : 6
    <ebd>   DW_AT_sibling     : <0xee0>
 <2><ec1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xaa2): HEXSTR_NONE
    <ec6>   DW_AT_const_value : 0
 <2><ec7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x1066): HEXSTR_NON_ASCII
    <ecc>   DW_AT_const_value : 1
 <2><ecd>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ece>   DW_AT_name        : (indirect string, offset: 0x987): HEXSTR_ALL
    <ed2>   DW_AT_const_value : 2
 <2><ed3>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x6a6): HEXSTR_NON_ASCII_CHARS
    <ed8>   DW_AT_const_value : 3
 <2><ed9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eda>   DW_AT_name        : (indirect string, offset: 0x10ee): NUM_HEXSTR_OPTS
    <ede>   DW_AT_const_value : 4
 <2><edf>: Abbrev Number: 0
 <1><ee0>: Abbrev Number: 10 (DW_TAG_variable)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xe91): xflag
    <ee5>   DW_AT_decl_file   : 19
    <ee6>   DW_AT_decl_line   : 546
    <ee8>   DW_AT_decl_column : 17
    <ee9>   DW_AT_type        : <0x2b>
    <eed>   DW_AT_external    : 1
    <eee>   DW_AT_declaration : 1
 <1><eef>: Abbrev Number: 10 (DW_TAG_variable)
    <ef0>   DW_AT_name        : (indirect string, offset: 0xd21): followfork
    <ef4>   DW_AT_decl_file   : 19
    <ef5>   DW_AT_decl_line   : 547
    <ef7>   DW_AT_decl_column : 13
    <ef8>   DW_AT_type        : <0x50e>
    <efc>   DW_AT_external    : 1
    <efd>   DW_AT_declaration : 1
 <1><efe>: Abbrev Number: 10 (DW_TAG_variable)
    <eff>   DW_AT_name        : (indirect string, offset: 0x354): output_separately
    <f03>   DW_AT_decl_file   : 19
    <f04>   DW_AT_decl_line   : 548
    <f06>   DW_AT_decl_column : 13
    <f07>   DW_AT_type        : <0x50e>
    <f0b>   DW_AT_external    : 1
    <f0c>   DW_AT_declaration : 1
 <1><f0d>: Abbrev Number: 10 (DW_TAG_variable)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x22a): stack_trace_enabled
    <f12>   DW_AT_decl_file   : 19
    <f13>   DW_AT_decl_line   : 551
    <f15>   DW_AT_decl_column : 13
    <f16>   DW_AT_type        : <0x50e>
    <f1a>   DW_AT_external    : 1
    <f1b>   DW_AT_declaration : 1
 <1><f1c>: Abbrev Number: 10 (DW_TAG_variable)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x68a): ptrace_setoptions
    <f21>   DW_AT_decl_file   : 19
    <f22>   DW_AT_decl_line   : 555
    <f24>   DW_AT_decl_column : 17
    <f25>   DW_AT_type        : <0x2b>
    <f29>   DW_AT_external    : 1
    <f2a>   DW_AT_declaration : 1
 <1><f2b>: Abbrev Number: 10 (DW_TAG_variable)
    <f2c>   DW_AT_name        : (indirect string, offset: 0xa97): max_strlen
    <f30>   DW_AT_decl_file   : 19
    <f31>   DW_AT_decl_line   : 556
    <f33>   DW_AT_decl_column : 17
    <f34>   DW_AT_type        : <0x2b>
    <f38>   DW_AT_external    : 1
    <f39>   DW_AT_declaration : 1
 <1><f3a>: Abbrev Number: 10 (DW_TAG_variable)
    <f3b>   DW_AT_name        : (indirect string, offset: 0xae5): os_release
    <f3f>   DW_AT_decl_file   : 19
    <f40>   DW_AT_decl_line   : 557
    <f42>   DW_AT_decl_column : 17
    <f43>   DW_AT_type        : <0x2b>
    <f47>   DW_AT_external    : 1
    <f48>   DW_AT_declaration : 1
 <1><f49>: Abbrev Number: 10 (DW_TAG_variable)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x743): xlat_verbosity
    <f4e>   DW_AT_decl_file   : 19
    <f4f>   DW_AT_decl_line   : 919
    <f51>   DW_AT_decl_column : 24
    <f52>   DW_AT_type        : <0xa87>
    <f56>   DW_AT_external    : 1
    <f57>   DW_AT_declaration : 1
 <1><f58>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f59>   DW_AT_name        : (indirect string, offset: 0x62e): xlat_style_private_flag_bits
    <f5d>   DW_AT_encoding    : 7	(unsigned)
    <f5e>   DW_AT_byte_size   : 4
    <f5f>   DW_AT_type        : <0x2b>
    <f63>   DW_AT_decl_file   : 19
    <f64>   DW_AT_decl_line   : 939
    <f66>   DW_AT_decl_column : 6
    <f67>   DW_AT_sibling     : <0xf84>
 <2><f6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x2be): PAF_PRINT_INDICES_BIT
    <f70>   DW_AT_const_value : 5
 <2><f71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f72>   DW_AT_name        : (indirect string, offset: 0xba5): PAF_ARRAY_TRUNCATED_BIT
    <f76>   DW_AT_const_value : 6
 <2><f77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0x40c): PXF_DEFAULT_STR_BIT
    <f7c>   DW_AT_const_value : 7
 <2><f7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f7e>   DW_AT_name        : (indirect string, offset: 0xd03): SPFF_AUXSTR_MODE_BIT
    <f82>   DW_AT_const_value : 8
 <2><f83>: Abbrev Number: 0
 <1><f84>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f85>   DW_AT_name        : (indirect string, offset: 0xdbc): find_xlat_flag_bits
    <f89>   DW_AT_encoding    : 7	(unsigned)
    <f8a>   DW_AT_byte_size   : 4
    <f8b>   DW_AT_type        : <0x2b>
    <f8f>   DW_AT_decl_file   : 19
    <f90>   DW_AT_decl_line   : 1443
    <f92>   DW_AT_decl_column : 6
    <f93>   DW_AT_sibling     : <0xf9e>
 <2><f97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f98>   DW_AT_name        : (indirect string, offset: 0x9c4): FXL_CASE_SENSITIVE_BIT
    <f9c>   DW_AT_const_value : 0
 <2><f9d>: Abbrev Number: 0
 <1><f9e>: Abbrev Number: 10 (DW_TAG_variable)
    <f9f>   DW_AT_name        : (indirect string, offset: 0xa68): printing_tcp
    <fa3>   DW_AT_decl_file   : 19
    <fa4>   DW_AT_decl_line   : 1689
    <fa6>   DW_AT_decl_column : 20
    <fa7>   DW_AT_type        : <0x626>
    <fab>   DW_AT_external    : 1
    <fac>   DW_AT_declaration : 1
 <1><fad>: Abbrev Number: 10 (DW_TAG_variable)
    <fae>   DW_AT_name        : (indirect string, offset: 0x5e2): errnoent
    <fb2>   DW_AT_decl_file   : 19
    <fb3>   DW_AT_decl_line   : 1887
    <fb5>   DW_AT_decl_column : 26
    <fb6>   DW_AT_type        : <0x442>
    <fba>   DW_AT_external    : 1
    <fbb>   DW_AT_declaration : 1
 <1><fbc>: Abbrev Number: 10 (DW_TAG_variable)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x8bc): signalent
    <fc1>   DW_AT_decl_file   : 19
    <fc2>   DW_AT_decl_line   : 1888
    <fc4>   DW_AT_decl_column : 26
    <fc5>   DW_AT_type        : <0x442>
    <fc9>   DW_AT_external    : 1
    <fca>   DW_AT_declaration : 1
 <1><fcb>: Abbrev Number: 10 (DW_TAG_variable)
    <fcc>   DW_AT_name        : (indirect string, offset: 0xf04): nerrnos
    <fd0>   DW_AT_decl_file   : 19
    <fd1>   DW_AT_decl_line   : 1889
    <fd3>   DW_AT_decl_column : 27
    <fd4>   DW_AT_type        : <0x32>
    <fd8>   DW_AT_external    : 1
    <fd9>   DW_AT_declaration : 1
 <1><fda>: Abbrev Number: 10 (DW_TAG_variable)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x10bd): nsignals
    <fdf>   DW_AT_decl_file   : 19
    <fe0>   DW_AT_decl_line   : 1890
    <fe2>   DW_AT_decl_column : 27
    <fe3>   DW_AT_type        : <0x32>
    <fe7>   DW_AT_external    : 1
    <fe8>   DW_AT_declaration : 1
 <1><fe9>: Abbrev Number: 15 (DW_TAG_array_type)
    <fea>   DW_AT_type        : <0x8a6>
    <fee>   DW_AT_sibling     : <0xff4>
 <2><ff2>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ff3>: Abbrev Number: 0
 <1><ff4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff5>   DW_AT_type        : <0xfe9>
 <1><ff9>: Abbrev Number: 10 (DW_TAG_variable)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xd87): sysent0
    <ffe>   DW_AT_decl_file   : 19
    <fff>   DW_AT_decl_line   : 1892
    <1001>   DW_AT_decl_column : 28
    <1002>   DW_AT_type        : <0xff4>
    <1006>   DW_AT_external    : 1
    <1007>   DW_AT_declaration : 1
 <1><1008>: Abbrev Number: 15 (DW_TAG_array_type)
    <1009>   DW_AT_type        : <0x90d>
    <100d>   DW_AT_sibling     : <0x1013>
 <2><1011>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><1012>: Abbrev Number: 0
 <1><1013>: Abbrev Number: 3 (DW_TAG_const_type)
    <1014>   DW_AT_type        : <0x1008>
 <1><1018>: Abbrev Number: 10 (DW_TAG_variable)
    <1019>   DW_AT_name        : (indirect string, offset: 0x1119): ioctlent0
    <101d>   DW_AT_decl_file   : 19
    <101e>   DW_AT_decl_line   : 1893
    <1020>   DW_AT_decl_column : 30
    <1021>   DW_AT_type        : <0x1013>
    <1025>   DW_AT_external    : 1
    <1026>   DW_AT_declaration : 1
 <1><1027>: Abbrev Number: 10 (DW_TAG_variable)
    <1028>   DW_AT_name        : (indirect string, offset: 0x102b): personality_names
    <102c>   DW_AT_decl_file   : 19
    <102d>   DW_AT_decl_line   : 1895
    <102f>   DW_AT_decl_column : 26
    <1030>   DW_AT_type        : <0x442>
    <1034>   DW_AT_external    : 1
    <1035>   DW_AT_declaration : 1
 <1><1036>: Abbrev Number: 10 (DW_TAG_variable)
    <1037>   DW_AT_name        : (indirect string, offset: 0x8e6): sysent
    <103b>   DW_AT_decl_file   : 19
    <103c>   DW_AT_decl_line   : 1898
    <103e>   DW_AT_decl_column : 29
    <103f>   DW_AT_type        : <0x9f2>
    <1043>   DW_AT_external    : 1
    <1044>   DW_AT_declaration : 1
 <1><1045>: Abbrev Number: 10 (DW_TAG_variable)
    <1046>   DW_AT_name        : (indirect string, offset: 0xd18): ioctlent
    <104a>   DW_AT_decl_file   : 19
    <104b>   DW_AT_decl_line   : 1899
    <104d>   DW_AT_decl_column : 31
    <104e>   DW_AT_type        : <0x1054>
    <1052>   DW_AT_external    : 1
    <1053>   DW_AT_declaration : 1
 <1><1054>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1055>   DW_AT_byte_size   : 4
    <1056>   DW_AT_type        : <0x90d>
 <1><105a>: Abbrev Number: 10 (DW_TAG_variable)
    <105b>   DW_AT_name        : (indirect string, offset: 0x8d0): nsyscalls
    <105f>   DW_AT_decl_file   : 19
    <1060>   DW_AT_decl_line   : 1905
    <1062>   DW_AT_decl_column : 17
    <1063>   DW_AT_type        : <0x2b>
    <1067>   DW_AT_external    : 1
    <1068>   DW_AT_declaration : 1
 <1><1069>: Abbrev Number: 10 (DW_TAG_variable)
    <106a>   DW_AT_name        : (indirect string, offset: 0xf1e): nioctlents
    <106e>   DW_AT_decl_file   : 19
    <106f>   DW_AT_decl_line   : 1906
    <1071>   DW_AT_decl_column : 17
    <1072>   DW_AT_type        : <0x2b>
    <1076>   DW_AT_external    : 1
    <1077>   DW_AT_declaration : 1
 <1><1078>: Abbrev Number: 15 (DW_TAG_array_type)
    <1079>   DW_AT_type        : <0x32>
    <107d>   DW_AT_sibling     : <0x1088>
 <2><1081>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1082>   DW_AT_type        : <0x2b>
    <1086>   DW_AT_upper_bound : 2
 <2><1087>: Abbrev Number: 0
 <1><1088>: Abbrev Number: 3 (DW_TAG_const_type)
    <1089>   DW_AT_type        : <0x1078>
 <1><108d>: Abbrev Number: 10 (DW_TAG_variable)
    <108e>   DW_AT_name        : (indirect string, offset: 0xf88): nsyscall_vec
    <1092>   DW_AT_decl_file   : 19
    <1093>   DW_AT_decl_line   : 1908
    <1095>   DW_AT_decl_column : 27
    <1096>   DW_AT_type        : <0x1088>
    <109a>   DW_AT_external    : 1
    <109b>   DW_AT_declaration : 1
 <1><109c>: Abbrev Number: 15 (DW_TAG_array_type)
    <109d>   DW_AT_type        : <0x9f8>
    <10a1>   DW_AT_sibling     : <0x10ac>
 <2><10a5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10a6>   DW_AT_type        : <0x2b>
    <10aa>   DW_AT_upper_bound : 2
 <2><10ab>: Abbrev Number: 0
 <1><10ac>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ad>   DW_AT_type        : <0x109c>
 <1><10b1>: Abbrev Number: 10 (DW_TAG_variable)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x7f7): sysent_vec
    <10b6>   DW_AT_decl_file   : 19
    <10b7>   DW_AT_decl_line   : 1909
    <10b9>   DW_AT_decl_column : 35
    <10ba>   DW_AT_type        : <0x10ac>
    <10be>   DW_AT_external    : 1
    <10bf>   DW_AT_declaration : 1
 <1><10c0>: Abbrev Number: 10 (DW_TAG_variable)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x3ad): inject_vec
    <10c5>   DW_AT_decl_file   : 19
    <10c6>   DW_AT_decl_line   : 1910
    <10c8>   DW_AT_decl_column : 28
    <10c9>   DW_AT_type        : <0x9fd>
    <10cd>   DW_AT_external    : 1
    <10ce>   DW_AT_declaration : 1
 <1><10cf>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10d0>   DW_AT_name        : (indirect string, offset: 0xe10): audit_arch_t
    <10d4>   DW_AT_byte_size   : 8
    <10d5>   DW_AT_decl_file   : 19
    <10d6>   DW_AT_decl_line   : 1912
    <10d8>   DW_AT_decl_column : 8
    <10d9>   DW_AT_sibling     : <0x10fe>
 <2><10dd>: Abbrev Number: 22 (DW_TAG_member)
    <10de>   DW_AT_name        : (indirect string, offset: 0x620): arch
    <10e2>   DW_AT_decl_file   : 19
    <10e3>   DW_AT_decl_line   : 1913
    <10e5>   DW_AT_decl_column : 15
    <10e6>   DW_AT_type        : <0x2b>
    <10ea>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ed>: Abbrev Number: 22 (DW_TAG_member)
    <10ee>   DW_AT_name        : (indirect string, offset: 0xa4e): flag
    <10f2>   DW_AT_decl_file   : 19
    <10f3>   DW_AT_decl_line   : 1914
    <10f5>   DW_AT_decl_column : 15
    <10f6>   DW_AT_type        : <0x2b>
    <10fa>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10fd>: Abbrev Number: 0
 <1><10fe>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ff>   DW_AT_type        : <0x10cf>
 <1><1103>: Abbrev Number: 15 (DW_TAG_array_type)
    <1104>   DW_AT_type        : <0x10fe>
    <1108>   DW_AT_sibling     : <0x1113>
 <2><110c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <110d>   DW_AT_type        : <0x2b>
    <1111>   DW_AT_upper_bound : 2
 <2><1112>: Abbrev Number: 0
 <1><1113>: Abbrev Number: 3 (DW_TAG_const_type)
    <1114>   DW_AT_type        : <0x1103>
 <1><1118>: Abbrev Number: 10 (DW_TAG_variable)
    <1119>   DW_AT_name        : (indirect string, offset: 0x9b5): audit_arch_vec
    <111d>   DW_AT_decl_file   : 19
    <111e>   DW_AT_decl_line   : 1917
    <1120>   DW_AT_decl_column : 34
    <1121>   DW_AT_type        : <0x1113>
    <1125>   DW_AT_external    : 1
    <1126>   DW_AT_declaration : 1
 <1><1127>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1128>   DW_AT_byte_size   : 180
    <1129>   DW_AT_decl_file   : 21
    <112a>   DW_AT_decl_line   : 2
    <112b>   DW_AT_decl_column : 9
    <112c>   DW_AT_sibling     : <0x13e1>
 <2><1130>: Abbrev Number: 9 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0x1cc): block_ioctl
    <1135>   DW_AT_decl_file   : 21
    <1136>   DW_AT_decl_line   : 3
    <1137>   DW_AT_decl_column : 8
    <1138>   DW_AT_type        : <0x13fb>
    <113c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><113f>: Abbrev Number: 9 (DW_TAG_member)
    <1140>   DW_AT_name        : (indirect string, offset: 0xb44): btrfs_ioctl
    <1144>   DW_AT_decl_file   : 21
    <1145>   DW_AT_decl_line   : 6
    <1146>   DW_AT_decl_column : 8
    <1147>   DW_AT_type        : <0x13fb>
    <114b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><114e>: Abbrev Number: 9 (DW_TAG_member)
    <114f>   DW_AT_name        : (indirect string, offset: 0x77c): evdev_write_ioctl_mpers
    <1153>   DW_AT_decl_file   : 21
    <1154>   DW_AT_decl_line   : 9
