Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x179e (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4eb): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xb7d): mpers-mx32/semid_ds_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xed5): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1045): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9c7): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x359): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x264): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe33): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x48f): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8bd): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf30): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8ed): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7a6): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbaf): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbe5): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd3b): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xca6): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x40c): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x458): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x365): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xbd0): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xfd8): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xe43): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2d5): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb40): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x1119): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe6e): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xb02): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x28c): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0x3ae): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0x102f): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x779): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xc95): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xb95): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x36d): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xa4a): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x4de): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0xf85): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x7e7): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x12e): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x107e): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x92f): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x9a0): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0xdd3): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x1bf): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0xcf8): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xb6): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x611): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x211): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0xffe): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x7d3): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x869): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x23f): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xe94): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xd08): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x16f): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x711): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xa94): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x1013): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x3d2): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xc6b): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0xa0c): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0xa6e): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x801): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0xb22): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x484): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x317): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x79): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x381): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5c3): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0x1058): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0xe2c): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x24b): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x5d7): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x279): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xea3): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x6ea): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0xc10): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x1ac): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xf17): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x376): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x9fe): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x10c8): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x4c9): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0xfac): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0xa18): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x41e): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0xad8): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x5b2): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x254): __kernel_mode_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 24
    <539>   DW_AT_decl_column : 22
    <53a>   DW_AT_type        : <0x2b>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x6ad): __kernel_uid32_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 49
    <545>   DW_AT_decl_column : 22
    <546>   DW_AT_type        : <0x2b>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x656): __kernel_gid32_t
    <54f>   DW_AT_decl_file   : 15
    <550>   DW_AT_decl_line   : 50
    <551>   DW_AT_decl_column : 22
    <552>   DW_AT_type        : <0x2b>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x9ad): __kernel_time_t
    <55b>   DW_AT_decl_file   : 15
    <55c>   DW_AT_decl_line   : 89
    <55d>   DW_AT_decl_column : 25
    <55e>   DW_AT_type        : <0x51a>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0x3e0): kernel_long_t
    <567>   DW_AT_decl_file   : 16
    <568>   DW_AT_decl_line   : 16
    <569>   DW_AT_decl_column : 25
    <56a>   DW_AT_type        : <0x51a>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x8de): kernel_ulong_t
    <573>   DW_AT_decl_file   : 16
    <574>   DW_AT_decl_line   : 17
    <575>   DW_AT_decl_column : 26
    <576>   DW_AT_type        : <0x526>
 <1><57a>: Abbrev Number: 3 (DW_TAG_const_type)
    <57b>   DW_AT_type        : <0x56e>
 <1><57f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <580>   DW_AT_name        : (indirect string, offset: 0xc2e): list_item
    <584>   DW_AT_byte_size   : 8
    <585>   DW_AT_decl_file   : 17
    <586>   DW_AT_decl_line   : 92
    <587>   DW_AT_decl_column : 8
    <588>   DW_AT_sibling     : <0x5ab>
 <2><58c>: Abbrev Number: 9 (DW_TAG_member)
    <58d>   DW_AT_name        : (indirect string, offset: 0x1114): prev
    <591>   DW_AT_decl_file   : 17
    <592>   DW_AT_decl_line   : 93
    <593>   DW_AT_decl_column : 20
    <594>   DW_AT_type        : <0x5ab>
    <598>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><59b>: Abbrev Number: 9 (DW_TAG_member)
    <59c>   DW_AT_name        : (indirect string, offset: 0x1103): next
    <5a0>   DW_AT_decl_file   : 17
    <5a1>   DW_AT_decl_line   : 94
    <5a2>   DW_AT_decl_column : 20
    <5a3>   DW_AT_type        : <0x5ab>
    <5a7>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5aa>: Abbrev Number: 0
 <1><5ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5ac>   DW_AT_byte_size   : 4
    <5ad>   DW_AT_type        : <0x57f>
 <1><5b1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x8b6): sysent
    <5b6>   DW_AT_byte_size   : 20
    <5b7>   DW_AT_decl_file   : 18
    <5b8>   DW_AT_decl_line   : 13
    <5b9>   DW_AT_decl_column : 16
    <5ba>   DW_AT_sibling     : <0x60a>
 <2><5be>: Abbrev Number: 9 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x106f): nargs
    <5c3>   DW_AT_decl_file   : 18
    <5c4>   DW_AT_decl_line   : 14
    <5c5>   DW_AT_decl_column : 11
    <5c6>   DW_AT_type        : <0x2b>
    <5ca>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5cd>: Abbrev Number: 9 (DW_TAG_member)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x9bd): sys_flags
    <5d2>   DW_AT_decl_file   : 18
    <5d3>   DW_AT_decl_line   : 15
    <5d4>   DW_AT_decl_column : 6
    <5d5>   DW_AT_type        : <0x64>
    <5d9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5dc>: Abbrev Number: 18 (DW_TAG_member)
    <5dd>   DW_AT_name        : sen
    <5e1>   DW_AT_decl_file   : 18
    <5e2>   DW_AT_decl_line   : 16
    <5e3>   DW_AT_decl_column : 6
    <5e4>   DW_AT_type        : <0x64>
    <5e8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5eb>: Abbrev Number: 9 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x30e): sys_func
    <5f0>   DW_AT_decl_file   : 18
    <5f1>   DW_AT_decl_line   : 17
    <5f2>   DW_AT_decl_column : 8
    <5f3>   DW_AT_type        : <0x877>
    <5f7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5fa>: Abbrev Number: 9 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x283): sys_name
    <5ff>   DW_AT_decl_file   : 18
    <600>   DW_AT_decl_line   : 18
    <601>   DW_AT_decl_column : 14
    <602>   DW_AT_type        : <0x1c2>
    <606>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><609>: Abbrev Number: 0
 <1><60a>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <60b>   DW_AT_prototyped  : 1
    <60c>   DW_AT_type        : <0x64>
    <610>   DW_AT_sibling     : <0x61a>
 <2><614>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <615>   DW_AT_type        : <0x61a>
 <2><619>: Abbrev Number: 0
 <1><61a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <61b>   DW_AT_byte_size   : 4
    <61c>   DW_AT_type        : <0x625>
 <1><620>: Abbrev Number: 3 (DW_TAG_const_type)
    <621>   DW_AT_type        : <0x61a>
 <1><625>: Abbrev Number: 21 (DW_TAG_structure_type)
    <626>   DW_AT_name        : tcb
    <62a>   DW_AT_byte_size   : 288
    <62c>   DW_AT_decl_file   : 19
    <62d>   DW_AT_decl_line   : 262
    <62f>   DW_AT_decl_column : 8
    <630>   DW_AT_sibling     : <0x877>
 <2><634>: Abbrev Number: 22 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x4d8): flags
    <639>   DW_AT_decl_file   : 19
    <63a>   DW_AT_decl_line   : 263
    <63c>   DW_AT_decl_column : 6
    <63d>   DW_AT_type        : <0x64>
    <641>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><644>: Abbrev Number: 23 (DW_TAG_member)
    <645>   DW_AT_name        : pid
    <649>   DW_AT_decl_file   : 19
    <64a>   DW_AT_decl_line   : 264
    <64c>   DW_AT_decl_column : 6
    <64d>   DW_AT_type        : <0x64>
    <651>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><654>: Abbrev Number: 22 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0x58): qual_flg
    <659>   DW_AT_decl_file   : 19
    <65a>   DW_AT_decl_line   : 265
    <65c>   DW_AT_decl_column : 6
    <65d>   DW_AT_type        : <0x64>
    <661>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><664>: Abbrev Number: 22 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x39a): currpers
    <669>   DW_AT_decl_file   : 19
    <66a>   DW_AT_decl_line   : 267
    <66c>   DW_AT_decl_column : 15
    <66d>   DW_AT_type        : <0x2b>
    <671>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><674>: Abbrev Number: 22 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0xb75): u_error
    <679>   DW_AT_decl_file   : 19
    <67a>   DW_AT_decl_line   : 269
    <67c>   DW_AT_decl_column : 16
    <67d>   DW_AT_type        : <0x37>
    <681>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><684>: Abbrev Number: 22 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x18c): scno
    <689>   DW_AT_decl_file   : 19
    <68a>   DW_AT_decl_line   : 270
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x56e>
    <691>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><694>: Abbrev Number: 22 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0xbc6): true_scno
    <699>   DW_AT_decl_file   : 19
    <69a>   DW_AT_decl_line   : 271
    <69c>   DW_AT_decl_column : 17
    <69d>   DW_AT_type        : <0x56e>
    <6a1>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6a4>: Abbrev Number: 22 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0x196): u_arg
    <6a9>   DW_AT_decl_file   : 19
    <6aa>   DW_AT_decl_line   : 272
    <6ac>   DW_AT_decl_column : 17
    <6ad>   DW_AT_type        : <0x9a7>
    <6b1>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6b4>: Abbrev Number: 22 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x9d4): u_rval
    <6b9>   DW_AT_decl_file   : 19
    <6ba>   DW_AT_decl_line   : 273
    <6bc>   DW_AT_decl_column : 16
    <6bd>   DW_AT_type        : <0x562>
    <6c1>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6c4>: Abbrev Number: 22 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0xaf4): sys_func_rval
    <6c9>   DW_AT_decl_file   : 19
    <6ca>   DW_AT_decl_line   : 274
    <6cc>   DW_AT_decl_column : 6
    <6cd>   DW_AT_type        : <0x64>
    <6d1>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6d4>: Abbrev Number: 22 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0xd22): curcol
    <6d9>   DW_AT_decl_file   : 19
    <6da>   DW_AT_decl_line   : 275
    <6dc>   DW_AT_decl_column : 6
    <6dd>   DW_AT_type        : <0x64>
    <6e1>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6e4>: Abbrev Number: 22 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x9e6): outf
    <6e9>   DW_AT_decl_file   : 19
    <6ea>   DW_AT_decl_line   : 276
    <6ec>   DW_AT_decl_column : 8
    <6ed>   DW_AT_type        : <0x407>
    <6f1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6f4>: Abbrev Number: 22 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0xf56): staged_output_data
    <6f9>   DW_AT_decl_file   : 19
    <6fa>   DW_AT_decl_line   : 277
    <6fc>   DW_AT_decl_column : 29
    <6fd>   DW_AT_type        : <0x9bd>
    <701>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><704>: Abbrev Number: 22 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xabf): auxstr
    <709>   DW_AT_decl_file   : 19
    <70a>   DW_AT_decl_line   : 279
    <70c>   DW_AT_decl_column : 14
    <70d>   DW_AT_type        : <0x1c2>
    <711>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><714>: Abbrev Number: 22 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x175): _priv_data
    <719>   DW_AT_decl_file   : 19
    <71a>   DW_AT_decl_line   : 280
    <71c>   DW_AT_decl_column : 8
    <71d>   DW_AT_type        : <0xc6>
    <721>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><724>: Abbrev Number: 22 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0xc5b): _free_priv_data
    <729>   DW_AT_decl_file   : 19
    <72a>   DW_AT_decl_line   : 281
    <72c>   DW_AT_decl_column : 9
    <72d>   DW_AT_type        : <0x9cf>
    <731>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><734>: Abbrev Number: 22 (DW_TAG_member)
    <735>   DW_AT_name        : (indirect string, offset: 0x186): s_ent
    <739>   DW_AT_decl_file   : 19
    <73a>   DW_AT_decl_line   : 282
    <73c>   DW_AT_decl_column : 23
    <73d>   DW_AT_type        : <0x9d5>
    <741>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><744>: Abbrev Number: 22 (DW_TAG_member)
    <745>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <749>   DW_AT_decl_file   : 19
    <74a>   DW_AT_decl_line   : 285
    <74c>   DW_AT_decl_column : 23
    <74d>   DW_AT_type        : <0x9d5>
    <751>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><755>: Abbrev Number: 22 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x38f): inject_vec
    <75a>   DW_AT_decl_file   : 19
    <75b>   DW_AT_decl_line   : 286
    <75d>   DW_AT_decl_column : 22
    <75e>   DW_AT_type        : <0x9e0>
    <762>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><766>: Abbrev Number: 22 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x80a): stime
    <76b>   DW_AT_decl_file   : 19
    <76c>   DW_AT_decl_line   : 287
    <76e>   DW_AT_decl_column : 18
    <76f>   DW_AT_type        : <0x133>
    <773>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><777>: Abbrev Number: 22 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x3a3): ltime
    <77c>   DW_AT_decl_file   : 19
    <77d>   DW_AT_decl_line   : 288
    <77f>   DW_AT_decl_column : 18
    <780>   DW_AT_type        : <0x133>
    <784>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><788>: Abbrev Number: 22 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x1036): atime
    <78d>   DW_AT_decl_file   : 19
    <78e>   DW_AT_decl_line   : 289
    <790>   DW_AT_decl_column : 18
    <791>   DW_AT_type        : <0x133>
    <795>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><799>: Abbrev Number: 22 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0x4d2): etime
    <79e>   DW_AT_decl_file   : 19
    <79f>   DW_AT_decl_line   : 290
    <7a1>   DW_AT_decl_column : 18
    <7a2>   DW_AT_type        : <0x133>
    <7a6>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7aa>: Abbrev Number: 22 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0xd90): delay_expiration_time
    <7af>   DW_AT_decl_file   : 19
    <7b0>   DW_AT_decl_line   : 291
    <7b2>   DW_AT_decl_column : 18
    <7b3>   DW_AT_type        : <0x133>
    <7b7>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7bb>: Abbrev Number: 22 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7c0>   DW_AT_decl_file   : 19
    <7c1>   DW_AT_decl_line   : 298
    <7c3>   DW_AT_decl_column : 15
    <7c4>   DW_AT_type        : <0x2b>
    <7c8>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7cc>: Abbrev Number: 22 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0xf92): last_dirfd
    <7d1>   DW_AT_decl_file   : 19
    <7d2>   DW_AT_decl_line   : 301
    <7d4>   DW_AT_decl_column : 6
    <7d5>   DW_AT_type        : <0x64>
    <7d9>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7dd>: Abbrev Number: 22 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xfb8): mmap_cache
    <7e2>   DW_AT_decl_file   : 19
    <7e3>   DW_AT_decl_line   : 304
    <7e5>   DW_AT_decl_column : 23
    <7e6>   DW_AT_type        : <0x9fc>
    <7ea>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ee>: Abbrev Number: 22 (DW_TAG_member)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xb9c): wait_data_idx
    <7f3>   DW_AT_decl_file   : 19
    <7f4>   DW_AT_decl_line   : 311
    <7f6>   DW_AT_decl_column : 9
    <7f7>   DW_AT_type        : <0x122>
    <7fb>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7ff>: Abbrev Number: 22 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0xac6): delayed_wait_data
    <804>   DW_AT_decl_file   : 19
    <805>   DW_AT_decl_line   : 313
    <807>   DW_AT_decl_column : 24
    <808>   DW_AT_type        : <0xa08>
    <80c>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><810>: Abbrev Number: 22 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0xb36): wait_list
    <815>   DW_AT_decl_file   : 19
    <816>   DW_AT_decl_line   : 314
    <818>   DW_AT_decl_column : 19
    <819>   DW_AT_type        : <0x57f>
    <81d>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><821>: Abbrev Number: 22 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0x702): vcpu_info_list
    <826>   DW_AT_decl_file   : 19
    <827>   DW_AT_decl_line   : 318
    <829>   DW_AT_decl_column : 20
    <82a>   DW_AT_type        : <0xa14>
    <82e>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><832>: Abbrev Number: 22 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0xced): unwind_ctx
    <837>   DW_AT_decl_file   : 19
    <838>   DW_AT_decl_line   : 322
    <83a>   DW_AT_decl_column : 8
    <83b>   DW_AT_type        : <0xc6>
    <83f>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><843>: Abbrev Number: 22 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x4bc): unwind_queue
    <848>   DW_AT_decl_file   : 19
    <849>   DW_AT_decl_line   : 323
    <84b>   DW_AT_decl_column : 25
    <84c>   DW_AT_type        : <0xa20>
    <850>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><854>: Abbrev Number: 22 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x16a): comm
    <859>   DW_AT_decl_file   : 19
    <85a>   DW_AT_decl_line   : 327
    <85c>   DW_AT_decl_column : 7
    <85d>   DW_AT_type        : <0xa26>
    <861>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><865>: Abbrev Number: 22 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x221): start_prc
    <86a>   DW_AT_decl_file   : 19
    <86b>   DW_AT_decl_line   : 329
    <86d>   DW_AT_decl_column : 16
    <86e>   DW_AT_type        : <0x37>
    <872>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><876>: Abbrev Number: 0
 <1><877>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <878>   DW_AT_byte_size   : 4
    <879>   DW_AT_type        : <0x60a>
 <1><87d>: Abbrev Number: 4 (DW_TAG_typedef)
    <87e>   DW_AT_name        : (indirect string, offset: 0x5a4): struct_sysent
    <882>   DW_AT_decl_file   : 18
    <883>   DW_AT_decl_line   : 19
    <884>   DW_AT_decl_column : 3
    <885>   DW_AT_type        : <0x5b1>
 <1><889>: Abbrev Number: 3 (DW_TAG_const_type)
    <88a>   DW_AT_type        : <0x87d>
 <1><88e>: Abbrev Number: 11 (DW_TAG_variable)
    <88f>   DW_AT_name        : (indirect string, offset: 0xd7c): current_personality
    <893>   DW_AT_decl_file   : 19
    <894>   DW_AT_decl_line   : 158
    <895>   DW_AT_decl_column : 17
    <896>   DW_AT_type        : <0x2b>
    <89a>   DW_AT_external    : 1
    <89b>   DW_AT_declaration : 1
 <1><89c>: Abbrev Number: 11 (DW_TAG_variable)
    <89d>   DW_AT_name        : (indirect string, offset: 0x858): current_wordsize
    <8a1>   DW_AT_decl_file   : 19
    <8a2>   DW_AT_decl_line   : 171
    <8a3>   DW_AT_decl_column : 17
    <8a4>   DW_AT_type        : <0x2b>
    <8a8>   DW_AT_external    : 1
    <8a9>   DW_AT_declaration : 1
 <1><8aa>: Abbrev Number: 11 (DW_TAG_variable)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xa9d): current_klongsize
    <8af>   DW_AT_decl_file   : 19
    <8b0>   DW_AT_decl_line   : 176
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x2b>
    <8b6>   DW_AT_external    : 1
    <8b7>   DW_AT_declaration : 1
 <1><8b8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xcc4): ioctlent
    <8bd>   DW_AT_byte_size   : 8
    <8be>   DW_AT_decl_file   : 19
    <8bf>   DW_AT_decl_line   : 217
    <8c0>   DW_AT_decl_column : 16
    <8c1>   DW_AT_sibling     : <0x8e4>
 <2><8c5>: Abbrev Number: 9 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0xf7e): symbol
    <8ca>   DW_AT_decl_file   : 19
    <8cb>   DW_AT_decl_line   : 218
    <8cc>   DW_AT_decl_column : 14
    <8cd>   DW_AT_type        : <0x1c2>
    <8d1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d4>: Abbrev Number: 9 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xd45): code
    <8d9>   DW_AT_decl_file   : 19
    <8da>   DW_AT_decl_line   : 219
    <8db>   DW_AT_decl_column : 15
    <8dc>   DW_AT_type        : <0x2b>
    <8e0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e3>: Abbrev Number: 0
 <1><8e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xc85): struct_ioctlent
    <8e9>   DW_AT_decl_file   : 19
    <8ea>   DW_AT_decl_line   : 220
    <8eb>   DW_AT_decl_column : 3
    <8ec>   DW_AT_type        : <0x8b8>
 <1><8f0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f1>   DW_AT_type        : <0x8e4>
 <1><8f5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x84c): inject_data
    <8fa>   DW_AT_byte_size   : 10
    <8fb>   DW_AT_decl_file   : 19
    <8fc>   DW_AT_decl_line   : 241
    <8fd>   DW_AT_decl_column : 8
    <8fe>   DW_AT_sibling     : <0x95d>
 <2><902>: Abbrev Number: 9 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x4d8): flags
    <907>   DW_AT_decl_file   : 19
    <908>   DW_AT_decl_line   : 242
    <909>   DW_AT_decl_column : 10
    <90a>   DW_AT_type        : <0xeb>
    <90e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><911>: Abbrev Number: 9 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x961): signo
    <916>   DW_AT_decl_file   : 19
    <917>   DW_AT_decl_line   : 243
    <918>   DW_AT_decl_column : 10
    <919>   DW_AT_type        : <0xeb>
    <91d>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><920>: Abbrev Number: 9 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0xfc): rval_idx
    <925>   DW_AT_decl_file   : 19
    <926>   DW_AT_decl_line   : 244
    <927>   DW_AT_decl_column : 11
    <928>   DW_AT_type        : <0xf7>
    <92c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><92f>: Abbrev Number: 9 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0xd18): delay_idx
    <934>   DW_AT_decl_file   : 19
    <935>   DW_AT_decl_line   : 245
    <936>   DW_AT_decl_column : 11
    <937>   DW_AT_type        : <0xf7>
    <93b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><93e>: Abbrev Number: 9 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x603): poke_idx
    <943>   DW_AT_decl_file   : 19
    <944>   DW_AT_decl_line   : 246
    <945>   DW_AT_decl_column : 11
    <946>   DW_AT_type        : <0xf7>
    <94a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><94d>: Abbrev Number: 9 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0x18c): scno
    <952>   DW_AT_decl_file   : 19
    <953>   DW_AT_decl_line   : 247
    <954>   DW_AT_decl_column : 11
    <955>   DW_AT_type        : <0xf7>
    <959>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><95c>: Abbrev Number: 0
 <1><95d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <95e>   DW_AT_name        : (indirect string, offset: 0xdd): inject_opts
    <962>   DW_AT_byte_size   : 16
    <963>   DW_AT_decl_file   : 19
    <964>   DW_AT_decl_line   : 250
    <965>   DW_AT_decl_column : 8
    <966>   DW_AT_sibling     : <0x9a7>
 <2><96a>: Abbrev Number: 9 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0xa68): first
    <96f>   DW_AT_decl_file   : 19
    <970>   DW_AT_decl_line   : 251
    <971>   DW_AT_decl_column : 11
    <972>   DW_AT_type        : <0xf7>
    <976>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><979>: Abbrev Number: 9 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x113d): last
    <97e>   DW_AT_decl_file   : 19
    <97f>   DW_AT_decl_line   : 252
    <980>   DW_AT_decl_column : 11
    <981>   DW_AT_type        : <0xf7>
    <985>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><988>: Abbrev Number: 9 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x3a9): step
    <98d>   DW_AT_decl_file   : 19
    <98e>   DW_AT_decl_line   : 253
    <98f>   DW_AT_decl_column : 11
    <990>   DW_AT_type        : <0xf7>
    <994>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><997>: Abbrev Number: 9 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0x1108): data
    <99c>   DW_AT_decl_file   : 19
    <99d>   DW_AT_decl_line   : 254
    <99e>   DW_AT_decl_column : 21
    <99f>   DW_AT_type        : <0x8f5>
    <9a3>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 15 (DW_TAG_array_type)
    <9a8>   DW_AT_type        : <0x56e>
    <9ac>   DW_AT_sibling     : <0x9b7>
 <2><9b0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9b1>   DW_AT_type        : <0x2b>
    <9b5>   DW_AT_upper_bound : 5
 <2><9b6>: Abbrev Number: 0
 <1><9b7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xf56): staged_output_data
    <9bc>   DW_AT_declaration : 1
 <1><9bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9be>   DW_AT_byte_size   : 4
    <9bf>   DW_AT_type        : <0x9b7>
 <1><9c3>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9c4>   DW_AT_prototyped  : 1
    <9c5>   DW_AT_sibling     : <0x9cf>
 <2><9c9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ca>   DW_AT_type        : <0xc6>
 <2><9ce>: Abbrev Number: 0
 <1><9cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d0>   DW_AT_byte_size   : 4
    <9d1>   DW_AT_type        : <0x9c3>
 <1><9d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d6>   DW_AT_byte_size   : 4
    <9d7>   DW_AT_type        : <0x889>
 <1><9db>: Abbrev Number: 3 (DW_TAG_const_type)
    <9dc>   DW_AT_type        : <0x9d5>
 <1><9e0>: Abbrev Number: 15 (DW_TAG_array_type)
    <9e1>   DW_AT_type        : <0x9f0>
    <9e5>   DW_AT_sibling     : <0x9f0>
 <2><9e9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9ea>   DW_AT_type        : <0x2b>
    <9ee>   DW_AT_upper_bound : 2
 <2><9ef>: Abbrev Number: 0
 <1><9f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f1>   DW_AT_byte_size   : 4
    <9f2>   DW_AT_type        : <0x95d>
 <1><9f6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f7>   DW_AT_name        : (indirect string, offset: 0xa9): mmap_cache_t
    <9fb>   DW_AT_declaration : 1
 <1><9fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x9f6>
 <1><a02>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a03>   DW_AT_name        : (indirect string, offset: 0x3c4): tcb_wait_data
    <a07>   DW_AT_declaration : 1
 <1><a08>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a09>   DW_AT_byte_size   : 4
    <a0a>   DW_AT_type        : <0xa02>
 <1><a0e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x160): vcpu_info
    <a13>   DW_AT_declaration : 1
 <1><a14>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a15>   DW_AT_byte_size   : 4
    <a16>   DW_AT_type        : <0xa0e>
 <1><a1a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xf3a): unwind_queue_t
    <a1f>   DW_AT_declaration : 1
 <1><a20>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a21>   DW_AT_byte_size   : 4
    <a22>   DW_AT_type        : <0xa1a>
 <1><a26>: Abbrev Number: 15 (DW_TAG_array_type)
    <a27>   DW_AT_type        : <0xdf>
    <a2b>   DW_AT_sibling     : <0xa36>
 <2><a2f>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a30>   DW_AT_type        : <0x2b>
    <a34>   DW_AT_upper_bound : 15
 <2><a35>: Abbrev Number: 0
 <1><a36>: Abbrev Number: 10 (DW_TAG_variable)
    <a37>   DW_AT_name        : (indirect string, offset: 0xbd9): stub_sysent
    <a3b>   DW_AT_decl_file   : 19
    <a3c>   DW_AT_decl_line   : 403
    <a3e>   DW_AT_decl_column : 28
    <a3f>   DW_AT_type        : <0x889>
    <a43>   DW_AT_external    : 1
    <a44>   DW_AT_declaration : 1
 <1><a45>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a46>   DW_AT_name        : (indirect string, offset: 0x10eb): xlat_type
    <a4a>   DW_AT_encoding    : 7	(unsigned)
    <a4b>   DW_AT_byte_size   : 4
    <a4c>   DW_AT_type        : <0x2b>
    <a50>   DW_AT_decl_file   : 20
    <a51>   DW_AT_decl_line   : 13
    <a52>   DW_AT_decl_column : 6
    <a53>   DW_AT_sibling     : <0xa6a>
 <2><a57>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0x2de): XT_NORMAL
    <a5c>   DW_AT_const_value : 0
 <2><a5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xc9c): XT_SORTED
    <a62>   DW_AT_const_value : 1
 <2><a63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0xe08): XT_INDEXED
    <a68>   DW_AT_const_value : 2
 <2><a69>: Abbrev Number: 0
 <1><a6a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xc05): xlat_style
    <a6f>   DW_AT_encoding    : 7	(unsigned)
    <a70>   DW_AT_byte_size   : 4
    <a71>   DW_AT_type        : <0x2b>
    <a75>   DW_AT_decl_file   : 20
    <a76>   DW_AT_decl_line   : 19
    <a77>   DW_AT_decl_column : 6
    <a78>   DW_AT_sibling     : <0xaa7>
 <2><a7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0xe9): XLAT_STYLE_DEFAULT
    <a81>   DW_AT_const_value : 0
 <2><a82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0xc38): XLAT_STYLE_RAW
    <a87>   DW_AT_const_value : 1
 <2><a88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0x10b6): XLAT_STYLE_ABBREV
    <a8d>   DW_AT_const_value : 2
 <2><a8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x2fb): XLAT_STYLE_VERBOSE
    <a93>   DW_AT_const_value : 3
 <2><a94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a99>   DW_AT_const_value : 0
 <2><a9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a9f>   DW_AT_const_value : 4
 <2><aa0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x112c): XLAT_STYLE_FMT_D
    <aa5>   DW_AT_const_value : 8
 <2><aa6>: Abbrev Number: 0
 <1><aa7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x32c): xlat_data
    <aac>   DW_AT_byte_size   : 16
    <aad>   DW_AT_decl_file   : 20
    <aae>   DW_AT_decl_line   : 51
    <aaf>   DW_AT_decl_column : 8
    <ab0>   DW_AT_sibling     : <0xad3>
 <2><ab4>: Abbrev Number: 18 (DW_TAG_member)
    <ab5>   DW_AT_name        : val
    <ab9>   DW_AT_decl_file   : 20
    <aba>   DW_AT_decl_line   : 52
    <abb>   DW_AT_decl_column : 11
    <abc>   DW_AT_type        : <0x10f>
    <ac0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac3>: Abbrev Number: 18 (DW_TAG_member)
    <ac4>   DW_AT_name        : str
    <ac8>   DW_AT_decl_file   : 20
    <ac9>   DW_AT_decl_line   : 53
    <aca>   DW_AT_decl_column : 14
    <acb>   DW_AT_type        : <0x1c2>
    <acf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad2>: Abbrev Number: 0
 <1><ad3>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad4>   DW_AT_type        : <0xaa7>
 <1><ad8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <add>   DW_AT_byte_size   : 24
    <ade>   DW_AT_decl_file   : 20
    <adf>   DW_AT_decl_line   : 56
    <ae0>   DW_AT_decl_column : 8
    <ae1>   DW_AT_sibling     : <0xb31>
 <2><ae5>: Abbrev Number: 9 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x1108): data
    <aea>   DW_AT_decl_file   : 20
    <aeb>   DW_AT_decl_line   : 57
    <aec>   DW_AT_decl_column : 26
    <aed>   DW_AT_type        : <0xb36>
    <af1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af4>: Abbrev Number: 9 (DW_TAG_member)
    <af5>   DW_AT_name        : (indirect string, offset: 0x8aa): flags_strsz
    <af9>   DW_AT_decl_file   : 20
    <afa>   DW_AT_decl_line   : 58
    <afb>   DW_AT_decl_column : 9
    <afc>   DW_AT_type        : <0x122>
    <b00>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b03>: Abbrev Number: 9 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0xbaa): size
    <b08>   DW_AT_decl_file   : 20
    <b09>   DW_AT_decl_line   : 59
    <b0a>   DW_AT_decl_column : 11
    <b0b>   DW_AT_type        : <0x103>
    <b0f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b12>: Abbrev Number: 9 (DW_TAG_member)
    <b13>   DW_AT_name        : (indirect string, offset: 0x191): type
    <b17>   DW_AT_decl_file   : 20
    <b18>   DW_AT_decl_line   : 60
    <b19>   DW_AT_decl_column : 17
    <b1a>   DW_AT_type        : <0xa45>
    <b1e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b21>: Abbrev Number: 9 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0x756): flags_mask
    <b26>   DW_AT_decl_file   : 20
    <b27>   DW_AT_decl_line   : 61
    <b28>   DW_AT_decl_column : 11
    <b29>   DW_AT_type        : <0x10f>
    <b2d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b30>: Abbrev Number: 0
 <1><b31>: Abbrev Number: 3 (DW_TAG_const_type)
    <b32>   DW_AT_type        : <0xad8>
 <1><b36>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b37>   DW_AT_byte_size   : 4
    <b38>   DW_AT_type        : <0xad3>
 <1><b3c>: Abbrev Number: 15 (DW_TAG_array_type)
    <b3d>   DW_AT_type        : <0xb31>
    <b41>   DW_AT_sibling     : <0xb47>
 <2><b45>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b46>: Abbrev Number: 0
 <1><b47>: Abbrev Number: 3 (DW_TAG_const_type)
    <b48>   DW_AT_type        : <0xb3c>
 <1><b4c>: Abbrev Number: 10 (DW_TAG_variable)
    <b4d>   DW_AT_name        : (indirect string, offset: 0xe81): addrfams
    <b51>   DW_AT_decl_file   : 19
    <b52>   DW_AT_decl_line   : 409
    <b54>   DW_AT_decl_column : 26
    <b55>   DW_AT_type        : <0xb47>
    <b59>   DW_AT_external    : 1
    <b5a>   DW_AT_declaration : 1
 <1><b5b>: Abbrev Number: 10 (DW_TAG_variable)
    <b5c>   DW_AT_name        : (indirect string, offset: 0xd55): arp_hardware_types
    <b60>   DW_AT_decl_file   : 19
    <b61>   DW_AT_decl_line   : 410
    <b63>   DW_AT_decl_column : 26
    <b64>   DW_AT_type        : <0xb47>
    <b68>   DW_AT_external    : 1
    <b69>   DW_AT_declaration : 1
 <1><b6a>: Abbrev Number: 10 (DW_TAG_variable)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x103c): at_flags
    <b6f>   DW_AT_decl_file   : 19
    <b70>   DW_AT_decl_line   : 411
    <b72>   DW_AT_decl_column : 26
    <b73>   DW_AT_type        : <0xb47>
    <b77>   DW_AT_external    : 1
    <b78>   DW_AT_declaration : 1
 <1><b79>: Abbrev Number: 10 (DW_TAG_variable)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x49a): clocknames
    <b7e>   DW_AT_decl_file   : 19
    <b7f>   DW_AT_decl_line   : 412
    <b81>   DW_AT_decl_column : 26
    <b82>   DW_AT_type        : <0xb47>
    <b86>   DW_AT_external    : 1
    <b87>   DW_AT_declaration : 1
 <1><b88>: Abbrev Number: 10 (DW_TAG_variable)
    <b89>   DW_AT_name        : (indirect string, offset: 0x1006): dirent_types
    <b8d>   DW_AT_decl_file   : 19
    <b8e>   DW_AT_decl_line   : 413
    <b90>   DW_AT_decl_column : 26
    <b91>   DW_AT_type        : <0xb47>
    <b95>   DW_AT_external    : 1
    <b96>   DW_AT_declaration : 1
 <1><b97>: Abbrev Number: 10 (DW_TAG_variable)
    <b98>   DW_AT_name        : (indirect string, offset: 0x8fb): ethernet_protocols
    <b9c>   DW_AT_decl_file   : 19
    <b9d>   DW_AT_decl_line   : 414
    <b9f>   DW_AT_decl_column : 26
    <ba0>   DW_AT_type        : <0xb47>
    <ba4>   DW_AT_external    : 1
    <ba5>   DW_AT_declaration : 1
 <1><ba6>: Abbrev Number: 10 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x667): inet_protocols
    <bab>   DW_AT_decl_file   : 19
    <bac>   DW_AT_decl_line   : 415
    <bae>   DW_AT_decl_column : 26
    <baf>   DW_AT_type        : <0xb47>
    <bb3>   DW_AT_external    : 1
    <bb4>   DW_AT_declaration : 1
 <1><bb5>: Abbrev Number: 10 (DW_TAG_variable)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x2cb): evdev_abs
    <bba>   DW_AT_decl_file   : 19
    <bbb>   DW_AT_decl_line   : 416
    <bbd>   DW_AT_decl_column : 26
    <bbe>   DW_AT_type        : <0xb47>
    <bc2>   DW_AT_external    : 1
    <bc3>   DW_AT_declaration : 1
 <1><bc4>: Abbrev Number: 10 (DW_TAG_variable)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x74b): audit_arch
    <bc9>   DW_AT_decl_file   : 19
    <bca>   DW_AT_decl_line   : 417
    <bcc>   DW_AT_decl_column : 26
    <bcd>   DW_AT_type        : <0xb47>
    <bd1>   DW_AT_external    : 1
    <bd2>   DW_AT_declaration : 1
 <1><bd3>: Abbrev Number: 10 (DW_TAG_variable)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x95): evdev_ev
    <bd8>   DW_AT_decl_file   : 19
    <bd9>   DW_AT_decl_line   : 418
    <bdb>   DW_AT_decl_column : 26
    <bdc>   DW_AT_type        : <0xb47>
    <be0>   DW_AT_external    : 1
    <be1>   DW_AT_declaration : 1
 <1><be2>: Abbrev Number: 10 (DW_TAG_variable)
    <be3>   DW_AT_name        : (indirect string, offset: 0x47b): iffflags
    <be7>   DW_AT_decl_file   : 19
    <be8>   DW_AT_decl_line   : 419
    <bea>   DW_AT_decl_column : 26
    <beb>   DW_AT_type        : <0xb47>
    <bef>   DW_AT_external    : 1
    <bf0>   DW_AT_declaration : 1
 <1><bf1>: Abbrev Number: 10 (DW_TAG_variable)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xc47): ip_type_of_services
    <bf6>   DW_AT_decl_file   : 19
    <bf7>   DW_AT_decl_line   : 420
    <bf9>   DW_AT_decl_column : 26
    <bfa>   DW_AT_type        : <0xb47>
    <bfe>   DW_AT_external    : 1
    <bff>   DW_AT_declaration : 1
 <1><c00>: Abbrev Number: 10 (DW_TAG_variable)
    <c01>   DW_AT_name        : (indirect string, offset: 0x6de): ipc_private
    <c05>   DW_AT_decl_file   : 19
    <c06>   DW_AT_decl_line   : 421
    <c08>   DW_AT_decl_column : 26
    <c09>   DW_AT_type        : <0xb47>
    <c0d>   DW_AT_external    : 1
    <c0e>   DW_AT_declaration : 1
 <1><c0f>: Abbrev Number: 10 (DW_TAG_variable)
    <c10>   DW_AT_name        : (indirect string, offset: 0x322): msg_flags
    <c14>   DW_AT_decl_file   : 19
    <c15>   DW_AT_decl_line   : 422
    <c17>   DW_AT_decl_column : 26
    <c18>   DW_AT_type        : <0xb47>
    <c1c>   DW_AT_external    : 1
    <c1d>   DW_AT_declaration : 1
 <1><c1e>: Abbrev Number: 10 (DW_TAG_variable)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x105): netlink_protocols
    <c23>   DW_AT_decl_file   : 19
    <c24>   DW_AT_decl_line   : 423
    <c26>   DW_AT_decl_column : 26
    <c27>   DW_AT_type        : <0xb47>
    <c2b>   DW_AT_external    : 1
    <c2c>   DW_AT_declaration : 1
 <1><c2d>: Abbrev Number: 10 (DW_TAG_variable)
    <c2e>   DW_AT_name        : (indirect string, offset: 0xf69): nl_bridge_vlan_flags
    <c32>   DW_AT_decl_file   : 19
    <c33>   DW_AT_decl_line   : 424
    <c35>   DW_AT_decl_column : 26
    <c36>   DW_AT_type        : <0xb47>
    <c3a>   DW_AT_external    : 1
    <c3b>   DW_AT_declaration : 1
 <1><c3c>: Abbrev Number: 10 (DW_TAG_variable)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xdf1): nl_netfilter_msg_types
    <c41>   DW_AT_decl_file   : 19
    <c42>   DW_AT_decl_line   : 425
    <c44>   DW_AT_decl_column : 26
    <c45>   DW_AT_type        : <0xb47>
    <c49>   DW_AT_external    : 1
    <c4a>   DW_AT_declaration : 1
 <1><c4b>: Abbrev Number: 10 (DW_TAG_variable)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x45d): nl_route_types
    <c50>   DW_AT_decl_file   : 19
    <c51>   DW_AT_decl_line   : 426
    <c53>   DW_AT_decl_column : 26
    <c54>   DW_AT_type        : <0xb47>
    <c58>   DW_AT_external    : 1
    <c59>   DW_AT_declaration : 1
 <1><c5a>: Abbrev Number: 10 (DW_TAG_variable)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xeb8): open_access_modes
    <c5f>   DW_AT_decl_file   : 19
    <c60>   DW_AT_decl_line   : 427
    <c62>   DW_AT_decl_column : 26
    <c63>   DW_AT_type        : <0xb47>
    <c67>   DW_AT_external    : 1
    <c68>   DW_AT_declaration : 1
 <1><c69>: Abbrev Number: 10 (DW_TAG_variable)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x85): open_mode_flags
    <c6e>   DW_AT_decl_file   : 19
    <c6f>   DW_AT_decl_line   : 428
    <c71>   DW_AT_decl_column : 26
    <c72>   DW_AT_type        : <0xb47>
    <c76>   DW_AT_external    : 1
    <c77>   DW_AT_declaration : 1
 <1><c78>: Abbrev Number: 10 (DW_TAG_variable)
    <c79>   DW_AT_name        : (indirect string, offset: 0xc78): perf_type_id
    <c7d>   DW_AT_decl_file   : 19
    <c7e>   DW_AT_decl_line   : 429
    <c80>   DW_AT_decl_column : 26
    <c81>   DW_AT_type        : <0xb47>
    <c85>   DW_AT_external    : 1
    <c86>   DW_AT_declaration : 1
 <1><c87>: Abbrev Number: 10 (DW_TAG_variable)
    <c88>   DW_AT_name        : (indirect string, offset: 0xe8a): pollflags
    <c8c>   DW_AT_decl_file   : 19
    <c8d>   DW_AT_decl_line   : 430
    <c8f>   DW_AT_decl_column : 26
    <c90>   DW_AT_type        : <0xb47>
    <c94>   DW_AT_external    : 1
    <c95>   DW_AT_declaration : 1
 <1><c96>: Abbrev Number: 10 (DW_TAG_variable)
    <c97>   DW_AT_name        : (indirect string, offset: 0x5f7): ptrace_cmds
    <c9b>   DW_AT_decl_file   : 19
    <c9c>   DW_AT_decl_line   : 431
    <c9e>   DW_AT_decl_column : 26
    <c9f>   DW_AT_type        : <0xb47>
    <ca3>   DW_AT_external    : 1
    <ca4>   DW_AT_declaration : 1
 <1><ca5>: Abbrev Number: 10 (DW_TAG_variable)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x83d): resource_flags
    <caa>   DW_AT_decl_file   : 19
    <cab>   DW_AT_decl_line   : 432
    <cad>   DW_AT_decl_column : 26
    <cae>   DW_AT_type        : <0xb47>
    <cb2>   DW_AT_external    : 1
    <cb3>   DW_AT_declaration : 1
 <1><cb4>: Abbrev Number: 10 (DW_TAG_variable)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x2a1): route_nexthop_flags
    <cb9>   DW_AT_decl_file   : 19
    <cba>   DW_AT_decl_line   : 433
    <cbc>   DW_AT_decl_column : 26
    <cbd>   DW_AT_type        : <0xb47>
    <cc1>   DW_AT_external    : 1
    <cc2>   DW_AT_declaration : 1
 <1><cc3>: Abbrev Number: 10 (DW_TAG_variable)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xef4): routing_protocols
    <cc8>   DW_AT_decl_file   : 19
    <cc9>   DW_AT_decl_line   : 434
    <ccb>   DW_AT_decl_column : 26
    <ccc>   DW_AT_type        : <0xb47>
    <cd0>   DW_AT_external    : 1
    <cd1>   DW_AT_declaration : 1
 <1><cd2>: Abbrev Number: 10 (DW_TAG_variable)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x46c): routing_scopes
    <cd7>   DW_AT_decl_file   : 19
    <cd8>   DW_AT_decl_line   : 435
    <cda>   DW_AT_decl_column : 26
    <cdb>   DW_AT_type        : <0xb47>
    <cdf>   DW_AT_external    : 1
    <ce0>   DW_AT_declaration : 1
 <1><ce1>: Abbrev Number: 10 (DW_TAG_variable)
    <ce2>   DW_AT_name        : (indirect string, offset: 0xddf): routing_table_ids
    <ce6>   DW_AT_decl_file   : 19
    <ce7>   DW_AT_decl_line   : 436
    <ce9>   DW_AT_decl_column : 26
    <cea>   DW_AT_type        : <0xb47>
    <cee>   DW_AT_external    : 1
    <cef>   DW_AT_declaration : 1
 <1><cf0>: Abbrev Number: 10 (DW_TAG_variable)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x69f): routing_types
    <cf5>   DW_AT_decl_file   : 19
    <cf6>   DW_AT_decl_line   : 437
    <cf8>   DW_AT_decl_column : 26
    <cf9>   DW_AT_type        : <0xb47>
    <cfd>   DW_AT_external    : 1
    <cfe>   DW_AT_declaration : 1
 <1><cff>: Abbrev Number: 10 (DW_TAG_variable)
    <d00>   DW_AT_name        : (indirect string, offset: 0x1b5): rwf_flags
    <d04>   DW_AT_decl_file   : 19
    <d05>   DW_AT_decl_line   : 438
    <d07>   DW_AT_decl_column : 26
    <d08>   DW_AT_type        : <0xb47>
    <d0c>   DW_AT_external    : 1
    <d0d>   DW_AT_declaration : 1
 <1><d0e>: Abbrev Number: 10 (DW_TAG_variable)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x875): seccomp_filter_flags
    <d13>   DW_AT_decl_file   : 19
    <d14>   DW_AT_decl_line   : 439
    <d16>   DW_AT_decl_column : 26
    <d17>   DW_AT_type        : <0xb47>
    <d1b>   DW_AT_external    : 1
    <d1c>   DW_AT_declaration : 1
 <1><d1d>: Abbrev Number: 10 (DW_TAG_variable)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x2e8): seccomp_ret_action
    <d22>   DW_AT_decl_file   : 19
    <d23>   DW_AT_decl_line   : 440
    <d25>   DW_AT_decl_column : 26
    <d26>   DW_AT_type        : <0xb47>
    <d2a>   DW_AT_external    : 1
    <d2b>   DW_AT_declaration : 1
 <1><d2c>: Abbrev Number: 10 (DW_TAG_variable)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x438): setns_types
    <d31>   DW_AT_decl_file   : 19
    <d32>   DW_AT_decl_line   : 441
    <d34>   DW_AT_decl_column : 26
    <d35>   DW_AT_type        : <0xb47>
    <d39>   DW_AT_external    : 1
    <d3a>   DW_AT_declaration : 1
 <1><d3b>: Abbrev Number: 10 (DW_TAG_variable)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xe76): sg_io_info
    <d40>   DW_AT_decl_file   : 19
    <d41>   DW_AT_decl_line   : 442
    <d43>   DW_AT_decl_column : 26
    <d44>   DW_AT_type        : <0xb47>
    <d48>   DW_AT_external    : 1
    <d49>   DW_AT_declaration : 1
 <1><d4a>: Abbrev Number: 10 (DW_TAG_variable)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xbed): socketlayers
    <d4f>   DW_AT_decl_file   : 19
    <d50>   DW_AT_decl_line   : 443
    <d52>   DW_AT_decl_column : 26
    <d53>   DW_AT_type        : <0xb47>
    <d57>   DW_AT_external    : 1
    <d58>   DW_AT_declaration : 1
 <1><d59>: Abbrev Number: 10 (DW_TAG_variable)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xdc9): socktypes
    <d5e>   DW_AT_decl_file   : 19
    <d5f>   DW_AT_decl_line   : 444
    <d61>   DW_AT_decl_column : 26
    <d62>   DW_AT_type        : <0xb47>
    <d66>   DW_AT_external    : 1
    <d67>   DW_AT_declaration : 1
 <1><d68>: Abbrev Number: 10 (DW_TAG_variable)
    <d69>   DW_AT_name        : (indirect string, offset: 0xaaf): tcp_state_flags
    <d6d>   DW_AT_decl_file   : 19
    <d6e>   DW_AT_decl_line   : 445
    <d70>   DW_AT_decl_column : 26
    <d71>   DW_AT_type        : <0xb47>
    <d75>   DW_AT_external    : 1
    <d76>   DW_AT_declaration : 1
 <1><d77>: Abbrev Number: 10 (DW_TAG_variable)
    <d78>   DW_AT_name        : (indirect string, offset: 0x780): tcp_states
    <d7c>   DW_AT_decl_file   : 19
    <d7d>   DW_AT_decl_line   : 446
    <d7f>   DW_AT_decl_column : 26
    <d80>   DW_AT_type        : <0xb47>
    <d84>   DW_AT_external    : 1
    <d85>   DW_AT_declaration : 1
 <1><d86>: Abbrev Number: 10 (DW_TAG_variable)
    <d87>   DW_AT_name        : (indirect string, offset: 0x1099): whence_codes
    <d8b>   DW_AT_decl_file   : 19
    <d8c>   DW_AT_decl_line   : 447
    <d8e>   DW_AT_decl_column : 26
    <d8f>   DW_AT_type        : <0xb47>
    <d93>   DW_AT_external    : 1
    <d94>   DW_AT_declaration : 1
 <1><d95>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d96>   DW_AT_encoding    : 7	(unsigned)
    <d97>   DW_AT_byte_size   : 4
    <d98>   DW_AT_type        : <0x2b>
    <d9c>   DW_AT_decl_file   : 19
    <d9d>   DW_AT_decl_line   : 508
    <d9f>   DW_AT_decl_column : 14
    <da0>   DW_AT_sibling     : <0xdb7>
 <2><da4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0x9db): CFLAG_NONE
    <da9>   DW_AT_const_value : 0
 <2><daa>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0x90e): CFLAG_ONLY_STATS
    <daf>   DW_AT_const_value : 1
 <2><db0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0xbfa): CFLAG_BOTH
    <db5>   DW_AT_const_value : 2
 <2><db6>: Abbrev Number: 0
 <1><db7>: Abbrev Number: 28 (DW_TAG_typedef)
    <db8>   DW_AT_name        : (indirect string, offset: 0x1142): cflag_t
    <dbc>   DW_AT_decl_file   : 19
    <dbd>   DW_AT_decl_line   : 512
    <dbf>   DW_AT_decl_column : 3
    <dc0>   DW_AT_type        : <0xd95>
 <1><dc4>: Abbrev Number: 10 (DW_TAG_variable)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xd12): cflag
    <dc9>   DW_AT_decl_file   : 19
    <dca>   DW_AT_decl_line   : 513
    <dcc>   DW_AT_decl_column : 16
    <dcd>   DW_AT_type        : <0xdb7>
    <dd1>   DW_AT_external    : 1
    <dd2>   DW_AT_declaration : 1
 <1><dd3>: Abbrev Number: 10 (DW_TAG_variable)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x180): Tflag
    <dd8>   DW_AT_decl_file   : 19
    <dd9>   DW_AT_decl_line   : 514
    <ddb>   DW_AT_decl_column : 13
    <ddc>   DW_AT_type        : <0x50e>
    <de0>   DW_AT_external    : 1
    <de1>   DW_AT_declaration : 1
 <1><de2>: Abbrev Number: 10 (DW_TAG_variable)
    <de3>   DW_AT_name        : (indirect string, offset: 0x7db): Tflag_scale
    <de7>   DW_AT_decl_file   : 19
    <de8>   DW_AT_decl_line   : 515
    <dea>   DW_AT_decl_column : 12
    <deb>   DW_AT_type        : <0x64>
    <def>   DW_AT_external    : 1
    <df0>   DW_AT_declaration : 1
 <1><df1>: Abbrev Number: 10 (DW_TAG_variable)
    <df2>   DW_AT_name        : (indirect string, offset: 0x88a): Tflag_width
    <df6>   DW_AT_decl_file   : 19
    <df7>   DW_AT_decl_line   : 516
    <df9>   DW_AT_decl_column : 12
    <dfa>   DW_AT_type        : <0x64>
    <dfe>   DW_AT_external    : 1
    <dff>   DW_AT_declaration : 1
 <1><e00>: Abbrev Number: 10 (DW_TAG_variable)
    <e01>   DW_AT_name        : (indirect string, offset: 0xe68): iflag
    <e05>   DW_AT_decl_file   : 19
    <e06>   DW_AT_decl_line   : 517
    <e08>   DW_AT_decl_column : 13
    <e09>   DW_AT_type        : <0x50e>
    <e0d>   DW_AT_external    : 1
    <e0e>   DW_AT_declaration : 1
 <1><e0f>: Abbrev Number: 10 (DW_TAG_variable)
    <e10>   DW_AT_name        : (indirect string, offset: 0x637): count_wallclock
    <e14>   DW_AT_decl_file   : 19
    <e15>   DW_AT_decl_line   : 518
    <e17>   DW_AT_decl_column : 13
    <e18>   DW_AT_type        : <0x50e>
    <e1c>   DW_AT_external    : 1
    <e1d>   DW_AT_declaration : 1
 <1><e1e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x4a): path_set_item
    <e23>   DW_AT_byte_size   : 4
    <e24>   DW_AT_decl_file   : 19
    <e25>   DW_AT_decl_line   : 520
    <e27>   DW_AT_decl_column : 8
    <e28>   DW_AT_sibling     : <0xe3d>
 <2><e2c>: Abbrev Number: 22 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xc3): path
    <e31>   DW_AT_decl_file   : 19
    <e32>   DW_AT_decl_line   : 521
    <e34>   DW_AT_decl_column : 14
    <e35>   DW_AT_type        : <0x1c2>
    <e39>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3c>: Abbrev Number: 0
 <1><e3d>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x78b): path_set
    <e42>   DW_AT_byte_size   : 12
    <e43>   DW_AT_decl_file   : 19
    <e44>   DW_AT_decl_line   : 525
    <e46>   DW_AT_decl_column : 15
    <e47>   DW_AT_sibling     : <0xe7c>
 <2><e4b>: Abbrev Number: 22 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x719): paths_selected
    <e50>   DW_AT_decl_file   : 19
    <e51>   DW_AT_decl_line   : 526
    <e53>   DW_AT_decl_column : 24
    <e54>   DW_AT_type        : <0xe7c>
    <e58>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e5b>: Abbrev Number: 22 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x108c): num_selected
    <e60>   DW_AT_decl_file   : 19
    <e61>   DW_AT_decl_line   : 527
    <e63>   DW_AT_decl_column : 9
    <e64>   DW_AT_type        : <0x122>
    <e68>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e6b>: Abbrev Number: 22 (DW_TAG_member)
    <e6c>   DW_AT_name        : (indirect string, offset: 0xbaa): size
    <e70>   DW_AT_decl_file   : 19
    <e71>   DW_AT_decl_line   : 528
    <e73>   DW_AT_decl_column : 9
    <e74>   DW_AT_type        : <0x122>
    <e78>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e7b>: Abbrev Number: 0
 <1><e7c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7d>   DW_AT_byte_size   : 4
    <e7e>   DW_AT_type        : <0xe1e>
 <1><e82>: Abbrev Number: 10 (DW_TAG_variable)
    <e83>   DW_AT_name        : (indirect string, offset: 0x10db): global_path_set
    <e87>   DW_AT_decl_file   : 19
    <e88>   DW_AT_decl_line   : 529
    <e8a>   DW_AT_decl_column : 3
    <e8b>   DW_AT_type        : <0xe3d>
    <e8f>   DW_AT_external    : 1
    <e90>   DW_AT_declaration : 1
 <1><e91>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e92>   DW_AT_name        : (indirect string, offset: 0xfe1): xflag_opts
    <e96>   DW_AT_encoding    : 7	(unsigned)
    <e97>   DW_AT_byte_size   : 4
    <e98>   DW_AT_type        : <0x2b>
    <e9c>   DW_AT_decl_file   : 19
    <e9d>   DW_AT_decl_line   : 531
    <e9f>   DW_AT_decl_column : 6
    <ea0>   DW_AT_sibling     : <0xec3>
 <2><ea4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xa5c): HEXSTR_NONE
    <ea9>   DW_AT_const_value : 0
 <2><eaa>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eab>   DW_AT_name        : (indirect string, offset: 0x101e): HEXSTR_NON_ASCII
    <eaf>   DW_AT_const_value : 1
 <2><eb0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x94c): HEXSTR_ALL
    <eb5>   DW_AT_const_value : 2
 <2><eb6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x688): HEXSTR_NON_ASCII_CHARS
    <ebb>   DW_AT_const_value : 3
 <2><ebc>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x10a6): NUM_HEXSTR_OPTS
    <ec1>   DW_AT_const_value : 4
 <2><ec2>: Abbrev Number: 0
 <1><ec3>: Abbrev Number: 10 (DW_TAG_variable)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xe3d): xflag
    <ec8>   DW_AT_decl_file   : 19
    <ec9>   DW_AT_decl_line   : 544
    <ecb>   DW_AT_decl_column : 17
    <ecc>   DW_AT_type        : <0x2b>
    <ed0>   DW_AT_external    : 1
    <ed1>   DW_AT_declaration : 1
 <1><ed2>: Abbrev Number: 10 (DW_TAG_variable)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xccd): followfork
    <ed7>   DW_AT_decl_file   : 19
    <ed8>   DW_AT_decl_line   : 545
    <eda>   DW_AT_decl_column : 13
    <edb>   DW_AT_type        : <0x50e>
    <edf>   DW_AT_external    : 1
    <ee0>   DW_AT_declaration : 1
 <1><ee1>: Abbrev Number: 10 (DW_TAG_variable)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x336): output_separately
    <ee6>   DW_AT_decl_file   : 19
    <ee7>   DW_AT_decl_line   : 546
    <ee9>   DW_AT_decl_column : 13
    <eea>   DW_AT_type        : <0x50e>
    <eee>   DW_AT_external    : 1
    <eef>   DW_AT_declaration : 1
 <1><ef0>: Abbrev Number: 10 (DW_TAG_variable)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x22b): stack_trace_enabled
    <ef5>   DW_AT_decl_file   : 19
    <ef6>   DW_AT_decl_line   : 549
    <ef8>   DW_AT_decl_column : 13
    <ef9>   DW_AT_type        : <0x50e>
    <efd>   DW_AT_external    : 1
    <efe>   DW_AT_declaration : 1
 <1><eff>: Abbrev Number: 10 (DW_TAG_variable)
    <f00>   DW_AT_name        : (indirect string, offset: 0x676): ptrace_setoptions
    <f04>   DW_AT_decl_file   : 19
    <f05>   DW_AT_decl_line   : 553
    <f07>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0x2b>
    <f0c>   DW_AT_external    : 1
    <f0d>   DW_AT_declaration : 1
 <1><f0e>: Abbrev Number: 10 (DW_TAG_variable)
    <f0f>   DW_AT_name        : (indirect string, offset: 0xa51): max_strlen
    <f13>   DW_AT_decl_file   : 19
    <f14>   DW_AT_decl_line   : 554
    <f16>   DW_AT_decl_column : 17
    <f17>   DW_AT_type        : <0x2b>
    <f1b>   DW_AT_external    : 1
    <f1c>   DW_AT_declaration : 1
 <1><f1d>: Abbrev Number: 10 (DW_TAG_variable)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xa89): os_release
    <f22>   DW_AT_decl_file   : 19
    <f23>   DW_AT_decl_line   : 555
    <f25>   DW_AT_decl_column : 17
    <f26>   DW_AT_type        : <0x2b>
    <f2a>   DW_AT_external    : 1
    <f2b>   DW_AT_declaration : 1
 <1><f2c>: Abbrev Number: 10 (DW_TAG_variable)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x728): xlat_verbosity
    <f31>   DW_AT_decl_file   : 19
    <f32>   DW_AT_decl_line   : 917
    <f34>   DW_AT_decl_column : 24
    <f35>   DW_AT_type        : <0xa6a>
    <f39>   DW_AT_external    : 1
    <f3a>   DW_AT_declaration : 1
 <1><f3b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x61a): xlat_style_private_flag_bits
    <f40>   DW_AT_encoding    : 7	(unsigned)
    <f41>   DW_AT_byte_size   : 4
    <f42>   DW_AT_type        : <0x2b>
    <f46>   DW_AT_decl_file   : 19
    <f47>   DW_AT_decl_line   : 937
    <f49>   DW_AT_decl_column : 6
    <f4a>   DW_AT_sibling     : <0xf67>
 <2><f4e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x2b5): PAF_PRINT_INDICES_BIT
    <f53>   DW_AT_const_value : 5
 <2><f54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0xb49): PAF_ARRAY_TRUNCATED_BIT
    <f59>   DW_AT_const_value : 6
 <2><f5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x3f8): PXF_DEFAULT_STR_BIT
    <f5f>   DW_AT_const_value : 7
 <2><f60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0xcaf): SPFF_AUXSTR_MODE_BIT
    <f65>   DW_AT_const_value : 8
 <2><f66>: Abbrev Number: 0
 <1><f67>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f68>   DW_AT_name        : (indirect string, offset: 0xd68): find_xlat_flag_bits
    <f6c>   DW_AT_encoding    : 7	(unsigned)
    <f6d>   DW_AT_byte_size   : 4
    <f6e>   DW_AT_type        : <0x2b>
    <f72>   DW_AT_decl_file   : 19
    <f73>   DW_AT_decl_line   : 1441
    <f75>   DW_AT_decl_column : 6
    <f76>   DW_AT_sibling     : <0xf81>
 <2><f7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x989): FXL_CASE_SENSITIVE_BIT
    <f7f>   DW_AT_const_value : 0
 <2><f80>: Abbrev Number: 0
 <1><f81>: Abbrev Number: 10 (DW_TAG_variable)
    <f82>   DW_AT_name        : (indirect string, offset: 0xa2d): printing_tcp
    <f86>   DW_AT_decl_file   : 19
    <f87>   DW_AT_decl_line   : 1687
    <f89>   DW_AT_decl_column : 20
    <f8a>   DW_AT_type        : <0x61a>
    <f8e>   DW_AT_external    : 1
    <f8f>   DW_AT_declaration : 1
 <1><f90>: Abbrev Number: 10 (DW_TAG_variable)
    <f91>   DW_AT_name        : (indirect string, offset: 0x5ce): errnoent
    <f95>   DW_AT_decl_file   : 19
    <f96>   DW_AT_decl_line   : 1885
    <f98>   DW_AT_decl_column : 26
    <f99>   DW_AT_type        : <0x442>
    <f9d>   DW_AT_external    : 1
    <f9e>   DW_AT_declaration : 1
 <1><f9f>: Abbrev Number: 10 (DW_TAG_variable)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x896): signalent
    <fa4>   DW_AT_decl_file   : 19
    <fa5>   DW_AT_decl_line   : 1886
    <fa7>   DW_AT_decl_column : 26
    <fa8>   DW_AT_type        : <0x442>
    <fac>   DW_AT_external    : 1
    <fad>   DW_AT_declaration : 1
 <1><fae>: Abbrev Number: 10 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0xeb0): nerrnos
    <fb3>   DW_AT_decl_file   : 19
    <fb4>   DW_AT_decl_line   : 1887
    <fb6>   DW_AT_decl_column : 27
    <fb7>   DW_AT_type        : <0x32>
    <fbb>   DW_AT_external    : 1
    <fbc>   DW_AT_declaration : 1
 <1><fbd>: Abbrev Number: 10 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x1075): nsignals
    <fc2>   DW_AT_decl_file   : 19
    <fc3>   DW_AT_decl_line   : 1888
    <fc5>   DW_AT_decl_column : 27
    <fc6>   DW_AT_type        : <0x32>
    <fca>   DW_AT_external    : 1
    <fcb>   DW_AT_declaration : 1
 <1><fcc>: Abbrev Number: 15 (DW_TAG_array_type)
    <fcd>   DW_AT_type        : <0x889>
    <fd1>   DW_AT_sibling     : <0xfd7>
 <2><fd5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd6>: Abbrev Number: 0
 <1><fd7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd8>   DW_AT_type        : <0xfcc>
 <1><fdc>: Abbrev Number: 10 (DW_TAG_variable)
    <fdd>   DW_AT_name        : (indirect string, offset: 0xd33): sysent0
    <fe1>   DW_AT_decl_file   : 19
    <fe2>   DW_AT_decl_line   : 1890
    <fe4>   DW_AT_decl_column : 28
    <fe5>   DW_AT_type        : <0xfd7>
    <fe9>   DW_AT_external    : 1
    <fea>   DW_AT_declaration : 1
 <1><feb>: Abbrev Number: 15 (DW_TAG_array_type)
    <fec>   DW_AT_type        : <0x8f0>
    <ff0>   DW_AT_sibling     : <0xff6>
 <2><ff4>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ff5>: Abbrev Number: 0
 <1><ff6>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff7>   DW_AT_type        : <0xfeb>
 <1><ffb>: Abbrev Number: 10 (DW_TAG_variable)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x10d1): ioctlent0
    <1000>   DW_AT_decl_file   : 19
    <1001>   DW_AT_decl_line   : 1891
    <1003>   DW_AT_decl_column : 30
    <1004>   DW_AT_type        : <0xff6>
    <1008>   DW_AT_external    : 1
    <1009>   DW_AT_declaration : 1
 <1><100a>: Abbrev Number: 10 (DW_TAG_variable)
    <100b>   DW_AT_name        : (indirect string, offset: 0xfec): personality_names
    <100f>   DW_AT_decl_file   : 19
    <1010>   DW_AT_decl_line   : 1893
    <1012>   DW_AT_decl_column : 26
    <1013>   DW_AT_type        : <0x442>
    <1017>   DW_AT_external    : 1
    <1018>   DW_AT_declaration : 1
 <1><1019>: Abbrev Number: 10 (DW_TAG_variable)
    <101a>   DW_AT_name        : (indirect string, offset: 0x8b6): sysent
    <101e>   DW_AT_decl_file   : 19
    <101f>   DW_AT_decl_line   : 1896
    <1021>   DW_AT_decl_column : 29
    <1022>   DW_AT_type        : <0x9d5>
    <1026>   DW_AT_external    : 1
    <1027>   DW_AT_declaration : 1
 <1><1028>: Abbrev Number: 10 (DW_TAG_variable)
    <1029>   DW_AT_name        : (indirect string, offset: 0xcc4): ioctlent
    <102d>   DW_AT_decl_file   : 19
    <102e>   DW_AT_decl_line   : 1897
    <1030>   DW_AT_decl_column : 31
    <1031>   DW_AT_type        : <0x1037>
    <1035>   DW_AT_external    : 1
    <1036>   DW_AT_declaration : 1
 <1><1037>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1038>   DW_AT_byte_size   : 4
    <1039>   DW_AT_type        : <0x8f0>
 <1><103d>: Abbrev Number: 10 (DW_TAG_variable)
    <103e>   DW_AT_name        : (indirect string, offset: 0x8a0): nsyscalls
    <1042>   DW_AT_decl_file   : 19
    <1043>   DW_AT_decl_line   : 1903
    <1045>   DW_AT_decl_column : 17
    <1046>   DW_AT_type        : <0x2b>
    <104a>   DW_AT_external    : 1
    <104b>   DW_AT_declaration : 1
 <1><104c>: Abbrev Number: 10 (DW_TAG_variable)
    <104d>   DW_AT_name        : (indirect string, offset: 0xeca): nioctlents
    <1051>   DW_AT_decl_file   : 19
    <1052>   DW_AT_decl_line   : 1904
    <1054>   DW_AT_decl_column : 17
    <1055>   DW_AT_type        : <0x2b>
    <1059>   DW_AT_external    : 1
    <105a>   DW_AT_declaration : 1
 <1><105b>: Abbrev Number: 15 (DW_TAG_array_type)
    <105c>   DW_AT_type        : <0x32>
    <1060>   DW_AT_sibling     : <0x106b>
 <2><1064>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1065>   DW_AT_type        : <0x2b>
    <1069>   DW_AT_upper_bound : 2
 <2><106a>: Abbrev Number: 0
 <1><106b>: Abbrev Number: 3 (DW_TAG_const_type)
    <106c>   DW_AT_type        : <0x105b>
 <1><1070>: Abbrev Number: 10 (DW_TAG_variable)
    <1071>   DW_AT_name        : (indirect string, offset: 0xf49): nsyscall_vec
    <1075>   DW_AT_decl_file   : 19
    <1076>   DW_AT_decl_line   : 1906
    <1078>   DW_AT_decl_column : 27
    <1079>   DW_AT_type        : <0x106b>
    <107d>   DW_AT_external    : 1
    <107e>   DW_AT_declaration : 1
 <1><107f>: Abbrev Number: 15 (DW_TAG_array_type)
    <1080>   DW_AT_type        : <0x9db>
    <1084>   DW_AT_sibling     : <0x108f>
 <2><1088>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1089>   DW_AT_type        : <0x2b>
    <108d>   DW_AT_upper_bound : 2
 <2><108e>: Abbrev Number: 0
 <1><108f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1090>   DW_AT_type        : <0x107f>
 <1><1094>: Abbrev Number: 10 (DW_TAG_variable)
    <1095>   DW_AT_name        : (indirect string, offset: 0x7c8): sysent_vec
    <1099>   DW_AT_decl_file   : 19
    <109a>   DW_AT_decl_line   : 1907
    <109c>   DW_AT_decl_column : 35
    <109d>   DW_AT_type        : <0x108f>
    <10a1>   DW_AT_external    : 1
    <10a2>   DW_AT_declaration : 1
 <1><10a3>: Abbrev Number: 10 (DW_TAG_variable)
    <10a4>   DW_AT_name        : (indirect string, offset: 0x38f): inject_vec
    <10a8>   DW_AT_decl_file   : 19
    <10a9>   DW_AT_decl_line   : 1908
    <10ab>   DW_AT_decl_column : 28
    <10ac>   DW_AT_type        : <0x9e0>
    <10b0>   DW_AT_external    : 1
    <10b1>   DW_AT_declaration : 1
 <1><10b2>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10b3>   DW_AT_name        : (indirect string, offset: 0xdbc): audit_arch_t
    <10b7>   DW_AT_byte_size   : 8
    <10b8>   DW_AT_decl_file   : 19
    <10b9>   DW_AT_decl_line   : 1910
    <10bb>   DW_AT_decl_column : 8
    <10bc>   DW_AT_sibling     : <0x10e1>
 <2><10c0>: Abbrev Number: 22 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x60c): arch
    <10c5>   DW_AT_decl_file   : 19
    <10c6>   DW_AT_decl_line   : 1911
    <10c8>   DW_AT_decl_column : 15
    <10c9>   DW_AT_type        : <0x2b>
    <10cd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d0>: Abbrev Number: 22 (DW_TAG_member)
    <10d1>   DW_AT_name        : (indirect string, offset: 0xa13): flag
    <10d5>   DW_AT_decl_file   : 19
    <10d6>   DW_AT_decl_line   : 1912
    <10d8>   DW_AT_decl_column : 15
    <10d9>   DW_AT_type        : <0x2b>
    <10dd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e0>: Abbrev Number: 0
 <1><10e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e2>   DW_AT_type        : <0x10b2>
 <1><10e6>: Abbrev Number: 15 (DW_TAG_array_type)
    <10e7>   DW_AT_type        : <0x10e1>
    <10eb>   DW_AT_sibling     : <0x10f6>
 <2><10ef>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10f0>   DW_AT_type        : <0x2b>
    <10f4>   DW_AT_upper_bound : 2
 <2><10f5>: Abbrev Number: 0
 <1><10f6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f7>   DW_AT_type        : <0x10e6>
 <1><10fb>: Abbrev Number: 10 (DW_TAG_variable)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x97a): audit_arch_vec
    <1100>   DW_AT_decl_file   : 19
    <1101>   DW_AT_decl_line   : 1915
    <1103>   DW_AT_decl_column : 34
    <1104>   DW_AT_type        : <0x10f6>
    <1108>   DW_AT_external    : 1
    <1109>   DW_AT_declaration : 1
 <1><110a>: Abbrev Number: 31 (DW_TAG_structure_type)
    <110b>   DW_AT_byte_size   : 180
    <110c>   DW_AT_decl_file   : 21
    <110d>   DW_AT_decl_line   : 2
    <110e>   DW_AT_decl_column : 9
    <110f>   DW_AT_sibling     : <0x13c4>
 <2><1113>: Abbrev Number: 9 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0x1cd): block_ioctl
    <1118>   DW_AT_decl_file   : 21
    <1119>   DW_AT_decl_line   : 3
    <111a>   DW_AT_decl_column : 8
    <111b>   DW_AT_type        : <0x13de>
    <111f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1122>: Abbrev Number: 9 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0xae8): btrfs_ioctl
    <1127>   DW_AT_decl_file   : 21
    <1128>   DW_AT_decl_line   : 6
    <1129>   DW_AT_decl_column : 8
    <112a>   DW_AT_type        : <0x13de>
    <112e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1131>: Abbrev Number: 9 (DW_TAG_member)
    <1132>   DW_AT_name        : (indirect string, offset: 0x761): evdev_write_ioctl_mpers
    <1136>   DW_AT_decl_file   : 21
    <1137>   DW_AT_decl_line   : 9
    <1138>   DW_AT_decl_column : 8
    <1139>   DW_AT_type        : <0x13de>
    <113d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1140>: Abbrev Number: 9 (DW_TAG_member)
    <1141>   DW_AT_name        : (indirect string, offset: 0x737): get_sock_fprog_size
    <1145>   DW_AT_decl_file   : 21
    <1146>   DW_AT_decl_line   : 12
    <1147>   DW_AT_decl_column : 17
    <1148>   DW_AT_type        : <0x13ea>
    <114c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><114f>: Abbrev Number: 9 (DW_TAG_member)
    <1150>   DW_AT_name        : (indirect string, offset: 0x19c): fetch_bpf_fprog
