Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x17c8 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4f0): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x10a1): mpers-mx32/shmid_ds_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xef4): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c5): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x105a): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9cc): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x368): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x27e): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe48): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x494): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ae): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf45): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8de): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7a0): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbaf): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbe5): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd3b): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xca6): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x411): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x45d): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x374): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xbd0): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xfed): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xe58): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2e4): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb58): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x114f): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe83): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xb1a): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x29b): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0x3bd): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0x1044): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x773): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xc95): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xb95): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x37c): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xa58): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x4e3): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0xf9a): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x7e1): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x12f): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x1093): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x929): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x9a5): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0xddd): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x1ca): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0xcf8): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xb7): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x616): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x21c): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x1013): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x7cd): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x85a): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x24a): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xea9): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xd08): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x170): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x70b): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xaa2): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x1028): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x3e1): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xc6b): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0xa11): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0xa7c): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x7fb): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0xb3a): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x489): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x326): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x390): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5c8): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0x106d): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0xe41): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x256): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x5dc): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x288): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xeb8): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x6e4): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0xc10): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x1b7): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xf2c): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x385): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xa03): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x10f5): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x4ce): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0xfc1): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0xa1d): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x423): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0xaf0): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x5b7): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x26e): __kernel_mode_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 24
    <539>   DW_AT_decl_column : 22
    <53a>   DW_AT_type        : <0x2b>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x25f): __kernel_pid_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 28
    <545>   DW_AT_decl_column : 14
    <546>   DW_AT_type        : <0x64>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x6b2): __kernel_uid32_t
    <54f>   DW_AT_decl_file   : 15
    <550>   DW_AT_decl_line   : 49
    <551>   DW_AT_decl_column : 22
    <552>   DW_AT_type        : <0x2b>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x65b): __kernel_gid32_t
    <55b>   DW_AT_decl_file   : 15
    <55c>   DW_AT_decl_line   : 50
    <55d>   DW_AT_decl_column : 22
    <55e>   DW_AT_type        : <0x2b>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0x9b2): __kernel_time_t
    <567>   DW_AT_decl_file   : 15
    <568>   DW_AT_decl_line   : 89
    <569>   DW_AT_decl_column : 25
    <56a>   DW_AT_type        : <0x51a>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x3ef): kernel_long_t
    <573>   DW_AT_decl_file   : 16
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 25
    <576>   DW_AT_type        : <0x51a>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x8cf): kernel_ulong_t
    <57f>   DW_AT_decl_file   : 16
    <580>   DW_AT_decl_line   : 17
    <581>   DW_AT_decl_column : 26
    <582>   DW_AT_type        : <0x526>
 <1><586>: Abbrev Number: 3 (DW_TAG_const_type)
    <587>   DW_AT_type        : <0x57a>
 <1><58b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <58c>   DW_AT_name        : (indirect string, offset: 0xc2e): list_item
    <590>   DW_AT_byte_size   : 8
    <591>   DW_AT_decl_file   : 17
    <592>   DW_AT_decl_line   : 92
    <593>   DW_AT_decl_column : 8
    <594>   DW_AT_sibling     : <0x5b7>
 <2><598>: Abbrev Number: 9 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x114a): prev
    <59d>   DW_AT_decl_file   : 17
    <59e>   DW_AT_decl_line   : 93
    <59f>   DW_AT_decl_column : 20
    <5a0>   DW_AT_type        : <0x5b7>
    <5a4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x1139): next
    <5ac>   DW_AT_decl_file   : 17
    <5ad>   DW_AT_decl_line   : 94
    <5ae>   DW_AT_decl_column : 20
    <5af>   DW_AT_type        : <0x5b7>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b6>: Abbrev Number: 0
 <1><5b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5b8>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x58b>
 <1><5bd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x8a7): sysent
    <5c2>   DW_AT_byte_size   : 20
    <5c3>   DW_AT_decl_file   : 18
    <5c4>   DW_AT_decl_line   : 13
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_sibling     : <0x616>
 <2><5ca>: Abbrev Number: 9 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x1084): nargs
    <5cf>   DW_AT_decl_file   : 18
    <5d0>   DW_AT_decl_line   : 14
    <5d1>   DW_AT_decl_column : 11
    <5d2>   DW_AT_type        : <0x2b>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d9>: Abbrev Number: 9 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x9c2): sys_flags
    <5de>   DW_AT_decl_file   : 18
    <5df>   DW_AT_decl_line   : 15
    <5e0>   DW_AT_decl_column : 6
    <5e1>   DW_AT_type        : <0x64>
    <5e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e8>: Abbrev Number: 18 (DW_TAG_member)
    <5e9>   DW_AT_name        : sen
    <5ed>   DW_AT_decl_file   : 18
    <5ee>   DW_AT_decl_line   : 16
    <5ef>   DW_AT_decl_column : 6
    <5f0>   DW_AT_type        : <0x64>
    <5f4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f7>: Abbrev Number: 9 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x31d): sys_func
    <5fc>   DW_AT_decl_file   : 18
    <5fd>   DW_AT_decl_line   : 17
    <5fe>   DW_AT_decl_column : 8
    <5ff>   DW_AT_type        : <0x883>
    <603>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><606>: Abbrev Number: 9 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x292): sys_name
    <60b>   DW_AT_decl_file   : 18
    <60c>   DW_AT_decl_line   : 18
    <60d>   DW_AT_decl_column : 14
    <60e>   DW_AT_type        : <0x1c2>
    <612>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><615>: Abbrev Number: 0
 <1><616>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <617>   DW_AT_prototyped  : 1
    <618>   DW_AT_type        : <0x64>
    <61c>   DW_AT_sibling     : <0x626>
 <2><620>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <621>   DW_AT_type        : <0x626>
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x631>
 <1><62c>: Abbrev Number: 3 (DW_TAG_const_type)
    <62d>   DW_AT_type        : <0x626>
 <1><631>: Abbrev Number: 21 (DW_TAG_structure_type)
    <632>   DW_AT_name        : tcb
    <636>   DW_AT_byte_size   : 288
    <638>   DW_AT_decl_file   : 19
    <639>   DW_AT_decl_line   : 262
    <63b>   DW_AT_decl_column : 8
    <63c>   DW_AT_sibling     : <0x883>
 <2><640>: Abbrev Number: 22 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x4dd): flags
    <645>   DW_AT_decl_file   : 19
    <646>   DW_AT_decl_line   : 263
    <648>   DW_AT_decl_column : 6
    <649>   DW_AT_type        : <0x64>
    <64d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><650>: Abbrev Number: 23 (DW_TAG_member)
    <651>   DW_AT_name        : pid
    <655>   DW_AT_decl_file   : 19
    <656>   DW_AT_decl_line   : 264
    <658>   DW_AT_decl_column : 6
    <659>   DW_AT_type        : <0x64>
    <65d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><660>: Abbrev Number: 22 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <665>   DW_AT_decl_file   : 19
    <666>   DW_AT_decl_line   : 265
    <668>   DW_AT_decl_column : 6
    <669>   DW_AT_type        : <0x64>
    <66d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><670>: Abbrev Number: 22 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x3a9): currpers
    <675>   DW_AT_decl_file   : 19
    <676>   DW_AT_decl_line   : 267
    <678>   DW_AT_decl_column : 15
    <679>   DW_AT_type        : <0x2b>
    <67d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><680>: Abbrev Number: 22 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0xb8d): u_error
    <685>   DW_AT_decl_file   : 19
    <686>   DW_AT_decl_line   : 269
    <688>   DW_AT_decl_column : 16
    <689>   DW_AT_type        : <0x37>
    <68d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><690>: Abbrev Number: 22 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x18d): scno
    <695>   DW_AT_decl_file   : 19
    <696>   DW_AT_decl_line   : 270
    <698>   DW_AT_decl_column : 17
    <699>   DW_AT_type        : <0x57a>
    <69d>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6a0>: Abbrev Number: 22 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0xbc6): true_scno
    <6a5>   DW_AT_decl_file   : 19
    <6a6>   DW_AT_decl_line   : 271
    <6a8>   DW_AT_decl_column : 17
    <6a9>   DW_AT_type        : <0x57a>
    <6ad>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6b0>: Abbrev Number: 22 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x197): u_arg
    <6b5>   DW_AT_decl_file   : 19
    <6b6>   DW_AT_decl_line   : 272
    <6b8>   DW_AT_decl_column : 17
    <6b9>   DW_AT_type        : <0x9b3>
    <6bd>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6c0>: Abbrev Number: 22 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x9d9): u_rval
    <6c5>   DW_AT_decl_file   : 19
    <6c6>   DW_AT_decl_line   : 273
    <6c8>   DW_AT_decl_column : 16
    <6c9>   DW_AT_type        : <0x56e>
    <6cd>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xb0c): sys_func_rval
    <6d5>   DW_AT_decl_file   : 19
    <6d6>   DW_AT_decl_line   : 274
    <6d8>   DW_AT_decl_column : 6
    <6d9>   DW_AT_type        : <0x64>
    <6dd>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6e0>: Abbrev Number: 22 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xd22): curcol
    <6e5>   DW_AT_decl_file   : 19
    <6e6>   DW_AT_decl_line   : 275
    <6e8>   DW_AT_decl_column : 6
    <6e9>   DW_AT_type        : <0x64>
    <6ed>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6f0>: Abbrev Number: 22 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x9eb): outf
    <6f5>   DW_AT_decl_file   : 19
    <6f6>   DW_AT_decl_line   : 276
    <6f8>   DW_AT_decl_column : 8
    <6f9>   DW_AT_type        : <0x407>
    <6fd>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><700>: Abbrev Number: 22 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0xf6b): staged_output_data
    <705>   DW_AT_decl_file   : 19
    <706>   DW_AT_decl_line   : 277
    <708>   DW_AT_decl_column : 29
    <709>   DW_AT_type        : <0x9c9>
    <70d>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><710>: Abbrev Number: 22 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xad7): auxstr
    <715>   DW_AT_decl_file   : 19
    <716>   DW_AT_decl_line   : 279
    <718>   DW_AT_decl_column : 14
    <719>   DW_AT_type        : <0x1c2>
    <71d>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><720>: Abbrev Number: 22 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x176): _priv_data
    <725>   DW_AT_decl_file   : 19
    <726>   DW_AT_decl_line   : 280
    <728>   DW_AT_decl_column : 8
    <729>   DW_AT_type        : <0xc6>
    <72d>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><730>: Abbrev Number: 22 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0xc5b): _free_priv_data
    <735>   DW_AT_decl_file   : 19
    <736>   DW_AT_decl_line   : 281
    <738>   DW_AT_decl_column : 9
    <739>   DW_AT_type        : <0x9db>
    <73d>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><740>: Abbrev Number: 22 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x187): s_ent
    <745>   DW_AT_decl_file   : 19
    <746>   DW_AT_decl_line   : 282
    <748>   DW_AT_decl_column : 23
    <749>   DW_AT_type        : <0x9e1>
    <74d>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><750>: Abbrev Number: 22 (DW_TAG_member)
    <751>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <755>   DW_AT_decl_file   : 19
    <756>   DW_AT_decl_line   : 285
    <758>   DW_AT_decl_column : 23
    <759>   DW_AT_type        : <0x9e1>
    <75d>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><761>: Abbrev Number: 22 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x39e): inject_vec
    <766>   DW_AT_decl_file   : 19
    <767>   DW_AT_decl_line   : 286
    <769>   DW_AT_decl_column : 22
    <76a>   DW_AT_type        : <0x9ec>
    <76e>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0x804): stime
    <777>   DW_AT_decl_file   : 19
    <778>   DW_AT_decl_line   : 287
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x133>
    <77f>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><783>: Abbrev Number: 22 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x3b2): ltime
    <788>   DW_AT_decl_file   : 19
    <789>   DW_AT_decl_line   : 288
    <78b>   DW_AT_decl_column : 18
    <78c>   DW_AT_type        : <0x133>
    <790>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><794>: Abbrev Number: 22 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0x104b): atime
    <799>   DW_AT_decl_file   : 19
    <79a>   DW_AT_decl_line   : 289
    <79c>   DW_AT_decl_column : 18
    <79d>   DW_AT_type        : <0x133>
    <7a1>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><7a5>: Abbrev Number: 22 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x4d7): etime
    <7aa>   DW_AT_decl_file   : 19
    <7ab>   DW_AT_decl_line   : 290
    <7ad>   DW_AT_decl_column : 18
    <7ae>   DW_AT_type        : <0x133>
    <7b2>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7b6>: Abbrev Number: 22 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xd9a): delay_expiration_time
    <7bb>   DW_AT_decl_file   : 19
    <7bc>   DW_AT_decl_line   : 291
    <7be>   DW_AT_decl_column : 18
    <7bf>   DW_AT_type        : <0x133>
    <7c3>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7c7>: Abbrev Number: 22 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7cc>   DW_AT_decl_file   : 19
    <7cd>   DW_AT_decl_line   : 298
    <7cf>   DW_AT_decl_column : 15
    <7d0>   DW_AT_type        : <0x2b>
    <7d4>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7d8>: Abbrev Number: 22 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0xfa7): last_dirfd
    <7dd>   DW_AT_decl_file   : 19
    <7de>   DW_AT_decl_line   : 301
    <7e0>   DW_AT_decl_column : 6
    <7e1>   DW_AT_type        : <0x64>
    <7e5>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7e9>: Abbrev Number: 22 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0xfcd): mmap_cache
    <7ee>   DW_AT_decl_file   : 19
    <7ef>   DW_AT_decl_line   : 304
    <7f1>   DW_AT_decl_column : 23
    <7f2>   DW_AT_type        : <0xa08>
    <7f6>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7fa>: Abbrev Number: 22 (DW_TAG_member)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xb9c): wait_data_idx
    <7ff>   DW_AT_decl_file   : 19
    <800>   DW_AT_decl_line   : 311
    <802>   DW_AT_decl_column : 9
    <803>   DW_AT_type        : <0x122>
    <807>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><80b>: Abbrev Number: 22 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0xade): delayed_wait_data
    <810>   DW_AT_decl_file   : 19
    <811>   DW_AT_decl_line   : 313
    <813>   DW_AT_decl_column : 24
    <814>   DW_AT_type        : <0xa14>
    <818>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><81c>: Abbrev Number: 22 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xb4e): wait_list
    <821>   DW_AT_decl_file   : 19
    <822>   DW_AT_decl_line   : 314
    <824>   DW_AT_decl_column : 19
    <825>   DW_AT_type        : <0x58b>
    <829>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><82d>: Abbrev Number: 22 (DW_TAG_member)
    <82e>   DW_AT_name        : (indirect string, offset: 0x6fc): vcpu_info_list
    <832>   DW_AT_decl_file   : 19
    <833>   DW_AT_decl_line   : 318
    <835>   DW_AT_decl_column : 20
    <836>   DW_AT_type        : <0xa20>
    <83a>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><83e>: Abbrev Number: 22 (DW_TAG_member)
    <83f>   DW_AT_name        : (indirect string, offset: 0xced): unwind_ctx
    <843>   DW_AT_decl_file   : 19
    <844>   DW_AT_decl_line   : 322
    <846>   DW_AT_decl_column : 8
    <847>   DW_AT_type        : <0xc6>
    <84b>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><84f>: Abbrev Number: 22 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0x4c1): unwind_queue
    <854>   DW_AT_decl_file   : 19
    <855>   DW_AT_decl_line   : 323
    <857>   DW_AT_decl_column : 25
    <858>   DW_AT_type        : <0xa2c>
    <85c>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><860>: Abbrev Number: 22 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0x16b): comm
    <865>   DW_AT_decl_file   : 19
    <866>   DW_AT_decl_line   : 327
    <868>   DW_AT_decl_column : 7
    <869>   DW_AT_type        : <0xa32>
    <86d>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><871>: Abbrev Number: 22 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x22c): start_prc
    <876>   DW_AT_decl_file   : 19
    <877>   DW_AT_decl_line   : 329
    <879>   DW_AT_decl_column : 16
    <87a>   DW_AT_type        : <0x37>
    <87e>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><882>: Abbrev Number: 0
 <1><883>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <884>   DW_AT_byte_size   : 4
    <885>   DW_AT_type        : <0x616>
 <1><889>: Abbrev Number: 4 (DW_TAG_typedef)
    <88a>   DW_AT_name        : (indirect string, offset: 0x5a9): struct_sysent
    <88e>   DW_AT_decl_file   : 18
    <88f>   DW_AT_decl_line   : 19
    <890>   DW_AT_decl_column : 3
    <891>   DW_AT_type        : <0x5bd>
 <1><895>: Abbrev Number: 3 (DW_TAG_const_type)
    <896>   DW_AT_type        : <0x889>
 <1><89a>: Abbrev Number: 11 (DW_TAG_variable)
    <89b>   DW_AT_name        : (indirect string, offset: 0xd86): current_personality
    <89f>   DW_AT_decl_file   : 19
    <8a0>   DW_AT_decl_line   : 158
    <8a1>   DW_AT_decl_column : 17
    <8a2>   DW_AT_type        : <0x2b>
    <8a6>   DW_AT_external    : 1
    <8a7>   DW_AT_declaration : 1
 <1><8a8>: Abbrev Number: 11 (DW_TAG_variable)
    <8a9>   DW_AT_name        : (indirect string, offset: 0x849): current_wordsize
    <8ad>   DW_AT_decl_file   : 19
    <8ae>   DW_AT_decl_line   : 171
    <8af>   DW_AT_decl_column : 17
    <8b0>   DW_AT_type        : <0x2b>
    <8b4>   DW_AT_external    : 1
    <8b5>   DW_AT_declaration : 1
 <1><8b6>: Abbrev Number: 11 (DW_TAG_variable)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xaab): current_klongsize
    <8bb>   DW_AT_decl_file   : 19
    <8bc>   DW_AT_decl_line   : 176
    <8bd>   DW_AT_decl_column : 17
    <8be>   DW_AT_type        : <0x2b>
    <8c2>   DW_AT_external    : 1
    <8c3>   DW_AT_declaration : 1
 <1><8c4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8c5>   DW_AT_name        : (indirect string, offset: 0xcc4): ioctlent
    <8c9>   DW_AT_byte_size   : 8
    <8ca>   DW_AT_decl_file   : 19
    <8cb>   DW_AT_decl_line   : 217
    <8cc>   DW_AT_decl_column : 16
    <8cd>   DW_AT_sibling     : <0x8f0>
 <2><8d1>: Abbrev Number: 9 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0xf93): symbol
    <8d6>   DW_AT_decl_file   : 19
    <8d7>   DW_AT_decl_line   : 218
    <8d8>   DW_AT_decl_column : 14
    <8d9>   DW_AT_type        : <0x1c2>
    <8dd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e0>: Abbrev Number: 9 (DW_TAG_member)
    <8e1>   DW_AT_name        : (indirect string, offset: 0xd45): code
    <8e5>   DW_AT_decl_file   : 19
    <8e6>   DW_AT_decl_line   : 219
    <8e7>   DW_AT_decl_column : 15
    <8e8>   DW_AT_type        : <0x2b>
    <8ec>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8ef>: Abbrev Number: 0
 <1><8f0>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f1>   DW_AT_name        : (indirect string, offset: 0xc85): struct_ioctlent
    <8f5>   DW_AT_decl_file   : 19
    <8f6>   DW_AT_decl_line   : 220
    <8f7>   DW_AT_decl_column : 3
    <8f8>   DW_AT_type        : <0x8c4>
 <1><8fc>: Abbrev Number: 3 (DW_TAG_const_type)
    <8fd>   DW_AT_type        : <0x8f0>
 <1><901>: Abbrev Number: 8 (DW_TAG_structure_type)
    <902>   DW_AT_name        : (indirect string, offset: 0x83d): inject_data
    <906>   DW_AT_byte_size   : 10
    <907>   DW_AT_decl_file   : 19
    <908>   DW_AT_decl_line   : 241
    <909>   DW_AT_decl_column : 8
    <90a>   DW_AT_sibling     : <0x969>
 <2><90e>: Abbrev Number: 9 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x4dd): flags
    <913>   DW_AT_decl_file   : 19
    <914>   DW_AT_decl_line   : 242
    <915>   DW_AT_decl_column : 10
    <916>   DW_AT_type        : <0xeb>
    <91a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><91d>: Abbrev Number: 9 (DW_TAG_member)
    <91e>   DW_AT_name        : (indirect string, offset: 0x966): signo
    <922>   DW_AT_decl_file   : 19
    <923>   DW_AT_decl_line   : 243
    <924>   DW_AT_decl_column : 10
    <925>   DW_AT_type        : <0xeb>
    <929>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><92c>: Abbrev Number: 9 (DW_TAG_member)
    <92d>   DW_AT_name        : (indirect string, offset: 0xfd): rval_idx
    <931>   DW_AT_decl_file   : 19
    <932>   DW_AT_decl_line   : 244
    <933>   DW_AT_decl_column : 11
    <934>   DW_AT_type        : <0xf7>
    <938>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><93b>: Abbrev Number: 9 (DW_TAG_member)
    <93c>   DW_AT_name        : (indirect string, offset: 0xd18): delay_idx
    <940>   DW_AT_decl_file   : 19
    <941>   DW_AT_decl_line   : 245
    <942>   DW_AT_decl_column : 11
    <943>   DW_AT_type        : <0xf7>
    <947>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><94a>: Abbrev Number: 9 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0x608): poke_idx
    <94f>   DW_AT_decl_file   : 19
    <950>   DW_AT_decl_line   : 246
    <951>   DW_AT_decl_column : 11
    <952>   DW_AT_type        : <0xf7>
    <956>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><959>: Abbrev Number: 9 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0x18d): scno
    <95e>   DW_AT_decl_file   : 19
    <95f>   DW_AT_decl_line   : 247
    <960>   DW_AT_decl_column : 11
    <961>   DW_AT_type        : <0xf7>
    <965>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><968>: Abbrev Number: 0
 <1><969>: Abbrev Number: 8 (DW_TAG_structure_type)
    <96a>   DW_AT_name        : (indirect string, offset: 0xde): inject_opts
    <96e>   DW_AT_byte_size   : 16
    <96f>   DW_AT_decl_file   : 19
    <970>   DW_AT_decl_line   : 250
    <971>   DW_AT_decl_column : 8
    <972>   DW_AT_sibling     : <0x9b3>
 <2><976>: Abbrev Number: 9 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0xa76): first
    <97b>   DW_AT_decl_file   : 19
    <97c>   DW_AT_decl_line   : 251
    <97d>   DW_AT_decl_column : 11
    <97e>   DW_AT_type        : <0xf7>
    <982>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><985>: Abbrev Number: 9 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x1173): last
    <98a>   DW_AT_decl_file   : 19
    <98b>   DW_AT_decl_line   : 252
    <98c>   DW_AT_decl_column : 11
    <98d>   DW_AT_type        : <0xf7>
    <991>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><994>: Abbrev Number: 9 (DW_TAG_member)
    <995>   DW_AT_name        : (indirect string, offset: 0x3b8): step
    <999>   DW_AT_decl_file   : 19
    <99a>   DW_AT_decl_line   : 253
    <99b>   DW_AT_decl_column : 11
    <99c>   DW_AT_type        : <0xf7>
    <9a0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9a3>: Abbrev Number: 9 (DW_TAG_member)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x113e): data
    <9a8>   DW_AT_decl_file   : 19
    <9a9>   DW_AT_decl_line   : 254
    <9aa>   DW_AT_decl_column : 21
    <9ab>   DW_AT_type        : <0x901>
    <9af>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9b2>: Abbrev Number: 0
 <1><9b3>: Abbrev Number: 15 (DW_TAG_array_type)
    <9b4>   DW_AT_type        : <0x57a>
    <9b8>   DW_AT_sibling     : <0x9c3>
 <2><9bc>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9bd>   DW_AT_type        : <0x2b>
    <9c1>   DW_AT_upper_bound : 5
 <2><9c2>: Abbrev Number: 0
 <1><9c3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9c4>   DW_AT_name        : (indirect string, offset: 0xf6b): staged_output_data
    <9c8>   DW_AT_declaration : 1
 <1><9c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ca>   DW_AT_byte_size   : 4
    <9cb>   DW_AT_type        : <0x9c3>
 <1><9cf>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9d0>   DW_AT_prototyped  : 1
    <9d1>   DW_AT_sibling     : <0x9db>
 <2><9d5>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9d6>   DW_AT_type        : <0xc6>
 <2><9da>: Abbrev Number: 0
 <1><9db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9dc>   DW_AT_byte_size   : 4
    <9dd>   DW_AT_type        : <0x9cf>
 <1><9e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e2>   DW_AT_byte_size   : 4
    <9e3>   DW_AT_type        : <0x895>
 <1><9e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <9e8>   DW_AT_type        : <0x9e1>
 <1><9ec>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ed>   DW_AT_type        : <0x9fc>
    <9f1>   DW_AT_sibling     : <0x9fc>
 <2><9f5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9f6>   DW_AT_type        : <0x2b>
    <9fa>   DW_AT_upper_bound : 2
 <2><9fb>: Abbrev Number: 0
 <1><9fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x969>
 <1><a02>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a03>   DW_AT_name        : (indirect string, offset: 0xaa): mmap_cache_t
    <a07>   DW_AT_declaration : 1
 <1><a08>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a09>   DW_AT_byte_size   : 4
    <a0a>   DW_AT_type        : <0xa02>
 <1><a0e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x3d3): tcb_wait_data
    <a13>   DW_AT_declaration : 1
 <1><a14>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a15>   DW_AT_byte_size   : 4
    <a16>   DW_AT_type        : <0xa0e>
 <1><a1a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x161): vcpu_info
    <a1f>   DW_AT_declaration : 1
 <1><a20>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a21>   DW_AT_byte_size   : 4
    <a22>   DW_AT_type        : <0xa1a>
 <1><a26>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a27>   DW_AT_name        : (indirect string, offset: 0xf4f): unwind_queue_t
    <a2b>   DW_AT_declaration : 1
 <1><a2c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a2d>   DW_AT_byte_size   : 4
    <a2e>   DW_AT_type        : <0xa26>
 <1><a32>: Abbrev Number: 15 (DW_TAG_array_type)
    <a33>   DW_AT_type        : <0xdf>
    <a37>   DW_AT_sibling     : <0xa42>
 <2><a3b>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a3c>   DW_AT_type        : <0x2b>
    <a40>   DW_AT_upper_bound : 15
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 10 (DW_TAG_variable)
    <a43>   DW_AT_name        : (indirect string, offset: 0xbd9): stub_sysent
    <a47>   DW_AT_decl_file   : 19
    <a48>   DW_AT_decl_line   : 403
    <a4a>   DW_AT_decl_column : 28
    <a4b>   DW_AT_type        : <0x895>
    <a4f>   DW_AT_external    : 1
    <a50>   DW_AT_declaration : 1
 <1><a51>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a52>   DW_AT_name        : (indirect string, offset: 0x1121): xlat_type
    <a56>   DW_AT_encoding    : 7	(unsigned)
    <a57>   DW_AT_byte_size   : 4
    <a58>   DW_AT_type        : <0x2b>
    <a5c>   DW_AT_decl_file   : 20
    <a5d>   DW_AT_decl_line   : 13
    <a5e>   DW_AT_decl_column : 6
    <a5f>   DW_AT_sibling     : <0xa76>
 <2><a63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0x2ed): XT_NORMAL
    <a68>   DW_AT_const_value : 0
 <2><a69>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0xc9c): XT_SORTED
    <a6e>   DW_AT_const_value : 1
 <2><a6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0xe1d): XT_INDEXED
    <a74>   DW_AT_const_value : 2
 <2><a75>: Abbrev Number: 0
 <1><a76>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a77>   DW_AT_name        : (indirect string, offset: 0xc05): xlat_style
    <a7b>   DW_AT_encoding    : 7	(unsigned)
    <a7c>   DW_AT_byte_size   : 4
    <a7d>   DW_AT_type        : <0x2b>
    <a81>   DW_AT_decl_file   : 20
    <a82>   DW_AT_decl_line   : 19
    <a83>   DW_AT_decl_column : 6
    <a84>   DW_AT_sibling     : <0xab3>
 <2><a88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0xea): XLAT_STYLE_DEFAULT
    <a8d>   DW_AT_const_value : 0
 <2><a8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0xc38): XLAT_STYLE_RAW
    <a93>   DW_AT_const_value : 1
 <2><a94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x10e3): XLAT_STYLE_ABBREV
    <a99>   DW_AT_const_value : 2
 <2><a9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x30a): XLAT_STYLE_VERBOSE
    <a9f>   DW_AT_const_value : 3
 <2><aa0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <aa5>   DW_AT_const_value : 0
 <2><aa6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <aab>   DW_AT_const_value : 4
 <2><aac>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aad>   DW_AT_name        : (indirect string, offset: 0x1162): XLAT_STYLE_FMT_D
    <ab1>   DW_AT_const_value : 8
 <2><ab2>: Abbrev Number: 0
 <1><ab3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x33b): xlat_data
    <ab8>   DW_AT_byte_size   : 16
    <ab9>   DW_AT_decl_file   : 20
    <aba>   DW_AT_decl_line   : 51
    <abb>   DW_AT_decl_column : 8
    <abc>   DW_AT_sibling     : <0xadf>
 <2><ac0>: Abbrev Number: 18 (DW_TAG_member)
    <ac1>   DW_AT_name        : val
    <ac5>   DW_AT_decl_file   : 20
    <ac6>   DW_AT_decl_line   : 52
    <ac7>   DW_AT_decl_column : 11
    <ac8>   DW_AT_type        : <0x10f>
    <acc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><acf>: Abbrev Number: 18 (DW_TAG_member)
    <ad0>   DW_AT_name        : str
    <ad4>   DW_AT_decl_file   : 20
    <ad5>   DW_AT_decl_line   : 53
    <ad6>   DW_AT_decl_column : 14
    <ad7>   DW_AT_type        : <0x1c2>
    <adb>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ade>: Abbrev Number: 0
 <1><adf>: Abbrev Number: 3 (DW_TAG_const_type)
    <ae0>   DW_AT_type        : <0xab3>
 <1><ae4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ae9>   DW_AT_byte_size   : 24
    <aea>   DW_AT_decl_file   : 20
    <aeb>   DW_AT_decl_line   : 56
    <aec>   DW_AT_decl_column : 8
    <aed>   DW_AT_sibling     : <0xb3d>
 <2><af1>: Abbrev Number: 9 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0x113e): data
    <af6>   DW_AT_decl_file   : 20
    <af7>   DW_AT_decl_line   : 57
    <af8>   DW_AT_decl_column : 26
    <af9>   DW_AT_type        : <0xb42>
    <afd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b00>: Abbrev Number: 9 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0x89b): flags_strsz
    <b05>   DW_AT_decl_file   : 20
    <b06>   DW_AT_decl_line   : 58
    <b07>   DW_AT_decl_column : 9
    <b08>   DW_AT_type        : <0x122>
    <b0c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b0f>: Abbrev Number: 9 (DW_TAG_member)
    <b10>   DW_AT_name        : (indirect string, offset: 0xbaa): size
    <b14>   DW_AT_decl_file   : 20
    <b15>   DW_AT_decl_line   : 59
    <b16>   DW_AT_decl_column : 11
    <b17>   DW_AT_type        : <0x103>
    <b1b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b1e>: Abbrev Number: 9 (DW_TAG_member)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x192): type
    <b23>   DW_AT_decl_file   : 20
    <b24>   DW_AT_decl_line   : 60
    <b25>   DW_AT_decl_column : 17
    <b26>   DW_AT_type        : <0xa51>
    <b2a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b2d>: Abbrev Number: 9 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x750): flags_mask
    <b32>   DW_AT_decl_file   : 20
    <b33>   DW_AT_decl_line   : 61
    <b34>   DW_AT_decl_column : 11
    <b35>   DW_AT_type        : <0x10f>
    <b39>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b3c>: Abbrev Number: 0
 <1><b3d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b3e>   DW_AT_type        : <0xae4>
 <1><b42>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b43>   DW_AT_byte_size   : 4
    <b44>   DW_AT_type        : <0xadf>
 <1><b48>: Abbrev Number: 15 (DW_TAG_array_type)
    <b49>   DW_AT_type        : <0xb3d>
    <b4d>   DW_AT_sibling     : <0xb53>
 <2><b51>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b52>: Abbrev Number: 0
 <1><b53>: Abbrev Number: 3 (DW_TAG_const_type)
    <b54>   DW_AT_type        : <0xb48>
 <1><b58>: Abbrev Number: 10 (DW_TAG_variable)
    <b59>   DW_AT_name        : (indirect string, offset: 0xe96): addrfams
    <b5d>   DW_AT_decl_file   : 19
    <b5e>   DW_AT_decl_line   : 409
    <b60>   DW_AT_decl_column : 26
    <b61>   DW_AT_type        : <0xb53>
    <b65>   DW_AT_external    : 1
    <b66>   DW_AT_declaration : 1
 <1><b67>: Abbrev Number: 10 (DW_TAG_variable)
    <b68>   DW_AT_name        : (indirect string, offset: 0xd55): arp_hardware_types
    <b6c>   DW_AT_decl_file   : 19
    <b6d>   DW_AT_decl_line   : 410
    <b6f>   DW_AT_decl_column : 26
    <b70>   DW_AT_type        : <0xb53>
    <b74>   DW_AT_external    : 1
    <b75>   DW_AT_declaration : 1
 <1><b76>: Abbrev Number: 10 (DW_TAG_variable)
    <b77>   DW_AT_name        : (indirect string, offset: 0x1051): at_flags
    <b7b>   DW_AT_decl_file   : 19
    <b7c>   DW_AT_decl_line   : 411
    <b7e>   DW_AT_decl_column : 26
    <b7f>   DW_AT_type        : <0xb53>
    <b83>   DW_AT_external    : 1
    <b84>   DW_AT_declaration : 1
 <1><b85>: Abbrev Number: 10 (DW_TAG_variable)
    <b86>   DW_AT_name        : (indirect string, offset: 0x49f): clocknames
    <b8a>   DW_AT_decl_file   : 19
    <b8b>   DW_AT_decl_line   : 412
    <b8d>   DW_AT_decl_column : 26
    <b8e>   DW_AT_type        : <0xb53>
    <b92>   DW_AT_external    : 1
    <b93>   DW_AT_declaration : 1
 <1><b94>: Abbrev Number: 10 (DW_TAG_variable)
    <b95>   DW_AT_name        : (indirect string, offset: 0x101b): dirent_types
    <b99>   DW_AT_decl_file   : 19
    <b9a>   DW_AT_decl_line   : 413
    <b9c>   DW_AT_decl_column : 26
    <b9d>   DW_AT_type        : <0xb53>
    <ba1>   DW_AT_external    : 1
    <ba2>   DW_AT_declaration : 1
 <1><ba3>: Abbrev Number: 10 (DW_TAG_variable)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x8ec): ethernet_protocols
    <ba8>   DW_AT_decl_file   : 19
    <ba9>   DW_AT_decl_line   : 414
    <bab>   DW_AT_decl_column : 26
    <bac>   DW_AT_type        : <0xb53>
    <bb0>   DW_AT_external    : 1
    <bb1>   DW_AT_declaration : 1
 <1><bb2>: Abbrev Number: 10 (DW_TAG_variable)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x66c): inet_protocols
    <bb7>   DW_AT_decl_file   : 19
    <bb8>   DW_AT_decl_line   : 415
    <bba>   DW_AT_decl_column : 26
    <bbb>   DW_AT_type        : <0xb53>
    <bbf>   DW_AT_external    : 1
    <bc0>   DW_AT_declaration : 1
 <1><bc1>: Abbrev Number: 10 (DW_TAG_variable)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x2da): evdev_abs
    <bc6>   DW_AT_decl_file   : 19
    <bc7>   DW_AT_decl_line   : 416
    <bc9>   DW_AT_decl_column : 26
    <bca>   DW_AT_type        : <0xb53>
    <bce>   DW_AT_external    : 1
    <bcf>   DW_AT_declaration : 1
 <1><bd0>: Abbrev Number: 10 (DW_TAG_variable)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x745): audit_arch
    <bd5>   DW_AT_decl_file   : 19
    <bd6>   DW_AT_decl_line   : 417
    <bd8>   DW_AT_decl_column : 26
    <bd9>   DW_AT_type        : <0xb53>
    <bdd>   DW_AT_external    : 1
    <bde>   DW_AT_declaration : 1
 <1><bdf>: Abbrev Number: 10 (DW_TAG_variable)
    <be0>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <be4>   DW_AT_decl_file   : 19
    <be5>   DW_AT_decl_line   : 418
    <be7>   DW_AT_decl_column : 26
    <be8>   DW_AT_type        : <0xb53>
    <bec>   DW_AT_external    : 1
    <bed>   DW_AT_declaration : 1
 <1><bee>: Abbrev Number: 10 (DW_TAG_variable)
    <bef>   DW_AT_name        : (indirect string, offset: 0x480): iffflags
    <bf3>   DW_AT_decl_file   : 19
    <bf4>   DW_AT_decl_line   : 419
    <bf6>   DW_AT_decl_column : 26
    <bf7>   DW_AT_type        : <0xb53>
    <bfb>   DW_AT_external    : 1
    <bfc>   DW_AT_declaration : 1
 <1><bfd>: Abbrev Number: 10 (DW_TAG_variable)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xc47): ip_type_of_services
    <c02>   DW_AT_decl_file   : 19
    <c03>   DW_AT_decl_line   : 420
    <c05>   DW_AT_decl_column : 26
    <c06>   DW_AT_type        : <0xb53>
    <c0a>   DW_AT_external    : 1
    <c0b>   DW_AT_declaration : 1
 <1><c0c>: Abbrev Number: 10 (DW_TAG_variable)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x6d8): ipc_private
    <c11>   DW_AT_decl_file   : 19
    <c12>   DW_AT_decl_line   : 421
    <c14>   DW_AT_decl_column : 26
    <c15>   DW_AT_type        : <0xb53>
    <c19>   DW_AT_external    : 1
    <c1a>   DW_AT_declaration : 1
 <1><c1b>: Abbrev Number: 10 (DW_TAG_variable)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x331): msg_flags
    <c20>   DW_AT_decl_file   : 19
    <c21>   DW_AT_decl_line   : 422
    <c23>   DW_AT_decl_column : 26
    <c24>   DW_AT_type        : <0xb53>
    <c28>   DW_AT_external    : 1
    <c29>   DW_AT_declaration : 1
 <1><c2a>: Abbrev Number: 10 (DW_TAG_variable)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x106): netlink_protocols
    <c2f>   DW_AT_decl_file   : 19
    <c30>   DW_AT_decl_line   : 423
    <c32>   DW_AT_decl_column : 26
    <c33>   DW_AT_type        : <0xb53>
    <c37>   DW_AT_external    : 1
    <c38>   DW_AT_declaration : 1
 <1><c39>: Abbrev Number: 10 (DW_TAG_variable)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xf7e): nl_bridge_vlan_flags
    <c3e>   DW_AT_decl_file   : 19
    <c3f>   DW_AT_decl_line   : 424
    <c41>   DW_AT_decl_column : 26
    <c42>   DW_AT_type        : <0xb53>
    <c46>   DW_AT_external    : 1
    <c47>   DW_AT_declaration : 1
 <1><c48>: Abbrev Number: 10 (DW_TAG_variable)
    <c49>   DW_AT_name        : (indirect string, offset: 0xe06): nl_netfilter_msg_types
    <c4d>   DW_AT_decl_file   : 19
    <c4e>   DW_AT_decl_line   : 425
    <c50>   DW_AT_decl_column : 26
    <c51>   DW_AT_type        : <0xb53>
    <c55>   DW_AT_external    : 1
    <c56>   DW_AT_declaration : 1
 <1><c57>: Abbrev Number: 10 (DW_TAG_variable)
    <c58>   DW_AT_name        : (indirect string, offset: 0x462): nl_route_types
    <c5c>   DW_AT_decl_file   : 19
    <c5d>   DW_AT_decl_line   : 426
    <c5f>   DW_AT_decl_column : 26
    <c60>   DW_AT_type        : <0xb53>
    <c64>   DW_AT_external    : 1
    <c65>   DW_AT_declaration : 1
 <1><c66>: Abbrev Number: 10 (DW_TAG_variable)
    <c67>   DW_AT_name        : (indirect string, offset: 0xecd): open_access_modes
    <c6b>   DW_AT_decl_file   : 19
    <c6c>   DW_AT_decl_line   : 427
    <c6e>   DW_AT_decl_column : 26
    <c6f>   DW_AT_type        : <0xb53>
    <c73>   DW_AT_external    : 1
    <c74>   DW_AT_declaration : 1
 <1><c75>: Abbrev Number: 10 (DW_TAG_variable)
    <c76>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c7a>   DW_AT_decl_file   : 19
    <c7b>   DW_AT_decl_line   : 428
    <c7d>   DW_AT_decl_column : 26
    <c7e>   DW_AT_type        : <0xb53>
    <c82>   DW_AT_external    : 1
    <c83>   DW_AT_declaration : 1
 <1><c84>: Abbrev Number: 10 (DW_TAG_variable)
    <c85>   DW_AT_name        : (indirect string, offset: 0xc78): perf_type_id
    <c89>   DW_AT_decl_file   : 19
    <c8a>   DW_AT_decl_line   : 429
    <c8c>   DW_AT_decl_column : 26
    <c8d>   DW_AT_type        : <0xb53>
    <c91>   DW_AT_external    : 1
    <c92>   DW_AT_declaration : 1
 <1><c93>: Abbrev Number: 10 (DW_TAG_variable)
    <c94>   DW_AT_name        : (indirect string, offset: 0xe9f): pollflags
    <c98>   DW_AT_decl_file   : 19
    <c99>   DW_AT_decl_line   : 430
    <c9b>   DW_AT_decl_column : 26
    <c9c>   DW_AT_type        : <0xb53>
    <ca0>   DW_AT_external    : 1
    <ca1>   DW_AT_declaration : 1
 <1><ca2>: Abbrev Number: 10 (DW_TAG_variable)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x5fc): ptrace_cmds
    <ca7>   DW_AT_decl_file   : 19
    <ca8>   DW_AT_decl_line   : 431
    <caa>   DW_AT_decl_column : 26
    <cab>   DW_AT_type        : <0xb53>
    <caf>   DW_AT_external    : 1
    <cb0>   DW_AT_declaration : 1
 <1><cb1>: Abbrev Number: 10 (DW_TAG_variable)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x82e): resource_flags
    <cb6>   DW_AT_decl_file   : 19
    <cb7>   DW_AT_decl_line   : 432
    <cb9>   DW_AT_decl_column : 26
    <cba>   DW_AT_type        : <0xb53>
    <cbe>   DW_AT_external    : 1
    <cbf>   DW_AT_declaration : 1
 <1><cc0>: Abbrev Number: 10 (DW_TAG_variable)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x2b0): route_nexthop_flags
    <cc5>   DW_AT_decl_file   : 19
    <cc6>   DW_AT_decl_line   : 433
    <cc8>   DW_AT_decl_column : 26
    <cc9>   DW_AT_type        : <0xb53>
    <ccd>   DW_AT_external    : 1
    <cce>   DW_AT_declaration : 1
 <1><ccf>: Abbrev Number: 10 (DW_TAG_variable)
    <cd0>   DW_AT_name        : (indirect string, offset: 0xf09): routing_protocols
    <cd4>   DW_AT_decl_file   : 19
    <cd5>   DW_AT_decl_line   : 434
    <cd7>   DW_AT_decl_column : 26
    <cd8>   DW_AT_type        : <0xb53>
    <cdc>   DW_AT_external    : 1
    <cdd>   DW_AT_declaration : 1
 <1><cde>: Abbrev Number: 10 (DW_TAG_variable)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x471): routing_scopes
    <ce3>   DW_AT_decl_file   : 19
    <ce4>   DW_AT_decl_line   : 435
    <ce6>   DW_AT_decl_column : 26
    <ce7>   DW_AT_type        : <0xb53>
    <ceb>   DW_AT_external    : 1
    <cec>   DW_AT_declaration : 1
 <1><ced>: Abbrev Number: 10 (DW_TAG_variable)
    <cee>   DW_AT_name        : (indirect string, offset: 0xde9): routing_table_ids
    <cf2>   DW_AT_decl_file   : 19
    <cf3>   DW_AT_decl_line   : 436
    <cf5>   DW_AT_decl_column : 26
    <cf6>   DW_AT_type        : <0xb53>
    <cfa>   DW_AT_external    : 1
    <cfb>   DW_AT_declaration : 1
 <1><cfc>: Abbrev Number: 10 (DW_TAG_variable)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x6a4): routing_types
    <d01>   DW_AT_decl_file   : 19
    <d02>   DW_AT_decl_line   : 437
    <d04>   DW_AT_decl_column : 26
    <d05>   DW_AT_type        : <0xb53>
    <d09>   DW_AT_external    : 1
    <d0a>   DW_AT_declaration : 1
 <1><d0b>: Abbrev Number: 10 (DW_TAG_variable)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x1c0): rwf_flags
    <d10>   DW_AT_decl_file   : 19
    <d11>   DW_AT_decl_line   : 438
    <d13>   DW_AT_decl_column : 26
    <d14>   DW_AT_type        : <0xb53>
    <d18>   DW_AT_external    : 1
    <d19>   DW_AT_declaration : 1
 <1><d1a>: Abbrev Number: 10 (DW_TAG_variable)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x866): seccomp_filter_flags
    <d1f>   DW_AT_decl_file   : 19
    <d20>   DW_AT_decl_line   : 439
    <d22>   DW_AT_decl_column : 26
    <d23>   DW_AT_type        : <0xb53>
    <d27>   DW_AT_external    : 1
    <d28>   DW_AT_declaration : 1
 <1><d29>: Abbrev Number: 10 (DW_TAG_variable)
    <d2a>   DW_AT_name        : (indirect string, offset: 0x2f7): seccomp_ret_action
    <d2e>   DW_AT_decl_file   : 19
    <d2f>   DW_AT_decl_line   : 440
    <d31>   DW_AT_decl_column : 26
    <d32>   DW_AT_type        : <0xb53>
    <d36>   DW_AT_external    : 1
    <d37>   DW_AT_declaration : 1
 <1><d38>: Abbrev Number: 10 (DW_TAG_variable)
    <d39>   DW_AT_name        : (indirect string, offset: 0x43d): setns_types
    <d3d>   DW_AT_decl_file   : 19
    <d3e>   DW_AT_decl_line   : 441
    <d40>   DW_AT_decl_column : 26
    <d41>   DW_AT_type        : <0xb53>
    <d45>   DW_AT_external    : 1
    <d46>   DW_AT_declaration : 1
 <1><d47>: Abbrev Number: 10 (DW_TAG_variable)
    <d48>   DW_AT_name        : (indirect string, offset: 0xe8b): sg_io_info
    <d4c>   DW_AT_decl_file   : 19
    <d4d>   DW_AT_decl_line   : 442
    <d4f>   DW_AT_decl_column : 26
    <d50>   DW_AT_type        : <0xb53>
    <d54>   DW_AT_external    : 1
    <d55>   DW_AT_declaration : 1
 <1><d56>: Abbrev Number: 10 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0xbed): socketlayers
    <d5b>   DW_AT_decl_file   : 19
    <d5c>   DW_AT_decl_line   : 443
    <d5e>   DW_AT_decl_column : 26
    <d5f>   DW_AT_type        : <0xb53>
    <d63>   DW_AT_external    : 1
    <d64>   DW_AT_declaration : 1
 <1><d65>: Abbrev Number: 10 (DW_TAG_variable)
    <d66>   DW_AT_name        : (indirect string, offset: 0xdd3): socktypes
    <d6a>   DW_AT_decl_file   : 19
    <d6b>   DW_AT_decl_line   : 444
    <d6d>   DW_AT_decl_column : 26
    <d6e>   DW_AT_type        : <0xb53>
    <d72>   DW_AT_external    : 1
    <d73>   DW_AT_declaration : 1
 <1><d74>: Abbrev Number: 10 (DW_TAG_variable)
    <d75>   DW_AT_name        : (indirect string, offset: 0xabd): tcp_state_flags
    <d79>   DW_AT_decl_file   : 19
    <d7a>   DW_AT_decl_line   : 445
    <d7c>   DW_AT_decl_column : 26
    <d7d>   DW_AT_type        : <0xb53>
    <d81>   DW_AT_external    : 1
    <d82>   DW_AT_declaration : 1
 <1><d83>: Abbrev Number: 10 (DW_TAG_variable)
    <d84>   DW_AT_name        : (indirect string, offset: 0x77a): tcp_states
    <d88>   DW_AT_decl_file   : 19
    <d89>   DW_AT_decl_line   : 446
    <d8b>   DW_AT_decl_column : 26
    <d8c>   DW_AT_type        : <0xb53>
    <d90>   DW_AT_external    : 1
    <d91>   DW_AT_declaration : 1
 <1><d92>: Abbrev Number: 10 (DW_TAG_variable)
    <d93>   DW_AT_name        : (indirect string, offset: 0x10c6): whence_codes
    <d97>   DW_AT_decl_file   : 19
    <d98>   DW_AT_decl_line   : 447
    <d9a>   DW_AT_decl_column : 26
    <d9b>   DW_AT_type        : <0xb53>
    <d9f>   DW_AT_external    : 1
    <da0>   DW_AT_declaration : 1
 <1><da1>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <da2>   DW_AT_encoding    : 7	(unsigned)
    <da3>   DW_AT_byte_size   : 4
    <da4>   DW_AT_type        : <0x2b>
    <da8>   DW_AT_decl_file   : 19
    <da9>   DW_AT_decl_line   : 508
    <dab>   DW_AT_decl_column : 14
    <dac>   DW_AT_sibling     : <0xdc3>
 <2><db0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0x9e0): CFLAG_NONE
    <db5>   DW_AT_const_value : 0
 <2><db6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db7>   DW_AT_name        : (indirect string, offset: 0x8ff): CFLAG_ONLY_STATS
    <dbb>   DW_AT_const_value : 1
 <2><dbc>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xbfa): CFLAG_BOTH
    <dc1>   DW_AT_const_value : 2
 <2><dc2>: Abbrev Number: 0
 <1><dc3>: Abbrev Number: 28 (DW_TAG_typedef)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x1178): cflag_t
    <dc8>   DW_AT_decl_file   : 19
    <dc9>   DW_AT_decl_line   : 512
    <dcb>   DW_AT_decl_column : 3
    <dcc>   DW_AT_type        : <0xda1>
 <1><dd0>: Abbrev Number: 10 (DW_TAG_variable)
    <dd1>   DW_AT_name        : (indirect string, offset: 0xd12): cflag
    <dd5>   DW_AT_decl_file   : 19
    <dd6>   DW_AT_decl_line   : 513
    <dd8>   DW_AT_decl_column : 16
    <dd9>   DW_AT_type        : <0xdc3>
    <ddd>   DW_AT_external    : 1
    <dde>   DW_AT_declaration : 1
 <1><ddf>: Abbrev Number: 10 (DW_TAG_variable)
    <de0>   DW_AT_name        : (indirect string, offset: 0x181): Tflag
    <de4>   DW_AT_decl_file   : 19
    <de5>   DW_AT_decl_line   : 514
    <de7>   DW_AT_decl_column : 13
    <de8>   DW_AT_type        : <0x50e>
    <dec>   DW_AT_external    : 1
    <ded>   DW_AT_declaration : 1
 <1><dee>: Abbrev Number: 10 (DW_TAG_variable)
    <def>   DW_AT_name        : (indirect string, offset: 0x7d5): Tflag_scale
    <df3>   DW_AT_decl_file   : 19
    <df4>   DW_AT_decl_line   : 515
    <df6>   DW_AT_decl_column : 12
    <df7>   DW_AT_type        : <0x64>
    <dfb>   DW_AT_external    : 1
    <dfc>   DW_AT_declaration : 1
 <1><dfd>: Abbrev Number: 10 (DW_TAG_variable)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x87b): Tflag_width
    <e02>   DW_AT_decl_file   : 19
    <e03>   DW_AT_decl_line   : 516
    <e05>   DW_AT_decl_column : 12
    <e06>   DW_AT_type        : <0x64>
    <e0a>   DW_AT_external    : 1
    <e0b>   DW_AT_declaration : 1
 <1><e0c>: Abbrev Number: 10 (DW_TAG_variable)
    <e0d>   DW_AT_name        : (indirect string, offset: 0xe7d): iflag
    <e11>   DW_AT_decl_file   : 19
    <e12>   DW_AT_decl_line   : 517
    <e14>   DW_AT_decl_column : 13
    <e15>   DW_AT_type        : <0x50e>
    <e19>   DW_AT_external    : 1
    <e1a>   DW_AT_declaration : 1
 <1><e1b>: Abbrev Number: 10 (DW_TAG_variable)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x63c): count_wallclock
    <e20>   DW_AT_decl_file   : 19
    <e21>   DW_AT_decl_line   : 518
    <e23>   DW_AT_decl_column : 13
    <e24>   DW_AT_type        : <0x50e>
    <e28>   DW_AT_external    : 1
    <e29>   DW_AT_declaration : 1
 <1><e2a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e2f>   DW_AT_byte_size   : 4
    <e30>   DW_AT_decl_file   : 19
    <e31>   DW_AT_decl_line   : 520
    <e33>   DW_AT_decl_column : 8
    <e34>   DW_AT_sibling     : <0xe49>
 <2><e38>: Abbrev Number: 22 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0xc4): path
    <e3d>   DW_AT_decl_file   : 19
    <e3e>   DW_AT_decl_line   : 521
    <e40>   DW_AT_decl_column : 14
    <e41>   DW_AT_type        : <0x1c2>
    <e45>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e48>: Abbrev Number: 0
 <1><e49>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x785): path_set
    <e4e>   DW_AT_byte_size   : 12
    <e4f>   DW_AT_decl_file   : 19
    <e50>   DW_AT_decl_line   : 525
    <e52>   DW_AT_decl_column : 15
    <e53>   DW_AT_sibling     : <0xe88>
 <2><e57>: Abbrev Number: 22 (DW_TAG_member)
    <e58>   DW_AT_name        : (indirect string, offset: 0x713): paths_selected
    <e5c>   DW_AT_decl_file   : 19
    <e5d>   DW_AT_decl_line   : 526
    <e5f>   DW_AT_decl_column : 24
    <e60>   DW_AT_type        : <0xe88>
    <e64>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e67>: Abbrev Number: 22 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0x10b9): num_selected
    <e6c>   DW_AT_decl_file   : 19
    <e6d>   DW_AT_decl_line   : 527
    <e6f>   DW_AT_decl_column : 9
    <e70>   DW_AT_type        : <0x122>
    <e74>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e77>: Abbrev Number: 22 (DW_TAG_member)
    <e78>   DW_AT_name        : (indirect string, offset: 0xbaa): size
    <e7c>   DW_AT_decl_file   : 19
    <e7d>   DW_AT_decl_line   : 528
    <e7f>   DW_AT_decl_column : 9
    <e80>   DW_AT_type        : <0x122>
    <e84>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e87>: Abbrev Number: 0
 <1><e88>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e89>   DW_AT_byte_size   : 4
    <e8a>   DW_AT_type        : <0xe2a>
 <1><e8e>: Abbrev Number: 10 (DW_TAG_variable)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x1108): global_path_set
    <e93>   DW_AT_decl_file   : 19
    <e94>   DW_AT_decl_line   : 529
    <e96>   DW_AT_decl_column : 3
    <e97>   DW_AT_type        : <0xe49>
    <e9b>   DW_AT_external    : 1
    <e9c>   DW_AT_declaration : 1
 <1><e9d>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e9e>   DW_AT_name        : (indirect string, offset: 0xff6): xflag_opts
    <ea2>   DW_AT_encoding    : 7	(unsigned)
    <ea3>   DW_AT_byte_size   : 4
    <ea4>   DW_AT_type        : <0x2b>
    <ea8>   DW_AT_decl_file   : 19
    <ea9>   DW_AT_decl_line   : 531
    <eab>   DW_AT_decl_column : 6
    <eac>   DW_AT_sibling     : <0xecf>
 <2><eb0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xa6a): HEXSTR_NONE
    <eb5>   DW_AT_const_value : 0
 <2><eb6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x1033): HEXSTR_NON_ASCII
    <ebb>   DW_AT_const_value : 1
 <2><ebc>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x951): HEXSTR_ALL
    <ec1>   DW_AT_const_value : 2
 <2><ec2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x68d): HEXSTR_NON_ASCII_CHARS
    <ec7>   DW_AT_const_value : 3
 <2><ec8>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x10d3): NUM_HEXSTR_OPTS
    <ecd>   DW_AT_const_value : 4
 <2><ece>: Abbrev Number: 0
 <1><ecf>: Abbrev Number: 10 (DW_TAG_variable)
    <ed0>   DW_AT_name        : (indirect string, offset: 0xe52): xflag
    <ed4>   DW_AT_decl_file   : 19
    <ed5>   DW_AT_decl_line   : 544
    <ed7>   DW_AT_decl_column : 17
    <ed8>   DW_AT_type        : <0x2b>
    <edc>   DW_AT_external    : 1
    <edd>   DW_AT_declaration : 1
 <1><ede>: Abbrev Number: 10 (DW_TAG_variable)
    <edf>   DW_AT_name        : (indirect string, offset: 0xccd): followfork
    <ee3>   DW_AT_decl_file   : 19
    <ee4>   DW_AT_decl_line   : 545
    <ee6>   DW_AT_decl_column : 13
    <ee7>   DW_AT_type        : <0x50e>
    <eeb>   DW_AT_external    : 1
    <eec>   DW_AT_declaration : 1
 <1><eed>: Abbrev Number: 10 (DW_TAG_variable)
    <eee>   DW_AT_name        : (indirect string, offset: 0x345): output_separately
    <ef2>   DW_AT_decl_file   : 19
    <ef3>   DW_AT_decl_line   : 546
    <ef5>   DW_AT_decl_column : 13
    <ef6>   DW_AT_type        : <0x50e>
    <efa>   DW_AT_external    : 1
    <efb>   DW_AT_declaration : 1
 <1><efc>: Abbrev Number: 10 (DW_TAG_variable)
    <efd>   DW_AT_name        : (indirect string, offset: 0x236): stack_trace_enabled
    <f01>   DW_AT_decl_file   : 19
    <f02>   DW_AT_decl_line   : 549
    <f04>   DW_AT_decl_column : 13
    <f05>   DW_AT_type        : <0x50e>
    <f09>   DW_AT_external    : 1
    <f0a>   DW_AT_declaration : 1
 <1><f0b>: Abbrev Number: 10 (DW_TAG_variable)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x67b): ptrace_setoptions
    <f10>   DW_AT_decl_file   : 19
    <f11>   DW_AT_decl_line   : 553
    <f13>   DW_AT_decl_column : 17
    <f14>   DW_AT_type        : <0x2b>
    <f18>   DW_AT_external    : 1
    <f19>   DW_AT_declaration : 1
 <1><f1a>: Abbrev Number: 10 (DW_TAG_variable)
    <f1b>   DW_AT_name        : (indirect string, offset: 0xa5f): max_strlen
    <f1f>   DW_AT_decl_file   : 19
    <f20>   DW_AT_decl_line   : 554
    <f22>   DW_AT_decl_column : 17
    <f23>   DW_AT_type        : <0x2b>
    <f27>   DW_AT_external    : 1
    <f28>   DW_AT_declaration : 1
 <1><f29>: Abbrev Number: 10 (DW_TAG_variable)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xa97): os_release
    <f2e>   DW_AT_decl_file   : 19
    <f2f>   DW_AT_decl_line   : 555
    <f31>   DW_AT_decl_column : 17
    <f32>   DW_AT_type        : <0x2b>
    <f36>   DW_AT_external    : 1
    <f37>   DW_AT_declaration : 1
 <1><f38>: Abbrev Number: 10 (DW_TAG_variable)
    <f39>   DW_AT_name        : (indirect string, offset: 0x722): xlat_verbosity
    <f3d>   DW_AT_decl_file   : 19
    <f3e>   DW_AT_decl_line   : 917
    <f40>   DW_AT_decl_column : 24
    <f41>   DW_AT_type        : <0xa76>
    <f45>   DW_AT_external    : 1
    <f46>   DW_AT_declaration : 1
 <1><f47>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f48>   DW_AT_name        : (indirect string, offset: 0x61f): xlat_style_private_flag_bits
    <f4c>   DW_AT_encoding    : 7	(unsigned)
    <f4d>   DW_AT_byte_size   : 4
    <f4e>   DW_AT_type        : <0x2b>
    <f52>   DW_AT_decl_file   : 19
    <f53>   DW_AT_decl_line   : 937
    <f55>   DW_AT_decl_column : 6
    <f56>   DW_AT_sibling     : <0xf73>
 <2><f5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x2c4): PAF_PRINT_INDICES_BIT
    <f5f>   DW_AT_const_value : 5
 <2><f60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0xb61): PAF_ARRAY_TRUNCATED_BIT
    <f65>   DW_AT_const_value : 6
 <2><f66>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f67>   DW_AT_name        : (indirect string, offset: 0x3fd): PXF_DEFAULT_STR_BIT
    <f6b>   DW_AT_const_value : 7
 <2><f6c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xcaf): SPFF_AUXSTR_MODE_BIT
    <f71>   DW_AT_const_value : 8
 <2><f72>: Abbrev Number: 0
 <1><f73>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f74>   DW_AT_name        : (indirect string, offset: 0xd68): find_xlat_flag_bits
    <f78>   DW_AT_encoding    : 7	(unsigned)
    <f79>   DW_AT_byte_size   : 4
    <f7a>   DW_AT_type        : <0x2b>
    <f7e>   DW_AT_decl_file   : 19
    <f7f>   DW_AT_decl_line   : 1441
    <f81>   DW_AT_decl_column : 6
    <f82>   DW_AT_sibling     : <0xf8d>
 <2><f86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f87>   DW_AT_name        : (indirect string, offset: 0x98e): FXL_CASE_SENSITIVE_BIT
    <f8b>   DW_AT_const_value : 0
 <2><f8c>: Abbrev Number: 0
 <1><f8d>: Abbrev Number: 10 (DW_TAG_variable)
    <f8e>   DW_AT_name        : (indirect string, offset: 0xa32): printing_tcp
    <f92>   DW_AT_decl_file   : 19
    <f93>   DW_AT_decl_line   : 1687
    <f95>   DW_AT_decl_column : 20
    <f96>   DW_AT_type        : <0x626>
    <f9a>   DW_AT_external    : 1
    <f9b>   DW_AT_declaration : 1
 <1><f9c>: Abbrev Number: 10 (DW_TAG_variable)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x5d3): errnoent
    <fa1>   DW_AT_decl_file   : 19
    <fa2>   DW_AT_decl_line   : 1885
    <fa4>   DW_AT_decl_column : 26
    <fa5>   DW_AT_type        : <0x442>
    <fa9>   DW_AT_external    : 1
    <faa>   DW_AT_declaration : 1
 <1><fab>: Abbrev Number: 10 (DW_TAG_variable)
    <fac>   DW_AT_name        : (indirect string, offset: 0x887): signalent
    <fb0>   DW_AT_decl_file   : 19
    <fb1>   DW_AT_decl_line   : 1886
    <fb3>   DW_AT_decl_column : 26
    <fb4>   DW_AT_type        : <0x442>
    <fb8>   DW_AT_external    : 1
    <fb9>   DW_AT_declaration : 1
 <1><fba>: Abbrev Number: 10 (DW_TAG_variable)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xec5): nerrnos
    <fbf>   DW_AT_decl_file   : 19
    <fc0>   DW_AT_decl_line   : 1887
    <fc2>   DW_AT_decl_column : 27
    <fc3>   DW_AT_type        : <0x32>
    <fc7>   DW_AT_external    : 1
    <fc8>   DW_AT_declaration : 1
 <1><fc9>: Abbrev Number: 10 (DW_TAG_variable)
    <fca>   DW_AT_name        : (indirect string, offset: 0x108a): nsignals
    <fce>   DW_AT_decl_file   : 19
    <fcf>   DW_AT_decl_line   : 1888
    <fd1>   DW_AT_decl_column : 27
    <fd2>   DW_AT_type        : <0x32>
    <fd6>   DW_AT_external    : 1
    <fd7>   DW_AT_declaration : 1
 <1><fd8>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd9>   DW_AT_type        : <0x895>
    <fdd>   DW_AT_sibling     : <0xfe3>
 <2><fe1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fe2>: Abbrev Number: 0
 <1><fe3>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe4>   DW_AT_type        : <0xfd8>
 <1><fe8>: Abbrev Number: 10 (DW_TAG_variable)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xd33): sysent0
    <fed>   DW_AT_decl_file   : 19
    <fee>   DW_AT_decl_line   : 1890
    <ff0>   DW_AT_decl_column : 28
    <ff1>   DW_AT_type        : <0xfe3>
    <ff5>   DW_AT_external    : 1
    <ff6>   DW_AT_declaration : 1
 <1><ff7>: Abbrev Number: 15 (DW_TAG_array_type)
    <ff8>   DW_AT_type        : <0x8fc>
    <ffc>   DW_AT_sibling     : <0x1002>
 <2><1000>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><1001>: Abbrev Number: 0
 <1><1002>: Abbrev Number: 3 (DW_TAG_const_type)
    <1003>   DW_AT_type        : <0xff7>
 <1><1007>: Abbrev Number: 10 (DW_TAG_variable)
    <1008>   DW_AT_name        : (indirect string, offset: 0x10fe): ioctlent0
    <100c>   DW_AT_decl_file   : 19
    <100d>   DW_AT_decl_line   : 1891
    <100f>   DW_AT_decl_column : 30
    <1010>   DW_AT_type        : <0x1002>
    <1014>   DW_AT_external    : 1
    <1015>   DW_AT_declaration : 1
 <1><1016>: Abbrev Number: 10 (DW_TAG_variable)
    <1017>   DW_AT_name        : (indirect string, offset: 0x1001): personality_names
    <101b>   DW_AT_decl_file   : 19
    <101c>   DW_AT_decl_line   : 1893
    <101e>   DW_AT_decl_column : 26
    <101f>   DW_AT_type        : <0x442>
    <1023>   DW_AT_external    : 1
    <1024>   DW_AT_declaration : 1
 <1><1025>: Abbrev Number: 10 (DW_TAG_variable)
    <1026>   DW_AT_name        : (indirect string, offset: 0x8a7): sysent
    <102a>   DW_AT_decl_file   : 19
    <102b>   DW_AT_decl_line   : 1896
    <102d>   DW_AT_decl_column : 29
    <102e>   DW_AT_type        : <0x9e1>
    <1032>   DW_AT_external    : 1
    <1033>   DW_AT_declaration : 1
 <1><1034>: Abbrev Number: 10 (DW_TAG_variable)
    <1035>   DW_AT_name        : (indirect string, offset: 0xcc4): ioctlent
    <1039>   DW_AT_decl_file   : 19
    <103a>   DW_AT_decl_line   : 1897
    <103c>   DW_AT_decl_column : 31
    <103d>   DW_AT_type        : <0x1043>
    <1041>   DW_AT_external    : 1
    <1042>   DW_AT_declaration : 1
 <1><1043>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1044>   DW_AT_byte_size   : 4
    <1045>   DW_AT_type        : <0x8fc>
 <1><1049>: Abbrev Number: 10 (DW_TAG_variable)
    <104a>   DW_AT_name        : (indirect string, offset: 0x891): nsyscalls
    <104e>   DW_AT_decl_file   : 19
    <104f>   DW_AT_decl_line   : 1903
    <1051>   DW_AT_decl_column : 17
    <1052>   DW_AT_type        : <0x2b>
    <1056>   DW_AT_external    : 1
    <1057>   DW_AT_declaration : 1
 <1><1058>: Abbrev Number: 10 (DW_TAG_variable)
    <1059>   DW_AT_name        : (indirect string, offset: 0xee9): nioctlents
    <105d>   DW_AT_decl_file   : 19
    <105e>   DW_AT_decl_line   : 1904
    <1060>   DW_AT_decl_column : 17
    <1061>   DW_AT_type        : <0x2b>
    <1065>   DW_AT_external    : 1
    <1066>   DW_AT_declaration : 1
 <1><1067>: Abbrev Number: 15 (DW_TAG_array_type)
    <1068>   DW_AT_type        : <0x32>
    <106c>   DW_AT_sibling     : <0x1077>
 <2><1070>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1071>   DW_AT_type        : <0x2b>
    <1075>   DW_AT_upper_bound : 2
 <2><1076>: Abbrev Number: 0
 <1><1077>: Abbrev Number: 3 (DW_TAG_const_type)
    <1078>   DW_AT_type        : <0x1067>
 <1><107c>: Abbrev Number: 10 (DW_TAG_variable)
    <107d>   DW_AT_name        : (indirect string, offset: 0xf5e): nsyscall_vec
    <1081>   DW_AT_decl_file   : 19
    <1082>   DW_AT_decl_line   : 1906
    <1084>   DW_AT_decl_column : 27
    <1085>   DW_AT_type        : <0x1077>
    <1089>   DW_AT_external    : 1
    <108a>   DW_AT_declaration : 1
 <1><108b>: Abbrev Number: 15 (DW_TAG_array_type)
    <108c>   DW_AT_type        : <0x9e7>
    <1090>   DW_AT_sibling     : <0x109b>
 <2><1094>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1095>   DW_AT_type        : <0x2b>
    <1099>   DW_AT_upper_bound : 2
 <2><109a>: Abbrev Number: 0
 <1><109b>: Abbrev Number: 3 (DW_TAG_const_type)
    <109c>   DW_AT_type        : <0x108b>
 <1><10a0>: Abbrev Number: 10 (DW_TAG_variable)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x7c2): sysent_vec
    <10a5>   DW_AT_decl_file   : 19
    <10a6>   DW_AT_decl_line   : 1907
    <10a8>   DW_AT_decl_column : 35
    <10a9>   DW_AT_type        : <0x109b>
    <10ad>   DW_AT_external    : 1
    <10ae>   DW_AT_declaration : 1
 <1><10af>: Abbrev Number: 10 (DW_TAG_variable)
    <10b0>   DW_AT_name        : (indirect string, offset: 0x39e): inject_vec
    <10b4>   DW_AT_decl_file   : 19
    <10b5>   DW_AT_decl_line   : 1908
    <10b7>   DW_AT_decl_column : 28
    <10b8>   DW_AT_type        : <0x9ec>
    <10bc>   DW_AT_external    : 1
    <10bd>   DW_AT_declaration : 1
 <1><10be>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10bf>   DW_AT_name        : (indirect string, offset: 0xdc6): audit_arch_t
    <10c3>   DW_AT_byte_size   : 8
    <10c4>   DW_AT_decl_file   : 19
    <10c5>   DW_AT_decl_line   : 1910
    <10c7>   DW_AT_decl_column : 8
    <10c8>   DW_AT_sibling     : <0x10ed>
 <2><10cc>: Abbrev Number: 22 (DW_TAG_member)
    <10cd>   DW_AT_name        : (indirect string, offset: 0x611): arch
    <10d1>   DW_AT_decl_file   : 19
    <10d2>   DW_AT_decl_line   : 1911
    <10d4>   DW_AT_decl_column : 15
    <10d5>   DW_AT_type        : <0x2b>
    <10d9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10dc>: Abbrev Number: 22 (DW_TAG_member)
    <10dd>   DW_AT_name        : (indirect string, offset: 0xa18): flag
    <10e1>   DW_AT_decl_file   : 19
    <10e2>   DW_AT_decl_line   : 1912
    <10e4>   DW_AT_decl_column : 15
    <10e5>   DW_AT_type        : <0x2b>
    <10e9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10ec>: Abbrev Number: 0
 <1><10ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ee>   DW_AT_type        : <0x10be>
 <1><10f2>: Abbrev Number: 15 (DW_TAG_array_type)
    <10f3>   DW_AT_type        : <0x10ed>
    <10f7>   DW_AT_sibling     : <0x1102>
 <2><10fb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10fc>   DW_AT_type        : <0x2b>
    <1100>   DW_AT_upper_bound : 2
 <2><1101>: Abbrev Number: 0
 <1><1102>: Abbrev Number: 3 (DW_TAG_const_type)
    <1103>   DW_AT_type        : <0x10f2>
 <1><1107>: Abbrev Number: 10 (DW_TAG_variable)
    <1108>   DW_AT_name        : (indirect string, offset: 0x97f): audit_arch_vec
    <110c>   DW_AT_decl_file   : 19
    <110d>   DW_AT_decl_line   : 1915
    <110f>   DW_AT_decl_column : 34
    <1110>   DW_AT_type        : <0x1102>
    <1114>   DW_AT_external    : 1
    <1115>   DW_AT_declaration : 1
 <1><1116>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1117>   DW_AT_byte_size   : 180
    <1118>   DW_AT_decl_file   : 21
    <1119>   DW_AT_decl_line   : 2
    <111a>   DW_AT_decl_column : 9
    <111b>   DW_AT_sibling     : <0x13d0>
 <2><111f>: Abbrev Number: 9 (DW_TAG_member)
    <1120>   DW_AT_name        : (indirect string, offset: 0x1d8): block_ioctl
    <1124>   DW_AT_decl_file   : 21
    <1125>   DW_AT_decl_line   : 3
    <1126>   DW_AT_decl_column : 8
    <1127>   DW_AT_type        : <0x13ea>
    <112b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><112e>: Abbrev Number: 9 (DW_TAG_member)
    <112f>   DW_AT_name        : (indirect string, offset: 0xb00): btrfs_ioctl
    <1133>   DW_AT_decl_file   : 21
    <1134>   DW_AT_decl_line   : 6
    <1135>   DW_AT_decl_column : 8
    <1136>   DW_AT_type        : <0x13ea>
    <113a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><113d>: Abbrev Number: 9 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x75b): evdev_write_ioctl_mpers
    <1142>   DW_AT_decl_file   : 21
    <1143>   DW_AT_decl_line   : 9
    <1144>   DW_AT_decl_column : 8
    <1145>   DW_AT_type        : <0x13ea>
    <1149>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><114c>: Abbrev Number: 9 (DW_TAG_member)
    <114d>   DW_AT_name        : (indirect string, offset: 0x731): get_sock_fprog_size
    <1151>   DW_AT_decl_file   : 21
    <1152>   DW_AT_decl_line   : 12
