Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1953 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x50b): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x105e): mpers-mx32/siginfo_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xac5): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10e2): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9f5): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8d5): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf9c): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x90e): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7b2): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbff): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xffc): __uid_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 146
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x2b>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xc35): __off_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 152
    <b5>   DW_AT_decl_column : 25
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xd97): __off64_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 153
    <c1>   DW_AT_decl_column : 27
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 4 (DW_TAG_typedef)
    <c7>   DW_AT_name        : (indirect string, offset: 0xb90): __pid_t
    <cb>   DW_AT_decl_file   : 1
    <cc>   DW_AT_decl_line   : 154
    <cd>   DW_AT_decl_column : 25
    <ce>   DW_AT_type        : <0x64>
 <1><d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <d3>   DW_AT_name        : (indirect string, offset: 0xaa9): __clock_t
    <d7>   DW_AT_decl_file   : 1
    <d8>   DW_AT_decl_line   : 156
    <d9>   DW_AT_decl_column : 27
    <da>   DW_AT_type        : <0x7c>
 <1><de>: Abbrev Number: 4 (DW_TAG_typedef)
    <df>   DW_AT_name        : (indirect string, offset: 0xd0c): __time_t
    <e3>   DW_AT_decl_file   : 1
    <e4>   DW_AT_decl_line   : 160
    <e5>   DW_AT_decl_column : 26
    <e6>   DW_AT_type        : <0x7c>
 <1><ea>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eb>   DW_AT_byte_size   : 4
 <1><ec>: Abbrev Number: 3 (DW_TAG_const_type)
    <ed>   DW_AT_type        : <0xea>
 <1><f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (indirect string, offset: 0x412): __syscall_slong_t
    <f6>   DW_AT_decl_file   : 1
    <f7>   DW_AT_decl_line   : 196
    <f8>   DW_AT_decl_column : 33
    <f9>   DW_AT_type        : <0x7c>
 <1><fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fe>   DW_AT_byte_size   : 4
    <ff>   DW_AT_type        : <0x103>
 <1><103>: Abbrev Number: 2 (DW_TAG_base_type)
    <104>   DW_AT_byte_size   : 1
    <105>   DW_AT_encoding    : 6	(signed char)
    <106>   DW_AT_name        : (indirect string, offset: 0x45e): char
 <1><10a>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b>   DW_AT_type        : <0x103>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0x35a): uint8_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 24
    <116>   DW_AT_decl_column : 19
    <117>   DW_AT_type        : <0x45>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xc20): uint16_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 25
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x58>
 <1><127>: Abbrev Number: 4 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x1112): uint32_t
    <12c>   DW_AT_decl_file   : 2
    <12d>   DW_AT_decl_line   : 26
    <12e>   DW_AT_decl_column : 20
    <12f>   DW_AT_type        : <0x70>
 <1><133>: Abbrev Number: 4 (DW_TAG_typedef)
    <134>   DW_AT_name        : (indirect string, offset: 0xea9): uint64_t
    <138>   DW_AT_decl_file   : 2
    <139>   DW_AT_decl_line   : 27
    <13a>   DW_AT_decl_column : 20
    <13b>   DW_AT_type        : <0x8f>
 <1><13f>: Abbrev Number: 2 (DW_TAG_base_type)
    <140>   DW_AT_byte_size   : 4
    <141>   DW_AT_encoding    : 5	(signed)
    <142>   DW_AT_name        : (indirect string, offset: 0x2ca): long int
 <1><146>: Abbrev Number: 4 (DW_TAG_typedef)
    <147>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <14b>   DW_AT_decl_file   : 3
    <14c>   DW_AT_decl_line   : 209
    <14d>   DW_AT_decl_column : 23
    <14e>   DW_AT_type        : <0x2b>
 <1><152>: Abbrev Number: 3 (DW_TAG_const_type)
    <153>   DW_AT_type        : <0x146>
 <1><157>: Abbrev Number: 8 (DW_TAG_structure_type)
    <158>   DW_AT_name        : (indirect string, offset: 0xba8): timespec
    <15c>   DW_AT_byte_size   : 16
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 10
    <15f>   DW_AT_decl_column : 8
    <160>   DW_AT_sibling     : <0x183>
 <2><164>: Abbrev Number: 9 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x11b8): tv_sec
    <169>   DW_AT_decl_file   : 4
    <16a>   DW_AT_decl_line   : 12
    <16b>   DW_AT_decl_column : 12
    <16c>   DW_AT_type        : <0xde>
    <170>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><173>: Abbrev Number: 9 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0xed6): tv_nsec
    <178>   DW_AT_decl_file   : 4
    <179>   DW_AT_decl_line   : 16
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xf1>
    <17f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><182>: Abbrev Number: 0
 <1><183>: Abbrev Number: 2 (DW_TAG_base_type)
    <184>   DW_AT_byte_size   : 16
    <185>   DW_AT_encoding    : 4	(float)
    <186>   DW_AT_name        : (indirect string, offset: 0xb65): long double
 <1><18a>: Abbrev Number: 10 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0x281): __environ
    <18f>   DW_AT_decl_file   : 5
    <190>   DW_AT_decl_line   : 543
    <192>   DW_AT_decl_column : 15
    <193>   DW_AT_type        : <0x199>
    <197>   DW_AT_external    : 1
    <198>   DW_AT_declaration : 1
 <1><199>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <19a>   DW_AT_byte_size   : 4
    <19b>   DW_AT_type        : <0xfd>
 <1><19f>: Abbrev Number: 10 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x3b4): environ
    <1a4>   DW_AT_decl_file   : 5
    <1a5>   DW_AT_decl_line   : 545
    <1a7>   DW_AT_decl_column : 15
    <1a8>   DW_AT_type        : <0x199>
    <1ac>   DW_AT_external    : 1
    <1ad>   DW_AT_declaration : 1
 <1><1ae>: Abbrev Number: 11 (DW_TAG_variable)
    <1af>   DW_AT_name        : (indirect string, offset: 0x10cc): optarg
    <1b3>   DW_AT_decl_file   : 6
    <1b4>   DW_AT_decl_line   : 36
    <1b5>   DW_AT_decl_column : 14
    <1b6>   DW_AT_type        : <0xfd>
    <1ba>   DW_AT_external    : 1
    <1bb>   DW_AT_declaration : 1
 <1><1bc>: Abbrev Number: 11 (DW_TAG_variable)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x785): optind
    <1c1>   DW_AT_decl_file   : 6
    <1c2>   DW_AT_decl_line   : 50
    <1c3>   DW_AT_decl_column : 12
    <1c4>   DW_AT_type        : <0x64>
    <1c8>   DW_AT_external    : 1
    <1c9>   DW_AT_declaration : 1
 <1><1ca>: Abbrev Number: 11 (DW_TAG_variable)
    <1cb>   DW_AT_name        : (indirect string, offset: 0xcfb): opterr
    <1cf>   DW_AT_decl_file   : 6
    <1d0>   DW_AT_decl_line   : 55
    <1d1>   DW_AT_decl_column : 12
    <1d2>   DW_AT_type        : <0x64>
    <1d6>   DW_AT_external    : 1
    <1d7>   DW_AT_declaration : 1
 <1><1d8>: Abbrev Number: 11 (DW_TAG_variable)
    <1d9>   DW_AT_name        : (indirect string, offset: 0xbe5): optopt
    <1dd>   DW_AT_decl_file   : 6
    <1de>   DW_AT_decl_line   : 59
    <1df>   DW_AT_decl_column : 12
    <1e0>   DW_AT_type        : <0x64>
    <1e4>   DW_AT_external    : 1
    <1e5>   DW_AT_declaration : 1
 <1><1e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e7>   DW_AT_byte_size   : 4
    <1e8>   DW_AT_type        : <0x10a>
 <1><1ec>: Abbrev Number: 3 (DW_TAG_const_type)
    <1ed>   DW_AT_type        : <0x1e6>
 <1><1f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1f2>   DW_AT_byte_size   : 4
    <1f3>   DW_AT_type        : <0x1f7>
 <1><1f7>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1f8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x362): _IO_FILE
    <1fd>   DW_AT_byte_size   : 152
    <1fe>   DW_AT_decl_file   : 7
    <1ff>   DW_AT_decl_line   : 49
    <200>   DW_AT_decl_column : 8
    <201>   DW_AT_sibling     : <0x3b9>
 <2><205>: Abbrev Number: 9 (DW_TAG_member)
    <206>   DW_AT_name        : (indirect string, offset: 0xa97): _flags
    <20a>   DW_AT_decl_file   : 7
    <20b>   DW_AT_decl_line   : 51
    <20c>   DW_AT_decl_column : 7
    <20d>   DW_AT_type        : <0x64>
    <211>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><214>: Abbrev Number: 9 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x4fe): _IO_read_ptr
    <219>   DW_AT_decl_file   : 7
    <21a>   DW_AT_decl_line   : 54
    <21b>   DW_AT_decl_column : 9
    <21c>   DW_AT_type        : <0xfd>
    <220>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><223>: Abbrev Number: 9 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x1004): _IO_read_end
    <228>   DW_AT_decl_file   : 7
    <229>   DW_AT_decl_line   : 55
    <22a>   DW_AT_decl_column : 9
    <22b>   DW_AT_type        : <0xfd>
    <22f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><232>: Abbrev Number: 9 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0x806): _IO_read_base
    <237>   DW_AT_decl_file   : 7
    <238>   DW_AT_decl_line   : 56
    <239>   DW_AT_decl_column : 9
    <23a>   DW_AT_type        : <0xfd>
    <23e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><241>: Abbrev Number: 9 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <246>   DW_AT_decl_file   : 7
    <247>   DW_AT_decl_line   : 57
    <248>   DW_AT_decl_column : 9
    <249>   DW_AT_type        : <0xfd>
    <24d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><250>: Abbrev Number: 9 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x1124): _IO_write_ptr
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 58
    <257>   DW_AT_decl_column : 9
    <258>   DW_AT_type        : <0xfd>
    <25c>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25f>: Abbrev Number: 9 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x95a): _IO_write_end
    <264>   DW_AT_decl_file   : 7
    <265>   DW_AT_decl_line   : 59
    <266>   DW_AT_decl_column : 9
    <267>   DW_AT_type        : <0xfd>
    <26b>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><26e>: Abbrev Number: 9 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x9d7): _IO_buf_base
    <273>   DW_AT_decl_file   : 7
    <274>   DW_AT_decl_line   : 60
    <275>   DW_AT_decl_column : 9
    <276>   DW_AT_type        : <0xfd>
    <27a>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><27d>: Abbrev Number: 9 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0xe44): _IO_buf_end
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 61
    <284>   DW_AT_decl_column : 9
    <285>   DW_AT_type        : <0xfd>
    <289>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><28c>: Abbrev Number: 9 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0x1d8): _IO_save_base
    <291>   DW_AT_decl_file   : 7
    <292>   DW_AT_decl_line   : 64
    <293>   DW_AT_decl_column : 9
    <294>   DW_AT_type        : <0xfd>
    <298>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><29b>: Abbrev Number: 9 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0xd5e): _IO_backup_base
    <2a0>   DW_AT_decl_file   : 7
    <2a1>   DW_AT_decl_line   : 65
    <2a2>   DW_AT_decl_column : 9
    <2a3>   DW_AT_type        : <0xfd>
    <2a7>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2aa>: Abbrev Number: 9 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2af>   DW_AT_decl_file   : 7
    <2b0>   DW_AT_decl_line   : 66
    <2b1>   DW_AT_decl_column : 9
    <2b2>   DW_AT_type        : <0xfd>
    <2b6>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b9>: Abbrev Number: 9 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x640): _markers
    <2be>   DW_AT_decl_file   : 7
    <2bf>   DW_AT_decl_line   : 68
    <2c0>   DW_AT_decl_column : 22
    <2c1>   DW_AT_type        : <0x3d3>
    <2c5>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c8>: Abbrev Number: 9 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x21b): _chain
    <2cd>   DW_AT_decl_file   : 7
    <2ce>   DW_AT_decl_line   : 70
    <2cf>   DW_AT_decl_column : 20
    <2d0>   DW_AT_type        : <0x3d9>
    <2d4>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d7>: Abbrev Number: 9 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x1092): _fileno
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 72
    <2de>   DW_AT_decl_column : 7
    <2df>   DW_AT_type        : <0x64>
    <2e3>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e6>: Abbrev Number: 9 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x7e0): _flags2
    <2eb>   DW_AT_decl_file   : 7
    <2ec>   DW_AT_decl_line   : 73
    <2ed>   DW_AT_decl_column : 7
    <2ee>   DW_AT_type        : <0x64>
    <2f2>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : (indirect string, offset: 0x881): _old_offset
    <2fa>   DW_AT_decl_file   : 7
    <2fb>   DW_AT_decl_line   : 74
    <2fc>   DW_AT_decl_column : 11
    <2fd>   DW_AT_type        : <0xae>
    <301>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><304>: Abbrev Number: 9 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0x249): _cur_column
    <309>   DW_AT_decl_file   : 7
    <30a>   DW_AT_decl_line   : 77
    <30b>   DW_AT_decl_column : 18
    <30c>   DW_AT_type        : <0x24>
    <310>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><313>: Abbrev Number: 9 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0xefc): _vtable_offset
    <318>   DW_AT_decl_file   : 7
    <319>   DW_AT_decl_line   : 78
    <31a>   DW_AT_decl_column : 15
    <31b>   DW_AT_type        : <0x3e>
    <31f>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><322>: Abbrev Number: 9 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0xd6e): _shortbuf
    <327>   DW_AT_decl_file   : 7
    <328>   DW_AT_decl_line   : 79
    <329>   DW_AT_decl_column : 8
    <32a>   DW_AT_type        : <0x3df>
    <32e>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><331>: Abbrev Number: 9 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <336>   DW_AT_decl_file   : 7
    <337>   DW_AT_decl_line   : 81
    <338>   DW_AT_decl_column : 15
    <339>   DW_AT_type        : <0x3ef>
    <33d>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><340>: Abbrev Number: 9 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x713): _offset
    <345>   DW_AT_decl_file   : 7
    <346>   DW_AT_decl_line   : 89
    <347>   DW_AT_decl_column : 13
    <348>   DW_AT_type        : <0xba>
    <34c>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><34f>: Abbrev Number: 9 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0xaf7): _codecvt
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 91
    <356>   DW_AT_decl_column : 23
    <357>   DW_AT_type        : <0x3fb>
    <35b>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><35e>: Abbrev Number: 9 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x10b0): _wide_data
    <363>   DW_AT_decl_file   : 7
    <364>   DW_AT_decl_line   : 92
    <365>   DW_AT_decl_column : 25
    <366>   DW_AT_type        : <0x407>
    <36a>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36d>: Abbrev Number: 9 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x3e2): _freeres_list
    <372>   DW_AT_decl_file   : 7
    <373>   DW_AT_decl_line   : 93
    <374>   DW_AT_decl_column : 20
    <375>   DW_AT_type        : <0x3d9>
    <379>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37c>: Abbrev Number: 9 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xcd1): _freeres_buf
    <381>   DW_AT_decl_file   : 7
    <382>   DW_AT_decl_line   : 94
    <383>   DW_AT_decl_column : 9
    <384>   DW_AT_type        : <0xea>
    <388>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38b>: Abbrev Number: 9 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0xa46): __pad5
    <390>   DW_AT_decl_file   : 7
    <391>   DW_AT_decl_line   : 95
    <392>   DW_AT_decl_column : 10
    <393>   DW_AT_type        : <0x146>
    <397>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0x268): _mode
    <39f>   DW_AT_decl_file   : 7
    <3a0>   DW_AT_decl_line   : 96
    <3a1>   DW_AT_decl_column : 7
    <3a2>   DW_AT_type        : <0x64>
    <3a6>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3a9>: Abbrev Number: 9 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x820): _unused2
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 98
    <3b0>   DW_AT_decl_column : 8
    <3b1>   DW_AT_type        : <0x40d>
    <3b5>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3b8>: Abbrev Number: 0
 <1><3b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xb8b): FILE
    <3be>   DW_AT_decl_file   : 8
    <3bf>   DW_AT_decl_line   : 7
    <3c0>   DW_AT_decl_column : 25
    <3c1>   DW_AT_type        : <0x1f8>
 <1><3c5>: Abbrev Number: 13 (DW_TAG_typedef)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x49b): _IO_lock_t
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 43
    <3cc>   DW_AT_decl_column : 14
 <1><3cd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x30c): _IO_marker
    <3d2>   DW_AT_declaration : 1
 <1><3d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d4>   DW_AT_byte_size   : 4
    <3d5>   DW_AT_type        : <0x3cd>
 <1><3d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3da>   DW_AT_byte_size   : 4
    <3db>   DW_AT_type        : <0x1f8>
 <1><3df>: Abbrev Number: 15 (DW_TAG_array_type)
    <3e0>   DW_AT_type        : <0x103>
    <3e4>   DW_AT_sibling     : <0x3ef>
 <2><3e8>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3e9>   DW_AT_type        : <0x2b>
    <3ed>   DW_AT_upper_bound : 0
 <2><3ee>: Abbrev Number: 0
 <1><3ef>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f0>   DW_AT_byte_size   : 4
    <3f1>   DW_AT_type        : <0x3c5>
 <1><3f5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3fa>   DW_AT_declaration : 1
 <1><3fb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fc>   DW_AT_byte_size   : 4
    <3fd>   DW_AT_type        : <0x3f5>
 <1><401>: Abbrev Number: 14 (DW_TAG_structure_type)
    <402>   DW_AT_name        : (indirect string, offset: 0x376): _IO_wide_data
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x401>
 <1><40d>: Abbrev Number: 15 (DW_TAG_array_type)
    <40e>   DW_AT_type        : <0x103>
    <412>   DW_AT_sibling     : <0x41d>
 <2><416>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <417>   DW_AT_type        : <0x2b>
    <41b>   DW_AT_upper_bound : 39
 <2><41c>: Abbrev Number: 0
 <1><41d>: Abbrev Number: 11 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x5ec): stdin
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 137
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x42b>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <42c>   DW_AT_byte_size   : 4
    <42d>   DW_AT_type        : <0x3b9>
 <1><431>: Abbrev Number: 11 (DW_TAG_variable)
    <432>   DW_AT_name        : (indirect string, offset: 0x10f5): stdout
    <436>   DW_AT_decl_file   : 9
    <437>   DW_AT_decl_line   : 138
    <438>   DW_AT_decl_column : 14
    <439>   DW_AT_type        : <0x42b>
    <43d>   DW_AT_external    : 1
    <43e>   DW_AT_declaration : 1
 <1><43f>: Abbrev Number: 11 (DW_TAG_variable)
    <440>   DW_AT_name        : (indirect string, offset: 0xe92): stderr
    <444>   DW_AT_decl_file   : 9
    <445>   DW_AT_decl_line   : 139
    <446>   DW_AT_decl_column : 14
    <447>   DW_AT_type        : <0x42b>
    <44b>   DW_AT_external    : 1
    <44c>   DW_AT_declaration : 1
 <1><44d>: Abbrev Number: 11 (DW_TAG_variable)
    <44e>   DW_AT_name        : (indirect string, offset: 0x255): sys_nerr
    <452>   DW_AT_decl_file   : 10
    <453>   DW_AT_decl_line   : 26
    <454>   DW_AT_decl_column : 12
    <455>   DW_AT_type        : <0x64>
    <459>   DW_AT_external    : 1
    <45a>   DW_AT_declaration : 1
 <1><45b>: Abbrev Number: 15 (DW_TAG_array_type)
    <45c>   DW_AT_type        : <0x1ec>
    <460>   DW_AT_sibling     : <0x466>
 <2><464>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><465>: Abbrev Number: 0
 <1><466>: Abbrev Number: 3 (DW_TAG_const_type)
    <467>   DW_AT_type        : <0x45b>
 <1><46b>: Abbrev Number: 11 (DW_TAG_variable)
    <46c>   DW_AT_name        : (indirect string, offset: 0x5fb): sys_errlist
    <470>   DW_AT_decl_file   : 10
    <471>   DW_AT_decl_line   : 27
    <472>   DW_AT_decl_column : 26
    <473>   DW_AT_type        : <0x466>
    <477>   DW_AT_external    : 1
    <478>   DW_AT_declaration : 1
 <1><479>: Abbrev Number: 11 (DW_TAG_variable)
    <47a>   DW_AT_name        : (indirect string, offset: 0x26e): _sys_nerr
    <47e>   DW_AT_decl_file   : 10
    <47f>   DW_AT_decl_line   : 30
    <480>   DW_AT_decl_column : 12
    <481>   DW_AT_type        : <0x64>
    <485>   DW_AT_external    : 1
    <486>   DW_AT_declaration : 1
 <1><487>: Abbrev Number: 11 (DW_TAG_variable)
    <488>   DW_AT_name        : (indirect string, offset: 0xf0b): _sys_errlist
    <48c>   DW_AT_decl_file   : 10
    <48d>   DW_AT_decl_line   : 31
    <48e>   DW_AT_decl_column : 26
    <48f>   DW_AT_type        : <0x466>
    <493>   DW_AT_external    : 1
    <494>   DW_AT_declaration : 1
 <1><495>: Abbrev Number: 11 (DW_TAG_variable)
    <496>   DW_AT_name        : (indirect string, offset: 0x6ec): program_invocation_name
    <49a>   DW_AT_decl_file   : 11
    <49b>   DW_AT_decl_line   : 45
    <49c>   DW_AT_decl_column : 14
    <49d>   DW_AT_type        : <0xfd>
    <4a1>   DW_AT_external    : 1
    <4a2>   DW_AT_declaration : 1
 <1><4a3>: Abbrev Number: 11 (DW_TAG_variable)
    <4a4>   DW_AT_name        : (indirect string, offset: 0xc6f): program_invocation_short_name
    <4a8>   DW_AT_decl_file   : 11
    <4a9>   DW_AT_decl_line   : 46
    <4aa>   DW_AT_decl_column : 14
    <4ab>   DW_AT_type        : <0xfd>
    <4af>   DW_AT_external    : 1
    <4b0>   DW_AT_declaration : 1
 <1><4b1>: Abbrev Number: 15 (DW_TAG_array_type)
    <4b2>   DW_AT_type        : <0xfd>
    <4b6>   DW_AT_sibling     : <0x4c1>
 <2><4ba>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4bb>   DW_AT_type        : <0x2b>
    <4bf>   DW_AT_upper_bound : 1
 <2><4c0>: Abbrev Number: 0
 <1><4c1>: Abbrev Number: 11 (DW_TAG_variable)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x1c5): __tzname
    <4c6>   DW_AT_decl_file   : 12
    <4c7>   DW_AT_decl_line   : 159
    <4c8>   DW_AT_decl_column : 14
    <4c9>   DW_AT_type        : <0x4b1>
    <4cd>   DW_AT_external    : 1
    <4ce>   DW_AT_declaration : 1
 <1><4cf>: Abbrev Number: 11 (DW_TAG_variable)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xf83): __daylight
    <4d4>   DW_AT_decl_file   : 12
    <4d5>   DW_AT_decl_line   : 160
    <4d6>   DW_AT_decl_column : 12
    <4d7>   DW_AT_type        : <0x64>
    <4db>   DW_AT_external    : 1
    <4dc>   DW_AT_declaration : 1
 <1><4dd>: Abbrev Number: 11 (DW_TAG_variable)
    <4de>   DW_AT_name        : (indirect string, offset: 0x36b): __timezone
    <4e2>   DW_AT_decl_file   : 12
    <4e3>   DW_AT_decl_line   : 161
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x13f>
    <4e9>   DW_AT_external    : 1
    <4ea>   DW_AT_declaration : 1
 <1><4eb>: Abbrev Number: 11 (DW_TAG_variable)
    <4ec>   DW_AT_name        : (indirect string, offset: 0xa36): tzname
    <4f0>   DW_AT_decl_file   : 12
    <4f1>   DW_AT_decl_line   : 166
    <4f2>   DW_AT_decl_column : 14
    <4f3>   DW_AT_type        : <0x4b1>
    <4f7>   DW_AT_external    : 1
    <4f8>   DW_AT_declaration : 1
 <1><4f9>: Abbrev Number: 11 (DW_TAG_variable)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x116e): daylight
    <4fe>   DW_AT_decl_file   : 12
    <4ff>   DW_AT_decl_line   : 174
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x4e0): timezone
    <50c>   DW_AT_decl_file   : 12
    <50d>   DW_AT_decl_line   : 175
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x13f>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 10 (DW_TAG_variable)
    <516>   DW_AT_name        : (indirect string, offset: 0x102b): getdate_err
    <51a>   DW_AT_decl_file   : 12
    <51b>   DW_AT_decl_line   : 274
    <51d>   DW_AT_decl_column : 12
    <51e>   DW_AT_type        : <0x64>
    <522>   DW_AT_external    : 1
    <523>   DW_AT_declaration : 1
 <1><524>: Abbrev Number: 11 (DW_TAG_variable)
    <525>   DW_AT_name        : (indirect string, offset: 0xa52): debug_flag
    <529>   DW_AT_decl_file   : 13
    <52a>   DW_AT_decl_line   : 20
    <52b>   DW_AT_decl_column : 13
    <52c>   DW_AT_type        : <0x532>
    <530>   DW_AT_external    : 1
    <531>   DW_AT_declaration : 1
 <1><532>: Abbrev Number: 2 (DW_TAG_base_type)
    <533>   DW_AT_byte_size   : 1
    <534>   DW_AT_encoding    : 2	(boolean)
    <535>   DW_AT_name        : (indirect string, offset: 0x424): _Bool
 <1><539>: Abbrev Number: 3 (DW_TAG_const_type)
    <53a>   DW_AT_type        : <0x532>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0xb3b): __kernel_long_t
    <543>   DW_AT_decl_file   : 14
    <544>   DW_AT_decl_line   : 14
    <545>   DW_AT_decl_column : 19
    <546>   DW_AT_type        : <0x88>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x5db): __kernel_ulong_t
    <54f>   DW_AT_decl_file   : 14
    <550>   DW_AT_decl_line   : 15
    <551>   DW_AT_decl_column : 28
    <552>   DW_AT_type        : <0x9b>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x3f0): kernel_long_t
    <55b>   DW_AT_decl_file   : 15
    <55c>   DW_AT_decl_line   : 16
    <55d>   DW_AT_decl_column : 25
    <55e>   DW_AT_type        : <0x53e>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0x8ff): kernel_ulong_t
    <567>   DW_AT_decl_file   : 15
    <568>   DW_AT_decl_line   : 17
    <569>   DW_AT_decl_column : 26
    <56a>   DW_AT_type        : <0x54a>
 <1><56e>: Abbrev Number: 3 (DW_TAG_const_type)
    <56f>   DW_AT_type        : <0x562>
 <1><573>: Abbrev Number: 8 (DW_TAG_structure_type)
    <574>   DW_AT_name        : (indirect string, offset: 0xc8d): list_item
    <578>   DW_AT_byte_size   : 8
    <579>   DW_AT_decl_file   : 16
    <57a>   DW_AT_decl_line   : 92
    <57b>   DW_AT_decl_column : 8
    <57c>   DW_AT_sibling     : <0x59f>
 <2><580>: Abbrev Number: 9 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x11b3): prev
    <585>   DW_AT_decl_file   : 16
    <586>   DW_AT_decl_line   : 93
    <587>   DW_AT_decl_column : 20
    <588>   DW_AT_type        : <0x59f>
    <58c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58f>: Abbrev Number: 9 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x11a9): next
    <594>   DW_AT_decl_file   : 16
    <595>   DW_AT_decl_line   : 94
    <596>   DW_AT_decl_column : 20
    <597>   DW_AT_type        : <0x59f>
    <59b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59e>: Abbrev Number: 0
 <1><59f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a0>   DW_AT_byte_size   : 4
    <5a1>   DW_AT_type        : <0x573>
 <1><5a5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x8ce): sysent
    <5aa>   DW_AT_byte_size   : 20
    <5ab>   DW_AT_decl_file   : 17
    <5ac>   DW_AT_decl_line   : 13
    <5ad>   DW_AT_decl_column : 16
    <5ae>   DW_AT_sibling     : <0x5fe>
 <2><5b2>: Abbrev Number: 9 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x110c): nargs
    <5b7>   DW_AT_decl_file   : 17
    <5b8>   DW_AT_decl_line   : 14
    <5b9>   DW_AT_decl_column : 11
    <5ba>   DW_AT_type        : <0x2b>
    <5be>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c1>: Abbrev Number: 9 (DW_TAG_member)
    <5c2>   DW_AT_name        : (indirect string, offset: 0x9eb): sys_flags
    <5c6>   DW_AT_decl_file   : 17
    <5c7>   DW_AT_decl_line   : 15
    <5c8>   DW_AT_decl_column : 6
    <5c9>   DW_AT_type        : <0x64>
    <5cd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5d0>: Abbrev Number: 18 (DW_TAG_member)
    <5d1>   DW_AT_name        : sen
    <5d5>   DW_AT_decl_file   : 17
    <5d6>   DW_AT_decl_line   : 16
    <5d7>   DW_AT_decl_column : 6
    <5d8>   DW_AT_type        : <0x64>
    <5dc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5df>: Abbrev Number: 9 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x303): sys_func
    <5e4>   DW_AT_decl_file   : 17
    <5e5>   DW_AT_decl_line   : 17
    <5e6>   DW_AT_decl_column : 8
    <5e7>   DW_AT_type        : <0x87c>
    <5eb>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ee>: Abbrev Number: 9 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x278): sys_name
    <5f3>   DW_AT_decl_file   : 17
    <5f4>   DW_AT_decl_line   : 18
    <5f5>   DW_AT_decl_column : 14
    <5f6>   DW_AT_type        : <0x1e6>
    <5fa>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5fd>: Abbrev Number: 0
 <1><5fe>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5ff>   DW_AT_prototyped  : 1
    <600>   DW_AT_type        : <0x64>
    <604>   DW_AT_sibling     : <0x60e>
 <2><608>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <609>   DW_AT_type        : <0x60e>
 <2><60d>: Abbrev Number: 0
 <1><60e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60f>   DW_AT_byte_size   : 4
    <610>   DW_AT_type        : <0x619>
 <1><614>: Abbrev Number: 3 (DW_TAG_const_type)
    <615>   DW_AT_type        : <0x60e>
 <1><619>: Abbrev Number: 21 (DW_TAG_structure_type)
    <61a>   DW_AT_name        : tcb
    <61e>   DW_AT_byte_size   : 304
    <620>   DW_AT_decl_file   : 18
    <621>   DW_AT_decl_line   : 262
    <623>   DW_AT_decl_column : 8
    <624>   DW_AT_sibling     : <0x87c>
 <2><628>: Abbrev Number: 22 (DW_TAG_member)
    <629>   DW_AT_name        : (indirect string, offset: 0x4f8): flags
    <62d>   DW_AT_decl_file   : 18
    <62e>   DW_AT_decl_line   : 263
    <630>   DW_AT_decl_column : 6
    <631>   DW_AT_type        : <0x64>
    <635>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><638>: Abbrev Number: 23 (DW_TAG_member)
    <639>   DW_AT_name        : pid
    <63d>   DW_AT_decl_file   : 18
    <63e>   DW_AT_decl_line   : 264
    <640>   DW_AT_decl_column : 6
    <641>   DW_AT_type        : <0x64>
    <645>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><648>: Abbrev Number: 22 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <64d>   DW_AT_decl_file   : 18
    <64e>   DW_AT_decl_line   : 265
    <650>   DW_AT_decl_column : 6
    <651>   DW_AT_type        : <0x64>
    <655>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><658>: Abbrev Number: 22 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x398): currpers
    <65d>   DW_AT_decl_file   : 18
    <65e>   DW_AT_decl_line   : 267
    <660>   DW_AT_decl_column : 15
    <661>   DW_AT_type        : <0x2b>
    <665>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><668>: Abbrev Number: 22 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0xbdd): u_error
    <66d>   DW_AT_decl_file   : 18
    <66e>   DW_AT_decl_line   : 269
    <670>   DW_AT_decl_column : 16
    <671>   DW_AT_type        : <0x37>
    <675>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><678>: Abbrev Number: 22 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <67d>   DW_AT_decl_file   : 18
    <67e>   DW_AT_decl_line   : 270
    <680>   DW_AT_decl_column : 17
    <681>   DW_AT_type        : <0x562>
    <685>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><688>: Abbrev Number: 22 (DW_TAG_member)
    <689>   DW_AT_name        : (indirect string, offset: 0xc16): true_scno
    <68d>   DW_AT_decl_file   : 18
    <68e>   DW_AT_decl_line   : 271
    <690>   DW_AT_decl_column : 17
    <691>   DW_AT_type        : <0x562>
    <695>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><698>: Abbrev Number: 22 (DW_TAG_member)
    <699>   DW_AT_name        : (indirect string, offset: 0x1af): u_arg
    <69d>   DW_AT_decl_file   : 18
    <69e>   DW_AT_decl_line   : 272
    <6a0>   DW_AT_decl_column : 17
    <6a1>   DW_AT_type        : <0x9ac>
    <6a5>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6a8>: Abbrev Number: 22 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xa02): u_rval
    <6ad>   DW_AT_decl_file   : 18
    <6ae>   DW_AT_decl_line   : 273
    <6b0>   DW_AT_decl_column : 16
    <6b1>   DW_AT_type        : <0x556>
    <6b5>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6b8>: Abbrev Number: 22 (DW_TAG_member)
    <6b9>   DW_AT_name        : (indirect string, offset: 0xb57): sys_func_rval
    <6bd>   DW_AT_decl_file   : 18
    <6be>   DW_AT_decl_line   : 274
    <6c0>   DW_AT_decl_column : 6
    <6c1>   DW_AT_type        : <0x64>
    <6c5>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6c8>: Abbrev Number: 22 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0xd88): curcol
    <6cd>   DW_AT_decl_file   : 18
    <6ce>   DW_AT_decl_line   : 275
    <6d0>   DW_AT_decl_column : 6
    <6d1>   DW_AT_type        : <0x64>
    <6d5>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6d8>: Abbrev Number: 22 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0xa14): outf
    <6dd>   DW_AT_decl_file   : 18
    <6de>   DW_AT_decl_line   : 276
    <6e0>   DW_AT_decl_column : 8
    <6e1>   DW_AT_type        : <0x42b>
    <6e5>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6e8>: Abbrev Number: 22 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0xfc2): staged_output_data
    <6ed>   DW_AT_decl_file   : 18
    <6ee>   DW_AT_decl_line   : 277
    <6f0>   DW_AT_decl_column : 29
    <6f1>   DW_AT_type        : <0x9c2>
    <6f5>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6f8>: Abbrev Number: 22 (DW_TAG_member)
    <6f9>   DW_AT_name        : (indirect string, offset: 0xb22): auxstr
    <6fd>   DW_AT_decl_file   : 18
    <6fe>   DW_AT_decl_line   : 279
    <700>   DW_AT_decl_column : 14
    <701>   DW_AT_type        : <0x1e6>
    <705>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><708>: Abbrev Number: 22 (DW_TAG_member)
    <709>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <70d>   DW_AT_decl_file   : 18
    <70e>   DW_AT_decl_line   : 280
    <710>   DW_AT_decl_column : 8
    <711>   DW_AT_type        : <0xea>
    <715>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><718>: Abbrev Number: 22 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0xcba): _free_priv_data
    <71d>   DW_AT_decl_file   : 18
    <71e>   DW_AT_decl_line   : 281
    <720>   DW_AT_decl_column : 9
    <721>   DW_AT_type        : <0x9d4>
    <725>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><728>: Abbrev Number: 22 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <72d>   DW_AT_decl_file   : 18
    <72e>   DW_AT_decl_line   : 282
    <730>   DW_AT_decl_column : 23
    <731>   DW_AT_type        : <0x9da>
    <735>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><738>: Abbrev Number: 22 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <73d>   DW_AT_decl_file   : 18
    <73e>   DW_AT_decl_line   : 285
    <740>   DW_AT_decl_column : 23
    <741>   DW_AT_type        : <0x9da>
    <745>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><749>: Abbrev Number: 22 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x38d): inject_vec
    <74e>   DW_AT_decl_file   : 18
    <74f>   DW_AT_decl_line   : 286
    <751>   DW_AT_decl_column : 22
    <752>   DW_AT_type        : <0x9e5>
    <756>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x835): stime
    <75f>   DW_AT_decl_file   : 18
    <760>   DW_AT_decl_line   : 287
    <762>   DW_AT_decl_column : 18
    <763>   DW_AT_type        : <0x157>
    <767>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><76b>: Abbrev Number: 22 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x3a1): ltime
    <770>   DW_AT_decl_file   : 18
    <771>   DW_AT_decl_line   : 288
    <773>   DW_AT_decl_column : 18
    <774>   DW_AT_type        : <0x157>
    <778>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><77c>: Abbrev Number: 22 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x10d3): atime
    <781>   DW_AT_decl_file   : 18
    <782>   DW_AT_decl_line   : 289
    <784>   DW_AT_decl_column : 18
    <785>   DW_AT_type        : <0x157>
    <789>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><78d>: Abbrev Number: 22 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x4e9): etime
    <792>   DW_AT_decl_file   : 18
    <793>   DW_AT_decl_line   : 290
    <795>   DW_AT_decl_column : 18
    <796>   DW_AT_type        : <0x157>
    <79a>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><79e>: Abbrev Number: 22 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0xe01): delay_expiration_time
    <7a3>   DW_AT_decl_file   : 18
    <7a4>   DW_AT_decl_line   : 291
    <7a6>   DW_AT_decl_column : 18
    <7a7>   DW_AT_type        : <0x157>
    <7ab>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7af>: Abbrev Number: 22 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7b4>   DW_AT_decl_file   : 18
    <7b5>   DW_AT_decl_line   : 298
    <7b7>   DW_AT_decl_column : 15
    <7b8>   DW_AT_type        : <0x2b>
    <7bc>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7c0>: Abbrev Number: 22 (DW_TAG_member)
    <7c1>   DW_AT_name        : (indirect string, offset: 0x1011): last_dirfd
    <7c5>   DW_AT_decl_file   : 18
    <7c6>   DW_AT_decl_line   : 301
    <7c8>   DW_AT_decl_column : 6
    <7c9>   DW_AT_type        : <0x64>
    <7cd>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7d1>: Abbrev Number: 22 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x1037): mmap_cache
    <7d6>   DW_AT_decl_file   : 18
    <7d7>   DW_AT_decl_line   : 304
    <7d9>   DW_AT_decl_column : 23
    <7da>   DW_AT_type        : <0xa01>
    <7de>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7e2>: Abbrev Number: 22 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xbec): wait_data_idx
    <7e7>   DW_AT_decl_file   : 18
    <7e8>   DW_AT_decl_line   : 311
    <7ea>   DW_AT_decl_column : 9
    <7eb>   DW_AT_type        : <0x146>
    <7ef>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7f3>: Abbrev Number: 22 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0xb29): delayed_wait_data
    <7f8>   DW_AT_decl_file   : 18
    <7f9>   DW_AT_decl_line   : 313
    <7fb>   DW_AT_decl_column : 24
    <7fc>   DW_AT_type        : <0xa0d>
    <800>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><804>: Abbrev Number: 22 (DW_TAG_member)
    <805>   DW_AT_name        : (indirect string, offset: 0xb9e): wait_list
    <809>   DW_AT_decl_file   : 18
    <80a>   DW_AT_decl_line   : 314
    <80c>   DW_AT_decl_column : 19
    <80d>   DW_AT_type        : <0x573>
    <811>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><815>: Abbrev Number: 22 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x704): vcpu_info_list
    <81a>   DW_AT_decl_file   : 18
    <81b>   DW_AT_decl_line   : 318
    <81d>   DW_AT_decl_column : 20
    <81e>   DW_AT_type        : <0xa19>
    <822>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><826>: Abbrev Number: 22 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0xd53): unwind_ctx
    <82b>   DW_AT_decl_file   : 18
    <82c>   DW_AT_decl_line   : 322
    <82e>   DW_AT_decl_column : 8
    <82f>   DW_AT_type        : <0xea>
    <833>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><837>: Abbrev Number: 22 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0x4d3): unwind_queue
    <83c>   DW_AT_decl_file   : 18
    <83d>   DW_AT_decl_line   : 323
    <83f>   DW_AT_decl_column : 25
    <840>   DW_AT_type        : <0xa25>
    <844>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><848>: Abbrev Number: 22 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <84d>   DW_AT_decl_file   : 18
    <84e>   DW_AT_decl_line   : 327
    <850>   DW_AT_decl_column : 7
    <851>   DW_AT_type        : <0xa2b>
    <855>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><859>: Abbrev Number: 22 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x22b): start_prc
    <85e>   DW_AT_decl_file   : 18
    <85f>   DW_AT_decl_line   : 329
    <861>   DW_AT_decl_column : 16
    <862>   DW_AT_type        : <0x37>
    <866>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><86a>: Abbrev Number: 22 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x10a7): pre_comm
    <86f>   DW_AT_decl_file   : 18
    <870>   DW_AT_decl_line   : 330
    <872>   DW_AT_decl_column : 7
    <873>   DW_AT_type        : <0xa2b>
    <877>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><87b>: Abbrev Number: 0
 <1><87c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <87d>   DW_AT_byte_size   : 4
    <87e>   DW_AT_type        : <0x5fe>
 <1><882>: Abbrev Number: 4 (DW_TAG_typedef)
    <883>   DW_AT_name        : (indirect string, offset: 0x5cd): struct_sysent
    <887>   DW_AT_decl_file   : 17
    <888>   DW_AT_decl_line   : 19
    <889>   DW_AT_decl_column : 3
    <88a>   DW_AT_type        : <0x5a5>
 <1><88e>: Abbrev Number: 3 (DW_TAG_const_type)
    <88f>   DW_AT_type        : <0x882>
 <1><893>: Abbrev Number: 11 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0xded): current_personality
    <898>   DW_AT_decl_file   : 18
    <899>   DW_AT_decl_line   : 158
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x2b>
    <89f>   DW_AT_external    : 1
    <8a0>   DW_AT_declaration : 1
 <1><8a1>: Abbrev Number: 11 (DW_TAG_variable)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x866): current_wordsize
    <8a6>   DW_AT_decl_file   : 18
    <8a7>   DW_AT_decl_line   : 171
    <8a8>   DW_AT_decl_column : 17
    <8a9>   DW_AT_type        : <0x2b>
    <8ad>   DW_AT_external    : 1
    <8ae>   DW_AT_declaration : 1
 <1><8af>: Abbrev Number: 11 (DW_TAG_variable)
    <8b0>   DW_AT_name        : (indirect string, offset: 0xb00): current_klongsize
    <8b4>   DW_AT_decl_file   : 18
    <8b5>   DW_AT_decl_line   : 176
    <8b6>   DW_AT_decl_column : 17
    <8b7>   DW_AT_type        : <0x2b>
    <8bb>   DW_AT_external    : 1
    <8bc>   DW_AT_declaration : 1
 <1><8bd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8be>   DW_AT_name        : (indirect string, offset: 0xd2a): ioctlent
    <8c2>   DW_AT_byte_size   : 8
    <8c3>   DW_AT_decl_file   : 18
    <8c4>   DW_AT_decl_line   : 217
    <8c5>   DW_AT_decl_column : 16
    <8c6>   DW_AT_sibling     : <0x8e9>
 <2><8ca>: Abbrev Number: 9 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xff5): symbol
    <8cf>   DW_AT_decl_file   : 18
    <8d0>   DW_AT_decl_line   : 218
    <8d1>   DW_AT_decl_column : 14
    <8d2>   DW_AT_type        : <0x1e6>
    <8d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d9>: Abbrev Number: 9 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0xdac): code
    <8de>   DW_AT_decl_file   : 18
    <8df>   DW_AT_decl_line   : 219
    <8e0>   DW_AT_decl_column : 15
    <8e1>   DW_AT_type        : <0x2b>
    <8e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e8>: Abbrev Number: 0
 <1><8e9>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ea>   DW_AT_name        : (indirect string, offset: 0xceb): struct_ioctlent
    <8ee>   DW_AT_decl_file   : 18
    <8ef>   DW_AT_decl_line   : 220
    <8f0>   DW_AT_decl_column : 3
    <8f1>   DW_AT_type        : <0x8bd>
 <1><8f5>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f6>   DW_AT_type        : <0x8e9>
 <1><8fa>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x85a): inject_data
    <8ff>   DW_AT_byte_size   : 10
    <900>   DW_AT_decl_file   : 18
    <901>   DW_AT_decl_line   : 241
    <902>   DW_AT_decl_column : 8
    <903>   DW_AT_sibling     : <0x962>
 <2><907>: Abbrev Number: 9 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0x4f8): flags
    <90c>   DW_AT_decl_file   : 18
    <90d>   DW_AT_decl_line   : 242
    <90e>   DW_AT_decl_column : 10
    <90f>   DW_AT_type        : <0x10f>
    <913>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><916>: Abbrev Number: 9 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0x98c): signo
    <91b>   DW_AT_decl_file   : 18
    <91c>   DW_AT_decl_line   : 243
    <91d>   DW_AT_decl_column : 10
    <91e>   DW_AT_type        : <0x10f>
    <922>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><925>: Abbrev Number: 9 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <92a>   DW_AT_decl_file   : 18
    <92b>   DW_AT_decl_line   : 244
    <92c>   DW_AT_decl_column : 11
    <92d>   DW_AT_type        : <0x11b>
    <931>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><934>: Abbrev Number: 9 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0xd7e): delay_idx
    <939>   DW_AT_decl_file   : 18
    <93a>   DW_AT_decl_line   : 245
    <93b>   DW_AT_decl_column : 11
    <93c>   DW_AT_type        : <0x11b>
    <940>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><943>: Abbrev Number: 9 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0x632): poke_idx
    <948>   DW_AT_decl_file   : 18
    <949>   DW_AT_decl_line   : 246
    <94a>   DW_AT_decl_column : 11
    <94b>   DW_AT_type        : <0x11b>
    <94f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><952>: Abbrev Number: 9 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <957>   DW_AT_decl_file   : 18
    <958>   DW_AT_decl_line   : 247
    <959>   DW_AT_decl_column : 11
    <95a>   DW_AT_type        : <0x11b>
    <95e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><961>: Abbrev Number: 0
 <1><962>: Abbrev Number: 8 (DW_TAG_structure_type)
    <963>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <967>   DW_AT_byte_size   : 16
    <968>   DW_AT_decl_file   : 18
    <969>   DW_AT_decl_line   : 250
    <96a>   DW_AT_decl_column : 8
    <96b>   DW_AT_sibling     : <0x9ac>
 <2><96f>: Abbrev Number: 9 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0xabf): first
    <974>   DW_AT_decl_file   : 18
    <975>   DW_AT_decl_line   : 251
    <976>   DW_AT_decl_column : 11
    <977>   DW_AT_type        : <0x11b>
    <97b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><97e>: Abbrev Number: 9 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0x11e5): last
    <983>   DW_AT_decl_file   : 18
    <984>   DW_AT_decl_line   : 252
    <985>   DW_AT_decl_column : 11
    <986>   DW_AT_type        : <0x11b>
    <98a>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><98d>: Abbrev Number: 9 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0x3a7): step
    <992>   DW_AT_decl_file   : 18
    <993>   DW_AT_decl_line   : 253
    <994>   DW_AT_decl_column : 11
    <995>   DW_AT_type        : <0x11b>
    <999>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><99c>: Abbrev Number: 9 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0x11ae): data
    <9a1>   DW_AT_decl_file   : 18
    <9a2>   DW_AT_decl_line   : 254
    <9a3>   DW_AT_decl_column : 21
    <9a4>   DW_AT_type        : <0x8fa>
    <9a8>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ad>   DW_AT_type        : <0x562>
    <9b1>   DW_AT_sibling     : <0x9bc>
 <2><9b5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9b6>   DW_AT_type        : <0x2b>
    <9ba>   DW_AT_upper_bound : 5
 <2><9bb>: Abbrev Number: 0
 <1><9bc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9bd>   DW_AT_name        : (indirect string, offset: 0xfc2): staged_output_data
    <9c1>   DW_AT_declaration : 1
 <1><9c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c3>   DW_AT_byte_size   : 4
    <9c4>   DW_AT_type        : <0x9bc>
 <1><9c8>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9c9>   DW_AT_prototyped  : 1
    <9ca>   DW_AT_sibling     : <0x9d4>
 <2><9ce>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9cf>   DW_AT_type        : <0xea>
 <2><9d3>: Abbrev Number: 0
 <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9c8>
 <1><9da>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9db>   DW_AT_byte_size   : 4
    <9dc>   DW_AT_type        : <0x88e>
 <1><9e0>: Abbrev Number: 3 (DW_TAG_const_type)
    <9e1>   DW_AT_type        : <0x9da>
 <1><9e5>: Abbrev Number: 15 (DW_TAG_array_type)
    <9e6>   DW_AT_type        : <0x9f5>
    <9ea>   DW_AT_sibling     : <0x9f5>
 <2><9ee>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9ef>   DW_AT_type        : <0x2b>
    <9f3>   DW_AT_upper_bound : 2
 <2><9f4>: Abbrev Number: 0
 <1><9f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f6>   DW_AT_byte_size   : 4
    <9f7>   DW_AT_type        : <0x962>
 <1><9fb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <a00>   DW_AT_declaration : 1
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9fb>
 <1><a07>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a08>   DW_AT_name        : (indirect string, offset: 0x3d4): tcb_wait_data
    <a0c>   DW_AT_declaration : 1
 <1><a0d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0xa07>
 <1><a13>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a14>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <a18>   DW_AT_declaration : 1
 <1><a19>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1a>   DW_AT_byte_size   : 4
    <a1b>   DW_AT_type        : <0xa13>
 <1><a1f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a20>   DW_AT_name        : (indirect string, offset: 0xfa6): unwind_queue_t
    <a24>   DW_AT_declaration : 1
 <1><a25>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_type        : <0xa1f>
 <1><a2b>: Abbrev Number: 15 (DW_TAG_array_type)
    <a2c>   DW_AT_type        : <0x103>
    <a30>   DW_AT_sibling     : <0xa3b>
 <2><a34>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a35>   DW_AT_type        : <0x2b>
    <a39>   DW_AT_upper_bound : 15
 <2><a3a>: Abbrev Number: 0
 <1><a3b>: Abbrev Number: 10 (DW_TAG_variable)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xc29): stub_sysent
    <a40>   DW_AT_decl_file   : 18
    <a41>   DW_AT_decl_line   : 405
    <a43>   DW_AT_decl_column : 28
    <a44>   DW_AT_type        : <0x88e>
    <a48>   DW_AT_external    : 1
    <a49>   DW_AT_declaration : 1
 <1><a4a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x1191): xlat_type
    <a4f>   DW_AT_encoding    : 7	(unsigned)
    <a50>   DW_AT_byte_size   : 4
    <a51>   DW_AT_type        : <0x2b>
    <a55>   DW_AT_decl_file   : 19
    <a56>   DW_AT_decl_line   : 13
    <a57>   DW_AT_decl_column : 6
    <a58>   DW_AT_sibling     : <0xa6f>
 <2><a5c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x2d3): XT_NORMAL
    <a61>   DW_AT_const_value : 0
 <2><a62>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a63>   DW_AT_name        : (indirect string, offset: 0xd02): XT_SORTED
    <a67>   DW_AT_const_value : 1
 <2><a68>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a69>   DW_AT_name        : (indirect string, offset: 0xe79): XT_INDEXED
    <a6d>   DW_AT_const_value : 2
 <2><a6e>: Abbrev Number: 0
 <1><a6f>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a70>   DW_AT_name        : (indirect string, offset: 0xc64): xlat_style
    <a74>   DW_AT_encoding    : 7	(unsigned)
    <a75>   DW_AT_byte_size   : 4
    <a76>   DW_AT_type        : <0x2b>
    <a7a>   DW_AT_decl_file   : 19
    <a7b>   DW_AT_decl_line   : 19
    <a7c>   DW_AT_decl_column : 6
    <a7d>   DW_AT_sibling     : <0xaac>
 <2><a81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a86>   DW_AT_const_value : 0
 <2><a87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0xc97): XLAT_STYLE_RAW
    <a8c>   DW_AT_const_value : 1
 <2><a8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x115c): XLAT_STYLE_ABBREV
    <a92>   DW_AT_const_value : 2
 <2><a93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0x2f0): XLAT_STYLE_VERBOSE
    <a98>   DW_AT_const_value : 3
 <2><a99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a9e>   DW_AT_const_value : 0
 <2><a9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <aa4>   DW_AT_const_value : 4
 <2><aa5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x11cb): XLAT_STYLE_FMT_D
    <aaa>   DW_AT_const_value : 8
 <2><aab>: Abbrev Number: 0
 <1><aac>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aad>   DW_AT_name        : (indirect string, offset: 0x321): xlat_data
    <ab1>   DW_AT_byte_size   : 16
    <ab2>   DW_AT_decl_file   : 19
    <ab3>   DW_AT_decl_line   : 51
    <ab4>   DW_AT_decl_column : 8
    <ab5>   DW_AT_sibling     : <0xad8>
 <2><ab9>: Abbrev Number: 18 (DW_TAG_member)
    <aba>   DW_AT_name        : val
    <abe>   DW_AT_decl_file   : 19
    <abf>   DW_AT_decl_line   : 52
    <ac0>   DW_AT_decl_column : 11
    <ac1>   DW_AT_type        : <0x133>
    <ac5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac8>: Abbrev Number: 18 (DW_TAG_member)
    <ac9>   DW_AT_name        : str
    <acd>   DW_AT_decl_file   : 19
    <ace>   DW_AT_decl_line   : 53
    <acf>   DW_AT_decl_column : 14
    <ad0>   DW_AT_type        : <0x1e6>
    <ad4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad7>: Abbrev Number: 0
 <1><ad8>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad9>   DW_AT_type        : <0xaac>
 <1><add>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ade>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ae2>   DW_AT_byte_size   : 24
    <ae3>   DW_AT_decl_file   : 19
    <ae4>   DW_AT_decl_line   : 56
    <ae5>   DW_AT_decl_column : 8
    <ae6>   DW_AT_sibling     : <0xb36>
 <2><aea>: Abbrev Number: 9 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x11ae): data
    <aef>   DW_AT_decl_file   : 19
    <af0>   DW_AT_decl_line   : 57
    <af1>   DW_AT_decl_column : 26
    <af2>   DW_AT_type        : <0xb3b>
    <af6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af9>: Abbrev Number: 9 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x8c2): flags_strsz
    <afe>   DW_AT_decl_file   : 19
    <aff>   DW_AT_decl_line   : 58
    <b00>   DW_AT_decl_column : 9
    <b01>   DW_AT_type        : <0x146>
    <b05>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b08>: Abbrev Number: 9 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0xbfa): size
    <b0d>   DW_AT_decl_file   : 19
    <b0e>   DW_AT_decl_line   : 59
    <b0f>   DW_AT_decl_column : 11
    <b10>   DW_AT_type        : <0x127>
    <b14>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b17>: Abbrev Number: 9 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x1aa): type
    <b1c>   DW_AT_decl_file   : 19
    <b1d>   DW_AT_decl_line   : 60
    <b1e>   DW_AT_decl_column : 17
    <b1f>   DW_AT_type        : <0xa4a>
    <b23>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b26>: Abbrev Number: 9 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0x762): flags_mask
    <b2b>   DW_AT_decl_file   : 19
    <b2c>   DW_AT_decl_line   : 61
    <b2d>   DW_AT_decl_column : 11
    <b2e>   DW_AT_type        : <0x133>
    <b32>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b35>: Abbrev Number: 0
 <1><b36>: Abbrev Number: 3 (DW_TAG_const_type)
    <b37>   DW_AT_type        : <0xadd>
 <1><b3b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b3c>   DW_AT_byte_size   : 4
    <b3d>   DW_AT_type        : <0xad8>
 <1><b41>: Abbrev Number: 15 (DW_TAG_array_type)
    <b42>   DW_AT_type        : <0xb36>
    <b46>   DW_AT_sibling     : <0xb4c>
 <2><b4a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b4b>: Abbrev Number: 0
 <1><b4c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b4d>   DW_AT_type        : <0xb41>
 <1><b51>: Abbrev Number: 10 (DW_TAG_variable)
    <b52>   DW_AT_name        : (indirect string, offset: 0xee9): addrfams
    <b56>   DW_AT_decl_file   : 18
    <b57>   DW_AT_decl_line   : 411
    <b59>   DW_AT_decl_column : 26
    <b5a>   DW_AT_type        : <0xb4c>
    <b5e>   DW_AT_external    : 1
    <b5f>   DW_AT_declaration : 1
 <1><b60>: Abbrev Number: 10 (DW_TAG_variable)
    <b61>   DW_AT_name        : (indirect string, offset: 0xdbc): arp_hardware_types
    <b65>   DW_AT_decl_file   : 18
    <b66>   DW_AT_decl_line   : 412
    <b68>   DW_AT_decl_column : 26
    <b69>   DW_AT_type        : <0xb4c>
    <b6d>   DW_AT_external    : 1
    <b6e>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 10 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0x10d9): at_flags
    <b74>   DW_AT_decl_file   : 18
    <b75>   DW_AT_decl_line   : 413
    <b77>   DW_AT_decl_column : 26
    <b78>   DW_AT_type        : <0xb4c>
    <b7c>   DW_AT_external    : 1
    <b7d>   DW_AT_declaration : 1
 <1><b7e>: Abbrev Number: 10 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x4b1): clocknames
    <b83>   DW_AT_decl_file   : 18
    <b84>   DW_AT_decl_line   : 414
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb4c>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 10 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x109a): dirent_types
    <b92>   DW_AT_decl_file   : 18
    <b93>   DW_AT_decl_line   : 415
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb4c>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 10 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x91c): ethernet_protocols
    <ba1>   DW_AT_decl_file   : 18
    <ba2>   DW_AT_decl_line   : 416
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb4c>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 10 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x685): inet_protocols
    <bb0>   DW_AT_decl_file   : 18
    <bb1>   DW_AT_decl_line   : 417
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb4c>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 10 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x2c0): evdev_abs
    <bbf>   DW_AT_decl_file   : 18
    <bc0>   DW_AT_decl_line   : 418
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb4c>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 10 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0x757): audit_arch
    <bce>   DW_AT_decl_file   : 18
    <bcf>   DW_AT_decl_line   : 419
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb4c>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 10 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bdd>   DW_AT_decl_file   : 18
    <bde>   DW_AT_decl_line   : 420
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb4c>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 10 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x492): iffflags
    <bec>   DW_AT_decl_file   : 18
    <bed>   DW_AT_decl_line   : 421
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb4c>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 10 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xca6): ip_type_of_services
    <bfb>   DW_AT_decl_file   : 18
    <bfc>   DW_AT_decl_line   : 422
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb4c>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 10 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0x6e0): ipc_private
    <c0a>   DW_AT_decl_file   : 18
    <c0b>   DW_AT_decl_line   : 423
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb4c>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 10 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0x317): msg_flags
    <c19>   DW_AT_decl_file   : 18
    <c1a>   DW_AT_decl_line   : 424
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb4c>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 10 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c28>   DW_AT_decl_file   : 18
    <c29>   DW_AT_decl_line   : 425
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb4c>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 10 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0xfd5): nl_bridge_vlan_flags
    <c37>   DW_AT_decl_file   : 18
    <c38>   DW_AT_decl_line   : 426
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb4c>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 10 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0xe62): nl_netfilter_msg_types
    <c46>   DW_AT_decl_file   : 18
    <c47>   DW_AT_decl_line   : 427
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb4c>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 10 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0x46d): nl_route_types
    <c55>   DW_AT_decl_file   : 18
    <c56>   DW_AT_decl_line   : 428
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb4c>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 10 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xf27): open_access_modes
    <c64>   DW_AT_decl_file   : 18
    <c65>   DW_AT_decl_line   : 429
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb4c>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 10 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c73>   DW_AT_decl_file   : 18
    <c74>   DW_AT_decl_line   : 430
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb4c>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 10 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0xcde): perf_type_id
    <c82>   DW_AT_decl_file   : 18
    <c83>   DW_AT_decl_line   : 431
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb4c>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 10 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xef2): pollflags
    <c91>   DW_AT_decl_file   : 18
    <c92>   DW_AT_decl_line   : 432
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb4c>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 10 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x626): ptrace_cmds
    <ca0>   DW_AT_decl_file   : 18
    <ca1>   DW_AT_decl_line   : 433
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb4c>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 10 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0x84b): resource_flags
    <caf>   DW_AT_decl_file   : 18
    <cb0>   DW_AT_decl_line   : 434
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb4c>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 10 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0x296): route_nexthop_flags
    <cbe>   DW_AT_decl_file   : 18
    <cbf>   DW_AT_decl_line   : 435
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb4c>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 10 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0xf50): routing_protocols
    <ccd>   DW_AT_decl_file   : 18
    <cce>   DW_AT_decl_line   : 436
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb4c>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 10 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x483): routing_scopes
    <cdc>   DW_AT_decl_file   : 18
    <cdd>   DW_AT_decl_line   : 437
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb4c>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 10 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0xe50): routing_table_ids
    <ceb>   DW_AT_decl_file   : 18
    <cec>   DW_AT_decl_line   : 438
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb4c>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 10 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x6bd): routing_types
    <cfa>   DW_AT_decl_file   : 18
    <cfb>   DW_AT_decl_line   : 439
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb4c>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 10 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x1ce): rwf_flags
    <d09>   DW_AT_decl_file   : 18
    <d0a>   DW_AT_decl_line   : 440
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb4c>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 10 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0x88d): seccomp_filter_flags
    <d18>   DW_AT_decl_file   : 18
    <d19>   DW_AT_decl_line   : 441
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb4c>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 10 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0x2dd): seccomp_ret_action
    <d27>   DW_AT_decl_file   : 18
    <d28>   DW_AT_decl_line   : 442
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb4c>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 10 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0x43e): setns_types
    <d36>   DW_AT_decl_file   : 18
    <d37>   DW_AT_decl_line   : 443
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb4c>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 10 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0xede): sg_io_info
    <d45>   DW_AT_decl_file   : 18
    <d46>   DW_AT_decl_line   : 444
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb4c>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 10 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0xc3d): socketlayers
    <d54>   DW_AT_decl_file   : 18
    <d55>   DW_AT_decl_line   : 445
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb4c>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 10 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0xe3a): socktypes
    <d63>   DW_AT_decl_file   : 18
    <d64>   DW_AT_decl_line   : 446
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb4c>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 10 (DW_TAG_variable)
    <d6e>   DW_AT_name        : (indirect string, offset: 0xb12): tcp_state_flags
    <d72>   DW_AT_decl_file   : 18
    <d73>   DW_AT_decl_line   : 447
    <d75>   DW_AT_decl_column : 26
    <d76>   DW_AT_type        : <0xb4c>
    <d7a>   DW_AT_external    : 1
    <d7b>   DW_AT_declaration : 1
 <1><d7c>: Abbrev Number: 10 (DW_TAG_variable)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x78c): tcp_states
    <d81>   DW_AT_decl_file   : 18
    <d82>   DW_AT_decl_line   : 448
    <d84>   DW_AT_decl_column : 26
    <d85>   DW_AT_type        : <0xb4c>
    <d89>   DW_AT_external    : 1
    <d8a>   DW_AT_declaration : 1
 <1><d8b>: Abbrev Number: 10 (DW_TAG_variable)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x113f): whence_codes
    <d90>   DW_AT_decl_file   : 18
    <d91>   DW_AT_decl_line   : 449
    <d93>   DW_AT_decl_column : 26
    <d94>   DW_AT_type        : <0xb4c>
    <d98>   DW_AT_external    : 1
    <d99>   DW_AT_declaration : 1
 <1><d9a>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d9b>   DW_AT_encoding    : 7	(unsigned)
    <d9c>   DW_AT_byte_size   : 4
    <d9d>   DW_AT_type        : <0x2b>
    <da1>   DW_AT_decl_file   : 18
    <da2>   DW_AT_decl_line   : 510
    <da4>   DW_AT_decl_column : 14
    <da5>   DW_AT_sibling     : <0xdbc>
 <2><da9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0xa09): CFLAG_NONE
    <dae>   DW_AT_const_value : 0
 <2><daf>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x92f): CFLAG_ONLY_STATS
    <db4>   DW_AT_const_value : 1
 <2><db5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0xc4a): CFLAG_BOTH
    <dba>   DW_AT_const_value : 2
 <2><dbb>: Abbrev Number: 0
 <1><dbc>: Abbrev Number: 28 (DW_TAG_typedef)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x11ea): cflag_t
    <dc1>   DW_AT_decl_file   : 18
    <dc2>   DW_AT_decl_line   : 514
    <dc4>   DW_AT_decl_column : 3
    <dc5>   DW_AT_type        : <0xd9a>
 <1><dc9>: Abbrev Number: 10 (DW_TAG_variable)
    <dca>   DW_AT_name        : (indirect string, offset: 0xd78): cflag
    <dce>   DW_AT_decl_file   : 18
    <dcf>   DW_AT_decl_line   : 515
    <dd1>   DW_AT_decl_column : 16
    <dd2>   DW_AT_type        : <0xdbc>
    <dd6>   DW_AT_external    : 1
    <dd7>   DW_AT_declaration : 1
 <1><dd8>: Abbrev Number: 10 (DW_TAG_variable)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <ddd>   DW_AT_decl_file   : 18
    <dde>   DW_AT_decl_line   : 516
    <de0>   DW_AT_decl_column : 13
    <de1>   DW_AT_type        : <0x532>
    <de5>   DW_AT_external    : 1
    <de6>   DW_AT_declaration : 1
 <1><de7>: Abbrev Number: 10 (DW_TAG_variable)
    <de8>   DW_AT_name        : (indirect string, offset: 0x7fa): Tflag_scale
    <dec>   DW_AT_decl_file   : 18
    <ded>   DW_AT_decl_line   : 517
    <def>   DW_AT_decl_column : 12
    <df0>   DW_AT_type        : <0x64>
    <df4>   DW_AT_external    : 1
    <df5>   DW_AT_declaration : 1
 <1><df6>: Abbrev Number: 10 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0x8a2): Tflag_width
    <dfb>   DW_AT_decl_file   : 18
    <dfc>   DW_AT_decl_line   : 518
    <dfe>   DW_AT_decl_column : 12
    <dff>   DW_AT_type        : <0x64>
    <e03>   DW_AT_external    : 1
    <e04>   DW_AT_declaration : 1
 <1><e05>: Abbrev Number: 10 (DW_TAG_variable)
    <e06>   DW_AT_name        : (indirect string, offset: 0xec9): iflag
    <e0a>   DW_AT_decl_file   : 18
    <e0b>   DW_AT_decl_line   : 519
    <e0d>   DW_AT_decl_column : 13
    <e0e>   DW_AT_type        : <0x532>
    <e12>   DW_AT_external    : 1
    <e13>   DW_AT_declaration : 1
 <1><e14>: Abbrev Number: 10 (DW_TAG_variable)
    <e15>   DW_AT_name        : (indirect string, offset: 0x666): count_wallclock
    <e19>   DW_AT_decl_file   : 18
    <e1a>   DW_AT_decl_line   : 520
    <e1c>   DW_AT_decl_column : 13
    <e1d>   DW_AT_type        : <0x532>
    <e21>   DW_AT_external    : 1
    <e22>   DW_AT_declaration : 1
 <1><e23>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e24>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e28>   DW_AT_byte_size   : 4
    <e29>   DW_AT_decl_file   : 18
    <e2a>   DW_AT_decl_line   : 522
    <e2c>   DW_AT_decl_column : 8
    <e2d>   DW_AT_sibling     : <0xe42>
 <2><e31>: Abbrev Number: 22 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e36>   DW_AT_decl_file   : 18
    <e37>   DW_AT_decl_line   : 523
    <e39>   DW_AT_decl_column : 14
    <e3a>   DW_AT_type        : <0x1e6>
    <e3e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e43>   DW_AT_name        : (indirect string, offset: 0x797): path_set
    <e47>   DW_AT_byte_size   : 12
    <e48>   DW_AT_decl_file   : 18
    <e49>   DW_AT_decl_line   : 527
    <e4b>   DW_AT_decl_column : 15
    <e4c>   DW_AT_sibling     : <0xe81>
 <2><e50>: Abbrev Number: 22 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x71b): paths_selected
    <e55>   DW_AT_decl_file   : 18
    <e56>   DW_AT_decl_line   : 528
    <e58>   DW_AT_decl_column : 24
    <e59>   DW_AT_type        : <0xe81>
    <e5d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e60>: Abbrev Number: 22 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0x1132): num_selected
    <e65>   DW_AT_decl_file   : 18
    <e66>   DW_AT_decl_line   : 529
    <e68>   DW_AT_decl_column : 9
    <e69>   DW_AT_type        : <0x146>
    <e6d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e70>: Abbrev Number: 22 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0xbfa): size
    <e75>   DW_AT_decl_file   : 18
    <e76>   DW_AT_decl_line   : 530
    <e78>   DW_AT_decl_column : 9
    <e79>   DW_AT_type        : <0x146>
    <e7d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e82>   DW_AT_byte_size   : 4
    <e83>   DW_AT_type        : <0xe23>
 <1><e87>: Abbrev Number: 10 (DW_TAG_variable)
    <e88>   DW_AT_name        : (indirect string, offset: 0x1181): global_path_set
    <e8c>   DW_AT_decl_file   : 18
    <e8d>   DW_AT_decl_line   : 531
    <e8f>   DW_AT_decl_column : 3
    <e90>   DW_AT_type        : <0xe42>
    <e94>   DW_AT_external    : 1
    <e95>   DW_AT_declaration : 1
 <1><e96>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e97>   DW_AT_name        : (indirect string, offset: 0x1075): xflag_opts
    <e9b>   DW_AT_encoding    : 7	(unsigned)
    <e9c>   DW_AT_byte_size   : 4
    <e9d>   DW_AT_type        : <0x2b>
    <ea1>   DW_AT_decl_file   : 18
    <ea2>   DW_AT_decl_line   : 533
    <ea4>   DW_AT_decl_column : 6
    <ea5>   DW_AT_sibling     : <0xec8>
 <2><ea9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eaa>   DW_AT_name        : (indirect string, offset: 0xab3): HEXSTR_NONE
    <eae>   DW_AT_const_value : 0
 <2><eaf>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x10bb): HEXSTR_NON_ASCII
    <eb4>   DW_AT_const_value : 1
 <2><eb5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x977): HEXSTR_ALL
    <eba>   DW_AT_const_value : 2
 <2><ebb>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x6a6): HEXSTR_NON_ASCII_CHARS
    <ec0>   DW_AT_const_value : 3
 <2><ec1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x114c): NUM_HEXSTR_OPTS
    <ec6>   DW_AT_const_value : 4
 <2><ec7>: Abbrev Number: 0
 <1><ec8>: Abbrev Number: 10 (DW_TAG_variable)
    <ec9>   DW_AT_name        : (indirect string, offset: 0xea3): xflag
    <ecd>   DW_AT_decl_file   : 18
    <ece>   DW_AT_decl_line   : 546
    <ed0>   DW_AT_decl_column : 17
    <ed1>   DW_AT_type        : <0x2b>
    <ed5>   DW_AT_external    : 1
    <ed6>   DW_AT_declaration : 1
 <1><ed7>: Abbrev Number: 10 (DW_TAG_variable)
    <ed8>   DW_AT_name        : (indirect string, offset: 0xd33): followfork
    <edc>   DW_AT_decl_file   : 18
    <edd>   DW_AT_decl_line   : 547
    <edf>   DW_AT_decl_column : 13
    <ee0>   DW_AT_type        : <0x532>
    <ee4>   DW_AT_external    : 1
    <ee5>   DW_AT_declaration : 1
 <1><ee6>: Abbrev Number: 10 (DW_TAG_variable)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x32b): output_separately
    <eeb>   DW_AT_decl_file   : 18
    <eec>   DW_AT_decl_line   : 548
    <eee>   DW_AT_decl_column : 13
    <eef>   DW_AT_type        : <0x532>
    <ef3>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef5>: Abbrev Number: 10 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x235): stack_trace_enabled
    <efa>   DW_AT_decl_file   : 18
    <efb>   DW_AT_decl_line   : 551
    <efd>   DW_AT_decl_column : 13
    <efe>   DW_AT_type        : <0x532>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 10 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0x694): ptrace_setoptions
    <f09>   DW_AT_decl_file   : 18
    <f0a>   DW_AT_decl_line   : 555
    <f0c>   DW_AT_decl_column : 17
    <f0d>   DW_AT_type        : <0x2b>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 10 (DW_TAG_variable)
    <f14>   DW_AT_name        : (indirect string, offset: 0xa9e): max_strlen
    <f18>   DW_AT_decl_file   : 18
    <f19>   DW_AT_decl_line   : 556
    <f1b>   DW_AT_decl_column : 17
    <f1c>   DW_AT_type        : <0x2b>
    <f20>   DW_AT_external    : 1
    <f21>   DW_AT_declaration : 1
 <1><f22>: Abbrev Number: 10 (DW_TAG_variable)
    <f23>   DW_AT_name        : (indirect string, offset: 0xaec): os_release
    <f27>   DW_AT_decl_file   : 18
    <f28>   DW_AT_decl_line   : 557
    <f2a>   DW_AT_decl_column : 17
    <f2b>   DW_AT_type        : <0x2b>
    <f2f>   DW_AT_external    : 1
    <f30>   DW_AT_declaration : 1
 <1><f31>: Abbrev Number: 10 (DW_TAG_variable)
    <f32>   DW_AT_name        : (indirect string, offset: 0x72a): xlat_verbosity
    <f36>   DW_AT_decl_file   : 18
    <f37>   DW_AT_decl_line   : 919
    <f39>   DW_AT_decl_column : 24
    <f3a>   DW_AT_type        : <0xa6f>
    <f3e>   DW_AT_external    : 1
    <f3f>   DW_AT_declaration : 1
 <1><f40>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f41>   DW_AT_name        : (indirect string, offset: 0x649): xlat_style_private_flag_bits
    <f45>   DW_AT_encoding    : 7	(unsigned)
    <f46>   DW_AT_byte_size   : 4
    <f47>   DW_AT_type        : <0x2b>
    <f4b>   DW_AT_decl_file   : 18
    <f4c>   DW_AT_decl_line   : 939
    <f4e>   DW_AT_decl_column : 6
    <f4f>   DW_AT_sibling     : <0xf6c>
 <2><f53>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0x2aa): PAF_PRINT_INDICES_BIT
    <f58>   DW_AT_const_value : 5
 <2><f59>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xbb1): PAF_ARRAY_TRUNCATED_BIT
    <f5e>   DW_AT_const_value : 6
 <2><f5f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f60>   DW_AT_name        : (indirect string, offset: 0x3fe): PXF_DEFAULT_STR_BIT
    <f64>   DW_AT_const_value : 7
 <2><f65>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0xd15): SPFF_AUXSTR_MODE_BIT
    <f6a>   DW_AT_const_value : 8
 <2><f6b>: Abbrev Number: 0
 <1><f6c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xdcf): find_xlat_flag_bits
    <f71>   DW_AT_encoding    : 7	(unsigned)
    <f72>   DW_AT_byte_size   : 4
    <f73>   DW_AT_type        : <0x2b>
    <f77>   DW_AT_decl_file   : 18
    <f78>   DW_AT_decl_line   : 1443
    <f7a>   DW_AT_decl_column : 6
    <f7b>   DW_AT_sibling     : <0xf86>
 <2><f7f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f80>   DW_AT_name        : (indirect string, offset: 0x9c0): FXL_CASE_SENSITIVE_BIT
    <f84>   DW_AT_const_value : 0
 <2><f85>: Abbrev Number: 0
 <1><f86>: Abbrev Number: 10 (DW_TAG_variable)
    <f87>   DW_AT_name        : (indirect string, offset: 0xa67): printing_tcp
    <f8b>   DW_AT_decl_file   : 18
    <f8c>   DW_AT_decl_line   : 1689
    <f8e>   DW_AT_decl_column : 20
    <f8f>   DW_AT_type        : <0x60e>
    <f93>   DW_AT_external    : 1
    <f94>   DW_AT_declaration : 1
 <1><f95>: Abbrev Number: 10 (DW_TAG_variable)
    <f96>   DW_AT_name        : (indirect string, offset: 0x5f2): errnoent
    <f9a>   DW_AT_decl_file   : 18
    <f9b>   DW_AT_decl_line   : 1887
    <f9d>   DW_AT_decl_column : 26
    <f9e>   DW_AT_type        : <0x466>
    <fa2>   DW_AT_external    : 1
    <fa3>   DW_AT_declaration : 1
 <1><fa4>: Abbrev Number: 10 (DW_TAG_variable)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x8ae): signalent
    <fa9>   DW_AT_decl_file   : 18
    <faa>   DW_AT_decl_line   : 1888
    <fac>   DW_AT_decl_column : 26
    <fad>   DW_AT_type        : <0x466>
    <fb1>   DW_AT_external    : 1
    <fb2>   DW_AT_declaration : 1
 <1><fb3>: Abbrev Number: 10 (DW_TAG_variable)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xf1f): nerrnos
    <fb8>   DW_AT_decl_file   : 18
    <fb9>   DW_AT_decl_line   : 1889
    <fbb>   DW_AT_decl_column : 27
    <fbc>   DW_AT_type        : <0x32>
    <fc0>   DW_AT_external    : 1
    <fc1>   DW_AT_declaration : 1
 <1><fc2>: Abbrev Number: 10 (DW_TAG_variable)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x111b): nsignals
    <fc7>   DW_AT_decl_file   : 18
    <fc8>   DW_AT_decl_line   : 1890
    <fca>   DW_AT_decl_column : 27
    <fcb>   DW_AT_type        : <0x32>
    <fcf>   DW_AT_external    : 1
    <fd0>   DW_AT_declaration : 1
 <1><fd1>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd2>   DW_AT_type        : <0x88e>
    <fd6>   DW_AT_sibling     : <0xfdc>
 <2><fda>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fdb>: Abbrev Number: 0
 <1><fdc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fdd>   DW_AT_type        : <0xfd1>
 <1><fe1>: Abbrev Number: 10 (DW_TAG_variable)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xd8f): sysent0
    <fe6>   DW_AT_decl_file   : 18
    <fe7>   DW_AT_decl_line   : 1892
    <fe9>   DW_AT_decl_column : 28
    <fea>   DW_AT_type        : <0xfdc>
    <fee>   DW_AT_external    : 1
    <fef>   DW_AT_declaration : 1
 <1><ff0>: Abbrev Number: 15 (DW_TAG_array_type)
    <ff1>   DW_AT_type        : <0x8f5>
    <ff5>   DW_AT_sibling     : <0xffb>
 <2><ff9>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ffa>: Abbrev Number: 0
 <1><ffb>: Abbrev Number: 3 (DW_TAG_const_type)
    <ffc>   DW_AT_type        : <0xff0>
 <1><1000>: Abbrev Number: 10 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0x1177): ioctlent0
    <1005>   DW_AT_decl_file   : 18
    <1006>   DW_AT_decl_line   : 1893
    <1008>   DW_AT_decl_column : 30
    <1009>   DW_AT_type        : <0xffb>
    <100d>   DW_AT_external    : 1
    <100e>   DW_AT_declaration : 1
 <1><100f>: Abbrev Number: 10 (DW_TAG_variable)
    <1010>   DW_AT_name        : (indirect string, offset: 0x1080): personality_names
    <1014>   DW_AT_decl_file   : 18
    <1015>   DW_AT_decl_line   : 1895
    <1017>   DW_AT_decl_column : 26
    <1018>   DW_AT_type        : <0x466>
    <101c>   DW_AT_external    : 1
    <101d>   DW_AT_declaration : 1
 <1><101e>: Abbrev Number: 10 (DW_TAG_variable)
    <101f>   DW_AT_name        : (indirect string, offset: 0x8ce): sysent
    <1023>   DW_AT_decl_file   : 18
    <1024>   DW_AT_decl_line   : 1898
    <1026>   DW_AT_decl_column : 29
    <1027>   DW_AT_type        : <0x9da>
    <102b>   DW_AT_external    : 1
    <102c>   DW_AT_declaration : 1
 <1><102d>: Abbrev Number: 10 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0xd2a): ioctlent
    <1032>   DW_AT_decl_file   : 18
    <1033>   DW_AT_decl_line   : 1899
    <1035>   DW_AT_decl_column : 31
    <1036>   DW_AT_type        : <0x103c>
    <103a>   DW_AT_external    : 1
    <103b>   DW_AT_declaration : 1
 <1><103c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <103d>   DW_AT_byte_size   : 4
    <103e>   DW_AT_type        : <0x8f5>
 <1><1042>: Abbrev Number: 10 (DW_TAG_variable)
    <1043>   DW_AT_name        : (indirect string, offset: 0x8b8): nsyscalls
    <1047>   DW_AT_decl_file   : 18
    <1048>   DW_AT_decl_line   : 1905
    <104a>   DW_AT_decl_column : 17
    <104b>   DW_AT_type        : <0x2b>
    <104f>   DW_AT_external    : 1
    <1050>   DW_AT_declaration : 1
 <1><1051>: Abbrev Number: 10 (DW_TAG_variable)
    <1052>   DW_AT_name        : (indirect string, offset: 0xf45): nioctlents
    <1056>   DW_AT_decl_file   : 18
    <1057>   DW_AT_decl_line   : 1906
    <1059>   DW_AT_decl_column : 17
    <105a>   DW_AT_type        : <0x2b>
    <105e>   DW_AT_external    : 1
    <105f>   DW_AT_declaration : 1
 <1><1060>: Abbrev Number: 15 (DW_TAG_array_type)
    <1061>   DW_AT_type        : <0x32>
    <1065>   DW_AT_sibling     : <0x1070>
 <2><1069>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <106a>   DW_AT_type        : <0x2b>
    <106e>   DW_AT_upper_bound : 2
 <2><106f>: Abbrev Number: 0
 <1><1070>: Abbrev Number: 3 (DW_TAG_const_type)
    <1071>   DW_AT_type        : <0x1060>
 <1><1075>: Abbrev Number: 10 (DW_TAG_variable)
    <1076>   DW_AT_name        : (indirect string, offset: 0xfb5): nsyscall_vec
    <107a>   DW_AT_decl_file   : 18
    <107b>   DW_AT_decl_line   : 1908
    <107d>   DW_AT_decl_column : 27
    <107e>   DW_AT_type        : <0x1070>
    <1082>   DW_AT_external    : 1
    <1083>   DW_AT_declaration : 1
 <1><1084>: Abbrev Number: 15 (DW_TAG_array_type)
    <1085>   DW_AT_type        : <0x9e0>
    <1089>   DW_AT_sibling     : <0x1094>
 <2><108d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <108e>   DW_AT_type        : <0x2b>
    <1092>   DW_AT_upper_bound : 2
 <2><1093>: Abbrev Number: 0
 <1><1094>: Abbrev Number: 3 (DW_TAG_const_type)
    <1095>   DW_AT_type        : <0x1084>
 <1><1099>: Abbrev Number: 10 (DW_TAG_variable)
    <109a>   DW_AT_name        : (indirect string, offset: 0x7d5): sysent_vec
    <109e>   DW_AT_decl_file   : 18
    <109f>   DW_AT_decl_line   : 1909
    <10a1>   DW_AT_decl_column : 35
    <10a2>   DW_AT_type        : <0x1094>
    <10a6>   DW_AT_external    : 1
    <10a7>   DW_AT_declaration : 1
 <1><10a8>: Abbrev Number: 10 (DW_TAG_variable)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x38d): inject_vec
    <10ad>   DW_AT_decl_file   : 18
    <10ae>   DW_AT_decl_line   : 1910
    <10b0>   DW_AT_decl_column : 28
    <10b1>   DW_AT_type        : <0x9e5>
    <10b5>   DW_AT_external    : 1
    <10b6>   DW_AT_declaration : 1
 <1><10b7>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10b8>   DW_AT_name        : (indirect string, offset: 0xe2d): audit_arch_t
    <10bc>   DW_AT_byte_size   : 8
    <10bd>   DW_AT_decl_file   : 18
    <10be>   DW_AT_decl_line   : 1912
    <10c0>   DW_AT_decl_column : 8
    <10c1>   DW_AT_sibling     : <0x10e6>
 <2><10c5>: Abbrev Number: 22 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x63b): arch
    <10ca>   DW_AT_decl_file   : 18
    <10cb>   DW_AT_decl_line   : 1913
    <10cd>   DW_AT_decl_column : 15
    <10ce>   DW_AT_type        : <0x2b>
    <10d2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d5>: Abbrev Number: 22 (DW_TAG_member)
    <10d6>   DW_AT_name        : (indirect string, offset: 0xa4d): flag
    <10da>   DW_AT_decl_file   : 18
    <10db>   DW_AT_decl_line   : 1914
    <10dd>   DW_AT_decl_column : 15
    <10de>   DW_AT_type        : <0x2b>
    <10e2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e5>: Abbrev Number: 0
 <1><10e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e7>   DW_AT_type        : <0x10b7>
 <1><10eb>: Abbrev Number: 15 (DW_TAG_array_type)
    <10ec>   DW_AT_type        : <0x10e6>
    <10f0>   DW_AT_sibling     : <0x10fb>
 <2><10f4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10f5>   DW_AT_type        : <0x2b>
    <10f9>   DW_AT_upper_bound : 2
 <2><10fa>: Abbrev Number: 0
 <1><10fb>: Abbrev Number: 3 (DW_TAG_const_type)
    <10fc>   DW_AT_type        : <0x10eb>
 <1><1100>: Abbrev Number: 10 (DW_TAG_variable)
    <1101>   DW_AT_name        : (indirect string, offset: 0x9b1): audit_arch_vec
    <1105>   DW_AT_decl_file   : 18
    <1106>   DW_AT_decl_line   : 1917
    <1108>   DW_AT_decl_column : 34
    <1109>   DW_AT_type        : <0x10fb>
    <110d>   DW_AT_external    : 1
    <110e>   DW_AT_declaration : 1
 <1><110f>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1110>   DW_AT_byte_size   : 180
    <1111>   DW_AT_decl_file   : 20
    <1112>   DW_AT_decl_line   : 2
    <1113>   DW_AT_decl_column : 9
    <1114>   DW_AT_sibling     : <0x13c9>
 <2><1118>: Abbrev Number: 9 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0x1e6): block_ioctl
    <111d>   DW_AT_decl_file   : 20
    <111e>   DW_AT_decl_line   : 3
    <111f>   DW_AT_decl_column : 8
    <1120>   DW_AT_type        : <0x13e3>
    <1124>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1127>: Abbrev Number: 9 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0xb4b): btrfs_ioctl
    <112c>   DW_AT_decl_file   : 20
    <112d>   DW_AT_decl_line   : 6
    <112e>   DW_AT_decl_column : 8
    <112f>   DW_AT_type        : <0x13e3>
    <1133>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1136>: Abbrev Number: 9 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0x76d): evdev_write_ioctl_mpers
    <113b>   DW_AT_decl_file   : 20
    <113c>   DW_AT_decl_line   : 9
    <113d>   DW_AT_decl_column : 8
    <113e>   DW_AT_type        : <0x13e3>
    <1142>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1145>: Abbrev Number: 9 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0x739): get_sock_fprog_size
    <114a>   DW_AT_decl_file   : 20
    <114b>   DW_AT_decl_line   : 12
    <114c>   DW_AT_decl_column : 17
    <114d>   DW_AT_type        : <0x13ef>
    <1151>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1154>: Abbrev Number: 9 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0x1b5): fetch_bpf_fprog
    <1159>   DW_AT_decl_file   : 20
    <115a>   DW_AT_decl_line   : 15
    <115b>   DW_AT_decl_column : 10
    <115c>   DW_AT_type        : <0x140f>
    <1160>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1163>: Abbrev Number: 9 (DW_TAG_member)
    <1164>   DW_AT_name        : (indirect string, offset: 0x99e): fetch_struct_flock
    <1168>   DW_AT_decl_file   : 20
    <1169>   DW_AT_decl_line   : 18
    <116a>   DW_AT_decl_column : 10
    <116b>   DW_AT_type        : <0x140f>
    <116f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1172>: Abbrev Number: 9 (DW_TAG_member)
