Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1931 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x50d): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x105d): mpers-mx32/siginfo_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xbd1): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c5): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10c6): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9f7): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8d7): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf9b): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x910): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7b4): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbfe): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xffb): __uid_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 146
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x2b>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xc34): __off_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 152
    <b5>   DW_AT_decl_column : 25
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xd96): __off64_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 153
    <c1>   DW_AT_decl_column : 27
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 4 (DW_TAG_typedef)
    <c7>   DW_AT_name        : (indirect string, offset: 0xb7c): __pid_t
    <cb>   DW_AT_decl_file   : 1
    <cc>   DW_AT_decl_line   : 154
    <cd>   DW_AT_decl_column : 25
    <ce>   DW_AT_type        : <0x64>
 <1><d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <d3>   DW_AT_name        : (indirect string, offset: 0xaab): __clock_t
    <d7>   DW_AT_decl_file   : 1
    <d8>   DW_AT_decl_line   : 156
    <d9>   DW_AT_decl_column : 27
    <da>   DW_AT_type        : <0x7c>
 <1><de>: Abbrev Number: 4 (DW_TAG_typedef)
    <df>   DW_AT_name        : (indirect string, offset: 0xd0b): __time_t
    <e3>   DW_AT_decl_file   : 1
    <e4>   DW_AT_decl_line   : 160
    <e5>   DW_AT_decl_column : 26
    <e6>   DW_AT_type        : <0x7c>
 <1><ea>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eb>   DW_AT_byte_size   : 4
 <1><ec>: Abbrev Number: 3 (DW_TAG_const_type)
    <ed>   DW_AT_type        : <0xea>
 <1><f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (indirect string, offset: 0x411): __syscall_slong_t
    <f6>   DW_AT_decl_file   : 1
    <f7>   DW_AT_decl_line   : 196
    <f8>   DW_AT_decl_column : 33
    <f9>   DW_AT_type        : <0x7c>
 <1><fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fe>   DW_AT_byte_size   : 4
    <ff>   DW_AT_type        : <0x103>
 <1><103>: Abbrev Number: 2 (DW_TAG_base_type)
    <104>   DW_AT_byte_size   : 1
    <105>   DW_AT_encoding    : 6	(signed char)
    <106>   DW_AT_name        : (indirect string, offset: 0x45d): char
 <1><10a>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b>   DW_AT_type        : <0x103>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0x359): uint8_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 24
    <116>   DW_AT_decl_column : 19
    <117>   DW_AT_type        : <0x45>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xc1f): uint16_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 25
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x58>
 <1><127>: Abbrev Number: 4 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x10f6): uint32_t
    <12c>   DW_AT_decl_file   : 2
    <12d>   DW_AT_decl_line   : 26
    <12e>   DW_AT_decl_column : 20
    <12f>   DW_AT_type        : <0x70>
 <1><133>: Abbrev Number: 4 (DW_TAG_typedef)
    <134>   DW_AT_name        : (indirect string, offset: 0xea8): uint64_t
    <138>   DW_AT_decl_file   : 2
    <139>   DW_AT_decl_line   : 27
    <13a>   DW_AT_decl_column : 20
    <13b>   DW_AT_type        : <0x8f>
 <1><13f>: Abbrev Number: 2 (DW_TAG_base_type)
    <140>   DW_AT_byte_size   : 4
    <141>   DW_AT_encoding    : 5	(signed)
    <142>   DW_AT_name        : (indirect string, offset: 0x2c9): long int
 <1><146>: Abbrev Number: 4 (DW_TAG_typedef)
    <147>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <14b>   DW_AT_decl_file   : 3
    <14c>   DW_AT_decl_line   : 209
    <14d>   DW_AT_decl_column : 23
    <14e>   DW_AT_type        : <0x2b>
 <1><152>: Abbrev Number: 3 (DW_TAG_const_type)
    <153>   DW_AT_type        : <0x146>
 <1><157>: Abbrev Number: 8 (DW_TAG_structure_type)
    <158>   DW_AT_name        : (indirect string, offset: 0xb94): timespec
    <15c>   DW_AT_byte_size   : 16
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 10
    <15f>   DW_AT_decl_column : 8
    <160>   DW_AT_sibling     : <0x183>
 <2><164>: Abbrev Number: 9 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x119c): tv_sec
    <169>   DW_AT_decl_file   : 4
    <16a>   DW_AT_decl_line   : 12
    <16b>   DW_AT_decl_column : 12
    <16c>   DW_AT_type        : <0xde>
    <170>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><173>: Abbrev Number: 9 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0xed5): tv_nsec
    <178>   DW_AT_decl_file   : 4
    <179>   DW_AT_decl_line   : 16
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xf1>
    <17f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><182>: Abbrev Number: 0
 <1><183>: Abbrev Number: 2 (DW_TAG_base_type)
    <184>   DW_AT_byte_size   : 16
    <185>   DW_AT_encoding    : 4	(float)
    <186>   DW_AT_name        : (indirect string, offset: 0xb51): long double
 <1><18a>: Abbrev Number: 10 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0x280): __environ
    <18f>   DW_AT_decl_file   : 5
    <190>   DW_AT_decl_line   : 543
    <192>   DW_AT_decl_column : 15
    <193>   DW_AT_type        : <0x199>
    <197>   DW_AT_external    : 1
    <198>   DW_AT_declaration : 1
 <1><199>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <19a>   DW_AT_byte_size   : 4
    <19b>   DW_AT_type        : <0xfd>
 <1><19f>: Abbrev Number: 10 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x3b3): environ
    <1a4>   DW_AT_decl_file   : 5
    <1a5>   DW_AT_decl_line   : 545
    <1a7>   DW_AT_decl_column : 15
    <1a8>   DW_AT_type        : <0x199>
    <1ac>   DW_AT_external    : 1
    <1ad>   DW_AT_declaration : 1
 <1><1ae>: Abbrev Number: 11 (DW_TAG_variable)
    <1af>   DW_AT_name        : (indirect string, offset: 0x10b0): optarg
    <1b3>   DW_AT_decl_file   : 6
    <1b4>   DW_AT_decl_line   : 36
    <1b5>   DW_AT_decl_column : 14
    <1b6>   DW_AT_type        : <0xfd>
    <1ba>   DW_AT_external    : 1
    <1bb>   DW_AT_declaration : 1
 <1><1bc>: Abbrev Number: 11 (DW_TAG_variable)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x787): optind
    <1c1>   DW_AT_decl_file   : 6
    <1c2>   DW_AT_decl_line   : 50
    <1c3>   DW_AT_decl_column : 12
    <1c4>   DW_AT_type        : <0x64>
    <1c8>   DW_AT_external    : 1
    <1c9>   DW_AT_declaration : 1
 <1><1ca>: Abbrev Number: 11 (DW_TAG_variable)
    <1cb>   DW_AT_name        : (indirect string, offset: 0xcfa): opterr
    <1cf>   DW_AT_decl_file   : 6
    <1d0>   DW_AT_decl_line   : 55
    <1d1>   DW_AT_decl_column : 12
    <1d2>   DW_AT_type        : <0x64>
    <1d6>   DW_AT_external    : 1
    <1d7>   DW_AT_declaration : 1
 <1><1d8>: Abbrev Number: 11 (DW_TAG_variable)
    <1d9>   DW_AT_name        : (indirect string, offset: 0x11af): optopt
    <1dd>   DW_AT_decl_file   : 6
    <1de>   DW_AT_decl_line   : 59
    <1df>   DW_AT_decl_column : 12
    <1e0>   DW_AT_type        : <0x64>
    <1e4>   DW_AT_external    : 1
    <1e5>   DW_AT_declaration : 1
 <1><1e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e7>   DW_AT_byte_size   : 4
    <1e8>   DW_AT_type        : <0x10a>
 <1><1ec>: Abbrev Number: 3 (DW_TAG_const_type)
    <1ed>   DW_AT_type        : <0x1e6>
 <1><1f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1f2>   DW_AT_byte_size   : 4
    <1f3>   DW_AT_type        : <0x1f7>
 <1><1f7>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1f8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x361): _IO_FILE
    <1fd>   DW_AT_byte_size   : 152
    <1fe>   DW_AT_decl_file   : 7
    <1ff>   DW_AT_decl_line   : 49
    <200>   DW_AT_decl_column : 8
    <201>   DW_AT_sibling     : <0x3b9>
 <2><205>: Abbrev Number: 9 (DW_TAG_member)
    <206>   DW_AT_name        : (indirect string, offset: 0xa99): _flags
    <20a>   DW_AT_decl_file   : 7
    <20b>   DW_AT_decl_line   : 51
    <20c>   DW_AT_decl_column : 7
    <20d>   DW_AT_type        : <0x64>
    <211>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><214>: Abbrev Number: 9 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x500): _IO_read_ptr
    <219>   DW_AT_decl_file   : 7
    <21a>   DW_AT_decl_line   : 54
    <21b>   DW_AT_decl_column : 9
    <21c>   DW_AT_type        : <0xfd>
    <220>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><223>: Abbrev Number: 9 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x1003): _IO_read_end
    <228>   DW_AT_decl_file   : 7
    <229>   DW_AT_decl_line   : 55
    <22a>   DW_AT_decl_column : 9
    <22b>   DW_AT_type        : <0xfd>
    <22f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><232>: Abbrev Number: 9 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0x808): _IO_read_base
    <237>   DW_AT_decl_file   : 7
    <238>   DW_AT_decl_line   : 56
    <239>   DW_AT_decl_column : 9
    <23a>   DW_AT_type        : <0xfd>
    <23e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><241>: Abbrev Number: 9 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <246>   DW_AT_decl_file   : 7
    <247>   DW_AT_decl_line   : 57
    <248>   DW_AT_decl_column : 9
    <249>   DW_AT_type        : <0xfd>
    <24d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><250>: Abbrev Number: 9 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x1108): _IO_write_ptr
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 58
    <257>   DW_AT_decl_column : 9
    <258>   DW_AT_type        : <0xfd>
    <25c>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25f>: Abbrev Number: 9 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x95c): _IO_write_end
    <264>   DW_AT_decl_file   : 7
    <265>   DW_AT_decl_line   : 59
    <266>   DW_AT_decl_column : 9
    <267>   DW_AT_type        : <0xfd>
    <26b>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><26e>: Abbrev Number: 9 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x9d9): _IO_buf_base
    <273>   DW_AT_decl_file   : 7
    <274>   DW_AT_decl_line   : 60
    <275>   DW_AT_decl_column : 9
    <276>   DW_AT_type        : <0xfd>
    <27a>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><27d>: Abbrev Number: 9 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0xe43): _IO_buf_end
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 61
    <284>   DW_AT_decl_column : 9
    <285>   DW_AT_type        : <0xfd>
    <289>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><28c>: Abbrev Number: 9 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0x1d8): _IO_save_base
    <291>   DW_AT_decl_file   : 7
    <292>   DW_AT_decl_line   : 64
    <293>   DW_AT_decl_column : 9
    <294>   DW_AT_type        : <0xfd>
    <298>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><29b>: Abbrev Number: 9 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0xd5d): _IO_backup_base
    <2a0>   DW_AT_decl_file   : 7
    <2a1>   DW_AT_decl_line   : 65
    <2a2>   DW_AT_decl_column : 9
    <2a3>   DW_AT_type        : <0xfd>
    <2a7>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2aa>: Abbrev Number: 9 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2af>   DW_AT_decl_file   : 7
    <2b0>   DW_AT_decl_line   : 66
    <2b1>   DW_AT_decl_column : 9
    <2b2>   DW_AT_type        : <0xfd>
    <2b6>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b9>: Abbrev Number: 9 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x642): _markers
    <2be>   DW_AT_decl_file   : 7
    <2bf>   DW_AT_decl_line   : 68
    <2c0>   DW_AT_decl_column : 22
    <2c1>   DW_AT_type        : <0x3d3>
    <2c5>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c8>: Abbrev Number: 9 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x21b): _chain
    <2cd>   DW_AT_decl_file   : 7
    <2ce>   DW_AT_decl_line   : 70
    <2cf>   DW_AT_decl_column : 20
    <2d0>   DW_AT_type        : <0x3d9>
    <2d4>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d7>: Abbrev Number: 9 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x107f): _fileno
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 72
    <2de>   DW_AT_decl_column : 7
    <2df>   DW_AT_type        : <0x64>
    <2e3>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e6>: Abbrev Number: 9 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x7e2): _flags2
    <2eb>   DW_AT_decl_file   : 7
    <2ec>   DW_AT_decl_line   : 73
    <2ed>   DW_AT_decl_column : 7
    <2ee>   DW_AT_type        : <0x64>
    <2f2>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : (indirect string, offset: 0x883): _old_offset
    <2fa>   DW_AT_decl_file   : 7
    <2fb>   DW_AT_decl_line   : 74
    <2fc>   DW_AT_decl_column : 11
    <2fd>   DW_AT_type        : <0xae>
    <301>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><304>: Abbrev Number: 9 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0x24e): _cur_column
    <309>   DW_AT_decl_file   : 7
    <30a>   DW_AT_decl_line   : 77
    <30b>   DW_AT_decl_column : 18
    <30c>   DW_AT_type        : <0x24>
    <310>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><313>: Abbrev Number: 9 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0xefb): _vtable_offset
    <318>   DW_AT_decl_file   : 7
    <319>   DW_AT_decl_line   : 78
    <31a>   DW_AT_decl_column : 15
    <31b>   DW_AT_type        : <0x3e>
    <31f>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><322>: Abbrev Number: 9 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0xd6d): _shortbuf
    <327>   DW_AT_decl_file   : 7
    <328>   DW_AT_decl_line   : 79
    <329>   DW_AT_decl_column : 8
    <32a>   DW_AT_type        : <0x3df>
    <32e>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><331>: Abbrev Number: 9 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <336>   DW_AT_decl_file   : 7
    <337>   DW_AT_decl_line   : 81
    <338>   DW_AT_decl_column : 15
    <339>   DW_AT_type        : <0x3ef>
    <33d>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><340>: Abbrev Number: 9 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x715): _offset
    <345>   DW_AT_decl_file   : 7
    <346>   DW_AT_decl_line   : 89
    <347>   DW_AT_decl_column : 13
    <348>   DW_AT_type        : <0xba>
    <34c>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><34f>: Abbrev Number: 9 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0xae3): _codecvt
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 91
    <356>   DW_AT_decl_column : 23
    <357>   DW_AT_type        : <0x3fb>
    <35b>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><35e>: Abbrev Number: 9 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x1094): _wide_data
    <363>   DW_AT_decl_file   : 7
    <364>   DW_AT_decl_line   : 92
    <365>   DW_AT_decl_column : 25
    <366>   DW_AT_type        : <0x407>
    <36a>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36d>: Abbrev Number: 9 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x3e1): _freeres_list
    <372>   DW_AT_decl_file   : 7
    <373>   DW_AT_decl_line   : 93
    <374>   DW_AT_decl_column : 20
    <375>   DW_AT_type        : <0x3d9>
    <379>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37c>: Abbrev Number: 9 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xcd0): _freeres_buf
    <381>   DW_AT_decl_file   : 7
    <382>   DW_AT_decl_line   : 94
    <383>   DW_AT_decl_column : 9
    <384>   DW_AT_type        : <0xea>
    <388>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38b>: Abbrev Number: 9 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0xa48): __pad5
    <390>   DW_AT_decl_file   : 7
    <391>   DW_AT_decl_line   : 95
    <392>   DW_AT_decl_column : 10
    <393>   DW_AT_type        : <0x146>
    <397>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0xac7): _mode
    <39f>   DW_AT_decl_file   : 7
    <3a0>   DW_AT_decl_line   : 96
    <3a1>   DW_AT_decl_column : 7
    <3a2>   DW_AT_type        : <0x64>
    <3a6>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3a9>: Abbrev Number: 9 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x822): _unused2
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 98
    <3b0>   DW_AT_decl_column : 8
    <3b1>   DW_AT_type        : <0x40d>
    <3b5>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3b8>: Abbrev Number: 0
 <1><3b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xb77): FILE
    <3be>   DW_AT_decl_file   : 8
    <3bf>   DW_AT_decl_line   : 7
    <3c0>   DW_AT_decl_column : 25
    <3c1>   DW_AT_type        : <0x1f8>
 <1><3c5>: Abbrev Number: 13 (DW_TAG_typedef)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x49d): _IO_lock_t
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 43
    <3cc>   DW_AT_decl_column : 14
 <1><3cd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x30b): _IO_marker
    <3d2>   DW_AT_declaration : 1
 <1><3d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d4>   DW_AT_byte_size   : 4
    <3d5>   DW_AT_type        : <0x3cd>
 <1><3d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3da>   DW_AT_byte_size   : 4
    <3db>   DW_AT_type        : <0x1f8>
 <1><3df>: Abbrev Number: 15 (DW_TAG_array_type)
    <3e0>   DW_AT_type        : <0x103>
    <3e4>   DW_AT_sibling     : <0x3ef>
 <2><3e8>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3e9>   DW_AT_type        : <0x2b>
    <3ed>   DW_AT_upper_bound : 0
 <2><3ee>: Abbrev Number: 0
 <1><3ef>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f0>   DW_AT_byte_size   : 4
    <3f1>   DW_AT_type        : <0x3c5>
 <1><3f5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3fa>   DW_AT_declaration : 1
 <1><3fb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fc>   DW_AT_byte_size   : 4
    <3fd>   DW_AT_type        : <0x3f5>
 <1><401>: Abbrev Number: 14 (DW_TAG_structure_type)
    <402>   DW_AT_name        : (indirect string, offset: 0x375): _IO_wide_data
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x401>
 <1><40d>: Abbrev Number: 15 (DW_TAG_array_type)
    <40e>   DW_AT_type        : <0x103>
    <412>   DW_AT_sibling     : <0x41d>
 <2><416>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <417>   DW_AT_type        : <0x2b>
    <41b>   DW_AT_upper_bound : 39
 <2><41c>: Abbrev Number: 0
 <1><41d>: Abbrev Number: 11 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x5ee): stdin
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 137
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x42b>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <42c>   DW_AT_byte_size   : 4
    <42d>   DW_AT_type        : <0x3b9>
 <1><431>: Abbrev Number: 11 (DW_TAG_variable)
    <432>   DW_AT_name        : (indirect string, offset: 0x10d9): stdout
    <436>   DW_AT_decl_file   : 9
    <437>   DW_AT_decl_line   : 138
    <438>   DW_AT_decl_column : 14
    <439>   DW_AT_type        : <0x42b>
    <43d>   DW_AT_external    : 1
    <43e>   DW_AT_declaration : 1
 <1><43f>: Abbrev Number: 11 (DW_TAG_variable)
    <440>   DW_AT_name        : (indirect string, offset: 0xe91): stderr
    <444>   DW_AT_decl_file   : 9
    <445>   DW_AT_decl_line   : 139
    <446>   DW_AT_decl_column : 14
    <447>   DW_AT_type        : <0x42b>
    <44b>   DW_AT_external    : 1
    <44c>   DW_AT_declaration : 1
 <1><44d>: Abbrev Number: 11 (DW_TAG_variable)
    <44e>   DW_AT_name        : (indirect string, offset: 0x25a): sys_nerr
    <452>   DW_AT_decl_file   : 10
    <453>   DW_AT_decl_line   : 26
    <454>   DW_AT_decl_column : 12
    <455>   DW_AT_type        : <0x64>
    <459>   DW_AT_external    : 1
    <45a>   DW_AT_declaration : 1
 <1><45b>: Abbrev Number: 15 (DW_TAG_array_type)
    <45c>   DW_AT_type        : <0x1ec>
    <460>   DW_AT_sibling     : <0x466>
 <2><464>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><465>: Abbrev Number: 0
 <1><466>: Abbrev Number: 3 (DW_TAG_const_type)
    <467>   DW_AT_type        : <0x45b>
 <1><46b>: Abbrev Number: 11 (DW_TAG_variable)
    <46c>   DW_AT_name        : (indirect string, offset: 0x5fd): sys_errlist
    <470>   DW_AT_decl_file   : 10
    <471>   DW_AT_decl_line   : 27
    <472>   DW_AT_decl_column : 26
    <473>   DW_AT_type        : <0x466>
    <477>   DW_AT_external    : 1
    <478>   DW_AT_declaration : 1
 <1><479>: Abbrev Number: 11 (DW_TAG_variable)
    <47a>   DW_AT_name        : (indirect string, offset: 0x26d): _sys_nerr
    <47e>   DW_AT_decl_file   : 10
    <47f>   DW_AT_decl_line   : 30
    <480>   DW_AT_decl_column : 12
    <481>   DW_AT_type        : <0x64>
    <485>   DW_AT_external    : 1
    <486>   DW_AT_declaration : 1
 <1><487>: Abbrev Number: 11 (DW_TAG_variable)
    <488>   DW_AT_name        : (indirect string, offset: 0xf0a): _sys_errlist
    <48c>   DW_AT_decl_file   : 10
    <48d>   DW_AT_decl_line   : 31
    <48e>   DW_AT_decl_column : 26
    <48f>   DW_AT_type        : <0x466>
    <493>   DW_AT_external    : 1
    <494>   DW_AT_declaration : 1
 <1><495>: Abbrev Number: 11 (DW_TAG_variable)
    <496>   DW_AT_name        : (indirect string, offset: 0x6ee): program_invocation_name
    <49a>   DW_AT_decl_file   : 11
    <49b>   DW_AT_decl_line   : 45
    <49c>   DW_AT_decl_column : 14
    <49d>   DW_AT_type        : <0xfd>
    <4a1>   DW_AT_external    : 1
    <4a2>   DW_AT_declaration : 1
 <1><4a3>: Abbrev Number: 11 (DW_TAG_variable)
    <4a4>   DW_AT_name        : (indirect string, offset: 0xc6e): program_invocation_short_name
    <4a8>   DW_AT_decl_file   : 11
    <4a9>   DW_AT_decl_line   : 46
    <4aa>   DW_AT_decl_column : 14
    <4ab>   DW_AT_type        : <0xfd>
    <4af>   DW_AT_external    : 1
    <4b0>   DW_AT_declaration : 1
 <1><4b1>: Abbrev Number: 15 (DW_TAG_array_type)
    <4b2>   DW_AT_type        : <0xfd>
    <4b6>   DW_AT_sibling     : <0x4c1>
 <2><4ba>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4bb>   DW_AT_type        : <0x2b>
    <4bf>   DW_AT_upper_bound : 1
 <2><4c0>: Abbrev Number: 0
 <1><4c1>: Abbrev Number: 11 (DW_TAG_variable)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x1c5): __tzname
    <4c6>   DW_AT_decl_file   : 12
    <4c7>   DW_AT_decl_line   : 159
    <4c8>   DW_AT_decl_column : 14
    <4c9>   DW_AT_type        : <0x4b1>
    <4cd>   DW_AT_external    : 1
    <4ce>   DW_AT_declaration : 1
 <1><4cf>: Abbrev Number: 11 (DW_TAG_variable)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xf82): __daylight
    <4d4>   DW_AT_decl_file   : 12
    <4d5>   DW_AT_decl_line   : 160
    <4d6>   DW_AT_decl_column : 12
    <4d7>   DW_AT_type        : <0x64>
    <4db>   DW_AT_external    : 1
    <4dc>   DW_AT_declaration : 1
 <1><4dd>: Abbrev Number: 11 (DW_TAG_variable)
    <4de>   DW_AT_name        : (indirect string, offset: 0x36a): __timezone
    <4e2>   DW_AT_decl_file   : 12
    <4e3>   DW_AT_decl_line   : 161
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x13f>
    <4e9>   DW_AT_external    : 1
    <4ea>   DW_AT_declaration : 1
 <1><4eb>: Abbrev Number: 11 (DW_TAG_variable)
    <4ec>   DW_AT_name        : (indirect string, offset: 0xa38): tzname
    <4f0>   DW_AT_decl_file   : 12
    <4f1>   DW_AT_decl_line   : 166
    <4f2>   DW_AT_decl_column : 14
    <4f3>   DW_AT_type        : <0x4b1>
    <4f7>   DW_AT_external    : 1
    <4f8>   DW_AT_declaration : 1
 <1><4f9>: Abbrev Number: 11 (DW_TAG_variable)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x1152): daylight
    <4fe>   DW_AT_decl_file   : 12
    <4ff>   DW_AT_decl_line   : 174
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x4e2): timezone
    <50c>   DW_AT_decl_file   : 12
    <50d>   DW_AT_decl_line   : 175
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x13f>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 10 (DW_TAG_variable)
    <516>   DW_AT_name        : (indirect string, offset: 0x102a): getdate_err
    <51a>   DW_AT_decl_file   : 12
    <51b>   DW_AT_decl_line   : 274
    <51d>   DW_AT_decl_column : 12
    <51e>   DW_AT_type        : <0x64>
    <522>   DW_AT_external    : 1
    <523>   DW_AT_declaration : 1
 <1><524>: Abbrev Number: 11 (DW_TAG_variable)
    <525>   DW_AT_name        : (indirect string, offset: 0xa54): debug_flag
    <529>   DW_AT_decl_file   : 13
    <52a>   DW_AT_decl_line   : 20
    <52b>   DW_AT_decl_column : 13
    <52c>   DW_AT_type        : <0x532>
    <530>   DW_AT_external    : 1
    <531>   DW_AT_declaration : 1
 <1><532>: Abbrev Number: 2 (DW_TAG_base_type)
    <533>   DW_AT_byte_size   : 1
    <534>   DW_AT_encoding    : 2	(boolean)
    <535>   DW_AT_name        : (indirect string, offset: 0x423): _Bool
 <1><539>: Abbrev Number: 3 (DW_TAG_const_type)
    <53a>   DW_AT_type        : <0x532>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0xb27): __kernel_long_t
    <543>   DW_AT_decl_file   : 14
    <544>   DW_AT_decl_line   : 14
    <545>   DW_AT_decl_column : 19
    <546>   DW_AT_type        : <0x88>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x5dd): __kernel_ulong_t
    <54f>   DW_AT_decl_file   : 14
    <550>   DW_AT_decl_line   : 15
    <551>   DW_AT_decl_column : 28
    <552>   DW_AT_type        : <0x9b>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x3ef): kernel_long_t
    <55b>   DW_AT_decl_file   : 15
    <55c>   DW_AT_decl_line   : 16
    <55d>   DW_AT_decl_column : 25
    <55e>   DW_AT_type        : <0x53e>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0x901): kernel_ulong_t
    <567>   DW_AT_decl_file   : 15
    <568>   DW_AT_decl_line   : 17
    <569>   DW_AT_decl_column : 26
    <56a>   DW_AT_type        : <0x54a>
 <1><56e>: Abbrev Number: 3 (DW_TAG_const_type)
    <56f>   DW_AT_type        : <0x562>
 <1><573>: Abbrev Number: 8 (DW_TAG_structure_type)
    <574>   DW_AT_name        : (indirect string, offset: 0xc8c): list_item
    <578>   DW_AT_byte_size   : 8
    <579>   DW_AT_decl_file   : 16
    <57a>   DW_AT_decl_line   : 92
    <57b>   DW_AT_decl_column : 8
    <57c>   DW_AT_sibling     : <0x59f>
 <2><580>: Abbrev Number: 9 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x1197): prev
    <585>   DW_AT_decl_file   : 16
    <586>   DW_AT_decl_line   : 93
    <587>   DW_AT_decl_column : 20
    <588>   DW_AT_type        : <0x59f>
    <58c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58f>: Abbrev Number: 9 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x118d): next
    <594>   DW_AT_decl_file   : 16
    <595>   DW_AT_decl_line   : 94
    <596>   DW_AT_decl_column : 20
    <597>   DW_AT_type        : <0x59f>
    <59b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59e>: Abbrev Number: 0
 <1><59f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a0>   DW_AT_byte_size   : 4
    <5a1>   DW_AT_type        : <0x573>
 <1><5a5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x8d0): sysent
    <5aa>   DW_AT_byte_size   : 20
    <5ab>   DW_AT_decl_file   : 17
    <5ac>   DW_AT_decl_line   : 13
    <5ad>   DW_AT_decl_column : 16
    <5ae>   DW_AT_sibling     : <0x5fe>
 <2><5b2>: Abbrev Number: 9 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x10f0): nargs
    <5b7>   DW_AT_decl_file   : 17
    <5b8>   DW_AT_decl_line   : 14
    <5b9>   DW_AT_decl_column : 11
    <5ba>   DW_AT_type        : <0x2b>
    <5be>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c1>: Abbrev Number: 9 (DW_TAG_member)
    <5c2>   DW_AT_name        : (indirect string, offset: 0x9ed): sys_flags
    <5c6>   DW_AT_decl_file   : 17
    <5c7>   DW_AT_decl_line   : 15
    <5c8>   DW_AT_decl_column : 6
    <5c9>   DW_AT_type        : <0x64>
    <5cd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5d0>: Abbrev Number: 18 (DW_TAG_member)
    <5d1>   DW_AT_name        : sen
    <5d5>   DW_AT_decl_file   : 17
    <5d6>   DW_AT_decl_line   : 16
    <5d7>   DW_AT_decl_column : 6
    <5d8>   DW_AT_type        : <0x64>
    <5dc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5df>: Abbrev Number: 9 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x302): sys_func
    <5e4>   DW_AT_decl_file   : 17
    <5e5>   DW_AT_decl_line   : 17
    <5e6>   DW_AT_decl_column : 8
    <5e7>   DW_AT_type        : <0x85a>
    <5eb>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ee>: Abbrev Number: 9 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x277): sys_name
    <5f3>   DW_AT_decl_file   : 17
    <5f4>   DW_AT_decl_line   : 18
    <5f5>   DW_AT_decl_column : 14
    <5f6>   DW_AT_type        : <0x1e6>
    <5fa>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5fd>: Abbrev Number: 0
 <1><5fe>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5ff>   DW_AT_prototyped  : 1
    <600>   DW_AT_type        : <0x64>
    <604>   DW_AT_sibling     : <0x60e>
 <2><608>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <609>   DW_AT_type        : <0x60e>
 <2><60d>: Abbrev Number: 0
 <1><60e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60f>   DW_AT_byte_size   : 4
    <610>   DW_AT_type        : <0x619>
 <1><614>: Abbrev Number: 3 (DW_TAG_const_type)
    <615>   DW_AT_type        : <0x60e>
 <1><619>: Abbrev Number: 21 (DW_TAG_structure_type)
    <61a>   DW_AT_name        : tcb
    <61e>   DW_AT_byte_size   : 280
    <620>   DW_AT_decl_file   : 18
    <621>   DW_AT_decl_line   : 262
    <623>   DW_AT_decl_column : 8
    <624>   DW_AT_sibling     : <0x85a>
 <2><628>: Abbrev Number: 22 (DW_TAG_member)
    <629>   DW_AT_name        : (indirect string, offset: 0x4fa): flags
    <62d>   DW_AT_decl_file   : 18
    <62e>   DW_AT_decl_line   : 263
    <630>   DW_AT_decl_column : 6
    <631>   DW_AT_type        : <0x64>
    <635>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><638>: Abbrev Number: 23 (DW_TAG_member)
    <639>   DW_AT_name        : pid
    <63d>   DW_AT_decl_file   : 18
    <63e>   DW_AT_decl_line   : 264
    <640>   DW_AT_decl_column : 6
    <641>   DW_AT_type        : <0x64>
    <645>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><648>: Abbrev Number: 22 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <64d>   DW_AT_decl_file   : 18
    <64e>   DW_AT_decl_line   : 265
    <650>   DW_AT_decl_column : 6
    <651>   DW_AT_type        : <0x64>
    <655>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><658>: Abbrev Number: 22 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x397): currpers
    <65d>   DW_AT_decl_file   : 18
    <65e>   DW_AT_decl_line   : 267
    <660>   DW_AT_decl_column : 15
    <661>   DW_AT_type        : <0x2b>
    <665>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><668>: Abbrev Number: 22 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0xbc9): u_error
    <66d>   DW_AT_decl_file   : 18
    <66e>   DW_AT_decl_line   : 269
    <670>   DW_AT_decl_column : 16
    <671>   DW_AT_type        : <0x37>
    <675>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><678>: Abbrev Number: 22 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <67d>   DW_AT_decl_file   : 18
    <67e>   DW_AT_decl_line   : 270
    <680>   DW_AT_decl_column : 17
    <681>   DW_AT_type        : <0x562>
    <685>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><688>: Abbrev Number: 22 (DW_TAG_member)
    <689>   DW_AT_name        : (indirect string, offset: 0xc15): true_scno
    <68d>   DW_AT_decl_file   : 18
    <68e>   DW_AT_decl_line   : 271
    <690>   DW_AT_decl_column : 17
    <691>   DW_AT_type        : <0x562>
    <695>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><698>: Abbrev Number: 22 (DW_TAG_member)
    <699>   DW_AT_name        : (indirect string, offset: 0x1af): u_arg
    <69d>   DW_AT_decl_file   : 18
    <69e>   DW_AT_decl_line   : 272
    <6a0>   DW_AT_decl_column : 17
    <6a1>   DW_AT_type        : <0x98a>
    <6a5>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6a8>: Abbrev Number: 22 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xa04): u_rval
    <6ad>   DW_AT_decl_file   : 18
    <6ae>   DW_AT_decl_line   : 273
    <6b0>   DW_AT_decl_column : 16
    <6b1>   DW_AT_type        : <0x556>
    <6b5>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6b8>: Abbrev Number: 22 (DW_TAG_member)
    <6b9>   DW_AT_name        : (indirect string, offset: 0xb43): sys_func_rval
    <6bd>   DW_AT_decl_file   : 18
    <6be>   DW_AT_decl_line   : 274
    <6c0>   DW_AT_decl_column : 6
    <6c1>   DW_AT_type        : <0x64>
    <6c5>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6c8>: Abbrev Number: 22 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0xd87): curcol
    <6cd>   DW_AT_decl_file   : 18
    <6ce>   DW_AT_decl_line   : 275
    <6d0>   DW_AT_decl_column : 6
    <6d1>   DW_AT_type        : <0x64>
    <6d5>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6d8>: Abbrev Number: 22 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0xa16): outf
    <6dd>   DW_AT_decl_file   : 18
    <6de>   DW_AT_decl_line   : 276
    <6e0>   DW_AT_decl_column : 8
    <6e1>   DW_AT_type        : <0x42b>
    <6e5>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6e8>: Abbrev Number: 22 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0xfc1): staged_output_data
    <6ed>   DW_AT_decl_file   : 18
    <6ee>   DW_AT_decl_line   : 277
    <6f0>   DW_AT_decl_column : 29
    <6f1>   DW_AT_type        : <0x9a0>
    <6f5>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6f8>: Abbrev Number: 22 (DW_TAG_member)
    <6f9>   DW_AT_name        : (indirect string, offset: 0xb0e): auxstr
    <6fd>   DW_AT_decl_file   : 18
    <6fe>   DW_AT_decl_line   : 279
    <700>   DW_AT_decl_column : 14
    <701>   DW_AT_type        : <0x1e6>
    <705>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><708>: Abbrev Number: 22 (DW_TAG_member)
    <709>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <70d>   DW_AT_decl_file   : 18
    <70e>   DW_AT_decl_line   : 280
    <710>   DW_AT_decl_column : 8
    <711>   DW_AT_type        : <0xea>
    <715>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><718>: Abbrev Number: 22 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0xcb9): _free_priv_data
    <71d>   DW_AT_decl_file   : 18
    <71e>   DW_AT_decl_line   : 281
    <720>   DW_AT_decl_column : 9
    <721>   DW_AT_type        : <0x9b2>
    <725>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><728>: Abbrev Number: 22 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <72d>   DW_AT_decl_file   : 18
    <72e>   DW_AT_decl_line   : 282
    <730>   DW_AT_decl_column : 23
    <731>   DW_AT_type        : <0x9b8>
    <735>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><738>: Abbrev Number: 22 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <73d>   DW_AT_decl_file   : 18
    <73e>   DW_AT_decl_line   : 285
    <740>   DW_AT_decl_column : 23
    <741>   DW_AT_type        : <0x9b8>
    <745>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><749>: Abbrev Number: 22 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x38c): inject_vec
    <74e>   DW_AT_decl_file   : 18
    <74f>   DW_AT_decl_line   : 286
    <751>   DW_AT_decl_column : 22
    <752>   DW_AT_type        : <0x9c3>
    <756>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x837): stime
    <75f>   DW_AT_decl_file   : 18
    <760>   DW_AT_decl_line   : 287
    <762>   DW_AT_decl_column : 18
    <763>   DW_AT_type        : <0x157>
    <767>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><76b>: Abbrev Number: 22 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x3a0): ltime
    <770>   DW_AT_decl_file   : 18
    <771>   DW_AT_decl_line   : 288
    <773>   DW_AT_decl_column : 18
    <774>   DW_AT_type        : <0x157>
    <778>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><77c>: Abbrev Number: 22 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x10b7): atime
    <781>   DW_AT_decl_file   : 18
    <782>   DW_AT_decl_line   : 289
    <784>   DW_AT_decl_column : 18
    <785>   DW_AT_type        : <0x157>
    <789>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><78d>: Abbrev Number: 22 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x4eb): etime
    <792>   DW_AT_decl_file   : 18
    <793>   DW_AT_decl_line   : 290
    <795>   DW_AT_decl_column : 18
    <796>   DW_AT_type        : <0x157>
    <79a>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><79e>: Abbrev Number: 22 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0xe00): delay_expiration_time
    <7a3>   DW_AT_decl_file   : 18
    <7a4>   DW_AT_decl_line   : 291
    <7a6>   DW_AT_decl_column : 18
    <7a7>   DW_AT_type        : <0x157>
    <7ab>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7af>: Abbrev Number: 22 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7b4>   DW_AT_decl_file   : 18
    <7b5>   DW_AT_decl_line   : 298
    <7b7>   DW_AT_decl_column : 15
    <7b8>   DW_AT_type        : <0x2b>
    <7bc>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7c0>: Abbrev Number: 22 (DW_TAG_member)
    <7c1>   DW_AT_name        : (indirect string, offset: 0x1010): last_dirfd
    <7c5>   DW_AT_decl_file   : 18
    <7c6>   DW_AT_decl_line   : 301
    <7c8>   DW_AT_decl_column : 6
    <7c9>   DW_AT_type        : <0x64>
    <7cd>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7d1>: Abbrev Number: 22 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x1036): mmap_cache
    <7d6>   DW_AT_decl_file   : 18
    <7d7>   DW_AT_decl_line   : 304
    <7d9>   DW_AT_decl_column : 23
    <7da>   DW_AT_type        : <0x9df>
    <7de>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7e2>: Abbrev Number: 22 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xbeb): wait_data_idx
    <7e7>   DW_AT_decl_file   : 18
    <7e8>   DW_AT_decl_line   : 311
    <7ea>   DW_AT_decl_column : 9
    <7eb>   DW_AT_type        : <0x146>
    <7ef>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7f3>: Abbrev Number: 22 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0xb15): delayed_wait_data
    <7f8>   DW_AT_decl_file   : 18
    <7f9>   DW_AT_decl_line   : 313
    <7fb>   DW_AT_decl_column : 24
    <7fc>   DW_AT_type        : <0x9eb>
    <800>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><804>: Abbrev Number: 22 (DW_TAG_member)
    <805>   DW_AT_name        : (indirect string, offset: 0xb8a): wait_list
    <809>   DW_AT_decl_file   : 18
    <80a>   DW_AT_decl_line   : 314
    <80c>   DW_AT_decl_column : 19
    <80d>   DW_AT_type        : <0x573>
    <811>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><815>: Abbrev Number: 22 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x706): vcpu_info_list
    <81a>   DW_AT_decl_file   : 18
    <81b>   DW_AT_decl_line   : 318
    <81d>   DW_AT_decl_column : 20
    <81e>   DW_AT_type        : <0x9f7>
    <822>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><826>: Abbrev Number: 22 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0xd52): unwind_ctx
    <82b>   DW_AT_decl_file   : 18
    <82c>   DW_AT_decl_line   : 322
    <82e>   DW_AT_decl_column : 8
    <82f>   DW_AT_type        : <0xea>
    <833>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><837>: Abbrev Number: 22 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0x4d5): unwind_queue
    <83c>   DW_AT_decl_file   : 18
    <83d>   DW_AT_decl_line   : 323
    <83f>   DW_AT_decl_column : 25
    <840>   DW_AT_type        : <0xa03>
    <844>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><848>: Abbrev Number: 22 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <84d>   DW_AT_decl_file   : 18
    <84e>   DW_AT_decl_line   : 327
    <850>   DW_AT_decl_column : 7
    <851>   DW_AT_type        : <0xa09>
    <855>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><859>: Abbrev Number: 0
 <1><85a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <85b>   DW_AT_byte_size   : 4
    <85c>   DW_AT_type        : <0x5fe>
 <1><860>: Abbrev Number: 4 (DW_TAG_typedef)
    <861>   DW_AT_name        : (indirect string, offset: 0x5cf): struct_sysent
    <865>   DW_AT_decl_file   : 17
    <866>   DW_AT_decl_line   : 19
    <867>   DW_AT_decl_column : 3
    <868>   DW_AT_type        : <0x5a5>
 <1><86c>: Abbrev Number: 3 (DW_TAG_const_type)
    <86d>   DW_AT_type        : <0x860>
 <1><871>: Abbrev Number: 11 (DW_TAG_variable)
    <872>   DW_AT_name        : (indirect string, offset: 0xdec): current_personality
    <876>   DW_AT_decl_file   : 18
    <877>   DW_AT_decl_line   : 158
    <878>   DW_AT_decl_column : 17
    <879>   DW_AT_type        : <0x2b>
    <87d>   DW_AT_external    : 1
    <87e>   DW_AT_declaration : 1
 <1><87f>: Abbrev Number: 11 (DW_TAG_variable)
    <880>   DW_AT_name        : (indirect string, offset: 0x868): current_wordsize
    <884>   DW_AT_decl_file   : 18
    <885>   DW_AT_decl_line   : 171
    <886>   DW_AT_decl_column : 17
    <887>   DW_AT_type        : <0x2b>
    <88b>   DW_AT_external    : 1
    <88c>   DW_AT_declaration : 1
 <1><88d>: Abbrev Number: 11 (DW_TAG_variable)
    <88e>   DW_AT_name        : (indirect string, offset: 0xaec): current_klongsize
    <892>   DW_AT_decl_file   : 18
    <893>   DW_AT_decl_line   : 176
    <894>   DW_AT_decl_column : 17
    <895>   DW_AT_type        : <0x2b>
    <899>   DW_AT_external    : 1
    <89a>   DW_AT_declaration : 1
 <1><89b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <89c>   DW_AT_name        : (indirect string, offset: 0xd29): ioctlent
    <8a0>   DW_AT_byte_size   : 8
    <8a1>   DW_AT_decl_file   : 18
    <8a2>   DW_AT_decl_line   : 217
    <8a3>   DW_AT_decl_column : 16
    <8a4>   DW_AT_sibling     : <0x8c7>
 <2><8a8>: Abbrev Number: 9 (DW_TAG_member)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xff4): symbol
    <8ad>   DW_AT_decl_file   : 18
    <8ae>   DW_AT_decl_line   : 218
    <8af>   DW_AT_decl_column : 14
    <8b0>   DW_AT_type        : <0x1e6>
    <8b4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b7>: Abbrev Number: 9 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0xdab): code
    <8bc>   DW_AT_decl_file   : 18
    <8bd>   DW_AT_decl_line   : 219
    <8be>   DW_AT_decl_column : 15
    <8bf>   DW_AT_type        : <0x2b>
    <8c3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8c6>: Abbrev Number: 0
 <1><8c7>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c8>   DW_AT_name        : (indirect string, offset: 0xcea): struct_ioctlent
    <8cc>   DW_AT_decl_file   : 18
    <8cd>   DW_AT_decl_line   : 220
    <8ce>   DW_AT_decl_column : 3
    <8cf>   DW_AT_type        : <0x89b>
 <1><8d3>: Abbrev Number: 3 (DW_TAG_const_type)
    <8d4>   DW_AT_type        : <0x8c7>
 <1><8d8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x85c): inject_data
    <8dd>   DW_AT_byte_size   : 10
    <8de>   DW_AT_decl_file   : 18
    <8df>   DW_AT_decl_line   : 241
    <8e0>   DW_AT_decl_column : 8
    <8e1>   DW_AT_sibling     : <0x940>
 <2><8e5>: Abbrev Number: 9 (DW_TAG_member)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x4fa): flags
    <8ea>   DW_AT_decl_file   : 18
    <8eb>   DW_AT_decl_line   : 242
    <8ec>   DW_AT_decl_column : 10
    <8ed>   DW_AT_type        : <0x10f>
    <8f1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f4>: Abbrev Number: 9 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x98e): signo
    <8f9>   DW_AT_decl_file   : 18
    <8fa>   DW_AT_decl_line   : 243
    <8fb>   DW_AT_decl_column : 10
    <8fc>   DW_AT_type        : <0x10f>
    <900>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><903>: Abbrev Number: 9 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <908>   DW_AT_decl_file   : 18
    <909>   DW_AT_decl_line   : 244
    <90a>   DW_AT_decl_column : 11
    <90b>   DW_AT_type        : <0x11b>
    <90f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><912>: Abbrev Number: 9 (DW_TAG_member)
    <913>   DW_AT_name        : (indirect string, offset: 0xd7d): delay_idx
    <917>   DW_AT_decl_file   : 18
    <918>   DW_AT_decl_line   : 245
    <919>   DW_AT_decl_column : 11
    <91a>   DW_AT_type        : <0x11b>
    <91e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><921>: Abbrev Number: 9 (DW_TAG_member)
    <922>   DW_AT_name        : (indirect string, offset: 0x634): poke_idx
    <926>   DW_AT_decl_file   : 18
    <927>   DW_AT_decl_line   : 246
    <928>   DW_AT_decl_column : 11
    <929>   DW_AT_type        : <0x11b>
    <92d>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><930>: Abbrev Number: 9 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <935>   DW_AT_decl_file   : 18
    <936>   DW_AT_decl_line   : 247
    <937>   DW_AT_decl_column : 11
    <938>   DW_AT_type        : <0x11b>
    <93c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><93f>: Abbrev Number: 0
 <1><940>: Abbrev Number: 8 (DW_TAG_structure_type)
    <941>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <945>   DW_AT_byte_size   : 16
    <946>   DW_AT_decl_file   : 18
    <947>   DW_AT_decl_line   : 250
    <948>   DW_AT_decl_column : 8
    <949>   DW_AT_sibling     : <0x98a>
 <2><94d>: Abbrev Number: 9 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0xac1): first
    <952>   DW_AT_decl_file   : 18
    <953>   DW_AT_decl_line   : 251
    <954>   DW_AT_decl_column : 11
    <955>   DW_AT_type        : <0x11b>
    <959>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><95c>: Abbrev Number: 9 (DW_TAG_member)
    <95d>   DW_AT_name        : (indirect string, offset: 0x11d0): last
    <961>   DW_AT_decl_file   : 18
    <962>   DW_AT_decl_line   : 252
    <963>   DW_AT_decl_column : 11
    <964>   DW_AT_type        : <0x11b>
    <968>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><96b>: Abbrev Number: 9 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0x3a6): step
    <970>   DW_AT_decl_file   : 18
    <971>   DW_AT_decl_line   : 253
    <972>   DW_AT_decl_column : 11
    <973>   DW_AT_type        : <0x11b>
    <977>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><97a>: Abbrev Number: 9 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x1192): data
    <97f>   DW_AT_decl_file   : 18
    <980>   DW_AT_decl_line   : 254
    <981>   DW_AT_decl_column : 21
    <982>   DW_AT_type        : <0x8d8>
    <986>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><989>: Abbrev Number: 0
 <1><98a>: Abbrev Number: 15 (DW_TAG_array_type)
    <98b>   DW_AT_type        : <0x562>
    <98f>   DW_AT_sibling     : <0x99a>
 <2><993>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <994>   DW_AT_type        : <0x2b>
    <998>   DW_AT_upper_bound : 5
 <2><999>: Abbrev Number: 0
 <1><99a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <99b>   DW_AT_name        : (indirect string, offset: 0xfc1): staged_output_data
    <99f>   DW_AT_declaration : 1
 <1><9a0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a1>   DW_AT_byte_size   : 4
    <9a2>   DW_AT_type        : <0x99a>
 <1><9a6>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a7>   DW_AT_prototyped  : 1
    <9a8>   DW_AT_sibling     : <0x9b2>
 <2><9ac>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ad>   DW_AT_type        : <0xea>
 <2><9b1>: Abbrev Number: 0
 <1><9b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_type        : <0x9a6>
 <1><9b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x86c>
 <1><9be>: Abbrev Number: 3 (DW_TAG_const_type)
    <9bf>   DW_AT_type        : <0x9b8>
 <1><9c3>: Abbrev Number: 15 (DW_TAG_array_type)
    <9c4>   DW_AT_type        : <0x9d3>
    <9c8>   DW_AT_sibling     : <0x9d3>
 <2><9cc>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9cd>   DW_AT_type        : <0x2b>
    <9d1>   DW_AT_upper_bound : 2
 <2><9d2>: Abbrev Number: 0
 <1><9d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d4>   DW_AT_byte_size   : 4
    <9d5>   DW_AT_type        : <0x940>
 <1><9d9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9da>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9de>   DW_AT_declaration : 1
 <1><9df>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e0>   DW_AT_byte_size   : 4
    <9e1>   DW_AT_type        : <0x9d9>
 <1><9e5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x3d3): tcb_wait_data
    <9ea>   DW_AT_declaration : 1
 <1><9eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ec>   DW_AT_byte_size   : 4
    <9ed>   DW_AT_type        : <0x9e5>
 <1><9f1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <9f6>   DW_AT_declaration : 1
 <1><9f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f8>   DW_AT_byte_size   : 4
    <9f9>   DW_AT_type        : <0x9f1>
 <1><9fd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fe>   DW_AT_name        : (indirect string, offset: 0xfa5): unwind_queue_t
    <a02>   DW_AT_declaration : 1
 <1><a03>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a04>   DW_AT_byte_size   : 4
    <a05>   DW_AT_type        : <0x9fd>
 <1><a09>: Abbrev Number: 15 (DW_TAG_array_type)
    <a0a>   DW_AT_type        : <0x103>
    <a0e>   DW_AT_sibling     : <0xa19>
 <2><a12>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a13>   DW_AT_type        : <0x2b>
    <a17>   DW_AT_upper_bound : 15
 <2><a18>: Abbrev Number: 0
 <1><a19>: Abbrev Number: 10 (DW_TAG_variable)
    <a1a>   DW_AT_name        : (indirect string, offset: 0xc28): stub_sysent
    <a1e>   DW_AT_decl_file   : 18
    <a1f>   DW_AT_decl_line   : 400
    <a21>   DW_AT_decl_column : 28
    <a22>   DW_AT_type        : <0x86c>
    <a26>   DW_AT_external    : 1
    <a27>   DW_AT_declaration : 1
 <1><a28>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a29>   DW_AT_name        : (indirect string, offset: 0x1175): xlat_type
    <a2d>   DW_AT_encoding    : 7	(unsigned)
    <a2e>   DW_AT_byte_size   : 4
    <a2f>   DW_AT_type        : <0x2b>
    <a33>   DW_AT_decl_file   : 19
    <a34>   DW_AT_decl_line   : 13
    <a35>   DW_AT_decl_column : 6
    <a36>   DW_AT_sibling     : <0xa4d>
 <2><a3a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x2d2): XT_NORMAL
    <a3f>   DW_AT_const_value : 0
 <2><a40>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0xd01): XT_SORTED
    <a45>   DW_AT_const_value : 1
 <2><a46>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0xe78): XT_INDEXED
    <a4b>   DW_AT_const_value : 2
 <2><a4c>: Abbrev Number: 0
 <1><a4d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xc63): xlat_style
    <a52>   DW_AT_encoding    : 7	(unsigned)
    <a53>   DW_AT_byte_size   : 4
    <a54>   DW_AT_type        : <0x2b>
    <a58>   DW_AT_decl_file   : 19
    <a59>   DW_AT_decl_line   : 19
    <a5a>   DW_AT_decl_column : 6
    <a5b>   DW_AT_sibling     : <0xa8a>
 <2><a5f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a64>   DW_AT_const_value : 0
 <2><a65>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0xc96): XLAT_STYLE_RAW
    <a6a>   DW_AT_const_value : 1
 <2><a6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x1140): XLAT_STYLE_ABBREV
    <a70>   DW_AT_const_value : 2
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x2ef): XLAT_STYLE_VERBOSE
    <a76>   DW_AT_const_value : 3
 <2><a77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a7c>   DW_AT_const_value : 0
 <2><a7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a82>   DW_AT_const_value : 4
 <2><a83>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x11b6): XLAT_STYLE_FMT_D
    <a88>   DW_AT_const_value : 8
 <2><a89>: Abbrev Number: 0
 <1><a8a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x320): xlat_data
    <a8f>   DW_AT_byte_size   : 16
    <a90>   DW_AT_decl_file   : 19
    <a91>   DW_AT_decl_line   : 51
    <a92>   DW_AT_decl_column : 8
    <a93>   DW_AT_sibling     : <0xab6>
 <2><a97>: Abbrev Number: 18 (DW_TAG_member)
    <a98>   DW_AT_name        : val
    <a9c>   DW_AT_decl_file   : 19
    <a9d>   DW_AT_decl_line   : 52
    <a9e>   DW_AT_decl_column : 11
    <a9f>   DW_AT_type        : <0x133>
    <aa3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aa6>: Abbrev Number: 18 (DW_TAG_member)
    <aa7>   DW_AT_name        : str
    <aab>   DW_AT_decl_file   : 19
    <aac>   DW_AT_decl_line   : 53
    <aad>   DW_AT_decl_column : 14
    <aae>   DW_AT_type        : <0x1e6>
    <ab2>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ab5>: Abbrev Number: 0
 <1><ab6>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab7>   DW_AT_type        : <0xa8a>
 <1><abb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <abc>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ac0>   DW_AT_byte_size   : 24
    <ac1>   DW_AT_decl_file   : 19
    <ac2>   DW_AT_decl_line   : 56
    <ac3>   DW_AT_decl_column : 8
    <ac4>   DW_AT_sibling     : <0xb14>
 <2><ac8>: Abbrev Number: 9 (DW_TAG_member)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x1192): data
    <acd>   DW_AT_decl_file   : 19
    <ace>   DW_AT_decl_line   : 57
    <acf>   DW_AT_decl_column : 26
    <ad0>   DW_AT_type        : <0xb19>
    <ad4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad7>: Abbrev Number: 9 (DW_TAG_member)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x8c4): flags_strsz
    <adc>   DW_AT_decl_file   : 19
    <add>   DW_AT_decl_line   : 58
    <ade>   DW_AT_decl_column : 9
    <adf>   DW_AT_type        : <0x146>
    <ae3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ae6>: Abbrev Number: 9 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0xbf9): size
    <aeb>   DW_AT_decl_file   : 19
    <aec>   DW_AT_decl_line   : 59
    <aed>   DW_AT_decl_column : 11
    <aee>   DW_AT_type        : <0x127>
    <af2>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af5>: Abbrev Number: 9 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0x1aa): type
    <afa>   DW_AT_decl_file   : 19
    <afb>   DW_AT_decl_line   : 60
    <afc>   DW_AT_decl_column : 17
    <afd>   DW_AT_type        : <0xa28>
    <b01>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b04>: Abbrev Number: 9 (DW_TAG_member)
    <b05>   DW_AT_name        : (indirect string, offset: 0x764): flags_mask
    <b09>   DW_AT_decl_file   : 19
    <b0a>   DW_AT_decl_line   : 61
    <b0b>   DW_AT_decl_column : 11
    <b0c>   DW_AT_type        : <0x133>
    <b10>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b13>: Abbrev Number: 0
 <1><b14>: Abbrev Number: 3 (DW_TAG_const_type)
    <b15>   DW_AT_type        : <0xabb>
 <1><b19>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b1a>   DW_AT_byte_size   : 4
    <b1b>   DW_AT_type        : <0xab6>
 <1><b1f>: Abbrev Number: 15 (DW_TAG_array_type)
    <b20>   DW_AT_type        : <0xb14>
    <b24>   DW_AT_sibling     : <0xb2a>
 <2><b28>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b29>: Abbrev Number: 0
 <1><b2a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2b>   DW_AT_type        : <0xb1f>
 <1><b2f>: Abbrev Number: 10 (DW_TAG_variable)
    <b30>   DW_AT_name        : (indirect string, offset: 0xee8): addrfams
    <b34>   DW_AT_decl_file   : 18
    <b35>   DW_AT_decl_line   : 406
    <b37>   DW_AT_decl_column : 26
    <b38>   DW_AT_type        : <0xb2a>
    <b3c>   DW_AT_external    : 1
    <b3d>   DW_AT_declaration : 1
 <1><b3e>: Abbrev Number: 10 (DW_TAG_variable)
    <b3f>   DW_AT_name        : (indirect string, offset: 0xdbb): arp_hardware_types
    <b43>   DW_AT_decl_file   : 18
    <b44>   DW_AT_decl_line   : 407
    <b46>   DW_AT_decl_column : 26
    <b47>   DW_AT_type        : <0xb2a>
    <b4b>   DW_AT_external    : 1
    <b4c>   DW_AT_declaration : 1
 <1><b4d>: Abbrev Number: 10 (DW_TAG_variable)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x10bd): at_flags
    <b52>   DW_AT_decl_file   : 18
    <b53>   DW_AT_decl_line   : 408
    <b55>   DW_AT_decl_column : 26
    <b56>   DW_AT_type        : <0xb2a>
    <b5a>   DW_AT_external    : 1
    <b5b>   DW_AT_declaration : 1
 <1><b5c>: Abbrev Number: 10 (DW_TAG_variable)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x4b3): clocknames
    <b61>   DW_AT_decl_file   : 18
    <b62>   DW_AT_decl_line   : 409
    <b64>   DW_AT_decl_column : 26
    <b65>   DW_AT_type        : <0xb2a>
    <b69>   DW_AT_external    : 1
    <b6a>   DW_AT_declaration : 1
 <1><b6b>: Abbrev Number: 10 (DW_TAG_variable)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x1087): dirent_types
    <b70>   DW_AT_decl_file   : 18
    <b71>   DW_AT_decl_line   : 410
    <b73>   DW_AT_decl_column : 26
    <b74>   DW_AT_type        : <0xb2a>
    <b78>   DW_AT_external    : 1
    <b79>   DW_AT_declaration : 1
 <1><b7a>: Abbrev Number: 10 (DW_TAG_variable)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x91e): ethernet_protocols
    <b7f>   DW_AT_decl_file   : 18
    <b80>   DW_AT_decl_line   : 411
    <b82>   DW_AT_decl_column : 26
    <b83>   DW_AT_type        : <0xb2a>
    <b87>   DW_AT_external    : 1
    <b88>   DW_AT_declaration : 1
 <1><b89>: Abbrev Number: 10 (DW_TAG_variable)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x687): inet_protocols
    <b8e>   DW_AT_decl_file   : 18
    <b8f>   DW_AT_decl_line   : 412
    <b91>   DW_AT_decl_column : 26
    <b92>   DW_AT_type        : <0xb2a>
    <b96>   DW_AT_external    : 1
    <b97>   DW_AT_declaration : 1
 <1><b98>: Abbrev Number: 10 (DW_TAG_variable)
    <b99>   DW_AT_name        : (indirect string, offset: 0x2bf): evdev_abs
    <b9d>   DW_AT_decl_file   : 18
    <b9e>   DW_AT_decl_line   : 413
    <ba0>   DW_AT_decl_column : 26
    <ba1>   DW_AT_type        : <0xb2a>
    <ba5>   DW_AT_external    : 1
    <ba6>   DW_AT_declaration : 1
 <1><ba7>: Abbrev Number: 10 (DW_TAG_variable)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x759): audit_arch
    <bac>   DW_AT_decl_file   : 18
    <bad>   DW_AT_decl_line   : 414
    <baf>   DW_AT_decl_column : 26
    <bb0>   DW_AT_type        : <0xb2a>
    <bb4>   DW_AT_external    : 1
    <bb5>   DW_AT_declaration : 1
 <1><bb6>: Abbrev Number: 10 (DW_TAG_variable)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bbb>   DW_AT_decl_file   : 18
    <bbc>   DW_AT_decl_line   : 415
    <bbe>   DW_AT_decl_column : 26
    <bbf>   DW_AT_type        : <0xb2a>
    <bc3>   DW_AT_external    : 1
    <bc4>   DW_AT_declaration : 1
 <1><bc5>: Abbrev Number: 10 (DW_TAG_variable)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x494): iffflags
    <bca>   DW_AT_decl_file   : 18
    <bcb>   DW_AT_decl_line   : 416
    <bcd>   DW_AT_decl_column : 26
    <bce>   DW_AT_type        : <0xb2a>
    <bd2>   DW_AT_external    : 1
    <bd3>   DW_AT_declaration : 1
 <1><bd4>: Abbrev Number: 10 (DW_TAG_variable)
    <bd5>   DW_AT_name        : (indirect string, offset: 0xca5): ip_type_of_services
    <bd9>   DW_AT_decl_file   : 18
    <bda>   DW_AT_decl_line   : 417
    <bdc>   DW_AT_decl_column : 26
    <bdd>   DW_AT_type        : <0xb2a>
    <be1>   DW_AT_external    : 1
    <be2>   DW_AT_declaration : 1
 <1><be3>: Abbrev Number: 10 (DW_TAG_variable)
    <be4>   DW_AT_name        : (indirect string, offset: 0x6e2): ipc_private
    <be8>   DW_AT_decl_file   : 18
    <be9>   DW_AT_decl_line   : 418
    <beb>   DW_AT_decl_column : 26
    <bec>   DW_AT_type        : <0xb2a>
    <bf0>   DW_AT_external    : 1
    <bf1>   DW_AT_declaration : 1
 <1><bf2>: Abbrev Number: 10 (DW_TAG_variable)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x316): msg_flags
    <bf7>   DW_AT_decl_file   : 18
    <bf8>   DW_AT_decl_line   : 419
    <bfa>   DW_AT_decl_column : 26
    <bfb>   DW_AT_type        : <0xb2a>
    <bff>   DW_AT_external    : 1
    <c00>   DW_AT_declaration : 1
 <1><c01>: Abbrev Number: 10 (DW_TAG_variable)
    <c02>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c06>   DW_AT_decl_file   : 18
    <c07>   DW_AT_decl_line   : 420
    <c09>   DW_AT_decl_column : 26
    <c0a>   DW_AT_type        : <0xb2a>
    <c0e>   DW_AT_external    : 1
    <c0f>   DW_AT_declaration : 1
 <1><c10>: Abbrev Number: 10 (DW_TAG_variable)
    <c11>   DW_AT_name        : (indirect string, offset: 0xfd4): nl_bridge_vlan_flags
    <c15>   DW_AT_decl_file   : 18
    <c16>   DW_AT_decl_line   : 421
    <c18>   DW_AT_decl_column : 26
    <c19>   DW_AT_type        : <0xb2a>
    <c1d>   DW_AT_external    : 1
    <c1e>   DW_AT_declaration : 1
 <1><c1f>: Abbrev Number: 10 (DW_TAG_variable)
    <c20>   DW_AT_name        : (indirect string, offset: 0xe61): nl_netfilter_msg_types
    <c24>   DW_AT_decl_file   : 18
    <c25>   DW_AT_decl_line   : 422
    <c27>   DW_AT_decl_column : 26
    <c28>   DW_AT_type        : <0xb2a>
    <c2c>   DW_AT_external    : 1
    <c2d>   DW_AT_declaration : 1
 <1><c2e>: Abbrev Number: 10 (DW_TAG_variable)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x22b): nl_route_types
    <c33>   DW_AT_decl_file   : 18
    <c34>   DW_AT_decl_line   : 423
    <c36>   DW_AT_decl_column : 26
    <c37>   DW_AT_type        : <0xb2a>
    <c3b>   DW_AT_external    : 1
    <c3c>   DW_AT_declaration : 1
 <1><c3d>: Abbrev Number: 10 (DW_TAG_variable)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xf26): open_access_modes
    <c42>   DW_AT_decl_file   : 18
    <c43>   DW_AT_decl_line   : 424
    <c45>   DW_AT_decl_column : 26
    <c46>   DW_AT_type        : <0xb2a>
    <c4a>   DW_AT_external    : 1
    <c4b>   DW_AT_declaration : 1
 <1><c4c>: Abbrev Number: 10 (DW_TAG_variable)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c51>   DW_AT_decl_file   : 18
    <c52>   DW_AT_decl_line   : 425
    <c54>   DW_AT_decl_column : 26
    <c55>   DW_AT_type        : <0xb2a>
    <c59>   DW_AT_external    : 1
    <c5a>   DW_AT_declaration : 1
 <1><c5b>: Abbrev Number: 10 (DW_TAG_variable)
    <c5c>   DW_AT_name        : (indirect string, offset: 0xcdd): perf_type_id
    <c60>   DW_AT_decl_file   : 18
    <c61>   DW_AT_decl_line   : 426
    <c63>   DW_AT_decl_column : 26
    <c64>   DW_AT_type        : <0xb2a>
    <c68>   DW_AT_external    : 1
    <c69>   DW_AT_declaration : 1
 <1><c6a>: Abbrev Number: 10 (DW_TAG_variable)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xef1): pollflags
    <c6f>   DW_AT_decl_file   : 18
    <c70>   DW_AT_decl_line   : 427
    <c72>   DW_AT_decl_column : 26
    <c73>   DW_AT_type        : <0xb2a>
    <c77>   DW_AT_external    : 1
    <c78>   DW_AT_declaration : 1
 <1><c79>: Abbrev Number: 10 (DW_TAG_variable)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x628): ptrace_cmds
    <c7e>   DW_AT_decl_file   : 18
    <c7f>   DW_AT_decl_line   : 428
    <c81>   DW_AT_decl_column : 26
    <c82>   DW_AT_type        : <0xb2a>
    <c86>   DW_AT_external    : 1
    <c87>   DW_AT_declaration : 1
 <1><c88>: Abbrev Number: 10 (DW_TAG_variable)
    <c89>   DW_AT_name        : (indirect string, offset: 0x84d): resource_flags
    <c8d>   DW_AT_decl_file   : 18
    <c8e>   DW_AT_decl_line   : 429
    <c90>   DW_AT_decl_column : 26
    <c91>   DW_AT_type        : <0xb2a>
    <c95>   DW_AT_external    : 1
    <c96>   DW_AT_declaration : 1
 <1><c97>: Abbrev Number: 10 (DW_TAG_variable)
    <c98>   DW_AT_name        : (indirect string, offset: 0x295): route_nexthop_flags
    <c9c>   DW_AT_decl_file   : 18
    <c9d>   DW_AT_decl_line   : 430
    <c9f>   DW_AT_decl_column : 26
    <ca0>   DW_AT_type        : <0xb2a>
    <ca4>   DW_AT_external    : 1
    <ca5>   DW_AT_declaration : 1
 <1><ca6>: Abbrev Number: 10 (DW_TAG_variable)
    <ca7>   DW_AT_name        : (indirect string, offset: 0xf4f): routing_protocols
    <cab>   DW_AT_decl_file   : 18
    <cac>   DW_AT_decl_line   : 431
    <cae>   DW_AT_decl_column : 26
    <caf>   DW_AT_type        : <0xb2a>
    <cb3>   DW_AT_external    : 1
    <cb4>   DW_AT_declaration : 1
 <1><cb5>: Abbrev Number: 10 (DW_TAG_variable)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x485): routing_scopes
    <cba>   DW_AT_decl_file   : 18
    <cbb>   DW_AT_decl_line   : 432
    <cbd>   DW_AT_decl_column : 26
    <cbe>   DW_AT_type        : <0xb2a>
    <cc2>   DW_AT_external    : 1
    <cc3>   DW_AT_declaration : 1
 <1><cc4>: Abbrev Number: 10 (DW_TAG_variable)
    <cc5>   DW_AT_name        : (indirect string, offset: 0xe4f): routing_table_ids
    <cc9>   DW_AT_decl_file   : 18
    <cca>   DW_AT_decl_line   : 433
    <ccc>   DW_AT_decl_column : 26
    <ccd>   DW_AT_type        : <0xb2a>
    <cd1>   DW_AT_external    : 1
    <cd2>   DW_AT_declaration : 1
 <1><cd3>: Abbrev Number: 10 (DW_TAG_variable)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x6bf): routing_types
    <cd8>   DW_AT_decl_file   : 18
    <cd9>   DW_AT_decl_line   : 434
    <cdb>   DW_AT_decl_column : 26
    <cdc>   DW_AT_type        : <0xb2a>
    <ce0>   DW_AT_external    : 1
    <ce1>   DW_AT_declaration : 1
 <1><ce2>: Abbrev Number: 10 (DW_TAG_variable)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x1ce): rwf_flags
    <ce7>   DW_AT_decl_file   : 18
    <ce8>   DW_AT_decl_line   : 435
    <cea>   DW_AT_decl_column : 26
    <ceb>   DW_AT_type        : <0xb2a>
    <cef>   DW_AT_external    : 1
    <cf0>   DW_AT_declaration : 1
 <1><cf1>: Abbrev Number: 10 (DW_TAG_variable)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x88f): seccomp_filter_flags
    <cf6>   DW_AT_decl_file   : 18
    <cf7>   DW_AT_decl_line   : 436
    <cf9>   DW_AT_decl_column : 26
    <cfa>   DW_AT_type        : <0xb2a>
    <cfe>   DW_AT_external    : 1
    <cff>   DW_AT_declaration : 1
 <1><d00>: Abbrev Number: 10 (DW_TAG_variable)
    <d01>   DW_AT_name        : (indirect string, offset: 0x2dc): seccomp_ret_action
    <d05>   DW_AT_decl_file   : 18
    <d06>   DW_AT_decl_line   : 437
    <d08>   DW_AT_decl_column : 26
    <d09>   DW_AT_type        : <0xb2a>
    <d0d>   DW_AT_external    : 1
    <d0e>   DW_AT_declaration : 1
 <1><d0f>: Abbrev Number: 10 (DW_TAG_variable)
    <d10>   DW_AT_name        : (indirect string, offset: 0x43d): setns_types
    <d14>   DW_AT_decl_file   : 18
    <d15>   DW_AT_decl_line   : 438
    <d17>   DW_AT_decl_column : 26
    <d18>   DW_AT_type        : <0xb2a>
    <d1c>   DW_AT_external    : 1
    <d1d>   DW_AT_declaration : 1
 <1><d1e>: Abbrev Number: 10 (DW_TAG_variable)
    <d1f>   DW_AT_name        : (indirect string, offset: 0xedd): sg_io_info
    <d23>   DW_AT_decl_file   : 18
    <d24>   DW_AT_decl_line   : 439
    <d26>   DW_AT_decl_column : 26
    <d27>   DW_AT_type        : <0xb2a>
    <d2b>   DW_AT_external    : 1
    <d2c>   DW_AT_declaration : 1
 <1><d2d>: Abbrev Number: 10 (DW_TAG_variable)
    <d2e>   DW_AT_name        : (indirect string, offset: 0xc3c): socketlayers
    <d32>   DW_AT_decl_file   : 18
    <d33>   DW_AT_decl_line   : 440
    <d35>   DW_AT_decl_column : 26
    <d36>   DW_AT_type        : <0xb2a>
    <d3a>   DW_AT_external    : 1
    <d3b>   DW_AT_declaration : 1
 <1><d3c>: Abbrev Number: 10 (DW_TAG_variable)
    <d3d>   DW_AT_name        : (indirect string, offset: 0xe39): socktypes
    <d41>   DW_AT_decl_file   : 18
    <d42>   DW_AT_decl_line   : 441
    <d44>   DW_AT_decl_column : 26
    <d45>   DW_AT_type        : <0xb2a>
    <d49>   DW_AT_external    : 1
    <d4a>   DW_AT_declaration : 1
 <1><d4b>: Abbrev Number: 10 (DW_TAG_variable)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xafe): tcp_state_flags
    <d50>   DW_AT_decl_file   : 18
    <d51>   DW_AT_decl_line   : 442
    <d53>   DW_AT_decl_column : 26
    <d54>   DW_AT_type        : <0xb2a>
    <d58>   DW_AT_external    : 1
    <d59>   DW_AT_declaration : 1
 <1><d5a>: Abbrev Number: 10 (DW_TAG_variable)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x78e): tcp_states
    <d5f>   DW_AT_decl_file   : 18
    <d60>   DW_AT_decl_line   : 443
    <d62>   DW_AT_decl_column : 26
    <d63>   DW_AT_type        : <0xb2a>
    <d67>   DW_AT_external    : 1
    <d68>   DW_AT_declaration : 1
 <1><d69>: Abbrev Number: 10 (DW_TAG_variable)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x1123): whence_codes
    <d6e>   DW_AT_decl_file   : 18
    <d6f>   DW_AT_decl_line   : 444
    <d71>   DW_AT_decl_column : 26
    <d72>   DW_AT_type        : <0xb2a>
    <d76>   DW_AT_external    : 1
    <d77>   DW_AT_declaration : 1
 <1><d78>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d79>   DW_AT_encoding    : 7	(unsigned)
    <d7a>   DW_AT_byte_size   : 4
    <d7b>   DW_AT_type        : <0x2b>
    <d7f>   DW_AT_decl_file   : 18
    <d80>   DW_AT_decl_line   : 505
    <d82>   DW_AT_decl_column : 14
    <d83>   DW_AT_sibling     : <0xd9a>
 <2><d87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d88>   DW_AT_name        : (indirect string, offset: 0xa0b): CFLAG_NONE
    <d8c>   DW_AT_const_value : 0
 <2><d8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x931): CFLAG_ONLY_STATS
    <d92>   DW_AT_const_value : 1
 <2><d93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0xc49): CFLAG_BOTH
    <d98>   DW_AT_const_value : 2
 <2><d99>: Abbrev Number: 0
 <1><d9a>: Abbrev Number: 28 (DW_TAG_typedef)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x11d5): cflag_t
    <d9f>   DW_AT_decl_file   : 18
    <da0>   DW_AT_decl_line   : 509
    <da2>   DW_AT_decl_column : 3
    <da3>   DW_AT_type        : <0xd78>
 <1><da7>: Abbrev Number: 10 (DW_TAG_variable)
    <da8>   DW_AT_name        : (indirect string, offset: 0xd77): cflag
    <dac>   DW_AT_decl_file   : 18
    <dad>   DW_AT_decl_line   : 510
    <daf>   DW_AT_decl_column : 16
    <db0>   DW_AT_type        : <0xd9a>
    <db4>   DW_AT_external    : 1
    <db5>   DW_AT_declaration : 1
 <1><db6>: Abbrev Number: 10 (DW_TAG_variable)
    <db7>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dbb>   DW_AT_decl_file   : 18
    <dbc>   DW_AT_decl_line   : 511
    <dbe>   DW_AT_decl_column : 13
    <dbf>   DW_AT_type        : <0x532>
    <dc3>   DW_AT_external    : 1
    <dc4>   DW_AT_declaration : 1
 <1><dc5>: Abbrev Number: 10 (DW_TAG_variable)
    <dc6>   DW_AT_name        : (indirect string, offset: 0x7fc): Tflag_scale
    <dca>   DW_AT_decl_file   : 18
    <dcb>   DW_AT_decl_line   : 512
    <dcd>   DW_AT_decl_column : 12
    <dce>   DW_AT_type        : <0x64>
    <dd2>   DW_AT_external    : 1
    <dd3>   DW_AT_declaration : 1
 <1><dd4>: Abbrev Number: 10 (DW_TAG_variable)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x8a4): Tflag_width
    <dd9>   DW_AT_decl_file   : 18
    <dda>   DW_AT_decl_line   : 513
    <ddc>   DW_AT_decl_column : 12
    <ddd>   DW_AT_type        : <0x64>
    <de1>   DW_AT_external    : 1
    <de2>   DW_AT_declaration : 1
 <1><de3>: Abbrev Number: 10 (DW_TAG_variable)
    <de4>   DW_AT_name        : (indirect string, offset: 0xec8): iflag
    <de8>   DW_AT_decl_file   : 18
    <de9>   DW_AT_decl_line   : 514
    <deb>   DW_AT_decl_column : 13
    <dec>   DW_AT_type        : <0x532>
    <df0>   DW_AT_external    : 1
    <df1>   DW_AT_declaration : 1
 <1><df2>: Abbrev Number: 10 (DW_TAG_variable)
    <df3>   DW_AT_name        : (indirect string, offset: 0x668): count_wallclock
    <df7>   DW_AT_decl_file   : 18
    <df8>   DW_AT_decl_line   : 515
    <dfa>   DW_AT_decl_column : 13
    <dfb>   DW_AT_type        : <0x532>
    <dff>   DW_AT_external    : 1
    <e00>   DW_AT_declaration : 1
 <1><e01>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e02>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e06>   DW_AT_byte_size   : 4
    <e07>   DW_AT_decl_file   : 18
    <e08>   DW_AT_decl_line   : 517
    <e0a>   DW_AT_decl_column : 8
    <e0b>   DW_AT_sibling     : <0xe20>
 <2><e0f>: Abbrev Number: 22 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e14>   DW_AT_decl_file   : 18
    <e15>   DW_AT_decl_line   : 518
    <e17>   DW_AT_decl_column : 14
    <e18>   DW_AT_type        : <0x1e6>
    <e1c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e1f>: Abbrev Number: 0
 <1><e20>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e21>   DW_AT_name        : (indirect string, offset: 0x799): path_set
    <e25>   DW_AT_byte_size   : 12
    <e26>   DW_AT_decl_file   : 18
    <e27>   DW_AT_decl_line   : 522
    <e29>   DW_AT_decl_column : 15
    <e2a>   DW_AT_sibling     : <0xe5f>
 <2><e2e>: Abbrev Number: 22 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x71d): paths_selected
    <e33>   DW_AT_decl_file   : 18
    <e34>   DW_AT_decl_line   : 523
    <e36>   DW_AT_decl_column : 24
    <e37>   DW_AT_type        : <0xe5f>
    <e3b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3e>: Abbrev Number: 22 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x1116): num_selected
    <e43>   DW_AT_decl_file   : 18
    <e44>   DW_AT_decl_line   : 524
    <e46>   DW_AT_decl_column : 9
    <e47>   DW_AT_type        : <0x146>
    <e4b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e4e>: Abbrev Number: 22 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0xbf9): size
    <e53>   DW_AT_decl_file   : 18
    <e54>   DW_AT_decl_line   : 525
    <e56>   DW_AT_decl_column : 9
    <e57>   DW_AT_type        : <0x146>
    <e5b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e5e>: Abbrev Number: 0
 <1><e5f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e60>   DW_AT_byte_size   : 4
    <e61>   DW_AT_type        : <0xe01>
 <1><e65>: Abbrev Number: 10 (DW_TAG_variable)
    <e66>   DW_AT_name        : (indirect string, offset: 0x1165): global_path_set
    <e6a>   DW_AT_decl_file   : 18
    <e6b>   DW_AT_decl_line   : 526
    <e6d>   DW_AT_decl_column : 3
    <e6e>   DW_AT_type        : <0xe20>
    <e72>   DW_AT_external    : 1
    <e73>   DW_AT_declaration : 1
 <1><e74>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e75>   DW_AT_name        : (indirect string, offset: 0x1074): xflag_opts
    <e79>   DW_AT_encoding    : 7	(unsigned)
    <e7a>   DW_AT_byte_size   : 4
    <e7b>   DW_AT_type        : <0x2b>
    <e7f>   DW_AT_decl_file   : 18
    <e80>   DW_AT_decl_line   : 528
    <e82>   DW_AT_decl_column : 6
    <e83>   DW_AT_sibling     : <0xea6>
 <2><e87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e88>   DW_AT_name        : (indirect string, offset: 0xab5): HEXSTR_NONE
    <e8c>   DW_AT_const_value : 0
 <2><e8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x109f): HEXSTR_NON_ASCII
    <e92>   DW_AT_const_value : 1
 <2><e93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0x979): HEXSTR_ALL
    <e98>   DW_AT_const_value : 2
 <2><e99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x6a8): HEXSTR_NON_ASCII_CHARS
    <e9e>   DW_AT_const_value : 3
 <2><e9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x1130): NUM_HEXSTR_OPTS
    <ea4>   DW_AT_const_value : 4
 <2><ea5>: Abbrev Number: 0
 <1><ea6>: Abbrev Number: 10 (DW_TAG_variable)
    <ea7>   DW_AT_name        : (indirect string, offset: 0xea2): xflag
    <eab>   DW_AT_decl_file   : 18
    <eac>   DW_AT_decl_line   : 541
    <eae>   DW_AT_decl_column : 17
    <eaf>   DW_AT_type        : <0x2b>
    <eb3>   DW_AT_external    : 1
    <eb4>   DW_AT_declaration : 1
 <1><eb5>: Abbrev Number: 10 (DW_TAG_variable)
    <eb6>   DW_AT_name        : (indirect string, offset: 0xd32): followfork
    <eba>   DW_AT_decl_file   : 18
    <ebb>   DW_AT_decl_line   : 542
    <ebd>   DW_AT_decl_column : 13
    <ebe>   DW_AT_type        : <0x532>
    <ec2>   DW_AT_external    : 1
    <ec3>   DW_AT_declaration : 1
 <1><ec4>: Abbrev Number: 10 (DW_TAG_variable)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x32a): output_separately
    <ec9>   DW_AT_decl_file   : 18
    <eca>   DW_AT_decl_line   : 543
    <ecc>   DW_AT_decl_column : 13
    <ecd>   DW_AT_type        : <0x532>
    <ed1>   DW_AT_external    : 1
    <ed2>   DW_AT_declaration : 1
 <1><ed3>: Abbrev Number: 10 (DW_TAG_variable)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x23a): stack_trace_enabled
    <ed8>   DW_AT_decl_file   : 18
    <ed9>   DW_AT_decl_line   : 546
    <edb>   DW_AT_decl_column : 13
    <edc>   DW_AT_type        : <0x532>
    <ee0>   DW_AT_external    : 1
    <ee1>   DW_AT_declaration : 1
 <1><ee2>: Abbrev Number: 10 (DW_TAG_variable)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x696): ptrace_setoptions
    <ee7>   DW_AT_decl_file   : 18
    <ee8>   DW_AT_decl_line   : 550
    <eea>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0x2b>
    <eef>   DW_AT_external    : 1
    <ef0>   DW_AT_declaration : 1
 <1><ef1>: Abbrev Number: 10 (DW_TAG_variable)
    <ef2>   DW_AT_name        : (indirect string, offset: 0xaa0): max_strlen
    <ef6>   DW_AT_decl_file   : 18
    <ef7>   DW_AT_decl_line   : 551
    <ef9>   DW_AT_decl_column : 17
    <efa>   DW_AT_type        : <0x2b>
    <efe>   DW_AT_external    : 1
    <eff>   DW_AT_declaration : 1
 <1><f00>: Abbrev Number: 10 (DW_TAG_variable)
    <f01>   DW_AT_name        : (indirect string, offset: 0xad8): os_release
    <f05>   DW_AT_decl_file   : 18
    <f06>   DW_AT_decl_line   : 552
    <f08>   DW_AT_decl_column : 17
    <f09>   DW_AT_type        : <0x2b>
    <f0d>   DW_AT_external    : 1
    <f0e>   DW_AT_declaration : 1
 <1><f0f>: Abbrev Number: 10 (DW_TAG_variable)
    <f10>   DW_AT_name        : (indirect string, offset: 0x72c): xlat_verbosity
    <f14>   DW_AT_decl_file   : 18
    <f15>   DW_AT_decl_line   : 914
    <f17>   DW_AT_decl_column : 24
    <f18>   DW_AT_type        : <0xa4d>
    <f1c>   DW_AT_external    : 1
    <f1d>   DW_AT_declaration : 1
 <1><f1e>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x64b): xlat_style_private_flag_bits
    <f23>   DW_AT_encoding    : 7	(unsigned)
    <f24>   DW_AT_byte_size   : 4
    <f25>   DW_AT_type        : <0x2b>
    <f29>   DW_AT_decl_file   : 18
    <f2a>   DW_AT_decl_line   : 934
    <f2c>   DW_AT_decl_column : 6
    <f2d>   DW_AT_sibling     : <0xf4a>
 <2><f31>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f32>   DW_AT_name        : (indirect string, offset: 0x2a9): PAF_PRINT_INDICES_BIT
    <f36>   DW_AT_const_value : 5
 <2><f37>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0xb9d): PAF_ARRAY_TRUNCATED_BIT
    <f3c>   DW_AT_const_value : 6
 <2><f3d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x3fd): PXF_DEFAULT_STR_BIT
    <f42>   DW_AT_const_value : 7
 <2><f43>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0xd14): SPFF_AUXSTR_MODE_BIT
    <f48>   DW_AT_const_value : 8
 <2><f49>: Abbrev Number: 0
 <1><f4a>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xdce): find_xlat_flag_bits
    <f4f>   DW_AT_encoding    : 7	(unsigned)
    <f50>   DW_AT_byte_size   : 4
    <f51>   DW_AT_type        : <0x2b>
    <f55>   DW_AT_decl_file   : 18
    <f56>   DW_AT_decl_line   : 1438
    <f58>   DW_AT_decl_column : 6
    <f59>   DW_AT_sibling     : <0xf64>
 <2><f5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x9c2): FXL_CASE_SENSITIVE_BIT
    <f62>   DW_AT_const_value : 0
 <2><f63>: Abbrev Number: 0
 <1><f64>: Abbrev Number: 10 (DW_TAG_variable)
    <f65>   DW_AT_name        : (indirect string, offset: 0xa69): printing_tcp
    <f69>   DW_AT_decl_file   : 18
    <f6a>   DW_AT_decl_line   : 1684
    <f6c>   DW_AT_decl_column : 20
    <f6d>   DW_AT_type        : <0x60e>
    <f71>   DW_AT_external    : 1
    <f72>   DW_AT_declaration : 1
 <1><f73>: Abbrev Number: 10 (DW_TAG_variable)
    <f74>   DW_AT_name        : (indirect string, offset: 0x5f4): errnoent
    <f78>   DW_AT_decl_file   : 18
    <f79>   DW_AT_decl_line   : 1882
    <f7b>   DW_AT_decl_column : 26
    <f7c>   DW_AT_type        : <0x466>
    <f80>   DW_AT_external    : 1
    <f81>   DW_AT_declaration : 1
 <1><f82>: Abbrev Number: 10 (DW_TAG_variable)
    <f83>   DW_AT_name        : (indirect string, offset: 0x8b0): signalent
    <f87>   DW_AT_decl_file   : 18
    <f88>   DW_AT_decl_line   : 1883
    <f8a>   DW_AT_decl_column : 26
    <f8b>   DW_AT_type        : <0x466>
    <f8f>   DW_AT_external    : 1
    <f90>   DW_AT_declaration : 1
 <1><f91>: Abbrev Number: 10 (DW_TAG_variable)
    <f92>   DW_AT_name        : (indirect string, offset: 0xf1e): nerrnos
    <f96>   DW_AT_decl_file   : 18
    <f97>   DW_AT_decl_line   : 1884
    <f99>   DW_AT_decl_column : 27
    <f9a>   DW_AT_type        : <0x32>
    <f9e>   DW_AT_external    : 1
    <f9f>   DW_AT_declaration : 1
 <1><fa0>: Abbrev Number: 10 (DW_TAG_variable)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x10ff): nsignals
    <fa5>   DW_AT_decl_file   : 18
    <fa6>   DW_AT_decl_line   : 1885
    <fa8>   DW_AT_decl_column : 27
    <fa9>   DW_AT_type        : <0x32>
    <fad>   DW_AT_external    : 1
    <fae>   DW_AT_declaration : 1
 <1><faf>: Abbrev Number: 15 (DW_TAG_array_type)
    <fb0>   DW_AT_type        : <0x86c>
    <fb4>   DW_AT_sibling     : <0xfba>
 <2><fb8>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb9>: Abbrev Number: 0
 <1><fba>: Abbrev Number: 3 (DW_TAG_const_type)
    <fbb>   DW_AT_type        : <0xfaf>
 <1><fbf>: Abbrev Number: 10 (DW_TAG_variable)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xd8e): sysent0
    <fc4>   DW_AT_decl_file   : 18
    <fc5>   DW_AT_decl_line   : 1887
    <fc7>   DW_AT_decl_column : 28
    <fc8>   DW_AT_type        : <0xfba>
    <fcc>   DW_AT_external    : 1
    <fcd>   DW_AT_declaration : 1
 <1><fce>: Abbrev Number: 15 (DW_TAG_array_type)
    <fcf>   DW_AT_type        : <0x8d3>
    <fd3>   DW_AT_sibling     : <0xfd9>
 <2><fd7>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd8>: Abbrev Number: 0
 <1><fd9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fda>   DW_AT_type        : <0xfce>
 <1><fde>: Abbrev Number: 10 (DW_TAG_variable)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x115b): ioctlent0
    <fe3>   DW_AT_decl_file   : 18
    <fe4>   DW_AT_decl_line   : 1888
    <fe6>   DW_AT_decl_column : 30
    <fe7>   DW_AT_type        : <0xfd9>
    <feb>   DW_AT_external    : 1
    <fec>   DW_AT_declaration : 1
 <1><fed>: Abbrev Number: 10 (DW_TAG_variable)
    <fee>   DW_AT_name        : (indirect string, offset: 0x46c): personality_names
    <ff2>   DW_AT_decl_file   : 18
    <ff3>   DW_AT_decl_line   : 1890
    <ff5>   DW_AT_decl_column : 26
    <ff6>   DW_AT_type        : <0x466>
    <ffa>   DW_AT_external    : 1
    <ffb>   DW_AT_declaration : 1
 <1><ffc>: Abbrev Number: 10 (DW_TAG_variable)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x8d0): sysent
    <1001>   DW_AT_decl_file   : 18
    <1002>   DW_AT_decl_line   : 1893
    <1004>   DW_AT_decl_column : 29
    <1005>   DW_AT_type        : <0x9b8>
    <1009>   DW_AT_external    : 1
    <100a>   DW_AT_declaration : 1
 <1><100b>: Abbrev Number: 10 (DW_TAG_variable)
    <100c>   DW_AT_name        : (indirect string, offset: 0xd29): ioctlent
    <1010>   DW_AT_decl_file   : 18
    <1011>   DW_AT_decl_line   : 1894
    <1013>   DW_AT_decl_column : 31
    <1014>   DW_AT_type        : <0x101a>
    <1018>   DW_AT_external    : 1
    <1019>   DW_AT_declaration : 1
 <1><101a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <101b>   DW_AT_byte_size   : 4
    <101c>   DW_AT_type        : <0x8d3>
 <1><1020>: Abbrev Number: 10 (DW_TAG_variable)
    <1021>   DW_AT_name        : (indirect string, offset: 0x8ba): nsyscalls
    <1025>   DW_AT_decl_file   : 18
    <1026>   DW_AT_decl_line   : 1900
    <1028>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0x2b>
    <102d>   DW_AT_external    : 1
    <102e>   DW_AT_declaration : 1
 <1><102f>: Abbrev Number: 10 (DW_TAG_variable)
    <1030>   DW_AT_name        : (indirect string, offset: 0xf44): nioctlents
    <1034>   DW_AT_decl_file   : 18
    <1035>   DW_AT_decl_line   : 1901
    <1037>   DW_AT_decl_column : 17
    <1038>   DW_AT_type        : <0x2b>
    <103c>   DW_AT_external    : 1
    <103d>   DW_AT_declaration : 1
 <1><103e>: Abbrev Number: 15 (DW_TAG_array_type)
    <103f>   DW_AT_type        : <0x32>
    <1043>   DW_AT_sibling     : <0x104e>
 <2><1047>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1048>   DW_AT_type        : <0x2b>
    <104c>   DW_AT_upper_bound : 2
 <2><104d>: Abbrev Number: 0
 <1><104e>: Abbrev Number: 3 (DW_TAG_const_type)
    <104f>   DW_AT_type        : <0x103e>
 <1><1053>: Abbrev Number: 10 (DW_TAG_variable)
    <1054>   DW_AT_name        : (indirect string, offset: 0xfb4): nsyscall_vec
    <1058>   DW_AT_decl_file   : 18
    <1059>   DW_AT_decl_line   : 1903
    <105b>   DW_AT_decl_column : 27
    <105c>   DW_AT_type        : <0x104e>
    <1060>   DW_AT_external    : 1
    <1061>   DW_AT_declaration : 1
 <1><1062>: Abbrev Number: 15 (DW_TAG_array_type)
    <1063>   DW_AT_type        : <0x9be>
    <1067>   DW_AT_sibling     : <0x1072>
 <2><106b>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <106c>   DW_AT_type        : <0x2b>
    <1070>   DW_AT_upper_bound : 2
 <2><1071>: Abbrev Number: 0
 <1><1072>: Abbrev Number: 3 (DW_TAG_const_type)
    <1073>   DW_AT_type        : <0x1062>
 <1><1077>: Abbrev Number: 10 (DW_TAG_variable)
    <1078>   DW_AT_name        : (indirect string, offset: 0x7d7): sysent_vec
    <107c>   DW_AT_decl_file   : 18
    <107d>   DW_AT_decl_line   : 1904
    <107f>   DW_AT_decl_column : 35
    <1080>   DW_AT_type        : <0x1072>
    <1084>   DW_AT_external    : 1
    <1085>   DW_AT_declaration : 1
 <1><1086>: Abbrev Number: 10 (DW_TAG_variable)
    <1087>   DW_AT_name        : (indirect string, offset: 0x38c): inject_vec
    <108b>   DW_AT_decl_file   : 18
    <108c>   DW_AT_decl_line   : 1905
    <108e>   DW_AT_decl_column : 28
    <108f>   DW_AT_type        : <0x9c3>
    <1093>   DW_AT_external    : 1
    <1094>   DW_AT_declaration : 1
 <1><1095>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1096>   DW_AT_name        : (indirect string, offset: 0xe2c): audit_arch_t
    <109a>   DW_AT_byte_size   : 8
    <109b>   DW_AT_decl_file   : 18
    <109c>   DW_AT_decl_line   : 1907
    <109e>   DW_AT_decl_column : 8
    <109f>   DW_AT_sibling     : <0x10c4>
 <2><10a3>: Abbrev Number: 22 (DW_TAG_member)
    <10a4>   DW_AT_name        : (indirect string, offset: 0x63d): arch
    <10a8>   DW_AT_decl_file   : 18
    <10a9>   DW_AT_decl_line   : 1908
    <10ab>   DW_AT_decl_column : 15
    <10ac>   DW_AT_type        : <0x2b>
    <10b0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b3>: Abbrev Number: 22 (DW_TAG_member)
    <10b4>   DW_AT_name        : (indirect string, offset: 0xa4f): flag
    <10b8>   DW_AT_decl_file   : 18
    <10b9>   DW_AT_decl_line   : 1909
    <10bb>   DW_AT_decl_column : 15
    <10bc>   DW_AT_type        : <0x2b>
    <10c0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c3>: Abbrev Number: 0
 <1><10c4>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c5>   DW_AT_type        : <0x1095>
 <1><10c9>: Abbrev Number: 15 (DW_TAG_array_type)
    <10ca>   DW_AT_type        : <0x10c4>
    <10ce>   DW_AT_sibling     : <0x10d9>
 <2><10d2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d3>   DW_AT_type        : <0x2b>
    <10d7>   DW_AT_upper_bound : 2
 <2><10d8>: Abbrev Number: 0
 <1><10d9>: Abbrev Number: 3 (DW_TAG_const_type)
    <10da>   DW_AT_type        : <0x10c9>
 <1><10de>: Abbrev Number: 10 (DW_TAG_variable)
    <10df>   DW_AT_name        : (indirect string, offset: 0x9b3): audit_arch_vec
    <10e3>   DW_AT_decl_file   : 18
    <10e4>   DW_AT_decl_line   : 1912
    <10e6>   DW_AT_decl_column : 34
    <10e7>   DW_AT_type        : <0x10d9>
    <10eb>   DW_AT_external    : 1
    <10ec>   DW_AT_declaration : 1
 <1><10ed>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10ee>   DW_AT_byte_size   : 180
    <10ef>   DW_AT_decl_file   : 20
    <10f0>   DW_AT_decl_line   : 2
    <10f1>   DW_AT_decl_column : 9
    <10f2>   DW_AT_sibling     : <0x13a7>
 <2><10f6>: Abbrev Number: 9 (DW_TAG_member)
    <10f7>   DW_AT_name        : (indirect string, offset: 0x1e6): block_ioctl
    <10fb>   DW_AT_decl_file   : 20
    <10fc>   DW_AT_decl_line   : 3
    <10fd>   DW_AT_decl_column : 8
    <10fe>   DW_AT_type        : <0x13c1>
    <1102>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1105>: Abbrev Number: 9 (DW_TAG_member)
    <1106>   DW_AT_name        : (indirect string, offset: 0xb37): btrfs_ioctl
    <110a>   DW_AT_decl_file   : 20
    <110b>   DW_AT_decl_line   : 6
    <110c>   DW_AT_decl_column : 8
    <110d>   DW_AT_type        : <0x13c1>
    <1111>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1114>: Abbrev Number: 9 (DW_TAG_member)
    <1115>   DW_AT_name        : (indirect string, offset: 0x76f): evdev_write_ioctl_mpers
    <1119>   DW_AT_decl_file   : 20
    <111a>   DW_AT_decl_line   : 9
    <111b>   DW_AT_decl_column : 8
    <111c>   DW_AT_type        : <0x13c1>
    <1120>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1123>: Abbrev Number: 9 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0x73b): get_sock_fprog_size
    <1128>   DW_AT_decl_file   : 20
    <1129>   DW_AT_decl_line   : 12
    <112a>   DW_AT_decl_column : 17
    <112b>   DW_AT_type        : <0x13cd>
    <112f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1132>: Abbrev Number: 9 (DW_TAG_member)
    <1133>   DW_AT_name        : (indirect string, offset: 0x1b5): fetch_bpf_fprog
    <1137>   DW_AT_decl_file   : 20
    <1138>   DW_AT_decl_line   : 15
    <1139>   DW_AT_decl_column : 10
    <113a>   DW_AT_type        : <0x13ed>
    <113e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1141>: Abbrev Number: 9 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0x9a0): fetch_struct_flock
    <1146>   DW_AT_decl_file   : 20
    <1147>   DW_AT_decl_line   : 18
    <1148>   DW_AT_decl_column : 10
    <1149>   DW_AT_type        : <0x13ed>
    <114d>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1150>: Abbrev Number: 9 (DW_TAG_member)
    <1151>   DW_AT_name        : (indirect string, offset: 0xd3d): fetch_struct_flock64
    <1155>   DW_AT_decl_file   : 20
    <1156>   DW_AT_decl_line   : 21
    <1157>   DW_AT_decl_column : 10
    <1158>   DW_AT_type        : <0x13ed>
    <115c>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><115f>: Abbrev Number: 9 (DW_TAG_member)
    <1160>   DW_AT_name        : (indirect string, offset: 0x156): fetch_struct_iovec
    <1164>   DW_AT_decl_file   : 20
    <1165>   DW_AT_decl_line   : 24
    <1166>   DW_AT_decl_column : 10
    <1167>   DW_AT_type        : <0x13ed>
    <116b>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><116e>: Abbrev Number: 9 (DW_TAG_member)
