Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x173a (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x508): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x265): mpers-mx32/struct_loop_info.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa57): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3d4): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x101f): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9b7): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x377): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x255): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe15): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4ac): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ae): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xef8): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8de): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7ae): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb96): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbcc): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd28): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc95): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x420): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x475): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x383): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xbb7): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xfa0): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xe25): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2f3): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb35): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10fd): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe4b): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xdf>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 3
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 16
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xaf7): long double
 <1><176>: Abbrev Number: 12 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x296): __environ
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 543
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x185>
    <183>   DW_AT_external    : 1
    <184>   DW_AT_declaration : 1
 <1><185>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 4
    <187>   DW_AT_type        : <0xd9>
 <1><18b>: Abbrev Number: 12 (DW_TAG_variable)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3cc): environ
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 545
    <193>   DW_AT_decl_column : 15
    <194>   DW_AT_type        : <0x185>
    <198>   DW_AT_external    : 1
    <199>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 13 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0x1000): optarg
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 36
    <1a1>   DW_AT_decl_column : 14
    <1a2>   DW_AT_type        : <0xd9>
    <1a6>   DW_AT_external    : 1
    <1a7>   DW_AT_declaration : 1
 <1><1a8>: Abbrev Number: 13 (DW_TAG_variable)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x781): optind
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 50
    <1af>   DW_AT_decl_column : 12
    <1b0>   DW_AT_type        : <0x64>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 13 (DW_TAG_variable)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xc84): opterr
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 55
    <1bd>   DW_AT_decl_column : 12
    <1be>   DW_AT_type        : <0x64>
    <1c2>   DW_AT_external    : 1
    <1c3>   DW_AT_declaration : 1
 <1><1c4>: Abbrev Number: 13 (DW_TAG_variable)
    <1c5>   DW_AT_name        : (indirect string, offset: 0xb72): optopt
    <1c9>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 59
    <1cb>   DW_AT_decl_column : 12
    <1cc>   DW_AT_type        : <0x64>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d3>   DW_AT_byte_size   : 4
    <1d4>   DW_AT_type        : <0xe6>
 <1><1d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d9>   DW_AT_type        : <0x1d2>
 <1><1dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1e4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x38b): _IO_FILE
    <1e9>   DW_AT_byte_size   : 152
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 49
    <1ec>   DW_AT_decl_column : 8
    <1ed>   DW_AT_sibling     : <0x3a5>
 <2><1f1>: Abbrev Number: 9 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0xa33): _flags
    <1f6>   DW_AT_decl_file   : 7
    <1f7>   DW_AT_decl_line   : 51
    <1f8>   DW_AT_decl_column : 7
    <1f9>   DW_AT_type        : <0x64>
    <1fd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x4fb): _IO_read_ptr
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 54
    <207>   DW_AT_decl_column : 9
    <208>   DW_AT_type        : <0xd9>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0xf4d): _IO_read_end
    <214>   DW_AT_decl_file   : 7
    <215>   DW_AT_decl_line   : 55
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xd9>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x7f5): _IO_read_base
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xd9>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 57
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xd9>
    <239>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x1058): _IO_write_ptr
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 58
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xd9>
    <248>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x92f): _IO_write_end
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 59
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xd9>
    <257>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x9a0): _IO_buf_base
    <25f>   DW_AT_decl_file   : 7
    <260>   DW_AT_decl_line   : 60
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xd9>
    <266>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xdc0): _IO_buf_end
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 61
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xd9>
    <275>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_save_base
    <27d>   DW_AT_decl_file   : 7
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xd9>
    <284>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xce7): _IO_backup_base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 65
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xd9>
    <293>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 66
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xd9>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x629): _markers
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 68
    <2ac>   DW_AT_decl_column : 22
    <2ad>   DW_AT_type        : <0x3bf>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x212): _chain
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 70
    <2bb>   DW_AT_decl_column : 20
    <2bc>   DW_AT_type        : <0x3c5>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0xfc6): _fileno
    <2c8>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 72
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x64>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x7e1): _flags2
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 73
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x85a): _old_offset
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 74
    <2e8>   DW_AT_decl_column : 11
    <2e9>   DW_AT_type        : <0xa2>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x240): _cur_column
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 77
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x24>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xe71): _vtable_offset
    <304>   DW_AT_decl_file   : 7
    <305>   DW_AT_decl_line   : 78
    <306>   DW_AT_decl_column : 15
    <307>   DW_AT_type        : <0x3e>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xcf7): _shortbuf
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 79
    <315>   DW_AT_decl_column : 8
    <316>   DW_AT_type        : <0x3cb>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 81
    <324>   DW_AT_decl_column : 15
    <325>   DW_AT_type        : <0x3db>
    <329>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x719): _offset
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 89
    <333>   DW_AT_decl_column : 13
    <334>   DW_AT_type        : <0xae>
    <338>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xa89): _codecvt
    <340>   DW_AT_decl_file   : 7
    <341>   DW_AT_decl_line   : 91
    <342>   DW_AT_decl_column : 23
    <343>   DW_AT_type        : <0x3e7>
    <347>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xfe4): _wide_data
    <34f>   DW_AT_decl_file   : 7
    <350>   DW_AT_decl_line   : 92
    <351>   DW_AT_decl_column : 25
    <352>   DW_AT_type        : <0x3f3>
    <356>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x3f0): _freeres_list
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 93
    <360>   DW_AT_decl_column : 20
    <361>   DW_AT_type        : <0x3c5>
    <365>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xc5a): _freeres_buf
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 94
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_type        : <0xc6>
    <374>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x9f5): __pad5
    <37c>   DW_AT_decl_file   : 7
    <37d>   DW_AT_decl_line   : 95
    <37e>   DW_AT_decl_column : 10
    <37f>   DW_AT_type        : <0x122>
    <383>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x25f): _mode
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 96
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x64>
    <392>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x80f): _unused2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 98
    <39c>   DW_AT_decl_column : 8
    <39d>   DW_AT_type        : <0x3f9>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xb17): FILE
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 7
    <3ac>   DW_AT_decl_column : 25
    <3ad>   DW_AT_type        : <0x1e4>
 <1><3b1>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x4a1): _IO_lock_t
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 43
    <3b8>   DW_AT_decl_column : 14
 <1><3b9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x335): _IO_marker
    <3be>   DW_AT_declaration : 1
 <1><3bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c1>   DW_AT_type        : <0x3b9>
 <1><3c5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c6>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x1e4>
 <1><3cb>: Abbrev Number: 10 (DW_TAG_array_type)
    <3cc>   DW_AT_type        : <0xdf>
    <3d0>   DW_AT_sibling     : <0x3db>
 <2><3d4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3d5>   DW_AT_type        : <0x2b>
    <3d9>   DW_AT_upper_bound : 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3b1>
 <1><3e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3e6>   DW_AT_declaration : 1
 <1><3e7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e8>   DW_AT_byte_size   : 4
    <3e9>   DW_AT_type        : <0x3e1>
 <1><3ed>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x39f): _IO_wide_data
    <3f2>   DW_AT_declaration : 1
 <1><3f3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f4>   DW_AT_byte_size   : 4
    <3f5>   DW_AT_type        : <0x3ed>
 <1><3f9>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fa>   DW_AT_type        : <0xdf>
    <3fe>   DW_AT_sibling     : <0x409>
 <2><402>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <403>   DW_AT_type        : <0x2b>
    <407>   DW_AT_upper_bound : 39
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 13 (DW_TAG_variable)
    <40a>   DW_AT_name        : (indirect string, offset: 0x5e0): stdin
    <40e>   DW_AT_decl_file   : 9
    <40f>   DW_AT_decl_line   : 137
    <410>   DW_AT_decl_column : 14
    <411>   DW_AT_type        : <0x417>
    <415>   DW_AT_external    : 1
    <416>   DW_AT_declaration : 1
 <1><417>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <418>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3a5>
 <1><41d>: Abbrev Number: 13 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x1032): stdout
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 138
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x417>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 13 (DW_TAG_variable)
    <42c>   DW_AT_name        : (indirect string, offset: 0xe0e): stderr
    <430>   DW_AT_decl_file   : 9
    <431>   DW_AT_decl_line   : 139
    <432>   DW_AT_decl_column : 14
    <433>   DW_AT_type        : <0x417>
    <437>   DW_AT_external    : 1
    <438>   DW_AT_declaration : 1
 <1><439>: Abbrev Number: 13 (DW_TAG_variable)
    <43a>   DW_AT_name        : (indirect string, offset: 0x24c): sys_nerr
    <43e>   DW_AT_decl_file   : 10
    <43f>   DW_AT_decl_line   : 26
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0x64>
    <445>   DW_AT_external    : 1
    <446>   DW_AT_declaration : 1
 <1><447>: Abbrev Number: 10 (DW_TAG_array_type)
    <448>   DW_AT_type        : <0x1d8>
    <44c>   DW_AT_sibling     : <0x452>
 <2><450>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 3 (DW_TAG_const_type)
    <453>   DW_AT_type        : <0x447>
 <1><457>: Abbrev Number: 13 (DW_TAG_variable)
    <458>   DW_AT_name        : (indirect string, offset: 0x5ef): sys_errlist
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 27
    <45e>   DW_AT_decl_column : 26
    <45f>   DW_AT_type        : <0x452>
    <463>   DW_AT_external    : 1
    <464>   DW_AT_declaration : 1
 <1><465>: Abbrev Number: 13 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x283): _sys_nerr
    <46a>   DW_AT_decl_file   : 10
    <46b>   DW_AT_decl_line   : 30
    <46c>   DW_AT_decl_column : 12
    <46d>   DW_AT_type        : <0x64>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 13 (DW_TAG_variable)
    <474>   DW_AT_name        : (indirect string, offset: 0xe80): _sys_errlist
    <478>   DW_AT_decl_file   : 10
    <479>   DW_AT_decl_line   : 31
    <47a>   DW_AT_decl_column : 26
    <47b>   DW_AT_type        : <0x452>
    <47f>   DW_AT_external    : 1
    <480>   DW_AT_declaration : 1
 <1><481>: Abbrev Number: 13 (DW_TAG_variable)
    <482>   DW_AT_name        : (indirect string, offset: 0x6f2): program_invocation_name
    <486>   DW_AT_decl_file   : 11
    <487>   DW_AT_decl_line   : 45
    <488>   DW_AT_decl_column : 14
    <489>   DW_AT_type        : <0xd9>
    <48d>   DW_AT_external    : 1
    <48e>   DW_AT_declaration : 1
 <1><48f>: Abbrev Number: 13 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0xbf7): program_invocation_short_name
    <494>   DW_AT_decl_file   : 11
    <495>   DW_AT_decl_line   : 46
    <496>   DW_AT_decl_column : 14
    <497>   DW_AT_type        : <0xd9>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 10 (DW_TAG_array_type)
    <49e>   DW_AT_type        : <0xd9>
    <4a2>   DW_AT_sibling     : <0x4ad>
 <2><4a6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4a7>   DW_AT_type        : <0x2b>
    <4ab>   DW_AT_upper_bound : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 13 (DW_TAG_variable)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1bc): __tzname
    <4b2>   DW_AT_decl_file   : 12
    <4b3>   DW_AT_decl_line   : 159
    <4b4>   DW_AT_decl_column : 14
    <4b5>   DW_AT_type        : <0x49d>
    <4b9>   DW_AT_external    : 1
    <4ba>   DW_AT_declaration : 1
 <1><4bb>: Abbrev Number: 13 (DW_TAG_variable)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xedf): __daylight
    <4c0>   DW_AT_decl_file   : 12
    <4c1>   DW_AT_decl_line   : 160
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x64>
    <4c7>   DW_AT_external    : 1
    <4c8>   DW_AT_declaration : 1
 <1><4c9>: Abbrev Number: 13 (DW_TAG_variable)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x394): __timezone
    <4ce>   DW_AT_decl_file   : 12
    <4cf>   DW_AT_decl_line   : 161
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x11b>
    <4d5>   DW_AT_external    : 1
    <4d6>   DW_AT_declaration : 1
 <1><4d7>: Abbrev Number: 13 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0x9ee): tzname
    <4dc>   DW_AT_decl_file   : 12
    <4dd>   DW_AT_decl_line   : 166
    <4de>   DW_AT_decl_column : 14
    <4df>   DW_AT_type        : <0x49d>
    <4e3>   DW_AT_external    : 1
    <4e4>   DW_AT_declaration : 1
 <1><4e5>: Abbrev Number: 13 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x10b3): daylight
    <4ea>   DW_AT_decl_file   : 12
    <4eb>   DW_AT_decl_line   : 174
    <4ec>   DW_AT_decl_column : 12
    <4ed>   DW_AT_type        : <0x64>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 13 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x4e6): timezone
    <4f8>   DW_AT_decl_file   : 12
    <4f9>   DW_AT_decl_line   : 175
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x11b>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 12 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0xf74): getdate_err
    <506>   DW_AT_decl_file   : 12
    <507>   DW_AT_decl_line   : 274
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0x64>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 13 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0xa01): debug_flag
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 20
    <517>   DW_AT_decl_column : 13
    <518>   DW_AT_type        : <0x51e>
    <51c>   DW_AT_external    : 1
    <51d>   DW_AT_declaration : 1
 <1><51e>: Abbrev Number: 2 (DW_TAG_base_type)
    <51f>   DW_AT_byte_size   : 1
    <520>   DW_AT_encoding    : 2	(boolean)
    <521>   DW_AT_name        : (indirect string, offset: 0x432): _Bool
 <1><525>: Abbrev Number: 3 (DW_TAG_const_type)
    <526>   DW_AT_type        : <0x51e>
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0xacd): __kernel_long_t
    <52f>   DW_AT_decl_file   : 14
    <530>   DW_AT_decl_line   : 14
    <531>   DW_AT_decl_column : 19
    <532>   DW_AT_type        : <0x88>
 <1><536>: Abbrev Number: 4 (DW_TAG_typedef)
    <537>   DW_AT_name        : (indirect string, offset: 0x5cf): __kernel_ulong_t
    <53b>   DW_AT_decl_file   : 14
    <53c>   DW_AT_decl_line   : 15
    <53d>   DW_AT_decl_column : 28
    <53e>   DW_AT_type        : <0x9b>
 <1><542>: Abbrev Number: 4 (DW_TAG_typedef)
    <543>   DW_AT_name        : (indirect string, offset: 0x6be): __kernel_old_dev_t
    <547>   DW_AT_decl_file   : 15
    <548>   DW_AT_decl_line   : 15
    <549>   DW_AT_decl_column : 23
    <54a>   DW_AT_type        : <0x37>
 <1><54e>: Abbrev Number: 4 (DW_TAG_typedef)
    <54f>   DW_AT_name        : (indirect string, offset: 0x3fe): kernel_long_t
    <553>   DW_AT_decl_file   : 16
    <554>   DW_AT_decl_line   : 16
    <555>   DW_AT_decl_column : 25
    <556>   DW_AT_type        : <0x52a>
 <1><55a>: Abbrev Number: 4 (DW_TAG_typedef)
    <55b>   DW_AT_name        : (indirect string, offset: 0x8cf): kernel_ulong_t
    <55f>   DW_AT_decl_file   : 16
    <560>   DW_AT_decl_line   : 17
    <561>   DW_AT_decl_column : 26
    <562>   DW_AT_type        : <0x536>
 <1><566>: Abbrev Number: 3 (DW_TAG_const_type)
    <567>   DW_AT_type        : <0x55a>
 <1><56b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56c>   DW_AT_name        : (indirect string, offset: 0xc15): list_item
    <570>   DW_AT_byte_size   : 8
    <571>   DW_AT_decl_file   : 17
    <572>   DW_AT_decl_line   : 92
    <573>   DW_AT_decl_column : 8
    <574>   DW_AT_sibling     : <0x597>
 <2><578>: Abbrev Number: 9 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0x10f8): prev
    <57d>   DW_AT_decl_file   : 17
    <57e>   DW_AT_decl_line   : 93
    <57f>   DW_AT_decl_column : 20
    <580>   DW_AT_type        : <0x597>
    <584>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x10ee): next
    <58c>   DW_AT_decl_file   : 17
    <58d>   DW_AT_decl_line   : 94
    <58e>   DW_AT_decl_column : 20
    <58f>   DW_AT_type        : <0x597>
    <593>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><596>: Abbrev Number: 0
 <1><597>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <598>   DW_AT_byte_size   : 4
    <599>   DW_AT_type        : <0x56b>
 <1><59d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59e>   DW_AT_name        : (indirect string, offset: 0x8a7): sysent
    <5a2>   DW_AT_byte_size   : 20
    <5a3>   DW_AT_decl_file   : 18
    <5a4>   DW_AT_decl_line   : 13
    <5a5>   DW_AT_decl_column : 16
    <5a6>   DW_AT_sibling     : <0x5f6>
 <2><5aa>: Abbrev Number: 9 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x1049): nargs
    <5af>   DW_AT_decl_file   : 18
    <5b0>   DW_AT_decl_line   : 14
    <5b1>   DW_AT_decl_column : 11
    <5b2>   DW_AT_type        : <0x2b>
    <5b6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b9>: Abbrev Number: 9 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x9ad): sys_flags
    <5be>   DW_AT_decl_file   : 18
    <5bf>   DW_AT_decl_line   : 15
    <5c0>   DW_AT_decl_column : 6
    <5c1>   DW_AT_type        : <0x64>
    <5c5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c8>: Abbrev Number: 18 (DW_TAG_member)
    <5c9>   DW_AT_name        : sen
    <5cd>   DW_AT_decl_file   : 18
    <5ce>   DW_AT_decl_line   : 16
    <5cf>   DW_AT_decl_column : 6
    <5d0>   DW_AT_type        : <0x64>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d7>: Abbrev Number: 9 (DW_TAG_member)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x32c): sys_func
    <5dc>   DW_AT_decl_file   : 18
    <5dd>   DW_AT_decl_line   : 17
    <5de>   DW_AT_decl_column : 8
    <5df>   DW_AT_type        : <0x874>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e6>: Abbrev Number: 9 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x28d): sys_name
    <5eb>   DW_AT_decl_file   : 18
    <5ec>   DW_AT_decl_line   : 18
    <5ed>   DW_AT_decl_column : 14
    <5ee>   DW_AT_type        : <0x1d2>
    <5f2>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f5>: Abbrev Number: 0
 <1><5f6>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5f7>   DW_AT_prototyped  : 1
    <5f8>   DW_AT_type        : <0x64>
    <5fc>   DW_AT_sibling     : <0x606>
 <2><600>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <601>   DW_AT_type        : <0x606>
 <2><605>: Abbrev Number: 0
 <1><606>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <607>   DW_AT_byte_size   : 4
    <608>   DW_AT_type        : <0x611>
 <1><60c>: Abbrev Number: 3 (DW_TAG_const_type)
    <60d>   DW_AT_type        : <0x606>
 <1><611>: Abbrev Number: 21 (DW_TAG_structure_type)
    <612>   DW_AT_name        : tcb
    <616>   DW_AT_byte_size   : 304
    <618>   DW_AT_decl_file   : 19
    <619>   DW_AT_decl_line   : 262
    <61b>   DW_AT_decl_column : 8
    <61c>   DW_AT_sibling     : <0x874>
 <2><620>: Abbrev Number: 22 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x4f5): flags
    <625>   DW_AT_decl_file   : 19
    <626>   DW_AT_decl_line   : 263
    <628>   DW_AT_decl_column : 6
    <629>   DW_AT_type        : <0x64>
    <62d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><630>: Abbrev Number: 23 (DW_TAG_member)
    <631>   DW_AT_name        : pid
    <635>   DW_AT_decl_file   : 19
    <636>   DW_AT_decl_line   : 264
    <638>   DW_AT_decl_column : 6
    <639>   DW_AT_type        : <0x64>
    <63d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><640>: Abbrev Number: 22 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <645>   DW_AT_decl_file   : 19
    <646>   DW_AT_decl_line   : 265
    <648>   DW_AT_decl_column : 6
    <649>   DW_AT_type        : <0x64>
    <64d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><650>: Abbrev Number: 22 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0x3b8): currpers
    <655>   DW_AT_decl_file   : 19
    <656>   DW_AT_decl_line   : 267
    <658>   DW_AT_decl_column : 15
    <659>   DW_AT_type        : <0x2b>
    <65d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><660>: Abbrev Number: 22 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0xb6a): u_error
    <665>   DW_AT_decl_file   : 19
    <666>   DW_AT_decl_line   : 269
    <668>   DW_AT_decl_column : 16
    <669>   DW_AT_type        : <0x37>
    <66d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><670>: Abbrev Number: 22 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <675>   DW_AT_decl_file   : 19
    <676>   DW_AT_decl_line   : 270
    <678>   DW_AT_decl_column : 17
    <679>   DW_AT_type        : <0x55a>
    <67d>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><680>: Abbrev Number: 22 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0xbad): true_scno
    <685>   DW_AT_decl_file   : 19
    <686>   DW_AT_decl_line   : 271
    <688>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x55a>
    <68d>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><690>: Abbrev Number: 22 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x1a6): u_arg
    <695>   DW_AT_decl_file   : 19
    <696>   DW_AT_decl_line   : 272
    <698>   DW_AT_decl_column : 17
    <699>   DW_AT_type        : <0x9a4>
    <69d>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6a0>: Abbrev Number: 22 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x9c4): u_rval
    <6a5>   DW_AT_decl_file   : 19
    <6a6>   DW_AT_decl_line   : 273
    <6a8>   DW_AT_decl_column : 16
    <6a9>   DW_AT_type        : <0x54e>
    <6ad>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6b0>: Abbrev Number: 22 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0xae9): sys_func_rval
    <6b5>   DW_AT_decl_file   : 19
    <6b6>   DW_AT_decl_line   : 274
    <6b8>   DW_AT_decl_column : 6
    <6b9>   DW_AT_type        : <0x64>
    <6bd>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6c0>: Abbrev Number: 22 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xd19): curcol
    <6c5>   DW_AT_decl_file   : 19
    <6c6>   DW_AT_decl_line   : 275
    <6c8>   DW_AT_decl_column : 6
    <6c9>   DW_AT_type        : <0x64>
    <6cd>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0x9d6): outf
    <6d5>   DW_AT_decl_file   : 19
    <6d6>   DW_AT_decl_line   : 276
    <6d8>   DW_AT_decl_column : 8
    <6d9>   DW_AT_type        : <0x417>
    <6dd>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6e0>: Abbrev Number: 22 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xf1e): staged_output_data
    <6e5>   DW_AT_decl_file   : 19
    <6e6>   DW_AT_decl_line   : 277
    <6e8>   DW_AT_decl_column : 29
    <6e9>   DW_AT_type        : <0x9ba>
    <6ed>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6f0>: Abbrev Number: 22 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0xab4): auxstr
    <6f5>   DW_AT_decl_file   : 19
    <6f6>   DW_AT_decl_line   : 279
    <6f8>   DW_AT_decl_column : 14
    <6f9>   DW_AT_type        : <0x1d2>
    <6fd>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><700>: Abbrev Number: 22 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <705>   DW_AT_decl_file   : 19
    <706>   DW_AT_decl_line   : 280
    <708>   DW_AT_decl_column : 8
    <709>   DW_AT_type        : <0xc6>
    <70d>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><710>: Abbrev Number: 22 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xc4a): _free_priv_data
    <715>   DW_AT_decl_file   : 19
    <716>   DW_AT_decl_line   : 281
    <718>   DW_AT_decl_column : 9
    <719>   DW_AT_type        : <0x9cc>
    <71d>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><720>: Abbrev Number: 22 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x18c): s_ent
    <725>   DW_AT_decl_file   : 19
    <726>   DW_AT_decl_line   : 282
    <728>   DW_AT_decl_column : 23
    <729>   DW_AT_type        : <0x9d2>
    <72d>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><730>: Abbrev Number: 22 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <735>   DW_AT_decl_file   : 19
    <736>   DW_AT_decl_line   : 285
    <738>   DW_AT_decl_column : 23
    <739>   DW_AT_type        : <0x9d2>
    <73d>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><741>: Abbrev Number: 22 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x3ad): inject_vec
    <746>   DW_AT_decl_file   : 19
    <747>   DW_AT_decl_line   : 286
    <749>   DW_AT_decl_column : 22
    <74a>   DW_AT_type        : <0x9dd>
    <74e>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x818): stime
    <757>   DW_AT_decl_file   : 19
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x133>
    <75f>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><763>: Abbrev Number: 22 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x3c1): ltime
    <768>   DW_AT_decl_file   : 19
    <769>   DW_AT_decl_line   : 288
    <76b>   DW_AT_decl_column : 18
    <76c>   DW_AT_type        : <0x133>
    <770>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><774>: Abbrev Number: 22 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x1010): atime
    <779>   DW_AT_decl_file   : 19
    <77a>   DW_AT_decl_line   : 289
    <77c>   DW_AT_decl_column : 18
    <77d>   DW_AT_type        : <0x133>
    <781>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><785>: Abbrev Number: 22 (DW_TAG_member)
    <786>   DW_AT_name        : (indirect string, offset: 0x4ef): etime
    <78a>   DW_AT_decl_file   : 19
    <78b>   DW_AT_decl_line   : 290
    <78d>   DW_AT_decl_column : 18
    <78e>   DW_AT_type        : <0x133>
    <792>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><796>: Abbrev Number: 22 (DW_TAG_member)
    <797>   DW_AT_name        : (indirect string, offset: 0xd7d): delay_expiration_time
    <79b>   DW_AT_decl_file   : 19
    <79c>   DW_AT_decl_line   : 291
    <79e>   DW_AT_decl_column : 18
    <79f>   DW_AT_type        : <0x133>
    <7a3>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a7>: Abbrev Number: 22 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7ac>   DW_AT_decl_file   : 19
    <7ad>   DW_AT_decl_line   : 298
    <7af>   DW_AT_decl_column : 15
    <7b0>   DW_AT_type        : <0x2b>
    <7b4>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b8>: Abbrev Number: 22 (DW_TAG_member)
    <7b9>   DW_AT_name        : (indirect string, offset: 0xf5a): last_dirfd
    <7bd>   DW_AT_decl_file   : 19
    <7be>   DW_AT_decl_line   : 301
    <7c0>   DW_AT_decl_column : 6
    <7c1>   DW_AT_type        : <0x64>
    <7c5>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c9>: Abbrev Number: 22 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xf80): mmap_cache
    <7ce>   DW_AT_decl_file   : 19
    <7cf>   DW_AT_decl_line   : 304
    <7d1>   DW_AT_decl_column : 23
    <7d2>   DW_AT_type        : <0x9f9>
    <7d6>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7da>: Abbrev Number: 22 (DW_TAG_member)
    <7db>   DW_AT_name        : (indirect string, offset: 0xb83): wait_data_idx
    <7df>   DW_AT_decl_file   : 19
    <7e0>   DW_AT_decl_line   : 311
    <7e2>   DW_AT_decl_column : 9
    <7e3>   DW_AT_type        : <0x122>
    <7e7>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7eb>: Abbrev Number: 22 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0xabb): delayed_wait_data
    <7f0>   DW_AT_decl_file   : 19
    <7f1>   DW_AT_decl_line   : 313
    <7f3>   DW_AT_decl_column : 24
    <7f4>   DW_AT_type        : <0xa05>
    <7f8>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7fc>: Abbrev Number: 22 (DW_TAG_member)
    <7fd>   DW_AT_name        : (indirect string, offset: 0xb2b): wait_list
    <801>   DW_AT_decl_file   : 19
    <802>   DW_AT_decl_line   : 314
    <804>   DW_AT_decl_column : 19
    <805>   DW_AT_type        : <0x56b>
    <809>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><80d>: Abbrev Number: 22 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x70a): vcpu_info_list
    <812>   DW_AT_decl_file   : 19
    <813>   DW_AT_decl_line   : 318
    <815>   DW_AT_decl_column : 20
    <816>   DW_AT_type        : <0xa11>
    <81a>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81e>: Abbrev Number: 22 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0xcdc): unwind_ctx
    <823>   DW_AT_decl_file   : 19
    <824>   DW_AT_decl_line   : 322
    <826>   DW_AT_decl_column : 8
    <827>   DW_AT_type        : <0xc6>
    <82b>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82f>: Abbrev Number: 22 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x4d9): unwind_queue
    <834>   DW_AT_decl_file   : 19
    <835>   DW_AT_decl_line   : 323
    <837>   DW_AT_decl_column : 25
    <838>   DW_AT_type        : <0xa1d>
    <83c>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><840>: Abbrev Number: 22 (DW_TAG_member)
    <841>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <845>   DW_AT_decl_file   : 19
    <846>   DW_AT_decl_line   : 327
    <848>   DW_AT_decl_column : 7
    <849>   DW_AT_type        : <0xa23>
    <84d>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><851>: Abbrev Number: 22 (DW_TAG_member)
    <852>   DW_AT_name        : (indirect string, offset: 0x222): start_prc
    <856>   DW_AT_decl_file   : 19
    <857>   DW_AT_decl_line   : 329
    <859>   DW_AT_decl_column : 16
    <85a>   DW_AT_type        : <0x37>
    <85e>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><862>: Abbrev Number: 22 (DW_TAG_member)
    <863>   DW_AT_name        : (indirect string, offset: 0xfdb): pre_comm
    <867>   DW_AT_decl_file   : 19
    <868>   DW_AT_decl_line   : 330
    <86a>   DW_AT_decl_column : 7
    <86b>   DW_AT_type        : <0xa23>
    <86f>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><873>: Abbrev Number: 0
 <1><874>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <875>   DW_AT_byte_size   : 4
    <876>   DW_AT_type        : <0x5f6>
 <1><87a>: Abbrev Number: 4 (DW_TAG_typedef)
    <87b>   DW_AT_name        : (indirect string, offset: 0x5c1): struct_sysent
    <87f>   DW_AT_decl_file   : 18
    <880>   DW_AT_decl_line   : 19
    <881>   DW_AT_decl_column : 3
    <882>   DW_AT_type        : <0x59d>
 <1><886>: Abbrev Number: 3 (DW_TAG_const_type)
    <887>   DW_AT_type        : <0x87a>
 <1><88b>: Abbrev Number: 13 (DW_TAG_variable)
    <88c>   DW_AT_name        : (indirect string, offset: 0xd69): current_personality
    <890>   DW_AT_decl_file   : 19
    <891>   DW_AT_decl_line   : 158
    <892>   DW_AT_decl_column : 17
    <893>   DW_AT_type        : <0x2b>
    <897>   DW_AT_external    : 1
    <898>   DW_AT_declaration : 1
 <1><899>: Abbrev Number: 13 (DW_TAG_variable)
    <89a>   DW_AT_name        : (indirect string, offset: 0x849): current_wordsize
    <89e>   DW_AT_decl_file   : 19
    <89f>   DW_AT_decl_line   : 171
    <8a0>   DW_AT_decl_column : 17
    <8a1>   DW_AT_type        : <0x2b>
    <8a5>   DW_AT_external    : 1
    <8a6>   DW_AT_declaration : 1
 <1><8a7>: Abbrev Number: 13 (DW_TAG_variable)
    <8a8>   DW_AT_name        : (indirect string, offset: 0xa92): current_klongsize
    <8ac>   DW_AT_decl_file   : 19
    <8ad>   DW_AT_decl_line   : 176
    <8ae>   DW_AT_decl_column : 17
    <8af>   DW_AT_type        : <0x2b>
    <8b3>   DW_AT_external    : 1
    <8b4>   DW_AT_declaration : 1
 <1><8b5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b6>   DW_AT_name        : (indirect string, offset: 0xcb3): ioctlent
    <8ba>   DW_AT_byte_size   : 8
    <8bb>   DW_AT_decl_file   : 19
    <8bc>   DW_AT_decl_line   : 217
    <8bd>   DW_AT_decl_column : 16
    <8be>   DW_AT_sibling     : <0x8e1>
 <2><8c2>: Abbrev Number: 9 (DW_TAG_member)
    <8c3>   DW_AT_name        : (indirect string, offset: 0xf46): symbol
    <8c7>   DW_AT_decl_file   : 19
    <8c8>   DW_AT_decl_line   : 218
    <8c9>   DW_AT_decl_column : 14
    <8ca>   DW_AT_type        : <0x1d2>
    <8ce>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d1>: Abbrev Number: 9 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0xd32): code
    <8d6>   DW_AT_decl_file   : 19
    <8d7>   DW_AT_decl_line   : 219
    <8d8>   DW_AT_decl_column : 15
    <8d9>   DW_AT_type        : <0x2b>
    <8dd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e0>: Abbrev Number: 0
 <1><8e1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e2>   DW_AT_name        : (indirect string, offset: 0xc74): struct_ioctlent
    <8e6>   DW_AT_decl_file   : 19
    <8e7>   DW_AT_decl_line   : 220
    <8e8>   DW_AT_decl_column : 3
    <8e9>   DW_AT_type        : <0x8b5>
 <1><8ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ee>   DW_AT_type        : <0x8e1>
 <1><8f2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x83d): inject_data
    <8f7>   DW_AT_byte_size   : 10
    <8f8>   DW_AT_decl_file   : 19
    <8f9>   DW_AT_decl_line   : 241
    <8fa>   DW_AT_decl_column : 8
    <8fb>   DW_AT_sibling     : <0x95a>
 <2><8ff>: Abbrev Number: 9 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x4f5): flags
    <904>   DW_AT_decl_file   : 19
    <905>   DW_AT_decl_line   : 242
    <906>   DW_AT_decl_column : 10
    <907>   DW_AT_type        : <0xeb>
    <90b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90e>: Abbrev Number: 9 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x961): signo
    <913>   DW_AT_decl_file   : 19
    <914>   DW_AT_decl_line   : 243
    <915>   DW_AT_decl_column : 10
    <916>   DW_AT_type        : <0xeb>
    <91a>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><91d>: Abbrev Number: 9 (DW_TAG_member)
    <91e>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <922>   DW_AT_decl_file   : 19
    <923>   DW_AT_decl_line   : 244
    <924>   DW_AT_decl_column : 11
    <925>   DW_AT_type        : <0xf7>
    <929>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><92c>: Abbrev Number: 9 (DW_TAG_member)
    <92d>   DW_AT_name        : (indirect string, offset: 0xd07): delay_idx
    <931>   DW_AT_decl_file   : 19
    <932>   DW_AT_decl_line   : 245
    <933>   DW_AT_decl_column : 11
    <934>   DW_AT_type        : <0xf7>
    <938>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><93b>: Abbrev Number: 9 (DW_TAG_member)
    <93c>   DW_AT_name        : (indirect string, offset: 0x61b): poke_idx
    <940>   DW_AT_decl_file   : 19
    <941>   DW_AT_decl_line   : 246
    <942>   DW_AT_decl_column : 11
    <943>   DW_AT_type        : <0xf7>
    <947>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><94a>: Abbrev Number: 9 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <94f>   DW_AT_decl_file   : 19
    <950>   DW_AT_decl_line   : 247
    <951>   DW_AT_decl_column : 11
    <952>   DW_AT_type        : <0xf7>
    <956>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><959>: Abbrev Number: 0
 <1><95a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <95b>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <95f>   DW_AT_byte_size   : 16
    <960>   DW_AT_decl_file   : 19
    <961>   DW_AT_decl_line   : 250
    <962>   DW_AT_decl_column : 8
    <963>   DW_AT_sibling     : <0x9a4>
 <2><967>: Abbrev Number: 9 (DW_TAG_member)
    <968>   DW_AT_name        : (indirect string, offset: 0xa51): first
    <96c>   DW_AT_decl_file   : 19
    <96d>   DW_AT_decl_line   : 251
    <96e>   DW_AT_decl_column : 11
    <96f>   DW_AT_type        : <0xf7>
    <973>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><976>: Abbrev Number: 9 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0x1121): last
    <97b>   DW_AT_decl_file   : 19
    <97c>   DW_AT_decl_line   : 252
    <97d>   DW_AT_decl_column : 11
    <97e>   DW_AT_type        : <0xf7>
    <982>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><985>: Abbrev Number: 9 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x3c7): step
    <98a>   DW_AT_decl_file   : 19
    <98b>   DW_AT_decl_line   : 253
    <98c>   DW_AT_decl_column : 11
    <98d>   DW_AT_type        : <0xf7>
    <991>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><994>: Abbrev Number: 9 (DW_TAG_member)
    <995>   DW_AT_name        : (indirect string, offset: 0x10f3): data
    <999>   DW_AT_decl_file   : 19
    <99a>   DW_AT_decl_line   : 254
    <99b>   DW_AT_decl_column : 21
    <99c>   DW_AT_type        : <0x8f2>
    <9a0>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 10 (DW_TAG_array_type)
    <9a5>   DW_AT_type        : <0x55a>
    <9a9>   DW_AT_sibling     : <0x9b4>
 <2><9ad>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9ae>   DW_AT_type        : <0x2b>
    <9b2>   DW_AT_upper_bound : 5
 <2><9b3>: Abbrev Number: 0
 <1><9b4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9b5>   DW_AT_name        : (indirect string, offset: 0xf1e): staged_output_data
    <9b9>   DW_AT_declaration : 1
 <1><9ba>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bb>   DW_AT_byte_size   : 4
    <9bc>   DW_AT_type        : <0x9b4>
 <1><9c0>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9c1>   DW_AT_prototyped  : 1
    <9c2>   DW_AT_sibling     : <0x9cc>
 <2><9c6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9c7>   DW_AT_type        : <0xc6>
 <2><9cb>: Abbrev Number: 0
 <1><9cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_type        : <0x9c0>
 <1><9d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d3>   DW_AT_byte_size   : 4
    <9d4>   DW_AT_type        : <0x886>
 <1><9d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d9>   DW_AT_type        : <0x9d2>
 <1><9dd>: Abbrev Number: 10 (DW_TAG_array_type)
    <9de>   DW_AT_type        : <0x9ed>
    <9e2>   DW_AT_sibling     : <0x9ed>
 <2><9e6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9e7>   DW_AT_type        : <0x2b>
    <9eb>   DW_AT_upper_bound : 2
 <2><9ec>: Abbrev Number: 0
 <1><9ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ee>   DW_AT_byte_size   : 4
    <9ef>   DW_AT_type        : <0x95a>
 <1><9f3>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9f8>   DW_AT_declaration : 1
 <1><9f9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fa>   DW_AT_byte_size   : 4
    <9fb>   DW_AT_type        : <0x9f3>
 <1><9ff>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a00>   DW_AT_name        : (indirect string, offset: 0x3e2): tcb_wait_data
    <a04>   DW_AT_declaration : 1
 <1><a05>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
    <a07>   DW_AT_type        : <0x9ff>
 <1><a0b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <a10>   DW_AT_declaration : 1
 <1><a11>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a12>   DW_AT_byte_size   : 4
    <a13>   DW_AT_type        : <0xa0b>
 <1><a17>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a18>   DW_AT_name        : (indirect string, offset: 0xf02): unwind_queue_t
    <a1c>   DW_AT_declaration : 1
 <1><a1d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1e>   DW_AT_byte_size   : 4
    <a1f>   DW_AT_type        : <0xa17>
 <1><a23>: Abbrev Number: 10 (DW_TAG_array_type)
    <a24>   DW_AT_type        : <0xdf>
    <a28>   DW_AT_sibling     : <0xa33>
 <2><a2c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a2d>   DW_AT_type        : <0x2b>
    <a31>   DW_AT_upper_bound : 15
 <2><a32>: Abbrev Number: 0
 <1><a33>: Abbrev Number: 12 (DW_TAG_variable)
    <a34>   DW_AT_name        : (indirect string, offset: 0xbc0): stub_sysent
    <a38>   DW_AT_decl_file   : 19
    <a39>   DW_AT_decl_line   : 405
    <a3b>   DW_AT_decl_column : 28
    <a3c>   DW_AT_type        : <0x886>
    <a40>   DW_AT_external    : 1
    <a41>   DW_AT_declaration : 1
 <1><a42>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a43>   DW_AT_name        : (indirect string, offset: 0x10d6): xlat_type
    <a47>   DW_AT_encoding    : 7	(unsigned)
    <a48>   DW_AT_byte_size   : 4
    <a49>   DW_AT_type        : <0x2b>
    <a4d>   DW_AT_decl_file   : 20
    <a4e>   DW_AT_decl_line   : 13
    <a4f>   DW_AT_decl_column : 6
    <a50>   DW_AT_sibling     : <0xa67>
 <2><a54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x2fc): XT_NORMAL
    <a59>   DW_AT_const_value : 0
 <2><a5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xc8b): XT_SORTED
    <a5f>   DW_AT_const_value : 1
 <2><a60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0xdf5): XT_INDEXED
    <a65>   DW_AT_const_value : 2
 <2><a66>: Abbrev Number: 0
 <1><a67>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a68>   DW_AT_name        : (indirect string, offset: 0xbec): xlat_style
    <a6c>   DW_AT_encoding    : 7	(unsigned)
    <a6d>   DW_AT_byte_size   : 4
    <a6e>   DW_AT_type        : <0x2b>
    <a72>   DW_AT_decl_file   : 20
    <a73>   DW_AT_decl_line   : 19
    <a74>   DW_AT_decl_column : 6
    <a75>   DW_AT_sibling     : <0xaa4>
 <2><a79>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a7e>   DW_AT_const_value : 0
 <2><a7f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a80>   DW_AT_name        : (indirect string, offset: 0xc27): XLAT_STYLE_RAW
    <a84>   DW_AT_const_value : 1
 <2><a85>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a86>   DW_AT_name        : (indirect string, offset: 0x10a1): XLAT_STYLE_ABBREV
    <a8a>   DW_AT_const_value : 2
 <2><a8b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x319): XLAT_STYLE_VERBOSE
    <a90>   DW_AT_const_value : 3
 <2><a91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a92>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a96>   DW_AT_const_value : 0
 <2><a97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a98>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a9c>   DW_AT_const_value : 4
 <2><a9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x1110): XLAT_STYLE_FMT_D
    <aa2>   DW_AT_const_value : 8
 <2><aa3>: Abbrev Number: 0
 <1><aa4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x34a): xlat_data
    <aa9>   DW_AT_byte_size   : 16
    <aaa>   DW_AT_decl_file   : 20
    <aab>   DW_AT_decl_line   : 51
    <aac>   DW_AT_decl_column : 8
    <aad>   DW_AT_sibling     : <0xad0>
 <2><ab1>: Abbrev Number: 18 (DW_TAG_member)
    <ab2>   DW_AT_name        : val
    <ab6>   DW_AT_decl_file   : 20
    <ab7>   DW_AT_decl_line   : 52
    <ab8>   DW_AT_decl_column : 11
    <ab9>   DW_AT_type        : <0x10f>
    <abd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac0>: Abbrev Number: 18 (DW_TAG_member)
    <ac1>   DW_AT_name        : str
    <ac5>   DW_AT_decl_file   : 20
    <ac6>   DW_AT_decl_line   : 53
    <ac7>   DW_AT_decl_column : 14
    <ac8>   DW_AT_type        : <0x1d2>
    <acc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><acf>: Abbrev Number: 0
 <1><ad0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad1>   DW_AT_type        : <0xaa4>
 <1><ad5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ada>   DW_AT_byte_size   : 24
    <adb>   DW_AT_decl_file   : 20
    <adc>   DW_AT_decl_line   : 56
    <add>   DW_AT_decl_column : 8
    <ade>   DW_AT_sibling     : <0xb2e>
 <2><ae2>: Abbrev Number: 9 (DW_TAG_member)
    <ae3>   DW_AT_name        : (indirect string, offset: 0x10f3): data
    <ae7>   DW_AT_decl_file   : 20
    <ae8>   DW_AT_decl_line   : 57
    <ae9>   DW_AT_decl_column : 26
    <aea>   DW_AT_type        : <0xb33>
    <aee>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af1>: Abbrev Number: 9 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0x89b): flags_strsz
    <af6>   DW_AT_decl_file   : 20
    <af7>   DW_AT_decl_line   : 58
    <af8>   DW_AT_decl_column : 9
    <af9>   DW_AT_type        : <0x122>
    <afd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b00>: Abbrev Number: 9 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0xb91): size
    <b05>   DW_AT_decl_file   : 20
    <b06>   DW_AT_decl_line   : 59
    <b07>   DW_AT_decl_column : 11
    <b08>   DW_AT_type        : <0x103>
    <b0c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b0f>: Abbrev Number: 9 (DW_TAG_member)
    <b10>   DW_AT_name        : (indirect string, offset: 0x1a1): type
    <b14>   DW_AT_decl_file   : 20
    <b15>   DW_AT_decl_line   : 60
    <b16>   DW_AT_decl_column : 17
    <b17>   DW_AT_type        : <0xa42>
    <b1b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b1e>: Abbrev Number: 9 (DW_TAG_member)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x75e): flags_mask
    <b23>   DW_AT_decl_file   : 20
    <b24>   DW_AT_decl_line   : 61
    <b25>   DW_AT_decl_column : 11
    <b26>   DW_AT_type        : <0x10f>
    <b2a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b2d>: Abbrev Number: 0
 <1><b2e>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2f>   DW_AT_type        : <0xad5>
 <1><b33>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b34>   DW_AT_byte_size   : 4
    <b35>   DW_AT_type        : <0xad0>
 <1><b39>: Abbrev Number: 10 (DW_TAG_array_type)
    <b3a>   DW_AT_type        : <0xb2e>
    <b3e>   DW_AT_sibling     : <0xb44>
 <2><b42>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b43>: Abbrev Number: 0
 <1><b44>: Abbrev Number: 3 (DW_TAG_const_type)
    <b45>   DW_AT_type        : <0xb39>
 <1><b49>: Abbrev Number: 12 (DW_TAG_variable)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xe5e): addrfams
    <b4e>   DW_AT_decl_file   : 19
    <b4f>   DW_AT_decl_line   : 411
    <b51>   DW_AT_decl_column : 26
    <b52>   DW_AT_type        : <0xb44>
    <b56>   DW_AT_external    : 1
    <b57>   DW_AT_declaration : 1
 <1><b58>: Abbrev Number: 12 (DW_TAG_variable)
    <b59>   DW_AT_name        : (indirect string, offset: 0xd42): arp_hardware_types
    <b5d>   DW_AT_decl_file   : 19
    <b5e>   DW_AT_decl_line   : 412
    <b60>   DW_AT_decl_column : 26
    <b61>   DW_AT_type        : <0xb44>
    <b65>   DW_AT_external    : 1
    <b66>   DW_AT_declaration : 1
 <1><b67>: Abbrev Number: 12 (DW_TAG_variable)
    <b68>   DW_AT_name        : (indirect string, offset: 0x1016): at_flags
    <b6c>   DW_AT_decl_file   : 19
    <b6d>   DW_AT_decl_line   : 413
    <b6f>   DW_AT_decl_column : 26
    <b70>   DW_AT_type        : <0xb44>
    <b74>   DW_AT_external    : 1
    <b75>   DW_AT_declaration : 1
 <1><b76>: Abbrev Number: 12 (DW_TAG_variable)
    <b77>   DW_AT_name        : (indirect string, offset: 0x4b7): clocknames
    <b7b>   DW_AT_decl_file   : 19
    <b7c>   DW_AT_decl_line   : 414
    <b7e>   DW_AT_decl_column : 26
    <b7f>   DW_AT_type        : <0xb44>
    <b83>   DW_AT_external    : 1
    <b84>   DW_AT_declaration : 1
 <1><b85>: Abbrev Number: 12 (DW_TAG_variable)
    <b86>   DW_AT_name        : (indirect string, offset: 0xfce): dirent_types
    <b8a>   DW_AT_decl_file   : 19
    <b8b>   DW_AT_decl_line   : 415
    <b8d>   DW_AT_decl_column : 26
    <b8e>   DW_AT_type        : <0xb44>
    <b92>   DW_AT_external    : 1
    <b93>   DW_AT_declaration : 1
 <1><b94>: Abbrev Number: 12 (DW_TAG_variable)
    <b95>   DW_AT_name        : (indirect string, offset: 0x8ec): ethernet_protocols
    <b99>   DW_AT_decl_file   : 19
    <b9a>   DW_AT_decl_line   : 416
    <b9c>   DW_AT_decl_column : 26
    <b9d>   DW_AT_type        : <0xb44>
    <ba1>   DW_AT_external    : 1
    <ba2>   DW_AT_declaration : 1
 <1><ba3>: Abbrev Number: 12 (DW_TAG_variable)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x66e): inet_protocols
    <ba8>   DW_AT_decl_file   : 19
    <ba9>   DW_AT_decl_line   : 417
    <bab>   DW_AT_decl_column : 26
    <bac>   DW_AT_type        : <0xb44>
    <bb0>   DW_AT_external    : 1
    <bb1>   DW_AT_declaration : 1
 <1><bb2>: Abbrev Number: 12 (DW_TAG_variable)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x2e9): evdev_abs
    <bb7>   DW_AT_decl_file   : 19
    <bb8>   DW_AT_decl_line   : 418
    <bba>   DW_AT_decl_column : 26
    <bbb>   DW_AT_type        : <0xb44>
    <bbf>   DW_AT_external    : 1
    <bc0>   DW_AT_declaration : 1
 <1><bc1>: Abbrev Number: 12 (DW_TAG_variable)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x753): audit_arch
    <bc6>   DW_AT_decl_file   : 19
    <bc7>   DW_AT_decl_line   : 419
    <bc9>   DW_AT_decl_column : 26
    <bca>   DW_AT_type        : <0xb44>
    <bce>   DW_AT_external    : 1
    <bcf>   DW_AT_declaration : 1
 <1><bd0>: Abbrev Number: 12 (DW_TAG_variable)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bd5>   DW_AT_decl_file   : 19
    <bd6>   DW_AT_decl_line   : 420
    <bd8>   DW_AT_decl_column : 26
    <bd9>   DW_AT_type        : <0xb44>
    <bdd>   DW_AT_external    : 1
    <bde>   DW_AT_declaration : 1
 <1><bdf>: Abbrev Number: 12 (DW_TAG_variable)
    <be0>   DW_AT_name        : (indirect string, offset: 0x498): iffflags
    <be4>   DW_AT_decl_file   : 19
    <be5>   DW_AT_decl_line   : 421
    <be7>   DW_AT_decl_column : 26
    <be8>   DW_AT_type        : <0xb44>
    <bec>   DW_AT_external    : 1
    <bed>   DW_AT_declaration : 1
 <1><bee>: Abbrev Number: 12 (DW_TAG_variable)
    <bef>   DW_AT_name        : (indirect string, offset: 0xc36): ip_type_of_services
    <bf3>   DW_AT_decl_file   : 19
    <bf4>   DW_AT_decl_line   : 422
    <bf6>   DW_AT_decl_column : 26
    <bf7>   DW_AT_type        : <0xb44>
    <bfb>   DW_AT_external    : 1
    <bfc>   DW_AT_declaration : 1
 <1><bfd>: Abbrev Number: 12 (DW_TAG_variable)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x6e6): ipc_private
    <c02>   DW_AT_decl_file   : 19
    <c03>   DW_AT_decl_line   : 423
    <c05>   DW_AT_decl_column : 26
    <c06>   DW_AT_type        : <0xb44>
    <c0a>   DW_AT_external    : 1
    <c0b>   DW_AT_declaration : 1
 <1><c0c>: Abbrev Number: 12 (DW_TAG_variable)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x340): msg_flags
    <c11>   DW_AT_decl_file   : 19
    <c12>   DW_AT_decl_line   : 424
    <c14>   DW_AT_decl_column : 26
    <c15>   DW_AT_type        : <0xb44>
    <c19>   DW_AT_external    : 1
    <c1a>   DW_AT_declaration : 1
 <1><c1b>: Abbrev Number: 12 (DW_TAG_variable)
    <c1c>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c20>   DW_AT_decl_file   : 19
    <c21>   DW_AT_decl_line   : 425
    <c23>   DW_AT_decl_column : 26
    <c24>   DW_AT_type        : <0xb44>
    <c28>   DW_AT_external    : 1
    <c29>   DW_AT_declaration : 1
 <1><c2a>: Abbrev Number: 12 (DW_TAG_variable)
    <c2b>   DW_AT_name        : (indirect string, offset: 0xf31): nl_bridge_vlan_flags
    <c2f>   DW_AT_decl_file   : 19
    <c30>   DW_AT_decl_line   : 426
    <c32>   DW_AT_decl_column : 26
    <c33>   DW_AT_type        : <0xb44>
    <c37>   DW_AT_external    : 1
    <c38>   DW_AT_declaration : 1
 <1><c39>: Abbrev Number: 12 (DW_TAG_variable)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xdde): nl_netfilter_msg_types
    <c3e>   DW_AT_decl_file   : 19
    <c3f>   DW_AT_decl_line   : 427
    <c41>   DW_AT_decl_column : 26
    <c42>   DW_AT_type        : <0xb44>
    <c46>   DW_AT_external    : 1
    <c47>   DW_AT_declaration : 1
 <1><c48>: Abbrev Number: 12 (DW_TAG_variable)
    <c49>   DW_AT_name        : (indirect string, offset: 0x47a): nl_route_types
    <c4d>   DW_AT_decl_file   : 19
    <c4e>   DW_AT_decl_line   : 428
    <c50>   DW_AT_decl_column : 26
    <c51>   DW_AT_type        : <0xb44>
    <c55>   DW_AT_external    : 1
    <c56>   DW_AT_declaration : 1
 <1><c57>: Abbrev Number: 12 (DW_TAG_variable)
    <c58>   DW_AT_name        : (indirect string, offset: 0xe95): open_access_modes
    <c5c>   DW_AT_decl_file   : 19
    <c5d>   DW_AT_decl_line   : 429
    <c5f>   DW_AT_decl_column : 26
    <c60>   DW_AT_type        : <0xb44>
    <c64>   DW_AT_external    : 1
    <c65>   DW_AT_declaration : 1
 <1><c66>: Abbrev Number: 12 (DW_TAG_variable)
    <c67>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c6b>   DW_AT_decl_file   : 19
    <c6c>   DW_AT_decl_line   : 430
    <c6e>   DW_AT_decl_column : 26
    <c6f>   DW_AT_type        : <0xb44>
    <c73>   DW_AT_external    : 1
    <c74>   DW_AT_declaration : 1
 <1><c75>: Abbrev Number: 12 (DW_TAG_variable)
    <c76>   DW_AT_name        : (indirect string, offset: 0xc67): perf_type_id
    <c7a>   DW_AT_decl_file   : 19
    <c7b>   DW_AT_decl_line   : 431
    <c7d>   DW_AT_decl_column : 26
    <c7e>   DW_AT_type        : <0xb44>
    <c82>   DW_AT_external    : 1
    <c83>   DW_AT_declaration : 1
 <1><c84>: Abbrev Number: 12 (DW_TAG_variable)
    <c85>   DW_AT_name        : (indirect string, offset: 0xe67): pollflags
    <c89>   DW_AT_decl_file   : 19
    <c8a>   DW_AT_decl_line   : 432
    <c8c>   DW_AT_decl_column : 26
    <c8d>   DW_AT_type        : <0xb44>
    <c91>   DW_AT_external    : 1
    <c92>   DW_AT_declaration : 1
 <1><c93>: Abbrev Number: 12 (DW_TAG_variable)
    <c94>   DW_AT_name        : (indirect string, offset: 0x60f): ptrace_cmds
    <c98>   DW_AT_decl_file   : 19
    <c99>   DW_AT_decl_line   : 433
    <c9b>   DW_AT_decl_column : 26
    <c9c>   DW_AT_type        : <0xb44>
    <ca0>   DW_AT_external    : 1
    <ca1>   DW_AT_declaration : 1
 <1><ca2>: Abbrev Number: 12 (DW_TAG_variable)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x82e): resource_flags
    <ca7>   DW_AT_decl_file   : 19
    <ca8>   DW_AT_decl_line   : 434
    <caa>   DW_AT_decl_column : 26
    <cab>   DW_AT_type        : <0xb44>
    <caf>   DW_AT_external    : 1
    <cb0>   DW_AT_declaration : 1
 <1><cb1>: Abbrev Number: 12 (DW_TAG_variable)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x2ab): route_nexthop_flags
    <cb6>   DW_AT_decl_file   : 19
    <cb7>   DW_AT_decl_line   : 435
    <cb9>   DW_AT_decl_column : 26
    <cba>   DW_AT_type        : <0xb44>
    <cbe>   DW_AT_external    : 1
    <cbf>   DW_AT_declaration : 1
 <1><cc0>: Abbrev Number: 12 (DW_TAG_variable)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xebc): routing_protocols
    <cc5>   DW_AT_decl_file   : 19
    <cc6>   DW_AT_decl_line   : 436
    <cc8>   DW_AT_decl_column : 26
    <cc9>   DW_AT_type        : <0xb44>
    <ccd>   DW_AT_external    : 1
    <cce>   DW_AT_declaration : 1
 <1><ccf>: Abbrev Number: 12 (DW_TAG_variable)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x489): routing_scopes
    <cd4>   DW_AT_decl_file   : 19
    <cd5>   DW_AT_decl_line   : 437
    <cd7>   DW_AT_decl_column : 26
    <cd8>   DW_AT_type        : <0xb44>
    <cdc>   DW_AT_external    : 1
    <cdd>   DW_AT_declaration : 1
 <1><cde>: Abbrev Number: 12 (DW_TAG_variable)
    <cdf>   DW_AT_name        : (indirect string, offset: 0xdcc): routing_table_ids
    <ce3>   DW_AT_decl_file   : 19
    <ce4>   DW_AT_decl_line   : 438
    <ce6>   DW_AT_decl_column : 26
    <ce7>   DW_AT_type        : <0xb44>
    <ceb>   DW_AT_external    : 1
    <cec>   DW_AT_declaration : 1
 <1><ced>: Abbrev Number: 12 (DW_TAG_variable)
    <cee>   DW_AT_name        : (indirect string, offset: 0x6b0): routing_types
    <cf2>   DW_AT_decl_file   : 19
    <cf3>   DW_AT_decl_line   : 439
    <cf5>   DW_AT_decl_column : 26
    <cf6>   DW_AT_type        : <0xb44>
    <cfa>   DW_AT_external    : 1
    <cfb>   DW_AT_declaration : 1
 <1><cfc>: Abbrev Number: 12 (DW_TAG_variable)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x1c5): rwf_flags
    <d01>   DW_AT_decl_file   : 19
    <d02>   DW_AT_decl_line   : 440
    <d04>   DW_AT_decl_column : 26
    <d05>   DW_AT_type        : <0xb44>
    <d09>   DW_AT_external    : 1
    <d0a>   DW_AT_declaration : 1
 <1><d0b>: Abbrev Number: 12 (DW_TAG_variable)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x866): seccomp_filter_flags
    <d10>   DW_AT_decl_file   : 19
    <d11>   DW_AT_decl_line   : 441
    <d13>   DW_AT_decl_column : 26
    <d14>   DW_AT_type        : <0xb44>
    <d18>   DW_AT_external    : 1
    <d19>   DW_AT_declaration : 1
 <1><d1a>: Abbrev Number: 12 (DW_TAG_variable)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x306): seccomp_ret_action
    <d1f>   DW_AT_decl_file   : 19
    <d20>   DW_AT_decl_line   : 442
    <d22>   DW_AT_decl_column : 26
    <d23>   DW_AT_type        : <0xb44>
    <d27>   DW_AT_external    : 1
    <d28>   DW_AT_declaration : 1
 <1><d29>: Abbrev Number: 12 (DW_TAG_variable)
    <d2a>   DW_AT_name        : (indirect string, offset: 0x44c): setns_types
    <d2e>   DW_AT_decl_file   : 19
    <d2f>   DW_AT_decl_line   : 443
    <d31>   DW_AT_decl_column : 26
    <d32>   DW_AT_type        : <0xb44>
    <d36>   DW_AT_external    : 1
    <d37>   DW_AT_declaration : 1
 <1><d38>: Abbrev Number: 12 (DW_TAG_variable)
    <d39>   DW_AT_name        : (indirect string, offset: 0xe53): sg_io_info
    <d3d>   DW_AT_decl_file   : 19
    <d3e>   DW_AT_decl_line   : 444
    <d40>   DW_AT_decl_column : 26
    <d41>   DW_AT_type        : <0xb44>
    <d45>   DW_AT_external    : 1
    <d46>   DW_AT_declaration : 1
 <1><d47>: Abbrev Number: 12 (DW_TAG_variable)
    <d48>   DW_AT_name        : (indirect string, offset: 0xbd4): socketlayers
    <d4c>   DW_AT_decl_file   : 19
    <d4d>   DW_AT_decl_line   : 445
    <d4f>   DW_AT_decl_column : 26
    <d50>   DW_AT_type        : <0xb44>
    <d54>   DW_AT_external    : 1
    <d55>   DW_AT_declaration : 1
 <1><d56>: Abbrev Number: 12 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0xdb6): socktypes
    <d5b>   DW_AT_decl_file   : 19
    <d5c>   DW_AT_decl_line   : 446
    <d5e>   DW_AT_decl_column : 26
    <d5f>   DW_AT_type        : <0xb44>
    <d63>   DW_AT_external    : 1
    <d64>   DW_AT_declaration : 1
 <1><d65>: Abbrev Number: 12 (DW_TAG_variable)
    <d66>   DW_AT_name        : (indirect string, offset: 0xaa4): tcp_state_flags
    <d6a>   DW_AT_decl_file   : 19
    <d6b>   DW_AT_decl_line   : 447
    <d6d>   DW_AT_decl_column : 26
    <d6e>   DW_AT_type        : <0xb44>
    <d72>   DW_AT_external    : 1
    <d73>   DW_AT_declaration : 1
 <1><d74>: Abbrev Number: 12 (DW_TAG_variable)
    <d75>   DW_AT_name        : (indirect string, offset: 0x788): tcp_states
    <d79>   DW_AT_decl_file   : 19
    <d7a>   DW_AT_decl_line   : 448
    <d7c>   DW_AT_decl_column : 26
    <d7d>   DW_AT_type        : <0xb44>
    <d81>   DW_AT_external    : 1
    <d82>   DW_AT_declaration : 1
 <1><d83>: Abbrev Number: 12 (DW_TAG_variable)
    <d84>   DW_AT_name        : (indirect string, offset: 0x1084): whence_codes
    <d88>   DW_AT_decl_file   : 19
    <d89>   DW_AT_decl_line   : 449
    <d8b>   DW_AT_decl_column : 26
    <d8c>   DW_AT_type        : <0xb44>
    <d90>   DW_AT_external    : 1
    <d91>   DW_AT_declaration : 1
 <1><d92>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d93>   DW_AT_encoding    : 7	(unsigned)
    <d94>   DW_AT_byte_size   : 4
    <d95>   DW_AT_type        : <0x2b>
    <d99>   DW_AT_decl_file   : 19
    <d9a>   DW_AT_decl_line   : 510
    <d9c>   DW_AT_decl_column : 14
    <d9d>   DW_AT_sibling     : <0xdb4>
 <2><da1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da2>   DW_AT_name        : (indirect string, offset: 0x9cb): CFLAG_NONE
    <da6>   DW_AT_const_value : 0
 <2><da7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da8>   DW_AT_name        : (indirect string, offset: 0x8ff): CFLAG_ONLY_STATS
    <dac>   DW_AT_const_value : 1
 <2><dad>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dae>   DW_AT_name        : (indirect string, offset: 0xbe1): CFLAG_BOTH
    <db2>   DW_AT_const_value : 2
 <2><db3>: Abbrev Number: 0
 <1><db4>: Abbrev Number: 28 (DW_TAG_typedef)
    <db5>   DW_AT_name        : (indirect string, offset: 0x112f): cflag_t
    <db9>   DW_AT_decl_file   : 19
    <dba>   DW_AT_decl_line   : 514
    <dbc>   DW_AT_decl_column : 3
    <dbd>   DW_AT_type        : <0xd92>
 <1><dc1>: Abbrev Number: 12 (DW_TAG_variable)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xd01): cflag
    <dc6>   DW_AT_decl_file   : 19
    <dc7>   DW_AT_decl_line   : 515
    <dc9>   DW_AT_decl_column : 16
    <dca>   DW_AT_type        : <0xdb4>
    <dce>   DW_AT_external    : 1
    <dcf>   DW_AT_declaration : 1
 <1><dd0>: Abbrev Number: 12 (DW_TAG_variable)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <dd5>   DW_AT_decl_file   : 19
    <dd6>   DW_AT_decl_line   : 516
    <dd8>   DW_AT_decl_column : 13
    <dd9>   DW_AT_type        : <0x51e>
    <ddd>   DW_AT_external    : 1
    <dde>   DW_AT_declaration : 1
 <1><ddf>: Abbrev Number: 12 (DW_TAG_variable)
    <de0>   DW_AT_name        : (indirect string, offset: 0x7e9): Tflag_scale
    <de4>   DW_AT_decl_file   : 19
    <de5>   DW_AT_decl_line   : 517
    <de7>   DW_AT_decl_column : 12
    <de8>   DW_AT_type        : <0x64>
    <dec>   DW_AT_external    : 1
    <ded>   DW_AT_declaration : 1
 <1><dee>: Abbrev Number: 12 (DW_TAG_variable)
    <def>   DW_AT_name        : (indirect string, offset: 0x87b): Tflag_width
    <df3>   DW_AT_decl_file   : 19
    <df4>   DW_AT_decl_line   : 518
    <df6>   DW_AT_decl_column : 12
    <df7>   DW_AT_type        : <0x64>
    <dfb>   DW_AT_external    : 1
    <dfc>   DW_AT_declaration : 1
 <1><dfd>: Abbrev Number: 12 (DW_TAG_variable)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xe45): iflag
    <e02>   DW_AT_decl_file   : 19
    <e03>   DW_AT_decl_line   : 519
    <e05>   DW_AT_decl_column : 13
    <e06>   DW_AT_type        : <0x51e>
    <e0a>   DW_AT_external    : 1
    <e0b>   DW_AT_declaration : 1
 <1><e0c>: Abbrev Number: 12 (DW_TAG_variable)
    <e0d>   DW_AT_name        : (indirect string, offset: 0x64f): count_wallclock
    <e11>   DW_AT_decl_file   : 19
    <e12>   DW_AT_decl_line   : 520
    <e14>   DW_AT_decl_column : 13
    <e15>   DW_AT_type        : <0x51e>
    <e19>   DW_AT_external    : 1
    <e1a>   DW_AT_declaration : 1
 <1><e1b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e20>   DW_AT_byte_size   : 4
    <e21>   DW_AT_decl_file   : 19
    <e22>   DW_AT_decl_line   : 522
    <e24>   DW_AT_decl_column : 8
    <e25>   DW_AT_sibling     : <0xe3a>
 <2><e29>: Abbrev Number: 22 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e2e>   DW_AT_decl_file   : 19
    <e2f>   DW_AT_decl_line   : 523
    <e31>   DW_AT_decl_column : 14
    <e32>   DW_AT_type        : <0x1d2>
    <e36>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e39>: Abbrev Number: 0
 <1><e3a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e3b>   DW_AT_name        : (indirect string, offset: 0x793): path_set
    <e3f>   DW_AT_byte_size   : 12
    <e40>   DW_AT_decl_file   : 19
    <e41>   DW_AT_decl_line   : 527
    <e43>   DW_AT_decl_column : 15
    <e44>   DW_AT_sibling     : <0xe79>
 <2><e48>: Abbrev Number: 22 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x721): paths_selected
    <e4d>   DW_AT_decl_file   : 19
    <e4e>   DW_AT_decl_line   : 528
    <e50>   DW_AT_decl_column : 24
    <e51>   DW_AT_type        : <0xe79>
    <e55>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e58>: Abbrev Number: 22 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x1077): num_selected
    <e5d>   DW_AT_decl_file   : 19
    <e5e>   DW_AT_decl_line   : 529
    <e60>   DW_AT_decl_column : 9
    <e61>   DW_AT_type        : <0x122>
    <e65>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e68>: Abbrev Number: 22 (DW_TAG_member)
    <e69>   DW_AT_name        : (indirect string, offset: 0xb91): size
    <e6d>   DW_AT_decl_file   : 19
    <e6e>   DW_AT_decl_line   : 530
    <e70>   DW_AT_decl_column : 9
    <e71>   DW_AT_type        : <0x122>
    <e75>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e78>: Abbrev Number: 0
 <1><e79>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7a>   DW_AT_byte_size   : 4
    <e7b>   DW_AT_type        : <0xe1b>
 <1><e7f>: Abbrev Number: 12 (DW_TAG_variable)
    <e80>   DW_AT_name        : (indirect string, offset: 0x10c6): global_path_set
    <e84>   DW_AT_decl_file   : 19
    <e85>   DW_AT_decl_line   : 531
    <e87>   DW_AT_decl_column : 3
    <e88>   DW_AT_type        : <0xe3a>
    <e8c>   DW_AT_external    : 1
    <e8d>   DW_AT_declaration : 1
 <1><e8e>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e8f>   DW_AT_name        : (indirect string, offset: 0xfa9): xflag_opts
    <e93>   DW_AT_encoding    : 7	(unsigned)
    <e94>   DW_AT_byte_size   : 4
    <e95>   DW_AT_type        : <0x2b>
    <e99>   DW_AT_decl_file   : 19
    <e9a>   DW_AT_decl_line   : 533
    <e9c>   DW_AT_decl_column : 6
    <e9d>   DW_AT_sibling     : <0xec0>
 <2><ea1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea2>   DW_AT_name        : (indirect string, offset: 0xa45): HEXSTR_NONE
    <ea6>   DW_AT_const_value : 0
 <2><ea7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xfef): HEXSTR_NON_ASCII
    <eac>   DW_AT_const_value : 1
 <2><ead>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eae>   DW_AT_name        : (indirect string, offset: 0x94c): HEXSTR_ALL
    <eb2>   DW_AT_const_value : 2
 <2><eb3>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x68f): HEXSTR_NON_ASCII_CHARS
    <eb8>   DW_AT_const_value : 3
 <2><eb9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eba>   DW_AT_name        : (indirect string, offset: 0x1091): NUM_HEXSTR_OPTS
    <ebe>   DW_AT_const_value : 4
 <2><ebf>: Abbrev Number: 0
 <1><ec0>: Abbrev Number: 12 (DW_TAG_variable)
    <ec1>   DW_AT_name        : (indirect string, offset: 0xe1f): xflag
    <ec5>   DW_AT_decl_file   : 19
    <ec6>   DW_AT_decl_line   : 546
    <ec8>   DW_AT_decl_column : 17
    <ec9>   DW_AT_type        : <0x2b>
    <ecd>   DW_AT_external    : 1
    <ece>   DW_AT_declaration : 1
 <1><ecf>: Abbrev Number: 12 (DW_TAG_variable)
    <ed0>   DW_AT_name        : (indirect string, offset: 0xcbc): followfork
    <ed4>   DW_AT_decl_file   : 19
    <ed5>   DW_AT_decl_line   : 547
    <ed7>   DW_AT_decl_column : 13
    <ed8>   DW_AT_type        : <0x51e>
    <edc>   DW_AT_external    : 1
    <edd>   DW_AT_declaration : 1
 <1><ede>: Abbrev Number: 12 (DW_TAG_variable)
    <edf>   DW_AT_name        : (indirect string, offset: 0x354): output_separately
    <ee3>   DW_AT_decl_file   : 19
    <ee4>   DW_AT_decl_line   : 548
    <ee6>   DW_AT_decl_column : 13
    <ee7>   DW_AT_type        : <0x51e>
    <eeb>   DW_AT_external    : 1
    <eec>   DW_AT_declaration : 1
 <1><eed>: Abbrev Number: 12 (DW_TAG_variable)
    <eee>   DW_AT_name        : (indirect string, offset: 0x22c): stack_trace_enabled
    <ef2>   DW_AT_decl_file   : 19
    <ef3>   DW_AT_decl_line   : 551
    <ef5>   DW_AT_decl_column : 13
    <ef6>   DW_AT_type        : <0x51e>
    <efa>   DW_AT_external    : 1
    <efb>   DW_AT_declaration : 1
 <1><efc>: Abbrev Number: 12 (DW_TAG_variable)
    <efd>   DW_AT_name        : (indirect string, offset: 0x67d): ptrace_setoptions
    <f01>   DW_AT_decl_file   : 19
    <f02>   DW_AT_decl_line   : 555
    <f04>   DW_AT_decl_column : 17
    <f05>   DW_AT_type        : <0x2b>
    <f09>   DW_AT_external    : 1
    <f0a>   DW_AT_declaration : 1
 <1><f0b>: Abbrev Number: 12 (DW_TAG_variable)
    <f0c>   DW_AT_name        : (indirect string, offset: 0xa3a): max_strlen
    <f10>   DW_AT_decl_file   : 19
    <f11>   DW_AT_decl_line   : 556
    <f13>   DW_AT_decl_column : 17
    <f14>   DW_AT_type        : <0x2b>
    <f18>   DW_AT_external    : 1
    <f19>   DW_AT_declaration : 1
 <1><f1a>: Abbrev Number: 12 (DW_TAG_variable)
    <f1b>   DW_AT_name        : (indirect string, offset: 0xa7e): os_release
    <f1f>   DW_AT_decl_file   : 19
    <f20>   DW_AT_decl_line   : 557
    <f22>   DW_AT_decl_column : 17
    <f23>   DW_AT_type        : <0x2b>
    <f27>   DW_AT_external    : 1
    <f28>   DW_AT_declaration : 1
 <1><f29>: Abbrev Number: 12 (DW_TAG_variable)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x730): xlat_verbosity
    <f2e>   DW_AT_decl_file   : 19
    <f2f>   DW_AT_decl_line   : 919
    <f31>   DW_AT_decl_column : 24
    <f32>   DW_AT_type        : <0xa67>
    <f36>   DW_AT_external    : 1
    <f37>   DW_AT_declaration : 1
 <1><f38>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f39>   DW_AT_name        : (indirect string, offset: 0x632): xlat_style_private_flag_bits
    <f3d>   DW_AT_encoding    : 7	(unsigned)
    <f3e>   DW_AT_byte_size   : 4
    <f3f>   DW_AT_type        : <0x2b>
    <f43>   DW_AT_decl_file   : 19
    <f44>   DW_AT_decl_line   : 939
    <f46>   DW_AT_decl_column : 6
    <f47>   DW_AT_sibling     : <0xf64>
 <2><f4b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x2d3): PAF_PRINT_INDICES_BIT
    <f50>   DW_AT_const_value : 5
 <2><f51>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f52>   DW_AT_name        : (indirect string, offset: 0xb3e): PAF_ARRAY_TRUNCATED_BIT
    <f56>   DW_AT_const_value : 6
 <2><f57>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f58>   DW_AT_name        : (indirect string, offset: 0x40c): PXF_DEFAULT_STR_BIT
    <f5c>   DW_AT_const_value : 7
 <2><f5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xc9e): SPFF_AUXSTR_MODE_BIT
    <f62>   DW_AT_const_value : 8
 <2><f63>: Abbrev Number: 0
 <1><f64>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f65>   DW_AT_name        : (indirect string, offset: 0xd55): find_xlat_flag_bits
    <f69>   DW_AT_encoding    : 7	(unsigned)
    <f6a>   DW_AT_byte_size   : 4
    <f6b>   DW_AT_type        : <0x2b>
    <f6f>   DW_AT_decl_file   : 19
    <f70>   DW_AT_decl_line   : 1443
    <f72>   DW_AT_decl_column : 6
    <f73>   DW_AT_sibling     : <0xf7e>
 <2><f77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0x989): FXL_CASE_SENSITIVE_BIT
    <f7c>   DW_AT_const_value : 0
 <2><f7d>: Abbrev Number: 0
 <1><f7e>: Abbrev Number: 12 (DW_TAG_variable)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xa16): printing_tcp
    <f83>   DW_AT_decl_file   : 19
    <f84>   DW_AT_decl_line   : 1689
    <f86>   DW_AT_decl_column : 20
    <f87>   DW_AT_type        : <0x606>
    <f8b>   DW_AT_external    : 1
    <f8c>   DW_AT_declaration : 1
 <1><f8d>: Abbrev Number: 12 (DW_TAG_variable)
    <f8e>   DW_AT_name        : (indirect string, offset: 0x5e6): errnoent
    <f92>   DW_AT_decl_file   : 19
    <f93>   DW_AT_decl_line   : 1887
    <f95>   DW_AT_decl_column : 26
    <f96>   DW_AT_type        : <0x452>
    <f9a>   DW_AT_external    : 1
    <f9b>   DW_AT_declaration : 1
 <1><f9c>: Abbrev Number: 12 (DW_TAG_variable)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x887): signalent
    <fa1>   DW_AT_decl_file   : 19
    <fa2>   DW_AT_decl_line   : 1888
    <fa4>   DW_AT_decl_column : 26
    <fa5>   DW_AT_type        : <0x452>
    <fa9>   DW_AT_external    : 1
    <faa>   DW_AT_declaration : 1
 <1><fab>: Abbrev Number: 12 (DW_TAG_variable)
    <fac>   DW_AT_name        : (indirect string, offset: 0xe8d): nerrnos
    <fb0>   DW_AT_decl_file   : 19
    <fb1>   DW_AT_decl_line   : 1889
    <fb3>   DW_AT_decl_column : 27
    <fb4>   DW_AT_type        : <0x32>
    <fb8>   DW_AT_external    : 1
    <fb9>   DW_AT_declaration : 1
 <1><fba>: Abbrev Number: 12 (DW_TAG_variable)
    <fbb>   DW_AT_name        : (indirect string, offset: 0x104f): nsignals
    <fbf>   DW_AT_decl_file   : 19
    <fc0>   DW_AT_decl_line   : 1890
    <fc2>   DW_AT_decl_column : 27
    <fc3>   DW_AT_type        : <0x32>
    <fc7>   DW_AT_external    : 1
    <fc8>   DW_AT_declaration : 1
 <1><fc9>: Abbrev Number: 10 (DW_TAG_array_type)
    <fca>   DW_AT_type        : <0x886>
    <fce>   DW_AT_sibling     : <0xfd4>
 <2><fd2>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd5>   DW_AT_type        : <0xfc9>
 <1><fd9>: Abbrev Number: 12 (DW_TAG_variable)
    <fda>   DW_AT_name        : (indirect string, offset: 0xd20): sysent0
    <fde>   DW_AT_decl_file   : 19
    <fdf>   DW_AT_decl_line   : 1892
    <fe1>   DW_AT_decl_column : 28
    <fe2>   DW_AT_type        : <0xfd4>
    <fe6>   DW_AT_external    : 1
    <fe7>   DW_AT_declaration : 1
 <1><fe8>: Abbrev Number: 10 (DW_TAG_array_type)
    <fe9>   DW_AT_type        : <0x8ed>
    <fed>   DW_AT_sibling     : <0xff3>
 <2><ff1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ff2>: Abbrev Number: 0
 <1><ff3>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff4>   DW_AT_type        : <0xfe8>
 <1><ff8>: Abbrev Number: 12 (DW_TAG_variable)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x10bc): ioctlent0
    <ffd>   DW_AT_decl_file   : 19
    <ffe>   DW_AT_decl_line   : 1893
    <1000>   DW_AT_decl_column : 30
    <1001>   DW_AT_type        : <0xff3>
    <1005>   DW_AT_external    : 1
    <1006>   DW_AT_declaration : 1
 <1><1007>: Abbrev Number: 12 (DW_TAG_variable)
    <1008>   DW_AT_name        : (indirect string, offset: 0xfb4): personality_names
    <100c>   DW_AT_decl_file   : 19
    <100d>   DW_AT_decl_line   : 1895
    <100f>   DW_AT_decl_column : 26
    <1010>   DW_AT_type        : <0x452>
    <1014>   DW_AT_external    : 1
    <1015>   DW_AT_declaration : 1
 <1><1016>: Abbrev Number: 12 (DW_TAG_variable)
    <1017>   DW_AT_name        : (indirect string, offset: 0x8a7): sysent
    <101b>   DW_AT_decl_file   : 19
    <101c>   DW_AT_decl_line   : 1898
    <101e>   DW_AT_decl_column : 29
    <101f>   DW_AT_type        : <0x9d2>
    <1023>   DW_AT_external    : 1
    <1024>   DW_AT_declaration : 1
 <1><1025>: Abbrev Number: 12 (DW_TAG_variable)
    <1026>   DW_AT_name        : (indirect string, offset: 0xcb3): ioctlent
    <102a>   DW_AT_decl_file   : 19
    <102b>   DW_AT_decl_line   : 1899
    <102d>   DW_AT_decl_column : 31
    <102e>   DW_AT_type        : <0x1034>
    <1032>   DW_AT_external    : 1
    <1033>   DW_AT_declaration : 1
 <1><1034>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1035>   DW_AT_byte_size   : 4
    <1036>   DW_AT_type        : <0x8ed>
 <1><103a>: Abbrev Number: 12 (DW_TAG_variable)
    <103b>   DW_AT_name        : (indirect string, offset: 0x891): nsyscalls
    <103f>   DW_AT_decl_file   : 19
    <1040>   DW_AT_decl_line   : 1905
    <1042>   DW_AT_decl_column : 17
    <1043>   DW_AT_type        : <0x2b>
    <1047>   DW_AT_external    : 1
    <1048>   DW_AT_declaration : 1
 <1><1049>: Abbrev Number: 12 (DW_TAG_variable)
    <104a>   DW_AT_name        : (indirect string, offset: 0xeb1): nioctlents
    <104e>   DW_AT_decl_file   : 19
    <104f>   DW_AT_decl_line   : 1906
    <1051>   DW_AT_decl_column : 17
    <1052>   DW_AT_type        : <0x2b>
    <1056>   DW_AT_external    : 1
    <1057>   DW_AT_declaration : 1
 <1><1058>: Abbrev Number: 10 (DW_TAG_array_type)
    <1059>   DW_AT_type        : <0x32>
    <105d>   DW_AT_sibling     : <0x1068>
 <2><1061>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1062>   DW_AT_type        : <0x2b>
    <1066>   DW_AT_upper_bound : 2
 <2><1067>: Abbrev Number: 0
 <1><1068>: Abbrev Number: 3 (DW_TAG_const_type)
    <1069>   DW_AT_type        : <0x1058>
 <1><106d>: Abbrev Number: 12 (DW_TAG_variable)
    <106e>   DW_AT_name        : (indirect string, offset: 0xf11): nsyscall_vec
    <1072>   DW_AT_decl_file   : 19
    <1073>   DW_AT_decl_line   : 1908
    <1075>   DW_AT_decl_column : 27
    <1076>   DW_AT_type        : <0x1068>
    <107a>   DW_AT_external    : 1
    <107b>   DW_AT_declaration : 1
 <1><107c>: Abbrev Number: 10 (DW_TAG_array_type)
    <107d>   DW_AT_type        : <0x9d8>
    <1081>   DW_AT_sibling     : <0x108c>
 <2><1085>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1086>   DW_AT_type        : <0x2b>
    <108a>   DW_AT_upper_bound : 2
 <2><108b>: Abbrev Number: 0
 <1><108c>: Abbrev Number: 3 (DW_TAG_const_type)
    <108d>   DW_AT_type        : <0x107c>
 <1><1091>: Abbrev Number: 12 (DW_TAG_variable)
    <1092>   DW_AT_name        : (indirect string, offset: 0x7d6): sysent_vec
    <1096>   DW_AT_decl_file   : 19
    <1097>   DW_AT_decl_line   : 1909
    <1099>   DW_AT_decl_column : 35
    <109a>   DW_AT_type        : <0x108c>
    <109e>   DW_AT_external    : 1
    <109f>   DW_AT_declaration : 1
 <1><10a0>: Abbrev Number: 12 (DW_TAG_variable)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x3ad): inject_vec
    <10a5>   DW_AT_decl_file   : 19
    <10a6>   DW_AT_decl_line   : 1910
    <10a8>   DW_AT_decl_column : 28
    <10a9>   DW_AT_type        : <0x9dd>
    <10ad>   DW_AT_external    : 1
    <10ae>   DW_AT_declaration : 1
 <1><10af>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10b0>   DW_AT_name        : (indirect string, offset: 0xda9): audit_arch_t
    <10b4>   DW_AT_byte_size   : 8
    <10b5>   DW_AT_decl_file   : 19
    <10b6>   DW_AT_decl_line   : 1912
    <10b8>   DW_AT_decl_column : 8
    <10b9>   DW_AT_sibling     : <0x10de>
 <2><10bd>: Abbrev Number: 22 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0x624): arch
    <10c2>   DW_AT_decl_file   : 19
    <10c3>   DW_AT_decl_line   : 1913
    <10c5>   DW_AT_decl_column : 15
    <10c6>   DW_AT_type        : <0x2b>
    <10ca>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10cd>: Abbrev Number: 22 (DW_TAG_member)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x9fc): flag
    <10d2>   DW_AT_decl_file   : 19
    <10d3>   DW_AT_decl_line   : 1914
    <10d5>   DW_AT_decl_column : 15
    <10d6>   DW_AT_type        : <0x2b>
    <10da>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10dd>: Abbrev Number: 0
 <1><10de>: Abbrev Number: 3 (DW_TAG_const_type)
    <10df>   DW_AT_type        : <0x10af>
 <1><10e3>: Abbrev Number: 10 (DW_TAG_array_type)
    <10e4>   DW_AT_type        : <0x10de>
    <10e8>   DW_AT_sibling     : <0x10f3>
 <2><10ec>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10ed>   DW_AT_type        : <0x2b>
    <10f1>   DW_AT_upper_bound : 2
 <2><10f2>: Abbrev Number: 0
 <1><10f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f4>   DW_AT_type        : <0x10e3>
 <1><10f8>: Abbrev Number: 12 (DW_TAG_variable)
    <10f9>   DW_AT_name        : (indirect string, offset: 0x97a): audit_arch_vec
    <10fd>   DW_AT_decl_file   : 19
    <10fe>   DW_AT_decl_line   : 1917
    <1100>   DW_AT_decl_column : 34
    <1101>   DW_AT_type        : <0x10f3>
    <1105>   DW_AT_external    : 1
    <1106>   DW_AT_declaration : 1
 <1><1107>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1108>   DW_AT_byte_size   : 180
    <1109>   DW_AT_decl_file   : 21
    <110a>   DW_AT_decl_line   : 2
    <110b>   DW_AT_decl_column : 9
    <110c>   DW_AT_sibling     : <0x13c1>
 <2><1110>: Abbrev Number: 9 (DW_TAG_member)
    <1111>   DW_AT_name        : (indirect string, offset: 0x1dd): block_ioctl
    <1115>   DW_AT_decl_file   : 21
    <1116>   DW_AT_decl_line   : 3
    <1117>   DW_AT_decl_column : 8
    <1118>   DW_AT_type        : <0x13db>
    <111c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><111f>: Abbrev Number: 9 (DW_TAG_member)
    <1120>   DW_AT_name        : (indirect string, offset: 0xadd): btrfs_ioctl
    <1124>   DW_AT_decl_file   : 21
    <1125>   DW_AT_decl_line   : 6
    <1126>   DW_AT_decl_column : 8
    <1127>   DW_AT_type        : <0x13db>
    <112b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><112e>: Abbrev Number: 9 (DW_TAG_member)
    <112f>   DW_AT_name        : (indirect string, offset: 0x769): evdev_write_ioctl_mpers
    <1133>   DW_AT_decl_file   : 21
    <1134>   DW_AT_decl_line   : 9
    <1135>   DW_AT_decl_column : 8
    <1136>   DW_AT_type        : <0x13db>
    <113a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><113d>: Abbrev Number: 9 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x73f): get_sock_fprog_size
    <1142>   DW_AT_decl_file   : 21
    <1143>   DW_AT_decl_line   : 12
    <1144>   DW_AT_decl_column : 17
    <1145>   DW_AT_type        : <0x13e7>
    <1149>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><114c>: Abbrev Number: 9 (DW_TAG_member)
    <114d>   DW_AT_name        : (indirect string, offset: 0x1ac): fetch_bpf_fprog
    <1151>   DW_AT_decl_file   : 21
    <1152>   DW_AT_decl_line   : 15
    <1153>   DW_AT_decl_column : 10
    <1154>   DW_AT_type        : <0x1407>
