Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1718 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x50a): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x264): mpers-mx32/struct_loop_info.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb5e): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3d3): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1003): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9b9): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x376): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x25a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe14): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4ae): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8b0): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xef7): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8e0): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7b0): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb95): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbcb): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd27): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc94): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x41f): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x474): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x382): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xbb6): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xf9f): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xe24): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2f2): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb21): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10e1): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe4a): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xdf>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 3
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 16
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xae3): long double
 <1><176>: Abbrev Number: 12 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x295): __environ
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 543
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x185>
    <183>   DW_AT_external    : 1
    <184>   DW_AT_declaration : 1
 <1><185>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 4
    <187>   DW_AT_type        : <0xd9>
 <1><18b>: Abbrev Number: 12 (DW_TAG_variable)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3cb): environ
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 545
    <193>   DW_AT_decl_column : 15
    <194>   DW_AT_type        : <0x185>
    <198>   DW_AT_external    : 1
    <199>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 13 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0xfe4): optarg
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 36
    <1a1>   DW_AT_decl_column : 14
    <1a2>   DW_AT_type        : <0xd9>
    <1a6>   DW_AT_external    : 1
    <1a7>   DW_AT_declaration : 1
 <1><1a8>: Abbrev Number: 13 (DW_TAG_variable)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x783): optind
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 50
    <1af>   DW_AT_decl_column : 12
    <1b0>   DW_AT_type        : <0x64>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 13 (DW_TAG_variable)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xc83): opterr
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 55
    <1bd>   DW_AT_decl_column : 12
    <1be>   DW_AT_type        : <0x64>
    <1c2>   DW_AT_external    : 1
    <1c3>   DW_AT_declaration : 1
 <1><1c4>: Abbrev Number: 13 (DW_TAG_variable)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x10f4): optopt
    <1c9>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 59
    <1cb>   DW_AT_decl_column : 12
    <1cc>   DW_AT_type        : <0x64>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d3>   DW_AT_byte_size   : 4
    <1d4>   DW_AT_type        : <0xe6>
 <1><1d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d9>   DW_AT_type        : <0x1d2>
 <1><1dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1e4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x38a): _IO_FILE
    <1e9>   DW_AT_byte_size   : 152
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 49
    <1ec>   DW_AT_decl_column : 8
    <1ed>   DW_AT_sibling     : <0x3a5>
 <2><1f1>: Abbrev Number: 9 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0xa35): _flags
    <1f6>   DW_AT_decl_file   : 7
    <1f7>   DW_AT_decl_line   : 51
    <1f8>   DW_AT_decl_column : 7
    <1f9>   DW_AT_type        : <0x64>
    <1fd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x4fd): _IO_read_ptr
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 54
    <207>   DW_AT_decl_column : 9
    <208>   DW_AT_type        : <0xd9>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0xf4c): _IO_read_end
    <214>   DW_AT_decl_file   : 7
    <215>   DW_AT_decl_line   : 55
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xd9>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x7f7): _IO_read_base
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xd9>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 57
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xd9>
    <239>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x103c): _IO_write_ptr
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 58
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xd9>
    <248>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x931): _IO_write_end
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 59
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xd9>
    <257>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x9a2): _IO_buf_base
    <25f>   DW_AT_decl_file   : 7
    <260>   DW_AT_decl_line   : 60
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xd9>
    <266>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xdbf): _IO_buf_end
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 61
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xd9>
    <275>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_save_base
    <27d>   DW_AT_decl_file   : 7
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xd9>
    <284>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xce6): _IO_backup_base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 65
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xd9>
    <293>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 66
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xd9>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x62b): _markers
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 68
    <2ac>   DW_AT_decl_column : 22
    <2ad>   DW_AT_type        : <0x3bf>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x212): _chain
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 70
    <2bb>   DW_AT_decl_column : 20
    <2bc>   DW_AT_type        : <0x3c5>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0xfb3): _fileno
    <2c8>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 72
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x64>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x7e3): _flags2
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 73
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x85c): _old_offset
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 74
    <2e8>   DW_AT_decl_column : 11
    <2e9>   DW_AT_type        : <0xa2>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x245): _cur_column
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 77
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x24>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xe70): _vtable_offset
    <304>   DW_AT_decl_file   : 7
    <305>   DW_AT_decl_line   : 78
    <306>   DW_AT_decl_column : 15
    <307>   DW_AT_type        : <0x3e>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xcf6): _shortbuf
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 79
    <315>   DW_AT_decl_column : 8
    <316>   DW_AT_type        : <0x3cb>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 81
    <324>   DW_AT_decl_column : 15
    <325>   DW_AT_type        : <0x3db>
    <329>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x71b): _offset
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 89
    <333>   DW_AT_decl_column : 13
    <334>   DW_AT_type        : <0xae>
    <338>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xa75): _codecvt
    <340>   DW_AT_decl_file   : 7
    <341>   DW_AT_decl_line   : 91
    <342>   DW_AT_decl_column : 23
    <343>   DW_AT_type        : <0x3e7>
    <347>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xfc8): _wide_data
    <34f>   DW_AT_decl_file   : 7
    <350>   DW_AT_decl_line   : 92
    <351>   DW_AT_decl_column : 25
    <352>   DW_AT_type        : <0x3f3>
    <356>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x3ef): _freeres_list
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 93
    <360>   DW_AT_decl_column : 20
    <361>   DW_AT_type        : <0x3c5>
    <365>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xc59): _freeres_buf
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 94
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_type        : <0xc6>
    <374>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x9f7): __pad5
    <37c>   DW_AT_decl_file   : 7
    <37d>   DW_AT_decl_line   : 95
    <37e>   DW_AT_decl_column : 10
    <37f>   DW_AT_type        : <0x122>
    <383>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0xa59): _mode
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 96
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x64>
    <392>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x811): _unused2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 98
    <39c>   DW_AT_decl_column : 8
    <39d>   DW_AT_type        : <0x3f9>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xb03): FILE
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 7
    <3ac>   DW_AT_decl_column : 25
    <3ad>   DW_AT_type        : <0x1e4>
 <1><3b1>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x4a3): _IO_lock_t
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 43
    <3b8>   DW_AT_decl_column : 14
 <1><3b9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x334): _IO_marker
    <3be>   DW_AT_declaration : 1
 <1><3bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c1>   DW_AT_type        : <0x3b9>
 <1><3c5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c6>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x1e4>
 <1><3cb>: Abbrev Number: 10 (DW_TAG_array_type)
    <3cc>   DW_AT_type        : <0xdf>
    <3d0>   DW_AT_sibling     : <0x3db>
 <2><3d4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3d5>   DW_AT_type        : <0x2b>
    <3d9>   DW_AT_upper_bound : 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3b1>
 <1><3e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3e6>   DW_AT_declaration : 1
 <1><3e7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e8>   DW_AT_byte_size   : 4
    <3e9>   DW_AT_type        : <0x3e1>
 <1><3ed>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x39e): _IO_wide_data
    <3f2>   DW_AT_declaration : 1
 <1><3f3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f4>   DW_AT_byte_size   : 4
    <3f5>   DW_AT_type        : <0x3ed>
 <1><3f9>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fa>   DW_AT_type        : <0xdf>
    <3fe>   DW_AT_sibling     : <0x409>
 <2><402>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <403>   DW_AT_type        : <0x2b>
    <407>   DW_AT_upper_bound : 39
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 13 (DW_TAG_variable)
    <40a>   DW_AT_name        : (indirect string, offset: 0x5e2): stdin
    <40e>   DW_AT_decl_file   : 9
    <40f>   DW_AT_decl_line   : 137
    <410>   DW_AT_decl_column : 14
    <411>   DW_AT_type        : <0x417>
    <415>   DW_AT_external    : 1
    <416>   DW_AT_declaration : 1
 <1><417>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <418>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3a5>
 <1><41d>: Abbrev Number: 13 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x1016): stdout
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 138
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x417>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 13 (DW_TAG_variable)
    <42c>   DW_AT_name        : (indirect string, offset: 0xe0d): stderr
    <430>   DW_AT_decl_file   : 9
    <431>   DW_AT_decl_line   : 139
    <432>   DW_AT_decl_column : 14
    <433>   DW_AT_type        : <0x417>
    <437>   DW_AT_external    : 1
    <438>   DW_AT_declaration : 1
 <1><439>: Abbrev Number: 13 (DW_TAG_variable)
    <43a>   DW_AT_name        : (indirect string, offset: 0x251): sys_nerr
    <43e>   DW_AT_decl_file   : 10
    <43f>   DW_AT_decl_line   : 26
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0x64>
    <445>   DW_AT_external    : 1
    <446>   DW_AT_declaration : 1
 <1><447>: Abbrev Number: 10 (DW_TAG_array_type)
    <448>   DW_AT_type        : <0x1d8>
    <44c>   DW_AT_sibling     : <0x452>
 <2><450>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 3 (DW_TAG_const_type)
    <453>   DW_AT_type        : <0x447>
 <1><457>: Abbrev Number: 13 (DW_TAG_variable)
    <458>   DW_AT_name        : (indirect string, offset: 0x5f1): sys_errlist
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 27
    <45e>   DW_AT_decl_column : 26
    <45f>   DW_AT_type        : <0x452>
    <463>   DW_AT_external    : 1
    <464>   DW_AT_declaration : 1
 <1><465>: Abbrev Number: 13 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x282): _sys_nerr
    <46a>   DW_AT_decl_file   : 10
    <46b>   DW_AT_decl_line   : 30
    <46c>   DW_AT_decl_column : 12
    <46d>   DW_AT_type        : <0x64>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 13 (DW_TAG_variable)
    <474>   DW_AT_name        : (indirect string, offset: 0xe7f): _sys_errlist
    <478>   DW_AT_decl_file   : 10
    <479>   DW_AT_decl_line   : 31
    <47a>   DW_AT_decl_column : 26
    <47b>   DW_AT_type        : <0x452>
    <47f>   DW_AT_external    : 1
    <480>   DW_AT_declaration : 1
 <1><481>: Abbrev Number: 13 (DW_TAG_variable)
    <482>   DW_AT_name        : (indirect string, offset: 0x6f4): program_invocation_name
    <486>   DW_AT_decl_file   : 11
    <487>   DW_AT_decl_line   : 45
    <488>   DW_AT_decl_column : 14
    <489>   DW_AT_type        : <0xd9>
    <48d>   DW_AT_external    : 1
    <48e>   DW_AT_declaration : 1
 <1><48f>: Abbrev Number: 13 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0xbf6): program_invocation_short_name
    <494>   DW_AT_decl_file   : 11
    <495>   DW_AT_decl_line   : 46
    <496>   DW_AT_decl_column : 14
    <497>   DW_AT_type        : <0xd9>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 10 (DW_TAG_array_type)
    <49e>   DW_AT_type        : <0xd9>
    <4a2>   DW_AT_sibling     : <0x4ad>
 <2><4a6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4a7>   DW_AT_type        : <0x2b>
    <4ab>   DW_AT_upper_bound : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 13 (DW_TAG_variable)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1bc): __tzname
    <4b2>   DW_AT_decl_file   : 12
    <4b3>   DW_AT_decl_line   : 159
    <4b4>   DW_AT_decl_column : 14
    <4b5>   DW_AT_type        : <0x49d>
    <4b9>   DW_AT_external    : 1
    <4ba>   DW_AT_declaration : 1
 <1><4bb>: Abbrev Number: 13 (DW_TAG_variable)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xede): __daylight
    <4c0>   DW_AT_decl_file   : 12
    <4c1>   DW_AT_decl_line   : 160
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x64>
    <4c7>   DW_AT_external    : 1
    <4c8>   DW_AT_declaration : 1
 <1><4c9>: Abbrev Number: 13 (DW_TAG_variable)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x393): __timezone
    <4ce>   DW_AT_decl_file   : 12
    <4cf>   DW_AT_decl_line   : 161
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x11b>
    <4d5>   DW_AT_external    : 1
    <4d6>   DW_AT_declaration : 1
 <1><4d7>: Abbrev Number: 13 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0x9f0): tzname
    <4dc>   DW_AT_decl_file   : 12
    <4dd>   DW_AT_decl_line   : 166
    <4de>   DW_AT_decl_column : 14
    <4df>   DW_AT_type        : <0x49d>
    <4e3>   DW_AT_external    : 1
    <4e4>   DW_AT_declaration : 1
 <1><4e5>: Abbrev Number: 13 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x1097): daylight
    <4ea>   DW_AT_decl_file   : 12
    <4eb>   DW_AT_decl_line   : 174
    <4ec>   DW_AT_decl_column : 12
    <4ed>   DW_AT_type        : <0x64>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 13 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x4e8): timezone
    <4f8>   DW_AT_decl_file   : 12
    <4f9>   DW_AT_decl_line   : 175
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x11b>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 12 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0xf73): getdate_err
    <506>   DW_AT_decl_file   : 12
    <507>   DW_AT_decl_line   : 274
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0x64>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 13 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0xa03): debug_flag
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 20
    <517>   DW_AT_decl_column : 13
    <518>   DW_AT_type        : <0x51e>
    <51c>   DW_AT_external    : 1
    <51d>   DW_AT_declaration : 1
 <1><51e>: Abbrev Number: 2 (DW_TAG_base_type)
    <51f>   DW_AT_byte_size   : 1
    <520>   DW_AT_encoding    : 2	(boolean)
    <521>   DW_AT_name        : (indirect string, offset: 0x431): _Bool
 <1><525>: Abbrev Number: 3 (DW_TAG_const_type)
    <526>   DW_AT_type        : <0x51e>
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0xab9): __kernel_long_t
    <52f>   DW_AT_decl_file   : 14
    <530>   DW_AT_decl_line   : 14
    <531>   DW_AT_decl_column : 19
    <532>   DW_AT_type        : <0x88>
 <1><536>: Abbrev Number: 4 (DW_TAG_typedef)
    <537>   DW_AT_name        : (indirect string, offset: 0x5d1): __kernel_ulong_t
    <53b>   DW_AT_decl_file   : 14
    <53c>   DW_AT_decl_line   : 15
    <53d>   DW_AT_decl_column : 28
    <53e>   DW_AT_type        : <0x9b>
 <1><542>: Abbrev Number: 4 (DW_TAG_typedef)
    <543>   DW_AT_name        : (indirect string, offset: 0x6c0): __kernel_old_dev_t
    <547>   DW_AT_decl_file   : 15
    <548>   DW_AT_decl_line   : 15
    <549>   DW_AT_decl_column : 23
    <54a>   DW_AT_type        : <0x37>
 <1><54e>: Abbrev Number: 4 (DW_TAG_typedef)
    <54f>   DW_AT_name        : (indirect string, offset: 0x3fd): kernel_long_t
    <553>   DW_AT_decl_file   : 16
    <554>   DW_AT_decl_line   : 16
    <555>   DW_AT_decl_column : 25
    <556>   DW_AT_type        : <0x52a>
 <1><55a>: Abbrev Number: 4 (DW_TAG_typedef)
    <55b>   DW_AT_name        : (indirect string, offset: 0x8d1): kernel_ulong_t
    <55f>   DW_AT_decl_file   : 16
    <560>   DW_AT_decl_line   : 17
    <561>   DW_AT_decl_column : 26
    <562>   DW_AT_type        : <0x536>
 <1><566>: Abbrev Number: 3 (DW_TAG_const_type)
    <567>   DW_AT_type        : <0x55a>
 <1><56b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56c>   DW_AT_name        : (indirect string, offset: 0xc14): list_item
    <570>   DW_AT_byte_size   : 8
    <571>   DW_AT_decl_file   : 17
    <572>   DW_AT_decl_line   : 92
    <573>   DW_AT_decl_column : 8
    <574>   DW_AT_sibling     : <0x597>
 <2><578>: Abbrev Number: 9 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0x10dc): prev
    <57d>   DW_AT_decl_file   : 17
    <57e>   DW_AT_decl_line   : 93
    <57f>   DW_AT_decl_column : 20
    <580>   DW_AT_type        : <0x597>
    <584>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x10d2): next
    <58c>   DW_AT_decl_file   : 17
    <58d>   DW_AT_decl_line   : 94
    <58e>   DW_AT_decl_column : 20
    <58f>   DW_AT_type        : <0x597>
    <593>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><596>: Abbrev Number: 0
 <1><597>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <598>   DW_AT_byte_size   : 4
    <599>   DW_AT_type        : <0x56b>
 <1><59d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59e>   DW_AT_name        : (indirect string, offset: 0x8a9): sysent
    <5a2>   DW_AT_byte_size   : 20
    <5a3>   DW_AT_decl_file   : 18
    <5a4>   DW_AT_decl_line   : 13
    <5a5>   DW_AT_decl_column : 16
    <5a6>   DW_AT_sibling     : <0x5f6>
 <2><5aa>: Abbrev Number: 9 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x102d): nargs
    <5af>   DW_AT_decl_file   : 18
    <5b0>   DW_AT_decl_line   : 14
    <5b1>   DW_AT_decl_column : 11
    <5b2>   DW_AT_type        : <0x2b>
    <5b6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b9>: Abbrev Number: 9 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x9af): sys_flags
    <5be>   DW_AT_decl_file   : 18
    <5bf>   DW_AT_decl_line   : 15
    <5c0>   DW_AT_decl_column : 6
    <5c1>   DW_AT_type        : <0x64>
    <5c5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c8>: Abbrev Number: 18 (DW_TAG_member)
    <5c9>   DW_AT_name        : sen
    <5cd>   DW_AT_decl_file   : 18
    <5ce>   DW_AT_decl_line   : 16
    <5cf>   DW_AT_decl_column : 6
    <5d0>   DW_AT_type        : <0x64>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d7>: Abbrev Number: 9 (DW_TAG_member)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x32b): sys_func
    <5dc>   DW_AT_decl_file   : 18
    <5dd>   DW_AT_decl_line   : 17
    <5de>   DW_AT_decl_column : 8
    <5df>   DW_AT_type        : <0x852>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e6>: Abbrev Number: 9 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x28c): sys_name
    <5eb>   DW_AT_decl_file   : 18
    <5ec>   DW_AT_decl_line   : 18
    <5ed>   DW_AT_decl_column : 14
    <5ee>   DW_AT_type        : <0x1d2>
    <5f2>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f5>: Abbrev Number: 0
 <1><5f6>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5f7>   DW_AT_prototyped  : 1
    <5f8>   DW_AT_type        : <0x64>
    <5fc>   DW_AT_sibling     : <0x606>
 <2><600>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <601>   DW_AT_type        : <0x606>
 <2><605>: Abbrev Number: 0
 <1><606>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <607>   DW_AT_byte_size   : 4
    <608>   DW_AT_type        : <0x611>
 <1><60c>: Abbrev Number: 3 (DW_TAG_const_type)
    <60d>   DW_AT_type        : <0x606>
 <1><611>: Abbrev Number: 21 (DW_TAG_structure_type)
    <612>   DW_AT_name        : tcb
    <616>   DW_AT_byte_size   : 280
    <618>   DW_AT_decl_file   : 19
    <619>   DW_AT_decl_line   : 262
    <61b>   DW_AT_decl_column : 8
    <61c>   DW_AT_sibling     : <0x852>
 <2><620>: Abbrev Number: 22 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x4f7): flags
    <625>   DW_AT_decl_file   : 19
    <626>   DW_AT_decl_line   : 263
    <628>   DW_AT_decl_column : 6
    <629>   DW_AT_type        : <0x64>
    <62d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><630>: Abbrev Number: 23 (DW_TAG_member)
    <631>   DW_AT_name        : pid
    <635>   DW_AT_decl_file   : 19
    <636>   DW_AT_decl_line   : 264
    <638>   DW_AT_decl_column : 6
    <639>   DW_AT_type        : <0x64>
    <63d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><640>: Abbrev Number: 22 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <645>   DW_AT_decl_file   : 19
    <646>   DW_AT_decl_line   : 265
    <648>   DW_AT_decl_column : 6
    <649>   DW_AT_type        : <0x64>
    <64d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><650>: Abbrev Number: 22 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0x3b7): currpers
    <655>   DW_AT_decl_file   : 19
    <656>   DW_AT_decl_line   : 267
    <658>   DW_AT_decl_column : 15
    <659>   DW_AT_type        : <0x2b>
    <65d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><660>: Abbrev Number: 22 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0xb56): u_error
    <665>   DW_AT_decl_file   : 19
    <666>   DW_AT_decl_line   : 269
    <668>   DW_AT_decl_column : 16
    <669>   DW_AT_type        : <0x37>
    <66d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><670>: Abbrev Number: 22 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <675>   DW_AT_decl_file   : 19
    <676>   DW_AT_decl_line   : 270
    <678>   DW_AT_decl_column : 17
    <679>   DW_AT_type        : <0x55a>
    <67d>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><680>: Abbrev Number: 22 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0xbac): true_scno
    <685>   DW_AT_decl_file   : 19
    <686>   DW_AT_decl_line   : 271
    <688>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x55a>
    <68d>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><690>: Abbrev Number: 22 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x1a6): u_arg
    <695>   DW_AT_decl_file   : 19
    <696>   DW_AT_decl_line   : 272
    <698>   DW_AT_decl_column : 17
    <699>   DW_AT_type        : <0x982>
    <69d>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6a0>: Abbrev Number: 22 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x9c6): u_rval
    <6a5>   DW_AT_decl_file   : 19
    <6a6>   DW_AT_decl_line   : 273
    <6a8>   DW_AT_decl_column : 16
    <6a9>   DW_AT_type        : <0x54e>
    <6ad>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6b0>: Abbrev Number: 22 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0xad5): sys_func_rval
    <6b5>   DW_AT_decl_file   : 19
    <6b6>   DW_AT_decl_line   : 274
    <6b8>   DW_AT_decl_column : 6
    <6b9>   DW_AT_type        : <0x64>
    <6bd>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6c0>: Abbrev Number: 22 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xd18): curcol
    <6c5>   DW_AT_decl_file   : 19
    <6c6>   DW_AT_decl_line   : 275
    <6c8>   DW_AT_decl_column : 6
    <6c9>   DW_AT_type        : <0x64>
    <6cd>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0x9d8): outf
    <6d5>   DW_AT_decl_file   : 19
    <6d6>   DW_AT_decl_line   : 276
    <6d8>   DW_AT_decl_column : 8
    <6d9>   DW_AT_type        : <0x417>
    <6dd>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6e0>: Abbrev Number: 22 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xf1d): staged_output_data
    <6e5>   DW_AT_decl_file   : 19
    <6e6>   DW_AT_decl_line   : 277
    <6e8>   DW_AT_decl_column : 29
    <6e9>   DW_AT_type        : <0x998>
    <6ed>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6f0>: Abbrev Number: 22 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0xaa0): auxstr
    <6f5>   DW_AT_decl_file   : 19
    <6f6>   DW_AT_decl_line   : 279
    <6f8>   DW_AT_decl_column : 14
    <6f9>   DW_AT_type        : <0x1d2>
    <6fd>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><700>: Abbrev Number: 22 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <705>   DW_AT_decl_file   : 19
    <706>   DW_AT_decl_line   : 280
    <708>   DW_AT_decl_column : 8
    <709>   DW_AT_type        : <0xc6>
    <70d>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><710>: Abbrev Number: 22 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xc49): _free_priv_data
    <715>   DW_AT_decl_file   : 19
    <716>   DW_AT_decl_line   : 281
    <718>   DW_AT_decl_column : 9
    <719>   DW_AT_type        : <0x9aa>
    <71d>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><720>: Abbrev Number: 22 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x18c): s_ent
    <725>   DW_AT_decl_file   : 19
    <726>   DW_AT_decl_line   : 282
    <728>   DW_AT_decl_column : 23
    <729>   DW_AT_type        : <0x9b0>
    <72d>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><730>: Abbrev Number: 22 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <735>   DW_AT_decl_file   : 19
    <736>   DW_AT_decl_line   : 285
    <738>   DW_AT_decl_column : 23
    <739>   DW_AT_type        : <0x9b0>
    <73d>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><741>: Abbrev Number: 22 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x3ac): inject_vec
    <746>   DW_AT_decl_file   : 19
    <747>   DW_AT_decl_line   : 286
    <749>   DW_AT_decl_column : 22
    <74a>   DW_AT_type        : <0x9bb>
    <74e>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x81a): stime
    <757>   DW_AT_decl_file   : 19
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x133>
    <75f>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><763>: Abbrev Number: 22 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x3c0): ltime
    <768>   DW_AT_decl_file   : 19
    <769>   DW_AT_decl_line   : 288
    <76b>   DW_AT_decl_column : 18
    <76c>   DW_AT_type        : <0x133>
    <770>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><774>: Abbrev Number: 22 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0xff4): atime
    <779>   DW_AT_decl_file   : 19
    <77a>   DW_AT_decl_line   : 289
    <77c>   DW_AT_decl_column : 18
    <77d>   DW_AT_type        : <0x133>
    <781>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><785>: Abbrev Number: 22 (DW_TAG_member)
    <786>   DW_AT_name        : (indirect string, offset: 0x4f1): etime
    <78a>   DW_AT_decl_file   : 19
    <78b>   DW_AT_decl_line   : 290
    <78d>   DW_AT_decl_column : 18
    <78e>   DW_AT_type        : <0x133>
    <792>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><796>: Abbrev Number: 22 (DW_TAG_member)
    <797>   DW_AT_name        : (indirect string, offset: 0xd7c): delay_expiration_time
    <79b>   DW_AT_decl_file   : 19
    <79c>   DW_AT_decl_line   : 291
    <79e>   DW_AT_decl_column : 18
    <79f>   DW_AT_type        : <0x133>
    <7a3>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a7>: Abbrev Number: 22 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7ac>   DW_AT_decl_file   : 19
    <7ad>   DW_AT_decl_line   : 298
    <7af>   DW_AT_decl_column : 15
    <7b0>   DW_AT_type        : <0x2b>
    <7b4>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b8>: Abbrev Number: 22 (DW_TAG_member)
    <7b9>   DW_AT_name        : (indirect string, offset: 0xf59): last_dirfd
    <7bd>   DW_AT_decl_file   : 19
    <7be>   DW_AT_decl_line   : 301
    <7c0>   DW_AT_decl_column : 6
    <7c1>   DW_AT_type        : <0x64>
    <7c5>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c9>: Abbrev Number: 22 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xf7f): mmap_cache
    <7ce>   DW_AT_decl_file   : 19
    <7cf>   DW_AT_decl_line   : 304
    <7d1>   DW_AT_decl_column : 23
    <7d2>   DW_AT_type        : <0x9d7>
    <7d6>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7da>: Abbrev Number: 22 (DW_TAG_member)
    <7db>   DW_AT_name        : (indirect string, offset: 0xb82): wait_data_idx
    <7df>   DW_AT_decl_file   : 19
    <7e0>   DW_AT_decl_line   : 311
    <7e2>   DW_AT_decl_column : 9
    <7e3>   DW_AT_type        : <0x122>
    <7e7>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7eb>: Abbrev Number: 22 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0xaa7): delayed_wait_data
    <7f0>   DW_AT_decl_file   : 19
    <7f1>   DW_AT_decl_line   : 313
    <7f3>   DW_AT_decl_column : 24
    <7f4>   DW_AT_type        : <0x9e3>
    <7f8>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7fc>: Abbrev Number: 22 (DW_TAG_member)
    <7fd>   DW_AT_name        : (indirect string, offset: 0xb17): wait_list
    <801>   DW_AT_decl_file   : 19
    <802>   DW_AT_decl_line   : 314
    <804>   DW_AT_decl_column : 19
    <805>   DW_AT_type        : <0x56b>
    <809>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><80d>: Abbrev Number: 22 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x70c): vcpu_info_list
    <812>   DW_AT_decl_file   : 19
    <813>   DW_AT_decl_line   : 318
    <815>   DW_AT_decl_column : 20
    <816>   DW_AT_type        : <0x9ef>
    <81a>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81e>: Abbrev Number: 22 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0xcdb): unwind_ctx
    <823>   DW_AT_decl_file   : 19
    <824>   DW_AT_decl_line   : 322
    <826>   DW_AT_decl_column : 8
    <827>   DW_AT_type        : <0xc6>
    <82b>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82f>: Abbrev Number: 22 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x4db): unwind_queue
    <834>   DW_AT_decl_file   : 19
    <835>   DW_AT_decl_line   : 323
    <837>   DW_AT_decl_column : 25
    <838>   DW_AT_type        : <0x9fb>
    <83c>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><840>: Abbrev Number: 22 (DW_TAG_member)
    <841>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <845>   DW_AT_decl_file   : 19
    <846>   DW_AT_decl_line   : 327
    <848>   DW_AT_decl_column : 7
    <849>   DW_AT_type        : <0xa01>
    <84d>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <853>   DW_AT_byte_size   : 4
    <854>   DW_AT_type        : <0x5f6>
 <1><858>: Abbrev Number: 4 (DW_TAG_typedef)
    <859>   DW_AT_name        : (indirect string, offset: 0x5c3): struct_sysent
    <85d>   DW_AT_decl_file   : 18
    <85e>   DW_AT_decl_line   : 19
    <85f>   DW_AT_decl_column : 3
    <860>   DW_AT_type        : <0x59d>
 <1><864>: Abbrev Number: 3 (DW_TAG_const_type)
    <865>   DW_AT_type        : <0x858>
 <1><869>: Abbrev Number: 13 (DW_TAG_variable)
    <86a>   DW_AT_name        : (indirect string, offset: 0xd68): current_personality
    <86e>   DW_AT_decl_file   : 19
    <86f>   DW_AT_decl_line   : 158
    <870>   DW_AT_decl_column : 17
    <871>   DW_AT_type        : <0x2b>
    <875>   DW_AT_external    : 1
    <876>   DW_AT_declaration : 1
 <1><877>: Abbrev Number: 13 (DW_TAG_variable)
    <878>   DW_AT_name        : (indirect string, offset: 0x84b): current_wordsize
    <87c>   DW_AT_decl_file   : 19
    <87d>   DW_AT_decl_line   : 171
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x2b>
    <883>   DW_AT_external    : 1
    <884>   DW_AT_declaration : 1
 <1><885>: Abbrev Number: 13 (DW_TAG_variable)
    <886>   DW_AT_name        : (indirect string, offset: 0xa7e): current_klongsize
    <88a>   DW_AT_decl_file   : 19
    <88b>   DW_AT_decl_line   : 176
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x2b>
    <891>   DW_AT_external    : 1
    <892>   DW_AT_declaration : 1
 <1><893>: Abbrev Number: 8 (DW_TAG_structure_type)
    <894>   DW_AT_name        : (indirect string, offset: 0xcb2): ioctlent
    <898>   DW_AT_byte_size   : 8
    <899>   DW_AT_decl_file   : 19
    <89a>   DW_AT_decl_line   : 217
    <89b>   DW_AT_decl_column : 16
    <89c>   DW_AT_sibling     : <0x8bf>
 <2><8a0>: Abbrev Number: 9 (DW_TAG_member)
    <8a1>   DW_AT_name        : (indirect string, offset: 0xf45): symbol
    <8a5>   DW_AT_decl_file   : 19
    <8a6>   DW_AT_decl_line   : 218
    <8a7>   DW_AT_decl_column : 14
    <8a8>   DW_AT_type        : <0x1d2>
    <8ac>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8af>: Abbrev Number: 9 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0xd31): code
    <8b4>   DW_AT_decl_file   : 19
    <8b5>   DW_AT_decl_line   : 219
    <8b6>   DW_AT_decl_column : 15
    <8b7>   DW_AT_type        : <0x2b>
    <8bb>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8be>: Abbrev Number: 0
 <1><8bf>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c0>   DW_AT_name        : (indirect string, offset: 0xc73): struct_ioctlent
    <8c4>   DW_AT_decl_file   : 19
    <8c5>   DW_AT_decl_line   : 220
    <8c6>   DW_AT_decl_column : 3
    <8c7>   DW_AT_type        : <0x893>
 <1><8cb>: Abbrev Number: 3 (DW_TAG_const_type)
    <8cc>   DW_AT_type        : <0x8bf>
 <1><8d0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x83f): inject_data
    <8d5>   DW_AT_byte_size   : 10
    <8d6>   DW_AT_decl_file   : 19
    <8d7>   DW_AT_decl_line   : 241
    <8d8>   DW_AT_decl_column : 8
    <8d9>   DW_AT_sibling     : <0x938>
 <2><8dd>: Abbrev Number: 9 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0x4f7): flags
    <8e2>   DW_AT_decl_file   : 19
    <8e3>   DW_AT_decl_line   : 242
    <8e4>   DW_AT_decl_column : 10
    <8e5>   DW_AT_type        : <0xeb>
    <8e9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ec>: Abbrev Number: 9 (DW_TAG_member)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x963): signo
    <8f1>   DW_AT_decl_file   : 19
    <8f2>   DW_AT_decl_line   : 243
    <8f3>   DW_AT_decl_column : 10
    <8f4>   DW_AT_type        : <0xeb>
    <8f8>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8fb>: Abbrev Number: 9 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <900>   DW_AT_decl_file   : 19
    <901>   DW_AT_decl_line   : 244
    <902>   DW_AT_decl_column : 11
    <903>   DW_AT_type        : <0xf7>
    <907>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><90a>: Abbrev Number: 9 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0xd06): delay_idx
    <90f>   DW_AT_decl_file   : 19
    <910>   DW_AT_decl_line   : 245
    <911>   DW_AT_decl_column : 11
    <912>   DW_AT_type        : <0xf7>
    <916>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><919>: Abbrev Number: 9 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x61d): poke_idx
    <91e>   DW_AT_decl_file   : 19
    <91f>   DW_AT_decl_line   : 246
    <920>   DW_AT_decl_column : 11
    <921>   DW_AT_type        : <0xf7>
    <925>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><928>: Abbrev Number: 9 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <92d>   DW_AT_decl_file   : 19
    <92e>   DW_AT_decl_line   : 247
    <92f>   DW_AT_decl_column : 11
    <930>   DW_AT_type        : <0xf7>
    <934>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><937>: Abbrev Number: 0
 <1><938>: Abbrev Number: 8 (DW_TAG_structure_type)
    <939>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <93d>   DW_AT_byte_size   : 16
    <93e>   DW_AT_decl_file   : 19
    <93f>   DW_AT_decl_line   : 250
    <940>   DW_AT_decl_column : 8
    <941>   DW_AT_sibling     : <0x982>
 <2><945>: Abbrev Number: 9 (DW_TAG_member)
    <946>   DW_AT_name        : (indirect string, offset: 0xa53): first
    <94a>   DW_AT_decl_file   : 19
    <94b>   DW_AT_decl_line   : 251
    <94c>   DW_AT_decl_column : 11
    <94d>   DW_AT_type        : <0xf7>
    <951>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><954>: Abbrev Number: 9 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x110c): last
    <959>   DW_AT_decl_file   : 19
    <95a>   DW_AT_decl_line   : 252
    <95b>   DW_AT_decl_column : 11
    <95c>   DW_AT_type        : <0xf7>
    <960>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><963>: Abbrev Number: 9 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x3c6): step
    <968>   DW_AT_decl_file   : 19
    <969>   DW_AT_decl_line   : 253
    <96a>   DW_AT_decl_column : 11
    <96b>   DW_AT_type        : <0xf7>
    <96f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><972>: Abbrev Number: 9 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x10d7): data
    <977>   DW_AT_decl_file   : 19
    <978>   DW_AT_decl_line   : 254
    <979>   DW_AT_decl_column : 21
    <97a>   DW_AT_type        : <0x8d0>
    <97e>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><981>: Abbrev Number: 0
 <1><982>: Abbrev Number: 10 (DW_TAG_array_type)
    <983>   DW_AT_type        : <0x55a>
    <987>   DW_AT_sibling     : <0x992>
 <2><98b>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <98c>   DW_AT_type        : <0x2b>
    <990>   DW_AT_upper_bound : 5
 <2><991>: Abbrev Number: 0
 <1><992>: Abbrev Number: 16 (DW_TAG_structure_type)
    <993>   DW_AT_name        : (indirect string, offset: 0xf1d): staged_output_data
    <997>   DW_AT_declaration : 1
 <1><998>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <999>   DW_AT_byte_size   : 4
    <99a>   DW_AT_type        : <0x992>
 <1><99e>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <99f>   DW_AT_prototyped  : 1
    <9a0>   DW_AT_sibling     : <0x9aa>
 <2><9a4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9a5>   DW_AT_type        : <0xc6>
 <2><9a9>: Abbrev Number: 0
 <1><9aa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ab>   DW_AT_byte_size   : 4
    <9ac>   DW_AT_type        : <0x99e>
 <1><9b0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b1>   DW_AT_byte_size   : 4
    <9b2>   DW_AT_type        : <0x864>
 <1><9b6>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b7>   DW_AT_type        : <0x9b0>
 <1><9bb>: Abbrev Number: 10 (DW_TAG_array_type)
    <9bc>   DW_AT_type        : <0x9cb>
    <9c0>   DW_AT_sibling     : <0x9cb>
 <2><9c4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9c5>   DW_AT_type        : <0x2b>
    <9c9>   DW_AT_upper_bound : 2
 <2><9ca>: Abbrev Number: 0
 <1><9cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cc>   DW_AT_byte_size   : 4
    <9cd>   DW_AT_type        : <0x938>
 <1><9d1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9d6>   DW_AT_declaration : 1
 <1><9d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d8>   DW_AT_byte_size   : 4
    <9d9>   DW_AT_type        : <0x9d1>
 <1><9dd>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9de>   DW_AT_name        : (indirect string, offset: 0x3e1): tcb_wait_data
    <9e2>   DW_AT_declaration : 1
 <1><9e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e4>   DW_AT_byte_size   : 4
    <9e5>   DW_AT_type        : <0x9dd>
 <1><9e9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <9ee>   DW_AT_declaration : 1
 <1><9ef>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f0>   DW_AT_byte_size   : 4
    <9f1>   DW_AT_type        : <0x9e9>
 <1><9f5>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f6>   DW_AT_name        : (indirect string, offset: 0xf01): unwind_queue_t
    <9fa>   DW_AT_declaration : 1
 <1><9fb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fc>   DW_AT_byte_size   : 4
    <9fd>   DW_AT_type        : <0x9f5>
 <1><a01>: Abbrev Number: 10 (DW_TAG_array_type)
    <a02>   DW_AT_type        : <0xdf>
    <a06>   DW_AT_sibling     : <0xa11>
 <2><a0a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a0b>   DW_AT_type        : <0x2b>
    <a0f>   DW_AT_upper_bound : 15
 <2><a10>: Abbrev Number: 0
 <1><a11>: Abbrev Number: 12 (DW_TAG_variable)
    <a12>   DW_AT_name        : (indirect string, offset: 0xbbf): stub_sysent
    <a16>   DW_AT_decl_file   : 19
    <a17>   DW_AT_decl_line   : 400
    <a19>   DW_AT_decl_column : 28
    <a1a>   DW_AT_type        : <0x864>
    <a1e>   DW_AT_external    : 1
    <a1f>   DW_AT_declaration : 1
 <1><a20>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a21>   DW_AT_name        : (indirect string, offset: 0x10ba): xlat_type
    <a25>   DW_AT_encoding    : 7	(unsigned)
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_type        : <0x2b>
    <a2b>   DW_AT_decl_file   : 20
    <a2c>   DW_AT_decl_line   : 13
    <a2d>   DW_AT_decl_column : 6
    <a2e>   DW_AT_sibling     : <0xa45>
 <2><a32>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a33>   DW_AT_name        : (indirect string, offset: 0x2fb): XT_NORMAL
    <a37>   DW_AT_const_value : 0
 <2><a38>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a39>   DW_AT_name        : (indirect string, offset: 0xc8a): XT_SORTED
    <a3d>   DW_AT_const_value : 1
 <2><a3e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3f>   DW_AT_name        : (indirect string, offset: 0xdf4): XT_INDEXED
    <a43>   DW_AT_const_value : 2
 <2><a44>: Abbrev Number: 0
 <1><a45>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a46>   DW_AT_name        : (indirect string, offset: 0xbeb): xlat_style
    <a4a>   DW_AT_encoding    : 7	(unsigned)
    <a4b>   DW_AT_byte_size   : 4
    <a4c>   DW_AT_type        : <0x2b>
    <a50>   DW_AT_decl_file   : 20
    <a51>   DW_AT_decl_line   : 19
    <a52>   DW_AT_decl_column : 6
    <a53>   DW_AT_sibling     : <0xa82>
 <2><a57>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a5c>   DW_AT_const_value : 0
 <2><a5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xc26): XLAT_STYLE_RAW
    <a62>   DW_AT_const_value : 1
 <2><a63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0x1085): XLAT_STYLE_ABBREV
    <a68>   DW_AT_const_value : 2
 <2><a69>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x318): XLAT_STYLE_VERBOSE
    <a6e>   DW_AT_const_value : 3
 <2><a6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a74>   DW_AT_const_value : 0
 <2><a75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a7a>   DW_AT_const_value : 4
 <2><a7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x10fb): XLAT_STYLE_FMT_D
    <a80>   DW_AT_const_value : 8
 <2><a81>: Abbrev Number: 0
 <1><a82>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a83>   DW_AT_name        : (indirect string, offset: 0x349): xlat_data
    <a87>   DW_AT_byte_size   : 16
    <a88>   DW_AT_decl_file   : 20
    <a89>   DW_AT_decl_line   : 51
    <a8a>   DW_AT_decl_column : 8
    <a8b>   DW_AT_sibling     : <0xaae>
 <2><a8f>: Abbrev Number: 18 (DW_TAG_member)
    <a90>   DW_AT_name        : val
    <a94>   DW_AT_decl_file   : 20
    <a95>   DW_AT_decl_line   : 52
    <a96>   DW_AT_decl_column : 11
    <a97>   DW_AT_type        : <0x10f>
    <a9b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a9e>: Abbrev Number: 18 (DW_TAG_member)
    <a9f>   DW_AT_name        : str
    <aa3>   DW_AT_decl_file   : 20
    <aa4>   DW_AT_decl_line   : 53
    <aa5>   DW_AT_decl_column : 14
    <aa6>   DW_AT_type        : <0x1d2>
    <aaa>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aad>: Abbrev Number: 0
 <1><aae>: Abbrev Number: 3 (DW_TAG_const_type)
    <aaf>   DW_AT_type        : <0xa82>
 <1><ab3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ab8>   DW_AT_byte_size   : 24
    <ab9>   DW_AT_decl_file   : 20
    <aba>   DW_AT_decl_line   : 56
    <abb>   DW_AT_decl_column : 8
    <abc>   DW_AT_sibling     : <0xb0c>
 <2><ac0>: Abbrev Number: 9 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x10d7): data
    <ac5>   DW_AT_decl_file   : 20
    <ac6>   DW_AT_decl_line   : 57
    <ac7>   DW_AT_decl_column : 26
    <ac8>   DW_AT_type        : <0xb11>
    <acc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><acf>: Abbrev Number: 9 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x89d): flags_strsz
    <ad4>   DW_AT_decl_file   : 20
    <ad5>   DW_AT_decl_line   : 58
    <ad6>   DW_AT_decl_column : 9
    <ad7>   DW_AT_type        : <0x122>
    <adb>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ade>: Abbrev Number: 9 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0xb90): size
    <ae3>   DW_AT_decl_file   : 20
    <ae4>   DW_AT_decl_line   : 59
    <ae5>   DW_AT_decl_column : 11
    <ae6>   DW_AT_type        : <0x103>
    <aea>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aed>: Abbrev Number: 9 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x1a1): type
    <af2>   DW_AT_decl_file   : 20
    <af3>   DW_AT_decl_line   : 60
    <af4>   DW_AT_decl_column : 17
    <af5>   DW_AT_type        : <0xa20>
    <af9>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><afc>: Abbrev Number: 9 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0x760): flags_mask
    <b01>   DW_AT_decl_file   : 20
    <b02>   DW_AT_decl_line   : 61
    <b03>   DW_AT_decl_column : 11
    <b04>   DW_AT_type        : <0x10f>
    <b08>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b0b>: Abbrev Number: 0
 <1><b0c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0d>   DW_AT_type        : <0xab3>
 <1><b11>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b12>   DW_AT_byte_size   : 4
    <b13>   DW_AT_type        : <0xaae>
 <1><b17>: Abbrev Number: 10 (DW_TAG_array_type)
    <b18>   DW_AT_type        : <0xb0c>
    <b1c>   DW_AT_sibling     : <0xb22>
 <2><b20>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b21>: Abbrev Number: 0
 <1><b22>: Abbrev Number: 3 (DW_TAG_const_type)
    <b23>   DW_AT_type        : <0xb17>
 <1><b27>: Abbrev Number: 12 (DW_TAG_variable)
    <b28>   DW_AT_name        : (indirect string, offset: 0xe5d): addrfams
    <b2c>   DW_AT_decl_file   : 19
    <b2d>   DW_AT_decl_line   : 406
    <b2f>   DW_AT_decl_column : 26
    <b30>   DW_AT_type        : <0xb22>
    <b34>   DW_AT_external    : 1
    <b35>   DW_AT_declaration : 1
 <1><b36>: Abbrev Number: 12 (DW_TAG_variable)
    <b37>   DW_AT_name        : (indirect string, offset: 0xd41): arp_hardware_types
    <b3b>   DW_AT_decl_file   : 19
    <b3c>   DW_AT_decl_line   : 407
    <b3e>   DW_AT_decl_column : 26
    <b3f>   DW_AT_type        : <0xb22>
    <b43>   DW_AT_external    : 1
    <b44>   DW_AT_declaration : 1
 <1><b45>: Abbrev Number: 12 (DW_TAG_variable)
    <b46>   DW_AT_name        : (indirect string, offset: 0xffa): at_flags
    <b4a>   DW_AT_decl_file   : 19
    <b4b>   DW_AT_decl_line   : 408
    <b4d>   DW_AT_decl_column : 26
    <b4e>   DW_AT_type        : <0xb22>
    <b52>   DW_AT_external    : 1
    <b53>   DW_AT_declaration : 1
 <1><b54>: Abbrev Number: 12 (DW_TAG_variable)
    <b55>   DW_AT_name        : (indirect string, offset: 0x4b9): clocknames
    <b59>   DW_AT_decl_file   : 19
    <b5a>   DW_AT_decl_line   : 409
    <b5c>   DW_AT_decl_column : 26
    <b5d>   DW_AT_type        : <0xb22>
    <b61>   DW_AT_external    : 1
    <b62>   DW_AT_declaration : 1
 <1><b63>: Abbrev Number: 12 (DW_TAG_variable)
    <b64>   DW_AT_name        : (indirect string, offset: 0xfbb): dirent_types
    <b68>   DW_AT_decl_file   : 19
    <b69>   DW_AT_decl_line   : 410
    <b6b>   DW_AT_decl_column : 26
    <b6c>   DW_AT_type        : <0xb22>
    <b70>   DW_AT_external    : 1
    <b71>   DW_AT_declaration : 1
 <1><b72>: Abbrev Number: 12 (DW_TAG_variable)
    <b73>   DW_AT_name        : (indirect string, offset: 0x8ee): ethernet_protocols
    <b77>   DW_AT_decl_file   : 19
    <b78>   DW_AT_decl_line   : 411
    <b7a>   DW_AT_decl_column : 26
    <b7b>   DW_AT_type        : <0xb22>
    <b7f>   DW_AT_external    : 1
    <b80>   DW_AT_declaration : 1
 <1><b81>: Abbrev Number: 12 (DW_TAG_variable)
    <b82>   DW_AT_name        : (indirect string, offset: 0x670): inet_protocols
    <b86>   DW_AT_decl_file   : 19
    <b87>   DW_AT_decl_line   : 412
    <b89>   DW_AT_decl_column : 26
    <b8a>   DW_AT_type        : <0xb22>
    <b8e>   DW_AT_external    : 1
    <b8f>   DW_AT_declaration : 1
 <1><b90>: Abbrev Number: 12 (DW_TAG_variable)
    <b91>   DW_AT_name        : (indirect string, offset: 0x2e8): evdev_abs
    <b95>   DW_AT_decl_file   : 19
    <b96>   DW_AT_decl_line   : 413
    <b98>   DW_AT_decl_column : 26
    <b99>   DW_AT_type        : <0xb22>
    <b9d>   DW_AT_external    : 1
    <b9e>   DW_AT_declaration : 1
 <1><b9f>: Abbrev Number: 12 (DW_TAG_variable)
    <ba0>   DW_AT_name        : (indirect string, offset: 0x755): audit_arch
    <ba4>   DW_AT_decl_file   : 19
    <ba5>   DW_AT_decl_line   : 414
    <ba7>   DW_AT_decl_column : 26
    <ba8>   DW_AT_type        : <0xb22>
    <bac>   DW_AT_external    : 1
    <bad>   DW_AT_declaration : 1
 <1><bae>: Abbrev Number: 12 (DW_TAG_variable)
    <baf>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bb3>   DW_AT_decl_file   : 19
    <bb4>   DW_AT_decl_line   : 415
    <bb6>   DW_AT_decl_column : 26
    <bb7>   DW_AT_type        : <0xb22>
    <bbb>   DW_AT_external    : 1
    <bbc>   DW_AT_declaration : 1
 <1><bbd>: Abbrev Number: 12 (DW_TAG_variable)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x49a): iffflags
    <bc2>   DW_AT_decl_file   : 19
    <bc3>   DW_AT_decl_line   : 416
    <bc5>   DW_AT_decl_column : 26
    <bc6>   DW_AT_type        : <0xb22>
    <bca>   DW_AT_external    : 1
    <bcb>   DW_AT_declaration : 1
 <1><bcc>: Abbrev Number: 12 (DW_TAG_variable)
    <bcd>   DW_AT_name        : (indirect string, offset: 0xc35): ip_type_of_services
    <bd1>   DW_AT_decl_file   : 19
    <bd2>   DW_AT_decl_line   : 417
    <bd4>   DW_AT_decl_column : 26
    <bd5>   DW_AT_type        : <0xb22>
    <bd9>   DW_AT_external    : 1
    <bda>   DW_AT_declaration : 1
 <1><bdb>: Abbrev Number: 12 (DW_TAG_variable)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x6e8): ipc_private
    <be0>   DW_AT_decl_file   : 19
    <be1>   DW_AT_decl_line   : 418
    <be3>   DW_AT_decl_column : 26
    <be4>   DW_AT_type        : <0xb22>
    <be8>   DW_AT_external    : 1
    <be9>   DW_AT_declaration : 1
 <1><bea>: Abbrev Number: 12 (DW_TAG_variable)
    <beb>   DW_AT_name        : (indirect string, offset: 0x33f): msg_flags
    <bef>   DW_AT_decl_file   : 19
    <bf0>   DW_AT_decl_line   : 419
    <bf2>   DW_AT_decl_column : 26
    <bf3>   DW_AT_type        : <0xb22>
    <bf7>   DW_AT_external    : 1
    <bf8>   DW_AT_declaration : 1
 <1><bf9>: Abbrev Number: 12 (DW_TAG_variable)
    <bfa>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <bfe>   DW_AT_decl_file   : 19
    <bff>   DW_AT_decl_line   : 420
    <c01>   DW_AT_decl_column : 26
    <c02>   DW_AT_type        : <0xb22>
    <c06>   DW_AT_external    : 1
    <c07>   DW_AT_declaration : 1
 <1><c08>: Abbrev Number: 12 (DW_TAG_variable)
    <c09>   DW_AT_name        : (indirect string, offset: 0xf30): nl_bridge_vlan_flags
    <c0d>   DW_AT_decl_file   : 19
    <c0e>   DW_AT_decl_line   : 421
    <c10>   DW_AT_decl_column : 26
    <c11>   DW_AT_type        : <0xb22>
    <c15>   DW_AT_external    : 1
    <c16>   DW_AT_declaration : 1
 <1><c17>: Abbrev Number: 12 (DW_TAG_variable)
    <c18>   DW_AT_name        : (indirect string, offset: 0xddd): nl_netfilter_msg_types
    <c1c>   DW_AT_decl_file   : 19
    <c1d>   DW_AT_decl_line   : 422
    <c1f>   DW_AT_decl_column : 26
    <c20>   DW_AT_type        : <0xb22>
    <c24>   DW_AT_external    : 1
    <c25>   DW_AT_declaration : 1
 <1><c26>: Abbrev Number: 12 (DW_TAG_variable)
    <c27>   DW_AT_name        : (indirect string, offset: 0x222): nl_route_types
    <c2b>   DW_AT_decl_file   : 19
    <c2c>   DW_AT_decl_line   : 423
    <c2e>   DW_AT_decl_column : 26
    <c2f>   DW_AT_type        : <0xb22>
    <c33>   DW_AT_external    : 1
    <c34>   DW_AT_declaration : 1
 <1><c35>: Abbrev Number: 12 (DW_TAG_variable)
    <c36>   DW_AT_name        : (indirect string, offset: 0xe94): open_access_modes
    <c3a>   DW_AT_decl_file   : 19
    <c3b>   DW_AT_decl_line   : 424
    <c3d>   DW_AT_decl_column : 26
    <c3e>   DW_AT_type        : <0xb22>
    <c42>   DW_AT_external    : 1
    <c43>   DW_AT_declaration : 1
 <1><c44>: Abbrev Number: 12 (DW_TAG_variable)
    <c45>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c49>   DW_AT_decl_file   : 19
    <c4a>   DW_AT_decl_line   : 425
    <c4c>   DW_AT_decl_column : 26
    <c4d>   DW_AT_type        : <0xb22>
    <c51>   DW_AT_external    : 1
    <c52>   DW_AT_declaration : 1
 <1><c53>: Abbrev Number: 12 (DW_TAG_variable)
    <c54>   DW_AT_name        : (indirect string, offset: 0xc66): perf_type_id
    <c58>   DW_AT_decl_file   : 19
    <c59>   DW_AT_decl_line   : 426
    <c5b>   DW_AT_decl_column : 26
    <c5c>   DW_AT_type        : <0xb22>
    <c60>   DW_AT_external    : 1
    <c61>   DW_AT_declaration : 1
 <1><c62>: Abbrev Number: 12 (DW_TAG_variable)
    <c63>   DW_AT_name        : (indirect string, offset: 0xe66): pollflags
    <c67>   DW_AT_decl_file   : 19
    <c68>   DW_AT_decl_line   : 427
    <c6a>   DW_AT_decl_column : 26
    <c6b>   DW_AT_type        : <0xb22>
    <c6f>   DW_AT_external    : 1
    <c70>   DW_AT_declaration : 1
 <1><c71>: Abbrev Number: 12 (DW_TAG_variable)
    <c72>   DW_AT_name        : (indirect string, offset: 0x611): ptrace_cmds
    <c76>   DW_AT_decl_file   : 19
    <c77>   DW_AT_decl_line   : 428
    <c79>   DW_AT_decl_column : 26
    <c7a>   DW_AT_type        : <0xb22>
    <c7e>   DW_AT_external    : 1
    <c7f>   DW_AT_declaration : 1
 <1><c80>: Abbrev Number: 12 (DW_TAG_variable)
    <c81>   DW_AT_name        : (indirect string, offset: 0x830): resource_flags
    <c85>   DW_AT_decl_file   : 19
    <c86>   DW_AT_decl_line   : 429
    <c88>   DW_AT_decl_column : 26
    <c89>   DW_AT_type        : <0xb22>
    <c8d>   DW_AT_external    : 1
    <c8e>   DW_AT_declaration : 1
 <1><c8f>: Abbrev Number: 12 (DW_TAG_variable)
    <c90>   DW_AT_name        : (indirect string, offset: 0x2aa): route_nexthop_flags
    <c94>   DW_AT_decl_file   : 19
    <c95>   DW_AT_decl_line   : 430
    <c97>   DW_AT_decl_column : 26
    <c98>   DW_AT_type        : <0xb22>
    <c9c>   DW_AT_external    : 1
    <c9d>   DW_AT_declaration : 1
 <1><c9e>: Abbrev Number: 12 (DW_TAG_variable)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xebb): routing_protocols
    <ca3>   DW_AT_decl_file   : 19
    <ca4>   DW_AT_decl_line   : 431
    <ca6>   DW_AT_decl_column : 26
    <ca7>   DW_AT_type        : <0xb22>
    <cab>   DW_AT_external    : 1
    <cac>   DW_AT_declaration : 1
 <1><cad>: Abbrev Number: 12 (DW_TAG_variable)
    <cae>   DW_AT_name        : (indirect string, offset: 0x48b): routing_scopes
    <cb2>   DW_AT_decl_file   : 19
    <cb3>   DW_AT_decl_line   : 432
    <cb5>   DW_AT_decl_column : 26
    <cb6>   DW_AT_type        : <0xb22>
    <cba>   DW_AT_external    : 1
    <cbb>   DW_AT_declaration : 1
 <1><cbc>: Abbrev Number: 12 (DW_TAG_variable)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xdcb): routing_table_ids
    <cc1>   DW_AT_decl_file   : 19
    <cc2>   DW_AT_decl_line   : 433
    <cc4>   DW_AT_decl_column : 26
    <cc5>   DW_AT_type        : <0xb22>
    <cc9>   DW_AT_external    : 1
    <cca>   DW_AT_declaration : 1
 <1><ccb>: Abbrev Number: 12 (DW_TAG_variable)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x6b2): routing_types
    <cd0>   DW_AT_decl_file   : 19
    <cd1>   DW_AT_decl_line   : 434
    <cd3>   DW_AT_decl_column : 26
    <cd4>   DW_AT_type        : <0xb22>
    <cd8>   DW_AT_external    : 1
    <cd9>   DW_AT_declaration : 1
 <1><cda>: Abbrev Number: 12 (DW_TAG_variable)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x1c5): rwf_flags
    <cdf>   DW_AT_decl_file   : 19
    <ce0>   DW_AT_decl_line   : 435
    <ce2>   DW_AT_decl_column : 26
    <ce3>   DW_AT_type        : <0xb22>
    <ce7>   DW_AT_external    : 1
    <ce8>   DW_AT_declaration : 1
 <1><ce9>: Abbrev Number: 12 (DW_TAG_variable)
    <cea>   DW_AT_name        : (indirect string, offset: 0x868): seccomp_filter_flags
    <cee>   DW_AT_decl_file   : 19
    <cef>   DW_AT_decl_line   : 436
    <cf1>   DW_AT_decl_column : 26
    <cf2>   DW_AT_type        : <0xb22>
    <cf6>   DW_AT_external    : 1
    <cf7>   DW_AT_declaration : 1
 <1><cf8>: Abbrev Number: 12 (DW_TAG_variable)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x305): seccomp_ret_action
    <cfd>   DW_AT_decl_file   : 19
    <cfe>   DW_AT_decl_line   : 437
    <d00>   DW_AT_decl_column : 26
    <d01>   DW_AT_type        : <0xb22>
    <d05>   DW_AT_external    : 1
    <d06>   DW_AT_declaration : 1
 <1><d07>: Abbrev Number: 12 (DW_TAG_variable)
    <d08>   DW_AT_name        : (indirect string, offset: 0x44b): setns_types
    <d0c>   DW_AT_decl_file   : 19
    <d0d>   DW_AT_decl_line   : 438
    <d0f>   DW_AT_decl_column : 26
    <d10>   DW_AT_type        : <0xb22>
    <d14>   DW_AT_external    : 1
    <d15>   DW_AT_declaration : 1
 <1><d16>: Abbrev Number: 12 (DW_TAG_variable)
    <d17>   DW_AT_name        : (indirect string, offset: 0xe52): sg_io_info
    <d1b>   DW_AT_decl_file   : 19
    <d1c>   DW_AT_decl_line   : 439
    <d1e>   DW_AT_decl_column : 26
    <d1f>   DW_AT_type        : <0xb22>
    <d23>   DW_AT_external    : 1
    <d24>   DW_AT_declaration : 1
 <1><d25>: Abbrev Number: 12 (DW_TAG_variable)
    <d26>   DW_AT_name        : (indirect string, offset: 0xbd3): socketlayers
    <d2a>   DW_AT_decl_file   : 19
    <d2b>   DW_AT_decl_line   : 440
    <d2d>   DW_AT_decl_column : 26
    <d2e>   DW_AT_type        : <0xb22>
    <d32>   DW_AT_external    : 1
    <d33>   DW_AT_declaration : 1
 <1><d34>: Abbrev Number: 12 (DW_TAG_variable)
    <d35>   DW_AT_name        : (indirect string, offset: 0xdb5): socktypes
    <d39>   DW_AT_decl_file   : 19
    <d3a>   DW_AT_decl_line   : 441
    <d3c>   DW_AT_decl_column : 26
    <d3d>   DW_AT_type        : <0xb22>
    <d41>   DW_AT_external    : 1
    <d42>   DW_AT_declaration : 1
 <1><d43>: Abbrev Number: 12 (DW_TAG_variable)
    <d44>   DW_AT_name        : (indirect string, offset: 0xa90): tcp_state_flags
    <d48>   DW_AT_decl_file   : 19
    <d49>   DW_AT_decl_line   : 442
    <d4b>   DW_AT_decl_column : 26
    <d4c>   DW_AT_type        : <0xb22>
    <d50>   DW_AT_external    : 1
    <d51>   DW_AT_declaration : 1
 <1><d52>: Abbrev Number: 12 (DW_TAG_variable)
    <d53>   DW_AT_name        : (indirect string, offset: 0x78a): tcp_states
    <d57>   DW_AT_decl_file   : 19
    <d58>   DW_AT_decl_line   : 443
    <d5a>   DW_AT_decl_column : 26
    <d5b>   DW_AT_type        : <0xb22>
    <d5f>   DW_AT_external    : 1
    <d60>   DW_AT_declaration : 1
 <1><d61>: Abbrev Number: 12 (DW_TAG_variable)
    <d62>   DW_AT_name        : (indirect string, offset: 0x1068): whence_codes
    <d66>   DW_AT_decl_file   : 19
    <d67>   DW_AT_decl_line   : 444
    <d69>   DW_AT_decl_column : 26
    <d6a>   DW_AT_type        : <0xb22>
    <d6e>   DW_AT_external    : 1
    <d6f>   DW_AT_declaration : 1
 <1><d70>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d71>   DW_AT_encoding    : 7	(unsigned)
    <d72>   DW_AT_byte_size   : 4
    <d73>   DW_AT_type        : <0x2b>
    <d77>   DW_AT_decl_file   : 19
    <d78>   DW_AT_decl_line   : 505
    <d7a>   DW_AT_decl_column : 14
    <d7b>   DW_AT_sibling     : <0xd92>
 <2><d7f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d80>   DW_AT_name        : (indirect string, offset: 0x9cd): CFLAG_NONE
    <d84>   DW_AT_const_value : 0
 <2><d85>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d86>   DW_AT_name        : (indirect string, offset: 0x901): CFLAG_ONLY_STATS
    <d8a>   DW_AT_const_value : 1
 <2><d8b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xbe0): CFLAG_BOTH
    <d90>   DW_AT_const_value : 2
 <2><d91>: Abbrev Number: 0
 <1><d92>: Abbrev Number: 28 (DW_TAG_typedef)
    <d93>   DW_AT_name        : (indirect string, offset: 0x111a): cflag_t
    <d97>   DW_AT_decl_file   : 19
    <d98>   DW_AT_decl_line   : 509
    <d9a>   DW_AT_decl_column : 3
    <d9b>   DW_AT_type        : <0xd70>
 <1><d9f>: Abbrev Number: 12 (DW_TAG_variable)
    <da0>   DW_AT_name        : (indirect string, offset: 0xd00): cflag
    <da4>   DW_AT_decl_file   : 19
    <da5>   DW_AT_decl_line   : 510
    <da7>   DW_AT_decl_column : 16
    <da8>   DW_AT_type        : <0xd92>
    <dac>   DW_AT_external    : 1
    <dad>   DW_AT_declaration : 1
 <1><dae>: Abbrev Number: 12 (DW_TAG_variable)
    <daf>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <db3>   DW_AT_decl_file   : 19
    <db4>   DW_AT_decl_line   : 511
    <db6>   DW_AT_decl_column : 13
    <db7>   DW_AT_type        : <0x51e>
    <dbb>   DW_AT_external    : 1
    <dbc>   DW_AT_declaration : 1
 <1><dbd>: Abbrev Number: 12 (DW_TAG_variable)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x7eb): Tflag_scale
    <dc2>   DW_AT_decl_file   : 19
    <dc3>   DW_AT_decl_line   : 512
    <dc5>   DW_AT_decl_column : 12
    <dc6>   DW_AT_type        : <0x64>
    <dca>   DW_AT_external    : 1
    <dcb>   DW_AT_declaration : 1
 <1><dcc>: Abbrev Number: 12 (DW_TAG_variable)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x87d): Tflag_width
    <dd1>   DW_AT_decl_file   : 19
    <dd2>   DW_AT_decl_line   : 513
    <dd4>   DW_AT_decl_column : 12
    <dd5>   DW_AT_type        : <0x64>
    <dd9>   DW_AT_external    : 1
    <dda>   DW_AT_declaration : 1
 <1><ddb>: Abbrev Number: 12 (DW_TAG_variable)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xe44): iflag
    <de0>   DW_AT_decl_file   : 19
    <de1>   DW_AT_decl_line   : 514
    <de3>   DW_AT_decl_column : 13
    <de4>   DW_AT_type        : <0x51e>
    <de8>   DW_AT_external    : 1
    <de9>   DW_AT_declaration : 1
 <1><dea>: Abbrev Number: 12 (DW_TAG_variable)
    <deb>   DW_AT_name        : (indirect string, offset: 0x651): count_wallclock
    <def>   DW_AT_decl_file   : 19
    <df0>   DW_AT_decl_line   : 515
    <df2>   DW_AT_decl_column : 13
    <df3>   DW_AT_type        : <0x51e>
    <df7>   DW_AT_external    : 1
    <df8>   DW_AT_declaration : 1
 <1><df9>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <dfe>   DW_AT_byte_size   : 4
    <dff>   DW_AT_decl_file   : 19
    <e00>   DW_AT_decl_line   : 517
    <e02>   DW_AT_decl_column : 8
    <e03>   DW_AT_sibling     : <0xe18>
 <2><e07>: Abbrev Number: 22 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e0c>   DW_AT_decl_file   : 19
    <e0d>   DW_AT_decl_line   : 518
    <e0f>   DW_AT_decl_column : 14
    <e10>   DW_AT_type        : <0x1d2>
    <e14>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e17>: Abbrev Number: 0
 <1><e18>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e19>   DW_AT_name        : (indirect string, offset: 0x795): path_set
    <e1d>   DW_AT_byte_size   : 12
    <e1e>   DW_AT_decl_file   : 19
    <e1f>   DW_AT_decl_line   : 522
    <e21>   DW_AT_decl_column : 15
    <e22>   DW_AT_sibling     : <0xe57>
 <2><e26>: Abbrev Number: 22 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0x723): paths_selected
    <e2b>   DW_AT_decl_file   : 19
    <e2c>   DW_AT_decl_line   : 523
    <e2e>   DW_AT_decl_column : 24
    <e2f>   DW_AT_type        : <0xe57>
    <e33>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e36>: Abbrev Number: 22 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0x105b): num_selected
    <e3b>   DW_AT_decl_file   : 19
    <e3c>   DW_AT_decl_line   : 524
    <e3e>   DW_AT_decl_column : 9
    <e3f>   DW_AT_type        : <0x122>
    <e43>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e46>: Abbrev Number: 22 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0xb90): size
    <e4b>   DW_AT_decl_file   : 19
    <e4c>   DW_AT_decl_line   : 525
    <e4e>   DW_AT_decl_column : 9
    <e4f>   DW_AT_type        : <0x122>
    <e53>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e56>: Abbrev Number: 0
 <1><e57>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e58>   DW_AT_byte_size   : 4
    <e59>   DW_AT_type        : <0xdf9>
 <1><e5d>: Abbrev Number: 12 (DW_TAG_variable)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x10aa): global_path_set
    <e62>   DW_AT_decl_file   : 19
    <e63>   DW_AT_decl_line   : 526
    <e65>   DW_AT_decl_column : 3
    <e66>   DW_AT_type        : <0xe18>
    <e6a>   DW_AT_external    : 1
    <e6b>   DW_AT_declaration : 1
 <1><e6c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6d>   DW_AT_name        : (indirect string, offset: 0xfa8): xflag_opts
    <e71>   DW_AT_encoding    : 7	(unsigned)
    <e72>   DW_AT_byte_size   : 4
    <e73>   DW_AT_type        : <0x2b>
    <e77>   DW_AT_decl_file   : 19
    <e78>   DW_AT_decl_line   : 528
    <e7a>   DW_AT_decl_column : 6
    <e7b>   DW_AT_sibling     : <0xe9e>
 <2><e7f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e80>   DW_AT_name        : (indirect string, offset: 0xa47): HEXSTR_NONE
    <e84>   DW_AT_const_value : 0
 <2><e85>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e86>   DW_AT_name        : (indirect string, offset: 0xfd3): HEXSTR_NON_ASCII
    <e8a>   DW_AT_const_value : 1
 <2><e8b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x94e): HEXSTR_ALL
    <e90>   DW_AT_const_value : 2
 <2><e91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e92>   DW_AT_name        : (indirect string, offset: 0x691): HEXSTR_NON_ASCII_CHARS
    <e96>   DW_AT_const_value : 3
 <2><e97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e98>   DW_AT_name        : (indirect string, offset: 0x1075): NUM_HEXSTR_OPTS
    <e9c>   DW_AT_const_value : 4
 <2><e9d>: Abbrev Number: 0
 <1><e9e>: Abbrev Number: 12 (DW_TAG_variable)
    <e9f>   DW_AT_name        : (indirect string, offset: 0xe1e): xflag
    <ea3>   DW_AT_decl_file   : 19
    <ea4>   DW_AT_decl_line   : 541
    <ea6>   DW_AT_decl_column : 17
    <ea7>   DW_AT_type        : <0x2b>
    <eab>   DW_AT_external    : 1
    <eac>   DW_AT_declaration : 1
 <1><ead>: Abbrev Number: 12 (DW_TAG_variable)
    <eae>   DW_AT_name        : (indirect string, offset: 0xcbb): followfork
    <eb2>   DW_AT_decl_file   : 19
    <eb3>   DW_AT_decl_line   : 542
    <eb5>   DW_AT_decl_column : 13
    <eb6>   DW_AT_type        : <0x51e>
    <eba>   DW_AT_external    : 1
    <ebb>   DW_AT_declaration : 1
 <1><ebc>: Abbrev Number: 12 (DW_TAG_variable)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x353): output_separately
    <ec1>   DW_AT_decl_file   : 19
    <ec2>   DW_AT_decl_line   : 543
    <ec4>   DW_AT_decl_column : 13
    <ec5>   DW_AT_type        : <0x51e>
    <ec9>   DW_AT_external    : 1
    <eca>   DW_AT_declaration : 1
 <1><ecb>: Abbrev Number: 12 (DW_TAG_variable)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x231): stack_trace_enabled
    <ed0>   DW_AT_decl_file   : 19
    <ed1>   DW_AT_decl_line   : 546
    <ed3>   DW_AT_decl_column : 13
    <ed4>   DW_AT_type        : <0x51e>
    <ed8>   DW_AT_external    : 1
    <ed9>   DW_AT_declaration : 1
 <1><eda>: Abbrev Number: 12 (DW_TAG_variable)
    <edb>   DW_AT_name        : (indirect string, offset: 0x67f): ptrace_setoptions
    <edf>   DW_AT_decl_file   : 19
    <ee0>   DW_AT_decl_line   : 550
    <ee2>   DW_AT_decl_column : 17
    <ee3>   DW_AT_type        : <0x2b>
    <ee7>   DW_AT_external    : 1
    <ee8>   DW_AT_declaration : 1
 <1><ee9>: Abbrev Number: 12 (DW_TAG_variable)
    <eea>   DW_AT_name        : (indirect string, offset: 0xa3c): max_strlen
    <eee>   DW_AT_decl_file   : 19
    <eef>   DW_AT_decl_line   : 551
    <ef1>   DW_AT_decl_column : 17
    <ef2>   DW_AT_type        : <0x2b>
    <ef6>   DW_AT_external    : 1
    <ef7>   DW_AT_declaration : 1
 <1><ef8>: Abbrev Number: 12 (DW_TAG_variable)
    <ef9>   DW_AT_name        : (indirect string, offset: 0xa6a): os_release
    <efd>   DW_AT_decl_file   : 19
    <efe>   DW_AT_decl_line   : 552
    <f00>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0x2b>
    <f05>   DW_AT_external    : 1
    <f06>   DW_AT_declaration : 1
 <1><f07>: Abbrev Number: 12 (DW_TAG_variable)
    <f08>   DW_AT_name        : (indirect string, offset: 0x732): xlat_verbosity
    <f0c>   DW_AT_decl_file   : 19
    <f0d>   DW_AT_decl_line   : 914
    <f0f>   DW_AT_decl_column : 24
    <f10>   DW_AT_type        : <0xa45>
    <f14>   DW_AT_external    : 1
    <f15>   DW_AT_declaration : 1
 <1><f16>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f17>   DW_AT_name        : (indirect string, offset: 0x634): xlat_style_private_flag_bits
    <f1b>   DW_AT_encoding    : 7	(unsigned)
    <f1c>   DW_AT_byte_size   : 4
    <f1d>   DW_AT_type        : <0x2b>
    <f21>   DW_AT_decl_file   : 19
    <f22>   DW_AT_decl_line   : 934
    <f24>   DW_AT_decl_column : 6
    <f25>   DW_AT_sibling     : <0xf42>
 <2><f29>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x2d2): PAF_PRINT_INDICES_BIT
    <f2e>   DW_AT_const_value : 5
 <2><f2f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0xb2a): PAF_ARRAY_TRUNCATED_BIT
    <f34>   DW_AT_const_value : 6
 <2><f35>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x40b): PXF_DEFAULT_STR_BIT
    <f3a>   DW_AT_const_value : 7
 <2><f3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xc9d): SPFF_AUXSTR_MODE_BIT
    <f40>   DW_AT_const_value : 8
 <2><f41>: Abbrev Number: 0
 <1><f42>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f43>   DW_AT_name        : (indirect string, offset: 0xd54): find_xlat_flag_bits
    <f47>   DW_AT_encoding    : 7	(unsigned)
    <f48>   DW_AT_byte_size   : 4
    <f49>   DW_AT_type        : <0x2b>
    <f4d>   DW_AT_decl_file   : 19
    <f4e>   DW_AT_decl_line   : 1438
    <f50>   DW_AT_decl_column : 6
    <f51>   DW_AT_sibling     : <0xf5c>
 <2><f55>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0x98b): FXL_CASE_SENSITIVE_BIT
    <f5a>   DW_AT_const_value : 0
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 12 (DW_TAG_variable)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xa18): printing_tcp
    <f61>   DW_AT_decl_file   : 19
    <f62>   DW_AT_decl_line   : 1684
    <f64>   DW_AT_decl_column : 20
    <f65>   DW_AT_type        : <0x606>
    <f69>   DW_AT_external    : 1
    <f6a>   DW_AT_declaration : 1
 <1><f6b>: Abbrev Number: 12 (DW_TAG_variable)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x5e8): errnoent
    <f70>   DW_AT_decl_file   : 19
    <f71>   DW_AT_decl_line   : 1882
    <f73>   DW_AT_decl_column : 26
    <f74>   DW_AT_type        : <0x452>
    <f78>   DW_AT_external    : 1
    <f79>   DW_AT_declaration : 1
 <1><f7a>: Abbrev Number: 12 (DW_TAG_variable)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x889): signalent
    <f7f>   DW_AT_decl_file   : 19
    <f80>   DW_AT_decl_line   : 1883
    <f82>   DW_AT_decl_column : 26
    <f83>   DW_AT_type        : <0x452>
    <f87>   DW_AT_external    : 1
    <f88>   DW_AT_declaration : 1
 <1><f89>: Abbrev Number: 12 (DW_TAG_variable)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xe8c): nerrnos
    <f8e>   DW_AT_decl_file   : 19
    <f8f>   DW_AT_decl_line   : 1884
    <f91>   DW_AT_decl_column : 27
    <f92>   DW_AT_type        : <0x32>
    <f96>   DW_AT_external    : 1
    <f97>   DW_AT_declaration : 1
 <1><f98>: Abbrev Number: 12 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0x1033): nsignals
    <f9d>   DW_AT_decl_file   : 19
    <f9e>   DW_AT_decl_line   : 1885
    <fa0>   DW_AT_decl_column : 27
    <fa1>   DW_AT_type        : <0x32>
    <fa5>   DW_AT_external    : 1
    <fa6>   DW_AT_declaration : 1
 <1><fa7>: Abbrev Number: 10 (DW_TAG_array_type)
    <fa8>   DW_AT_type        : <0x864>
    <fac>   DW_AT_sibling     : <0xfb2>
 <2><fb0>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb1>: Abbrev Number: 0
 <1><fb2>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb3>   DW_AT_type        : <0xfa7>
 <1><fb7>: Abbrev Number: 12 (DW_TAG_variable)
    <fb8>   DW_AT_name        : (indirect string, offset: 0xd1f): sysent0
    <fbc>   DW_AT_decl_file   : 19
    <fbd>   DW_AT_decl_line   : 1887
    <fbf>   DW_AT_decl_column : 28
    <fc0>   DW_AT_type        : <0xfb2>
    <fc4>   DW_AT_external    : 1
    <fc5>   DW_AT_declaration : 1
 <1><fc6>: Abbrev Number: 10 (DW_TAG_array_type)
    <fc7>   DW_AT_type        : <0x8cb>
    <fcb>   DW_AT_sibling     : <0xfd1>
 <2><fcf>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd0>: Abbrev Number: 0
 <1><fd1>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd2>   DW_AT_type        : <0xfc6>
 <1><fd6>: Abbrev Number: 12 (DW_TAG_variable)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x10a0): ioctlent0
    <fdb>   DW_AT_decl_file   : 19
    <fdc>   DW_AT_decl_line   : 1888
    <fde>   DW_AT_decl_column : 30
    <fdf>   DW_AT_type        : <0xfd1>
    <fe3>   DW_AT_external    : 1
    <fe4>   DW_AT_declaration : 1
 <1><fe5>: Abbrev Number: 12 (DW_TAG_variable)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x479): personality_names
    <fea>   DW_AT_decl_file   : 19
    <feb>   DW_AT_decl_line   : 1890
    <fed>   DW_AT_decl_column : 26
    <fee>   DW_AT_type        : <0x452>
    <ff2>   DW_AT_external    : 1
    <ff3>   DW_AT_declaration : 1
 <1><ff4>: Abbrev Number: 12 (DW_TAG_variable)
    <ff5>   DW_AT_name        : (indirect string, offset: 0x8a9): sysent
    <ff9>   DW_AT_decl_file   : 19
    <ffa>   DW_AT_decl_line   : 1893
    <ffc>   DW_AT_decl_column : 29
    <ffd>   DW_AT_type        : <0x9b0>
    <1001>   DW_AT_external    : 1
    <1002>   DW_AT_declaration : 1
 <1><1003>: Abbrev Number: 12 (DW_TAG_variable)
    <1004>   DW_AT_name        : (indirect string, offset: 0xcb2): ioctlent
    <1008>   DW_AT_decl_file   : 19
    <1009>   DW_AT_decl_line   : 1894
    <100b>   DW_AT_decl_column : 31
    <100c>   DW_AT_type        : <0x1012>
    <1010>   DW_AT_external    : 1
    <1011>   DW_AT_declaration : 1
 <1><1012>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1013>   DW_AT_byte_size   : 4
    <1014>   DW_AT_type        : <0x8cb>
 <1><1018>: Abbrev Number: 12 (DW_TAG_variable)
    <1019>   DW_AT_name        : (indirect string, offset: 0x893): nsyscalls
    <101d>   DW_AT_decl_file   : 19
    <101e>   DW_AT_decl_line   : 1900
    <1020>   DW_AT_decl_column : 17
    <1021>   DW_AT_type        : <0x2b>
    <1025>   DW_AT_external    : 1
    <1026>   DW_AT_declaration : 1
 <1><1027>: Abbrev Number: 12 (DW_TAG_variable)
    <1028>   DW_AT_name        : (indirect string, offset: 0xeb0): nioctlents
    <102c>   DW_AT_decl_file   : 19
    <102d>   DW_AT_decl_line   : 1901
    <102f>   DW_AT_decl_column : 17
    <1030>   DW_AT_type        : <0x2b>
    <1034>   DW_AT_external    : 1
    <1035>   DW_AT_declaration : 1
 <1><1036>: Abbrev Number: 10 (DW_TAG_array_type)
    <1037>   DW_AT_type        : <0x32>
    <103b>   DW_AT_sibling     : <0x1046>
 <2><103f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1040>   DW_AT_type        : <0x2b>
    <1044>   DW_AT_upper_bound : 2
 <2><1045>: Abbrev Number: 0
 <1><1046>: Abbrev Number: 3 (DW_TAG_const_type)
    <1047>   DW_AT_type        : <0x1036>
 <1><104b>: Abbrev Number: 12 (DW_TAG_variable)
    <104c>   DW_AT_name        : (indirect string, offset: 0xf10): nsyscall_vec
    <1050>   DW_AT_decl_file   : 19
    <1051>   DW_AT_decl_line   : 1903
    <1053>   DW_AT_decl_column : 27
    <1054>   DW_AT_type        : <0x1046>
    <1058>   DW_AT_external    : 1
    <1059>   DW_AT_declaration : 1
 <1><105a>: Abbrev Number: 10 (DW_TAG_array_type)
    <105b>   DW_AT_type        : <0x9b6>
    <105f>   DW_AT_sibling     : <0x106a>
 <2><1063>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1064>   DW_AT_type        : <0x2b>
    <1068>   DW_AT_upper_bound : 2
 <2><1069>: Abbrev Number: 0
 <1><106a>: Abbrev Number: 3 (DW_TAG_const_type)
    <106b>   DW_AT_type        : <0x105a>
 <1><106f>: Abbrev Number: 12 (DW_TAG_variable)
    <1070>   DW_AT_name        : (indirect string, offset: 0x7d8): sysent_vec
    <1074>   DW_AT_decl_file   : 19
    <1075>   DW_AT_decl_line   : 1904
    <1077>   DW_AT_decl_column : 35
    <1078>   DW_AT_type        : <0x106a>
    <107c>   DW_AT_external    : 1
    <107d>   DW_AT_declaration : 1
 <1><107e>: Abbrev Number: 12 (DW_TAG_variable)
    <107f>   DW_AT_name        : (indirect string, offset: 0x3ac): inject_vec
    <1083>   DW_AT_decl_file   : 19
    <1084>   DW_AT_decl_line   : 1905
    <1086>   DW_AT_decl_column : 28
    <1087>   DW_AT_type        : <0x9bb>
    <108b>   DW_AT_external    : 1
    <108c>   DW_AT_declaration : 1
 <1><108d>: Abbrev Number: 29 (DW_TAG_structure_type)
    <108e>   DW_AT_name        : (indirect string, offset: 0xda8): audit_arch_t
    <1092>   DW_AT_byte_size   : 8
    <1093>   DW_AT_decl_file   : 19
    <1094>   DW_AT_decl_line   : 1907
    <1096>   DW_AT_decl_column : 8
    <1097>   DW_AT_sibling     : <0x10bc>
 <2><109b>: Abbrev Number: 22 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0x626): arch
    <10a0>   DW_AT_decl_file   : 19
    <10a1>   DW_AT_decl_line   : 1908
    <10a3>   DW_AT_decl_column : 15
    <10a4>   DW_AT_type        : <0x2b>
    <10a8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ab>: Abbrev Number: 22 (DW_TAG_member)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x9fe): flag
    <10b0>   DW_AT_decl_file   : 19
    <10b1>   DW_AT_decl_line   : 1909
    <10b3>   DW_AT_decl_column : 15
    <10b4>   DW_AT_type        : <0x2b>
    <10b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10bb>: Abbrev Number: 0
 <1><10bc>: Abbrev Number: 3 (DW_TAG_const_type)
    <10bd>   DW_AT_type        : <0x108d>
 <1><10c1>: Abbrev Number: 10 (DW_TAG_array_type)
    <10c2>   DW_AT_type        : <0x10bc>
    <10c6>   DW_AT_sibling     : <0x10d1>
 <2><10ca>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10cb>   DW_AT_type        : <0x2b>
    <10cf>   DW_AT_upper_bound : 2
 <2><10d0>: Abbrev Number: 0
 <1><10d1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d2>   DW_AT_type        : <0x10c1>
 <1><10d6>: Abbrev Number: 12 (DW_TAG_variable)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x97c): audit_arch_vec
    <10db>   DW_AT_decl_file   : 19
    <10dc>   DW_AT_decl_line   : 1912
    <10de>   DW_AT_decl_column : 34
    <10df>   DW_AT_type        : <0x10d1>
    <10e3>   DW_AT_external    : 1
    <10e4>   DW_AT_declaration : 1
 <1><10e5>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e6>   DW_AT_byte_size   : 180
    <10e7>   DW_AT_decl_file   : 21
    <10e8>   DW_AT_decl_line   : 2
    <10e9>   DW_AT_decl_column : 9
    <10ea>   DW_AT_sibling     : <0x139f>
 <2><10ee>: Abbrev Number: 9 (DW_TAG_member)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x1dd): block_ioctl
    <10f3>   DW_AT_decl_file   : 21
    <10f4>   DW_AT_decl_line   : 3
    <10f5>   DW_AT_decl_column : 8
    <10f6>   DW_AT_type        : <0x13b9>
    <10fa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10fd>: Abbrev Number: 9 (DW_TAG_member)
    <10fe>   DW_AT_name        : (indirect string, offset: 0xac9): btrfs_ioctl
    <1102>   DW_AT_decl_file   : 21
    <1103>   DW_AT_decl_line   : 6
    <1104>   DW_AT_decl_column : 8
    <1105>   DW_AT_type        : <0x13b9>
    <1109>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><110c>: Abbrev Number: 9 (DW_TAG_member)
    <110d>   DW_AT_name        : (indirect string, offset: 0x76b): evdev_write_ioctl_mpers
    <1111>   DW_AT_decl_file   : 21
    <1112>   DW_AT_decl_line   : 9
    <1113>   DW_AT_decl_column : 8
    <1114>   DW_AT_type        : <0x13b9>
    <1118>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><111b>: Abbrev Number: 9 (DW_TAG_member)
    <111c>   DW_AT_name        : (indirect string, offset: 0x741): get_sock_fprog_size
    <1120>   DW_AT_decl_file   : 21
    <1121>   DW_AT_decl_line   : 12
    <1122>   DW_AT_decl_column : 17
    <1123>   DW_AT_type        : <0x13c5>
    <1127>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><112a>: Abbrev Number: 9 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0x1ac): fetch_bpf_fprog
    <112f>   DW_AT_decl_file   : 21
    <1130>   DW_AT_decl_line   : 15
    <1131>   DW_AT_decl_column : 10
    <1132>   DW_AT_type        : <0x13e5>
    <1136>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1139>: Abbrev Number: 9 (DW_TAG_member)
    <113a>   DW_AT_name        : (indirect string, offset: 0x969): fetch_struct_flock
    <113e>   DW_AT_decl_file   : 21
    <113f>   DW_AT_decl_line   : 18
    <1140>   DW_AT_decl_column : 10
    <1141>   DW_AT_type        : <0x13e5>
    <1145>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1148>: Abbrev Number: 9 (DW_TAG_member)
    <1149>   DW_AT_name        : (indirect string, offset: 0xcc6): fetch_struct_flock64
    <114d>   DW_AT_decl_file   : 21
    <114e>   DW_AT_decl_line   : 21
    <114f>   DW_AT_decl_column : 10
    <1150>   DW_AT_type        : <0x13e5>
