Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1688 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4c0): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1bd): mpers-mx32/struct_sigset_addr_size.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe3c): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x395): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfa2): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x944): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x338): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x24e): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xd8e): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x464): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x84a): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe8d): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x87a): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x749): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb1f): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb55): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xca1): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc16): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x3e1): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x42d): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x344): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xb40): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xf35): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xd9e): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2b4): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe2b): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x1078): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x124): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xac8): timespec
    <179>   DW_AT_byte_size   : 16
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x108d): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xba>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xdcf): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xcd>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 16
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xa8a): long double
 <1><1a7>: Abbrev Number: 13 (DW_TAG_variable)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x26b): __environ
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 543
    <1af>   DW_AT_decl_column : 15
    <1b0>   DW_AT_type        : <0x1b6>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1b7>   DW_AT_byte_size   : 4
    <1b8>   DW_AT_type        : <0xd9>
 <1><1bc>: Abbrev Number: 13 (DW_TAG_variable)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x38d): environ
    <1c1>   DW_AT_decl_file   : 7
    <1c2>   DW_AT_decl_line   : 545
    <1c4>   DW_AT_decl_column : 15
    <1c5>   DW_AT_type        : <0x1b6>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 14 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xf8c): optarg
    <1d0>   DW_AT_decl_file   : 8
    <1d1>   DW_AT_decl_line   : 36
    <1d2>   DW_AT_decl_column : 14
    <1d3>   DW_AT_type        : <0xd9>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 14 (DW_TAG_variable)
    <1da>   DW_AT_name        : (indirect string, offset: 0x71c): optind
    <1de>   DW_AT_decl_file   : 8
    <1df>   DW_AT_decl_line   : 50
    <1e0>   DW_AT_decl_column : 12
    <1e1>   DW_AT_type        : <0x64>
    <1e5>   DW_AT_external    : 1
    <1e6>   DW_AT_declaration : 1
 <1><1e7>: Abbrev Number: 14 (DW_TAG_variable)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xc05): opterr
    <1ec>   DW_AT_decl_file   : 8
    <1ed>   DW_AT_decl_line   : 55
    <1ee>   DW_AT_decl_column : 12
    <1ef>   DW_AT_type        : <0x64>
    <1f3>   DW_AT_external    : 1
    <1f4>   DW_AT_declaration : 1
 <1><1f5>: Abbrev Number: 14 (DW_TAG_variable)
    <1f6>   DW_AT_name        : (indirect string, offset: 0xb05): optopt
    <1fa>   DW_AT_decl_file   : 8
    <1fb>   DW_AT_decl_line   : 59
    <1fc>   DW_AT_decl_column : 12
    <1fd>   DW_AT_type        : <0x64>
    <201>   DW_AT_external    : 1
    <202>   DW_AT_declaration : 1
 <1><203>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <204>   DW_AT_byte_size   : 4
    <205>   DW_AT_type        : <0xe6>
 <1><209>: Abbrev Number: 3 (DW_TAG_const_type)
    <20a>   DW_AT_type        : <0x203>
 <1><20e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <20f>   DW_AT_byte_size   : 4
    <210>   DW_AT_type        : <0x214>
 <1><214>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><215>: Abbrev Number: 12 (DW_TAG_structure_type)
    <216>   DW_AT_name        : (indirect string, offset: 0x34c): _IO_FILE
    <21a>   DW_AT_byte_size   : 152
    <21b>   DW_AT_decl_file   : 9
    <21c>   DW_AT_decl_line   : 49
    <21d>   DW_AT_decl_column : 8
    <21e>   DW_AT_sibling     : <0x3d6>
 <2><222>: Abbrev Number: 9 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x9d7): _flags
    <227>   DW_AT_decl_file   : 9
    <228>   DW_AT_decl_line   : 51
    <229>   DW_AT_decl_column : 7
    <22a>   DW_AT_type        : <0x64>
    <22e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><231>: Abbrev Number: 9 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x4b3): _IO_read_ptr
    <236>   DW_AT_decl_file   : 9
    <237>   DW_AT_decl_line   : 54
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0xd9>
    <23d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><240>: Abbrev Number: 9 (DW_TAG_member)
    <241>   DW_AT_name        : (indirect string, offset: 0xee2): _IO_read_end
    <245>   DW_AT_decl_file   : 9
    <246>   DW_AT_decl_line   : 55
    <247>   DW_AT_decl_column : 9
    <248>   DW_AT_type        : <0xd9>
    <24c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><24f>: Abbrev Number: 9 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x785): _IO_read_base
    <254>   DW_AT_decl_file   : 9
    <255>   DW_AT_decl_line   : 56
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0xd9>
    <25b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><25e>: Abbrev Number: 9 (DW_TAG_member)
    <25f>   DW_AT_name        : (indirect string, offset: 0x9b8): _IO_write_base
    <263>   DW_AT_decl_file   : 9
    <264>   DW_AT_decl_line   : 57
    <265>   DW_AT_decl_column : 9
    <266>   DW_AT_type        : <0xd9>
    <26a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><26d>: Abbrev Number: 9 (DW_TAG_member)
    <26e>   DW_AT_name        : (indirect string, offset: 0xfdb): _IO_write_ptr
    <272>   DW_AT_decl_file   : 9
    <273>   DW_AT_decl_line   : 58
    <274>   DW_AT_decl_column : 9
    <275>   DW_AT_type        : <0xd9>
    <279>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><27c>: Abbrev Number: 9 (DW_TAG_member)
    <27d>   DW_AT_name        : (indirect string, offset: 0x8bc): _IO_write_end
    <281>   DW_AT_decl_file   : 9
    <282>   DW_AT_decl_line   : 59
    <283>   DW_AT_decl_column : 9
    <284>   DW_AT_type        : <0xd9>
    <288>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><28b>: Abbrev Number: 9 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x92d): _IO_buf_base
    <290>   DW_AT_decl_file   : 9
    <291>   DW_AT_decl_line   : 60
    <292>   DW_AT_decl_column : 9
    <293>   DW_AT_type        : <0xd9>
    <297>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><29a>: Abbrev Number: 9 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0xd39): _IO_buf_end
    <29f>   DW_AT_decl_file   : 9
    <2a0>   DW_AT_decl_line   : 61
    <2a1>   DW_AT_decl_column : 9
    <2a2>   DW_AT_type        : <0xd9>
    <2a6>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2a9>: Abbrev Number: 9 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x1af): _IO_save_base
    <2ae>   DW_AT_decl_file   : 9
    <2af>   DW_AT_decl_line   : 64
    <2b0>   DW_AT_decl_column : 9
    <2b1>   DW_AT_type        : <0xd9>
    <2b5>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2b8>: Abbrev Number: 9 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0xc68): _IO_backup_base
    <2bd>   DW_AT_decl_file   : 9
    <2be>   DW_AT_decl_line   : 65
    <2bf>   DW_AT_decl_column : 9
    <2c0>   DW_AT_type        : <0xd9>
    <2c4>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2c7>: Abbrev Number: 9 (DW_TAG_member)
    <2c8>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2cc>   DW_AT_decl_file   : 9
    <2cd>   DW_AT_decl_line   : 66
    <2ce>   DW_AT_decl_column : 9
    <2cf>   DW_AT_type        : <0xd9>
    <2d3>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2d6>: Abbrev Number: 9 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x5e1): _markers
    <2db>   DW_AT_decl_file   : 9
    <2dc>   DW_AT_decl_line   : 68
    <2dd>   DW_AT_decl_column : 22
    <2de>   DW_AT_type        : <0x3f0>
    <2e2>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2e5>: Abbrev Number: 9 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2ea>   DW_AT_decl_file   : 9
    <2eb>   DW_AT_decl_line   : 70
    <2ec>   DW_AT_decl_column : 20
    <2ed>   DW_AT_type        : <0x3f6>
    <2f1>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2f4>: Abbrev Number: 9 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0xf5b): _fileno
    <2f9>   DW_AT_decl_file   : 9
    <2fa>   DW_AT_decl_line   : 72
    <2fb>   DW_AT_decl_column : 7
    <2fc>   DW_AT_type        : <0x64>
    <300>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><303>: Abbrev Number: 9 (DW_TAG_member)
    <304>   DW_AT_name        : (indirect string, offset: 0x771): _flags2
    <308>   DW_AT_decl_file   : 9
    <309>   DW_AT_decl_line   : 73
    <30a>   DW_AT_decl_column : 7
    <30b>   DW_AT_type        : <0x64>
    <30f>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><312>: Abbrev Number: 9 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0x7ea): _old_offset
    <317>   DW_AT_decl_file   : 9
    <318>   DW_AT_decl_line   : 74
    <319>   DW_AT_decl_column : 11
    <31a>   DW_AT_type        : <0xa2>
    <31e>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><321>: Abbrev Number: 9 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x239): _cur_column
    <326>   DW_AT_decl_file   : 9
    <327>   DW_AT_decl_line   : 77
    <328>   DW_AT_decl_column : 18
    <329>   DW_AT_type        : <0x24>
    <32d>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><330>: Abbrev Number: 9 (DW_TAG_member)
    <331>   DW_AT_name        : (indirect string, offset: 0xdf5): _vtable_offset
    <335>   DW_AT_decl_file   : 9
    <336>   DW_AT_decl_line   : 78
    <337>   DW_AT_decl_column : 15
    <338>   DW_AT_type        : <0x3e>
    <33c>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><33f>: Abbrev Number: 9 (DW_TAG_member)
    <340>   DW_AT_name        : (indirect string, offset: 0xc78): _shortbuf
    <344>   DW_AT_decl_file   : 9
    <345>   DW_AT_decl_line   : 79
    <346>   DW_AT_decl_column : 8
    <347>   DW_AT_type        : <0x3fc>
    <34b>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><34e>: Abbrev Number: 9 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x15f): _lock
    <353>   DW_AT_decl_file   : 9
    <354>   DW_AT_decl_line   : 81
    <355>   DW_AT_decl_column : 15
    <356>   DW_AT_type        : <0x40c>
    <35a>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><35d>: Abbrev Number: 9 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0x6b4): _offset
    <362>   DW_AT_decl_file   : 9
    <363>   DW_AT_decl_line   : 89
    <364>   DW_AT_decl_column : 13
    <365>   DW_AT_type        : <0xae>
    <369>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><36c>: Abbrev Number: 9 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xa17): _codecvt
    <371>   DW_AT_decl_file   : 9
    <372>   DW_AT_decl_line   : 91
    <373>   DW_AT_decl_column : 23
    <374>   DW_AT_type        : <0x418>
    <378>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><37b>: Abbrev Number: 9 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0xf70): _wide_data
    <380>   DW_AT_decl_file   : 9
    <381>   DW_AT_decl_line   : 92
    <382>   DW_AT_decl_column : 25
    <383>   DW_AT_type        : <0x424>
    <387>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><38a>: Abbrev Number: 9 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x3b1): _freeres_list
    <38f>   DW_AT_decl_file   : 9
    <390>   DW_AT_decl_line   : 93
    <391>   DW_AT_decl_column : 20
    <392>   DW_AT_type        : <0x3f6>
    <396>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><399>: Abbrev Number: 9 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0xbdb): _freeres_buf
    <39e>   DW_AT_decl_file   : 9
    <39f>   DW_AT_decl_line   : 94
    <3a0>   DW_AT_decl_column : 9
    <3a1>   DW_AT_type        : <0xc6>
    <3a5>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3a8>: Abbrev Number: 9 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x98a): __pad5
    <3ad>   DW_AT_decl_file   : 9
    <3ae>   DW_AT_decl_line   : 95
    <3af>   DW_AT_decl_column : 10
    <3b0>   DW_AT_type        : <0x122>
    <3b4>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3b7>: Abbrev Number: 9 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x9fb): _mode
    <3bc>   DW_AT_decl_file   : 9
    <3bd>   DW_AT_decl_line   : 96
    <3be>   DW_AT_decl_column : 7
    <3bf>   DW_AT_type        : <0x64>
    <3c3>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3c6>: Abbrev Number: 9 (DW_TAG_member)
    <3c7>   DW_AT_name        : (indirect string, offset: 0x79f): _unused2
    <3cb>   DW_AT_decl_file   : 9
    <3cc>   DW_AT_decl_line   : 98
    <3cd>   DW_AT_decl_column : 8
    <3ce>   DW_AT_type        : <0x42a>
    <3d2>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3d5>: Abbrev Number: 0
 <1><3d6>: Abbrev Number: 4 (DW_TAG_typedef)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xaaa): FILE
    <3db>   DW_AT_decl_file   : 10
    <3dc>   DW_AT_decl_line   : 7
    <3dd>   DW_AT_decl_column : 25
    <3de>   DW_AT_type        : <0x215>
 <1><3e2>: Abbrev Number: 16 (DW_TAG_typedef)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x459): _IO_lock_t
    <3e7>   DW_AT_decl_file   : 9
    <3e8>   DW_AT_decl_line   : 43
    <3e9>   DW_AT_decl_column : 14
 <1><3ea>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x2f6): _IO_marker
    <3ef>   DW_AT_declaration : 1
 <1><3f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x3ea>
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x215>
 <1><3fc>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fd>   DW_AT_type        : <0xdf>
    <401>   DW_AT_sibling     : <0x40c>
 <2><405>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <406>   DW_AT_type        : <0x2b>
    <40a>   DW_AT_upper_bound : 0
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40d>   DW_AT_byte_size   : 4
    <40e>   DW_AT_type        : <0x3e2>
 <1><412>: Abbrev Number: 17 (DW_TAG_structure_type)
    <413>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <417>   DW_AT_declaration : 1
 <1><418>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <419>   DW_AT_byte_size   : 4
    <41a>   DW_AT_type        : <0x412>
 <1><41e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <41f>   DW_AT_name        : (indirect string, offset: 0x360): _IO_wide_data
    <423>   DW_AT_declaration : 1
 <1><424>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <425>   DW_AT_byte_size   : 4
    <426>   DW_AT_type        : <0x41e>
 <1><42a>: Abbrev Number: 10 (DW_TAG_array_type)
    <42b>   DW_AT_type        : <0xdf>
    <42f>   DW_AT_sibling     : <0x43a>
 <2><433>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <434>   DW_AT_type        : <0x2b>
    <438>   DW_AT_upper_bound : 39
 <2><439>: Abbrev Number: 0
 <1><43a>: Abbrev Number: 14 (DW_TAG_variable)
    <43b>   DW_AT_name        : (indirect string, offset: 0x598): stdin
    <43f>   DW_AT_decl_file   : 11
    <440>   DW_AT_decl_line   : 137
    <441>   DW_AT_decl_column : 14
    <442>   DW_AT_type        : <0x448>
    <446>   DW_AT_external    : 1
    <447>   DW_AT_declaration : 1
 <1><448>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <449>   DW_AT_byte_size   : 4
    <44a>   DW_AT_type        : <0x3d6>
 <1><44e>: Abbrev Number: 14 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0xfb5): stdout
    <453>   DW_AT_decl_file   : 11
    <454>   DW_AT_decl_line   : 138
    <455>   DW_AT_decl_column : 14
    <456>   DW_AT_type        : <0x448>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 14 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0xd87): stderr
    <461>   DW_AT_decl_file   : 11
    <462>   DW_AT_decl_line   : 139
    <463>   DW_AT_decl_column : 14
    <464>   DW_AT_type        : <0x448>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 14 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0x245): sys_nerr
    <46f>   DW_AT_decl_file   : 12
    <470>   DW_AT_decl_line   : 26
    <471>   DW_AT_decl_column : 12
    <472>   DW_AT_type        : <0x64>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 10 (DW_TAG_array_type)
    <479>   DW_AT_type        : <0x209>
    <47d>   DW_AT_sibling     : <0x483>
 <2><481>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><482>: Abbrev Number: 0
 <1><483>: Abbrev Number: 3 (DW_TAG_const_type)
    <484>   DW_AT_type        : <0x478>
 <1><488>: Abbrev Number: 14 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x5a7): sys_errlist
    <48d>   DW_AT_decl_file   : 12
    <48e>   DW_AT_decl_line   : 27
    <48f>   DW_AT_decl_column : 26
    <490>   DW_AT_type        : <0x483>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 14 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0x258): _sys_nerr
    <49b>   DW_AT_decl_file   : 12
    <49c>   DW_AT_decl_line   : 30
    <49d>   DW_AT_decl_column : 12
    <49e>   DW_AT_type        : <0x64>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 14 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe04): _sys_errlist
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 31
    <4ab>   DW_AT_decl_column : 26
    <4ac>   DW_AT_type        : <0x483>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 14 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x68d): program_invocation_name
    <4b7>   DW_AT_decl_file   : 13
    <4b8>   DW_AT_decl_line   : 45
    <4b9>   DW_AT_decl_column : 14
    <4ba>   DW_AT_type        : <0xd9>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 14 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0xb80): program_invocation_short_name
    <4c5>   DW_AT_decl_file   : 13
    <4c6>   DW_AT_decl_line   : 46
    <4c7>   DW_AT_decl_column : 14
    <4c8>   DW_AT_type        : <0xd9>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 10 (DW_TAG_array_type)
    <4cf>   DW_AT_type        : <0xd9>
    <4d3>   DW_AT_sibling     : <0x4de>
 <2><4d7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4d8>   DW_AT_type        : <0x2b>
    <4dc>   DW_AT_upper_bound : 1
 <2><4dd>: Abbrev Number: 0
 <1><4de>: Abbrev Number: 14 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x19c): __tzname
    <4e3>   DW_AT_decl_file   : 14
    <4e4>   DW_AT_decl_line   : 159
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4ce>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 14 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0xe74): __daylight
    <4f1>   DW_AT_decl_file   : 14
    <4f2>   DW_AT_decl_line   : 160
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 14 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x355): __timezone
    <4ff>   DW_AT_decl_file   : 14
    <500>   DW_AT_decl_line   : 161
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0x11b>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 14 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0x983): tzname
    <50d>   DW_AT_decl_file   : 14
    <50e>   DW_AT_decl_line   : 166
    <50f>   DW_AT_decl_column : 14
    <510>   DW_AT_type        : <0x4ce>
    <514>   DW_AT_external    : 1
    <515>   DW_AT_declaration : 1
 <1><516>: Abbrev Number: 14 (DW_TAG_variable)
    <517>   DW_AT_name        : (indirect string, offset: 0x1025): daylight
    <51b>   DW_AT_decl_file   : 14
    <51c>   DW_AT_decl_line   : 174
    <51d>   DW_AT_decl_column : 12
    <51e>   DW_AT_type        : <0x64>
    <522>   DW_AT_external    : 1
    <523>   DW_AT_declaration : 1
 <1><524>: Abbrev Number: 14 (DW_TAG_variable)
    <525>   DW_AT_name        : (indirect string, offset: 0x49e): timezone
    <529>   DW_AT_decl_file   : 14
    <52a>   DW_AT_decl_line   : 175
    <52b>   DW_AT_decl_column : 17
    <52c>   DW_AT_type        : <0x11b>
    <530>   DW_AT_external    : 1
    <531>   DW_AT_declaration : 1
 <1><532>: Abbrev Number: 13 (DW_TAG_variable)
    <533>   DW_AT_name        : (indirect string, offset: 0xf09): getdate_err
    <537>   DW_AT_decl_file   : 14
    <538>   DW_AT_decl_line   : 274
    <53a>   DW_AT_decl_column : 12
    <53b>   DW_AT_type        : <0x64>
    <53f>   DW_AT_external    : 1
    <540>   DW_AT_declaration : 1
 <1><541>: Abbrev Number: 14 (DW_TAG_variable)
    <542>   DW_AT_name        : (indirect string, offset: 0x996): debug_flag
    <546>   DW_AT_decl_file   : 15
    <547>   DW_AT_decl_line   : 20
    <548>   DW_AT_decl_column : 13
    <549>   DW_AT_type        : <0x54f>
    <54d>   DW_AT_external    : 1
    <54e>   DW_AT_declaration : 1
 <1><54f>: Abbrev Number: 2 (DW_TAG_base_type)
    <550>   DW_AT_byte_size   : 1
    <551>   DW_AT_encoding    : 2	(boolean)
    <552>   DW_AT_name        : (indirect string, offset: 0x3f3): _Bool
 <1><556>: Abbrev Number: 3 (DW_TAG_const_type)
    <557>   DW_AT_type        : <0x54f>
 <1><55b>: Abbrev Number: 4 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xa5b): __kernel_long_t
    <560>   DW_AT_decl_file   : 16
    <561>   DW_AT_decl_line   : 14
    <562>   DW_AT_decl_column : 19
    <563>   DW_AT_type        : <0x88>
 <1><567>: Abbrev Number: 4 (DW_TAG_typedef)
    <568>   DW_AT_name        : (indirect string, offset: 0x587): __kernel_ulong_t
    <56c>   DW_AT_decl_file   : 16
    <56d>   DW_AT_decl_line   : 15
    <56e>   DW_AT_decl_column : 28
    <56f>   DW_AT_type        : <0x9b>
 <1><573>: Abbrev Number: 4 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x3bf): kernel_long_t
    <578>   DW_AT_decl_file   : 17
    <579>   DW_AT_decl_line   : 16
    <57a>   DW_AT_decl_column : 25
    <57b>   DW_AT_type        : <0x55b>
 <1><57f>: Abbrev Number: 4 (DW_TAG_typedef)
    <580>   DW_AT_name        : (indirect string, offset: 0x86b): kernel_ulong_t
    <584>   DW_AT_decl_file   : 17
    <585>   DW_AT_decl_line   : 17
    <586>   DW_AT_decl_column : 26
    <587>   DW_AT_type        : <0x567>
 <1><58b>: Abbrev Number: 3 (DW_TAG_const_type)
    <58c>   DW_AT_type        : <0x57f>
 <1><590>: Abbrev Number: 12 (DW_TAG_structure_type)
    <591>   DW_AT_name        : (indirect string, offset: 0xb9e): list_item
    <595>   DW_AT_byte_size   : 8
    <596>   DW_AT_decl_file   : 18
    <597>   DW_AT_decl_line   : 92
    <598>   DW_AT_decl_column : 8
    <599>   DW_AT_sibling     : <0x5bc>
 <2><59d>: Abbrev Number: 9 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x1088): prev
    <5a2>   DW_AT_decl_file   : 18
    <5a3>   DW_AT_decl_line   : 93
    <5a4>   DW_AT_decl_column : 20
    <5a5>   DW_AT_type        : <0x5bc>
    <5a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5ac>: Abbrev Number: 9 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xa6b): next
    <5b1>   DW_AT_decl_file   : 18
    <5b2>   DW_AT_decl_line   : 94
    <5b3>   DW_AT_decl_column : 20
    <5b4>   DW_AT_type        : <0x5bc>
    <5b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5bb>: Abbrev Number: 0
 <1><5bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5bd>   DW_AT_byte_size   : 4
    <5be>   DW_AT_type        : <0x590>
 <1><5c2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x837): sysent
    <5c7>   DW_AT_byte_size   : 20
    <5c8>   DW_AT_decl_file   : 19
    <5c9>   DW_AT_decl_line   : 13
    <5ca>   DW_AT_decl_column : 16
    <5cb>   DW_AT_sibling     : <0x61b>
 <2><5cf>: Abbrev Number: 9 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0xfcc): nargs
    <5d4>   DW_AT_decl_file   : 19
    <5d5>   DW_AT_decl_line   : 14
    <5d6>   DW_AT_decl_column : 11
    <5d7>   DW_AT_type        : <0x2b>
    <5db>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5de>: Abbrev Number: 9 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x93a): sys_flags
    <5e3>   DW_AT_decl_file   : 19
    <5e4>   DW_AT_decl_line   : 15
    <5e5>   DW_AT_decl_column : 6
    <5e6>   DW_AT_type        : <0x64>
    <5ea>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5ed>: Abbrev Number: 19 (DW_TAG_member)
    <5ee>   DW_AT_name        : sen
    <5f2>   DW_AT_decl_file   : 19
    <5f3>   DW_AT_decl_line   : 16
    <5f4>   DW_AT_decl_column : 6
    <5f5>   DW_AT_type        : <0x64>
    <5f9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5fc>: Abbrev Number: 9 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x2ed): sys_func
    <601>   DW_AT_decl_file   : 19
    <602>   DW_AT_decl_line   : 17
    <603>   DW_AT_decl_column : 8
    <604>   DW_AT_type        : <0x888>
    <608>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><60b>: Abbrev Number: 9 (DW_TAG_member)
    <60c>   DW_AT_name        : (indirect string, offset: 0x262): sys_name
    <610>   DW_AT_decl_file   : 19
    <611>   DW_AT_decl_line   : 18
    <612>   DW_AT_decl_column : 14
    <613>   DW_AT_type        : <0x203>
    <617>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <61c>   DW_AT_prototyped  : 1
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_sibling     : <0x62b>
 <2><625>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <626>   DW_AT_type        : <0x62b>
 <2><62a>: Abbrev Number: 0
 <1><62b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <62c>   DW_AT_byte_size   : 4
    <62d>   DW_AT_type        : <0x636>
 <1><631>: Abbrev Number: 3 (DW_TAG_const_type)
    <632>   DW_AT_type        : <0x62b>
 <1><636>: Abbrev Number: 22 (DW_TAG_structure_type)
    <637>   DW_AT_name        : tcb
    <63b>   DW_AT_byte_size   : 288
    <63d>   DW_AT_decl_file   : 20
    <63e>   DW_AT_decl_line   : 262
    <640>   DW_AT_decl_column : 8
    <641>   DW_AT_sibling     : <0x888>
 <2><645>: Abbrev Number: 23 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0x4ad): flags
    <64a>   DW_AT_decl_file   : 20
    <64b>   DW_AT_decl_line   : 263
    <64d>   DW_AT_decl_column : 6
    <64e>   DW_AT_type        : <0x64>
    <652>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><655>: Abbrev Number: 24 (DW_TAG_member)
    <656>   DW_AT_name        : pid
    <65a>   DW_AT_decl_file   : 20
    <65b>   DW_AT_decl_line   : 264
    <65d>   DW_AT_decl_column : 6
    <65e>   DW_AT_type        : <0x64>
    <662>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><665>: Abbrev Number: 23 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <66a>   DW_AT_decl_file   : 20
    <66b>   DW_AT_decl_line   : 265
    <66d>   DW_AT_decl_column : 6
    <66e>   DW_AT_type        : <0x64>
    <672>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><675>: Abbrev Number: 23 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x379): currpers
    <67a>   DW_AT_decl_file   : 20
    <67b>   DW_AT_decl_line   : 267
    <67d>   DW_AT_decl_column : 15
    <67e>   DW_AT_type        : <0x2b>
    <682>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><685>: Abbrev Number: 23 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0xafd): u_error
    <68a>   DW_AT_decl_file   : 20
    <68b>   DW_AT_decl_line   : 269
    <68d>   DW_AT_decl_column : 16
    <68e>   DW_AT_type        : <0x37>
    <692>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><695>: Abbrev Number: 23 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <69a>   DW_AT_decl_file   : 20
    <69b>   DW_AT_decl_line   : 270
    <69d>   DW_AT_decl_column : 17
    <69e>   DW_AT_type        : <0x57f>
    <6a2>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6a5>: Abbrev Number: 23 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0xb36): true_scno
    <6aa>   DW_AT_decl_file   : 20
    <6ab>   DW_AT_decl_line   : 271
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0x57f>
    <6b2>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6b5>: Abbrev Number: 23 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x186): u_arg
    <6ba>   DW_AT_decl_file   : 20
    <6bb>   DW_AT_decl_line   : 272
    <6bd>   DW_AT_decl_column : 17
    <6be>   DW_AT_type        : <0x9b8>
    <6c2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6c5>: Abbrev Number: 23 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x951): u_rval
    <6ca>   DW_AT_decl_file   : 20
    <6cb>   DW_AT_decl_line   : 273
    <6cd>   DW_AT_decl_column : 16
    <6ce>   DW_AT_type        : <0x573>
    <6d2>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6d5>: Abbrev Number: 23 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0xa7c): sys_func_rval
    <6da>   DW_AT_decl_file   : 20
    <6db>   DW_AT_decl_line   : 274
    <6dd>   DW_AT_decl_column : 6
    <6de>   DW_AT_type        : <0x64>
    <6e2>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6e5>: Abbrev Number: 23 (DW_TAG_member)
    <6e6>   DW_AT_name        : (indirect string, offset: 0xc92): curcol
    <6ea>   DW_AT_decl_file   : 20
    <6eb>   DW_AT_decl_line   : 275
    <6ed>   DW_AT_decl_column : 6
    <6ee>   DW_AT_type        : <0x64>
    <6f2>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6f5>: Abbrev Number: 23 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x963): outf
    <6fa>   DW_AT_decl_file   : 20
    <6fb>   DW_AT_decl_line   : 276
    <6fd>   DW_AT_decl_column : 8
    <6fe>   DW_AT_type        : <0x448>
    <702>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><705>: Abbrev Number: 23 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0xeb3): staged_output_data
    <70a>   DW_AT_decl_file   : 20
    <70b>   DW_AT_decl_line   : 277
    <70d>   DW_AT_decl_column : 29
    <70e>   DW_AT_type        : <0x9ce>
    <712>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><715>: Abbrev Number: 23 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0xa42): auxstr
    <71a>   DW_AT_decl_file   : 20
    <71b>   DW_AT_decl_line   : 279
    <71d>   DW_AT_decl_column : 14
    <71e>   DW_AT_type        : <0x203>
    <722>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><725>: Abbrev Number: 23 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x165): _priv_data
    <72a>   DW_AT_decl_file   : 20
    <72b>   DW_AT_decl_line   : 280
    <72d>   DW_AT_decl_column : 8
    <72e>   DW_AT_type        : <0xc6>
    <732>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><735>: Abbrev Number: 23 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0xbcb): _free_priv_data
    <73a>   DW_AT_decl_file   : 20
    <73b>   DW_AT_decl_line   : 281
    <73d>   DW_AT_decl_column : 9
    <73e>   DW_AT_type        : <0x9e0>
    <742>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><745>: Abbrev Number: 23 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0x176): s_ent
    <74a>   DW_AT_decl_file   : 20
    <74b>   DW_AT_decl_line   : 282
    <74d>   DW_AT_decl_column : 23
    <74e>   DW_AT_type        : <0x9e6>
    <752>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><755>: Abbrev Number: 23 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <75a>   DW_AT_decl_file   : 20
    <75b>   DW_AT_decl_line   : 285
    <75d>   DW_AT_decl_column : 23
    <75e>   DW_AT_type        : <0x9e6>
    <762>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><766>: Abbrev Number: 23 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x36e): inject_vec
    <76b>   DW_AT_decl_file   : 20
    <76c>   DW_AT_decl_line   : 286
    <76e>   DW_AT_decl_column : 22
    <76f>   DW_AT_type        : <0x9f1>
    <773>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><777>: Abbrev Number: 23 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x7a8): stime
    <77c>   DW_AT_decl_file   : 20
    <77d>   DW_AT_decl_line   : 287
    <77f>   DW_AT_decl_column : 18
    <780>   DW_AT_type        : <0x174>
    <784>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><788>: Abbrev Number: 23 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x382): ltime
    <78d>   DW_AT_decl_file   : 20
    <78e>   DW_AT_decl_line   : 288
    <790>   DW_AT_decl_column : 18
    <791>   DW_AT_type        : <0x174>
    <795>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><799>: Abbrev Number: 23 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0xf93): atime
    <79e>   DW_AT_decl_file   : 20
    <79f>   DW_AT_decl_line   : 289
    <7a1>   DW_AT_decl_column : 18
    <7a2>   DW_AT_type        : <0x174>
    <7a6>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><7aa>: Abbrev Number: 23 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x4a7): etime
    <7af>   DW_AT_decl_file   : 20
    <7b0>   DW_AT_decl_line   : 290
    <7b2>   DW_AT_decl_column : 18
    <7b3>   DW_AT_type        : <0x174>
    <7b7>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7bb>: Abbrev Number: 23 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xcf6): delay_expiration_time
    <7c0>   DW_AT_decl_file   : 20
    <7c1>   DW_AT_decl_line   : 291
    <7c3>   DW_AT_decl_column : 18
    <7c4>   DW_AT_type        : <0x174>
    <7c8>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7cc>: Abbrev Number: 23 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7d1>   DW_AT_decl_file   : 20
    <7d2>   DW_AT_decl_line   : 298
    <7d4>   DW_AT_decl_column : 15
    <7d5>   DW_AT_type        : <0x2b>
    <7d9>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7dd>: Abbrev Number: 23 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xeef): last_dirfd
    <7e2>   DW_AT_decl_file   : 20
    <7e3>   DW_AT_decl_line   : 301
    <7e5>   DW_AT_decl_column : 6
    <7e6>   DW_AT_type        : <0x64>
    <7ea>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7ee>: Abbrev Number: 23 (DW_TAG_member)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xf15): mmap_cache
    <7f3>   DW_AT_decl_file   : 20
    <7f4>   DW_AT_decl_line   : 304
    <7f6>   DW_AT_decl_column : 23
    <7f7>   DW_AT_type        : <0xa0d>
    <7fb>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ff>: Abbrev Number: 23 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0xb0c): wait_data_idx
    <804>   DW_AT_decl_file   : 20
    <805>   DW_AT_decl_line   : 311
    <807>   DW_AT_decl_column : 9
    <808>   DW_AT_type        : <0x122>
    <80c>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><810>: Abbrev Number: 23 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0xa49): delayed_wait_data
    <815>   DW_AT_decl_file   : 20
    <816>   DW_AT_decl_line   : 313
    <818>   DW_AT_decl_column : 24
    <819>   DW_AT_type        : <0xa19>
    <81d>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><821>: Abbrev Number: 23 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0xabe): wait_list
    <826>   DW_AT_decl_file   : 20
    <827>   DW_AT_decl_line   : 314
    <829>   DW_AT_decl_column : 19
    <82a>   DW_AT_type        : <0x590>
    <82e>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><832>: Abbrev Number: 23 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0x6a5): vcpu_info_list
    <837>   DW_AT_decl_file   : 20
    <838>   DW_AT_decl_line   : 318
    <83a>   DW_AT_decl_column : 20
    <83b>   DW_AT_type        : <0xa25>
    <83f>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><843>: Abbrev Number: 23 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0xc5d): unwind_ctx
    <848>   DW_AT_decl_file   : 20
    <849>   DW_AT_decl_line   : 322
    <84b>   DW_AT_decl_column : 8
    <84c>   DW_AT_type        : <0xc6>
    <850>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><854>: Abbrev Number: 23 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x491): unwind_queue
    <859>   DW_AT_decl_file   : 20
    <85a>   DW_AT_decl_line   : 323
    <85c>   DW_AT_decl_column : 25
    <85d>   DW_AT_type        : <0xa31>
    <861>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><865>: Abbrev Number: 23 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x15a): comm
    <86a>   DW_AT_decl_file   : 20
    <86b>   DW_AT_decl_line   : 327
    <86d>   DW_AT_decl_column : 7
    <86e>   DW_AT_type        : <0xa37>
    <872>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><876>: Abbrev Number: 23 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x21b): start_prc
    <87b>   DW_AT_decl_file   : 20
    <87c>   DW_AT_decl_line   : 329
    <87e>   DW_AT_decl_column : 16
    <87f>   DW_AT_type        : <0x37>
    <883>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><887>: Abbrev Number: 0
 <1><888>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <889>   DW_AT_byte_size   : 4
    <88a>   DW_AT_type        : <0x61b>
 <1><88e>: Abbrev Number: 4 (DW_TAG_typedef)
    <88f>   DW_AT_name        : (indirect string, offset: 0x579): struct_sysent
    <893>   DW_AT_decl_file   : 19
    <894>   DW_AT_decl_line   : 19
    <895>   DW_AT_decl_column : 3
    <896>   DW_AT_type        : <0x5c2>
 <1><89a>: Abbrev Number: 3 (DW_TAG_const_type)
    <89b>   DW_AT_type        : <0x88e>
 <1><89f>: Abbrev Number: 14 (DW_TAG_variable)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xce2): current_personality
    <8a4>   DW_AT_decl_file   : 20
    <8a5>   DW_AT_decl_line   : 158
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0x2b>
    <8ab>   DW_AT_external    : 1
    <8ac>   DW_AT_declaration : 1
 <1><8ad>: Abbrev Number: 14 (DW_TAG_variable)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x7d9): current_wordsize
    <8b2>   DW_AT_decl_file   : 20
    <8b3>   DW_AT_decl_line   : 171
    <8b4>   DW_AT_decl_column : 17
    <8b5>   DW_AT_type        : <0x2b>
    <8b9>   DW_AT_external    : 1
    <8ba>   DW_AT_declaration : 1
 <1><8bb>: Abbrev Number: 14 (DW_TAG_variable)
    <8bc>   DW_AT_name        : (indirect string, offset: 0xa20): current_klongsize
    <8c0>   DW_AT_decl_file   : 20
    <8c1>   DW_AT_decl_line   : 176
    <8c2>   DW_AT_decl_column : 17
    <8c3>   DW_AT_type        : <0x2b>
    <8c7>   DW_AT_external    : 1
    <8c8>   DW_AT_declaration : 1
 <1><8c9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xc34): ioctlent
    <8ce>   DW_AT_byte_size   : 8
    <8cf>   DW_AT_decl_file   : 20
    <8d0>   DW_AT_decl_line   : 217
    <8d1>   DW_AT_decl_column : 16
    <8d2>   DW_AT_sibling     : <0x8f5>
 <2><8d6>: Abbrev Number: 9 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0xedb): symbol
    <8db>   DW_AT_decl_file   : 20
    <8dc>   DW_AT_decl_line   : 218
    <8dd>   DW_AT_decl_column : 14
    <8de>   DW_AT_type        : <0x203>
    <8e2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e5>: Abbrev Number: 9 (DW_TAG_member)
    <8e6>   DW_AT_name        : (indirect string, offset: 0xcab): code
    <8ea>   DW_AT_decl_file   : 20
    <8eb>   DW_AT_decl_line   : 219
    <8ec>   DW_AT_decl_column : 15
    <8ed>   DW_AT_type        : <0x2b>
    <8f1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8f4>: Abbrev Number: 0
 <1><8f5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f6>   DW_AT_name        : (indirect string, offset: 0xbf5): struct_ioctlent
    <8fa>   DW_AT_decl_file   : 20
    <8fb>   DW_AT_decl_line   : 220
    <8fc>   DW_AT_decl_column : 3
    <8fd>   DW_AT_type        : <0x8c9>
 <1><901>: Abbrev Number: 3 (DW_TAG_const_type)
    <902>   DW_AT_type        : <0x8f5>
 <1><906>: Abbrev Number: 12 (DW_TAG_structure_type)
    <907>   DW_AT_name        : (indirect string, offset: 0x7cd): inject_data
    <90b>   DW_AT_byte_size   : 10
    <90c>   DW_AT_decl_file   : 20
    <90d>   DW_AT_decl_line   : 241
    <90e>   DW_AT_decl_column : 8
    <90f>   DW_AT_sibling     : <0x96e>
 <2><913>: Abbrev Number: 9 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0x4ad): flags
    <918>   DW_AT_decl_file   : 20
    <919>   DW_AT_decl_line   : 242
    <91a>   DW_AT_decl_column : 10
    <91b>   DW_AT_type        : <0xeb>
    <91f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><922>: Abbrev Number: 9 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0x8ee): signo
    <927>   DW_AT_decl_file   : 20
    <928>   DW_AT_decl_line   : 243
    <929>   DW_AT_decl_column : 10
    <92a>   DW_AT_type        : <0xeb>
    <92e>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><931>: Abbrev Number: 9 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <936>   DW_AT_decl_file   : 20
    <937>   DW_AT_decl_line   : 244
    <938>   DW_AT_decl_column : 11
    <939>   DW_AT_type        : <0xf7>
    <93d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><940>: Abbrev Number: 9 (DW_TAG_member)
    <941>   DW_AT_name        : (indirect string, offset: 0xc88): delay_idx
    <945>   DW_AT_decl_file   : 20
    <946>   DW_AT_decl_line   : 245
    <947>   DW_AT_decl_column : 11
    <948>   DW_AT_type        : <0xf7>
    <94c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><94f>: Abbrev Number: 9 (DW_TAG_member)
    <950>   DW_AT_name        : (indirect string, offset: 0x5d3): poke_idx
    <954>   DW_AT_decl_file   : 20
    <955>   DW_AT_decl_line   : 246
    <956>   DW_AT_decl_column : 11
    <957>   DW_AT_type        : <0xf7>
    <95b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><95e>: Abbrev Number: 9 (DW_TAG_member)
    <95f>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <963>   DW_AT_decl_file   : 20
    <964>   DW_AT_decl_line   : 247
    <965>   DW_AT_decl_column : 11
    <966>   DW_AT_type        : <0xf7>
    <96a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><96d>: Abbrev Number: 0
 <1><96e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <96f>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <973>   DW_AT_byte_size   : 16
    <974>   DW_AT_decl_file   : 20
    <975>   DW_AT_decl_line   : 250
    <976>   DW_AT_decl_column : 8
    <977>   DW_AT_sibling     : <0x9b8>
 <2><97b>: Abbrev Number: 9 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0x9f5): first
    <980>   DW_AT_decl_file   : 20
    <981>   DW_AT_decl_line   : 251
    <982>   DW_AT_decl_column : 11
    <983>   DW_AT_type        : <0xf7>
    <987>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><98a>: Abbrev Number: 9 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0x10b1): last
    <98f>   DW_AT_decl_file   : 20
    <990>   DW_AT_decl_line   : 252
    <991>   DW_AT_decl_column : 11
    <992>   DW_AT_type        : <0xf7>
    <996>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><999>: Abbrev Number: 9 (DW_TAG_member)
    <99a>   DW_AT_name        : (indirect string, offset: 0x388): step
    <99e>   DW_AT_decl_file   : 20
    <99f>   DW_AT_decl_line   : 253
    <9a0>   DW_AT_decl_column : 11
    <9a1>   DW_AT_type        : <0xf7>
    <9a5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9a8>: Abbrev Number: 9 (DW_TAG_member)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x1083): data
    <9ad>   DW_AT_decl_file   : 20
    <9ae>   DW_AT_decl_line   : 254
    <9af>   DW_AT_decl_column : 21
    <9b0>   DW_AT_type        : <0x906>
    <9b4>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9b7>: Abbrev Number: 0
 <1><9b8>: Abbrev Number: 10 (DW_TAG_array_type)
    <9b9>   DW_AT_type        : <0x57f>
    <9bd>   DW_AT_sibling     : <0x9c8>
 <2><9c1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9c2>   DW_AT_type        : <0x2b>
    <9c6>   DW_AT_upper_bound : 5
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9c9>   DW_AT_name        : (indirect string, offset: 0xeb3): staged_output_data
    <9cd>   DW_AT_declaration : 1
 <1><9ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cf>   DW_AT_byte_size   : 4
    <9d0>   DW_AT_type        : <0x9c8>
 <1><9d4>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9d5>   DW_AT_prototyped  : 1
    <9d6>   DW_AT_sibling     : <0x9e0>
 <2><9da>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9db>   DW_AT_type        : <0xc6>
 <2><9df>: Abbrev Number: 0
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9d4>
 <1><9e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e7>   DW_AT_byte_size   : 4
    <9e8>   DW_AT_type        : <0x89a>
 <1><9ec>: Abbrev Number: 3 (DW_TAG_const_type)
    <9ed>   DW_AT_type        : <0x9e6>
 <1><9f1>: Abbrev Number: 10 (DW_TAG_array_type)
    <9f2>   DW_AT_type        : <0xa01>
    <9f6>   DW_AT_sibling     : <0xa01>
 <2><9fa>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9fb>   DW_AT_type        : <0x2b>
    <9ff>   DW_AT_upper_bound : 2
 <2><a00>: Abbrev Number: 0
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x96e>
 <1><a07>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a08>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <a0c>   DW_AT_declaration : 1
 <1><a0d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0xa07>
 <1><a13>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a14>   DW_AT_name        : (indirect string, offset: 0x3a3): tcb_wait_data
    <a18>   DW_AT_declaration : 1
 <1><a19>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1a>   DW_AT_byte_size   : 4
    <a1b>   DW_AT_type        : <0xa13>
 <1><a1f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a20>   DW_AT_name        : (indirect string, offset: 0x150): vcpu_info
    <a24>   DW_AT_declaration : 1
 <1><a25>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_type        : <0xa1f>
 <1><a2b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a2c>   DW_AT_name        : (indirect string, offset: 0xe97): unwind_queue_t
    <a30>   DW_AT_declaration : 1
 <1><a31>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a32>   DW_AT_byte_size   : 4
    <a33>   DW_AT_type        : <0xa2b>
 <1><a37>: Abbrev Number: 10 (DW_TAG_array_type)
    <a38>   DW_AT_type        : <0xdf>
    <a3c>   DW_AT_sibling     : <0xa47>
 <2><a40>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a41>   DW_AT_type        : <0x2b>
    <a45>   DW_AT_upper_bound : 15
 <2><a46>: Abbrev Number: 0
 <1><a47>: Abbrev Number: 13 (DW_TAG_variable)
    <a48>   DW_AT_name        : (indirect string, offset: 0xb49): stub_sysent
    <a4c>   DW_AT_decl_file   : 20
    <a4d>   DW_AT_decl_line   : 403
    <a4f>   DW_AT_decl_column : 28
    <a50>   DW_AT_type        : <0x89a>
    <a54>   DW_AT_external    : 1
    <a55>   DW_AT_declaration : 1
 <1><a56>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a57>   DW_AT_name        : (indirect string, offset: 0x1060): xlat_type
    <a5b>   DW_AT_encoding    : 7	(unsigned)
    <a5c>   DW_AT_byte_size   : 4
    <a5d>   DW_AT_type        : <0x2b>
    <a61>   DW_AT_decl_file   : 21
    <a62>   DW_AT_decl_line   : 13
    <a63>   DW_AT_decl_column : 6
    <a64>   DW_AT_sibling     : <0xa7b>
 <2><a68>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a69>   DW_AT_name        : (indirect string, offset: 0x2bd): XT_NORMAL
    <a6d>   DW_AT_const_value : 0
 <2><a6e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6f>   DW_AT_name        : (indirect string, offset: 0xc0c): XT_SORTED
    <a73>   DW_AT_const_value : 1
 <2><a74>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a75>   DW_AT_name        : (indirect string, offset: 0xd6e): XT_INDEXED
    <a79>   DW_AT_const_value : 2
 <2><a7a>: Abbrev Number: 0
 <1><a7b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xb75): xlat_style
    <a80>   DW_AT_encoding    : 7	(unsigned)
    <a81>   DW_AT_byte_size   : 4
    <a82>   DW_AT_type        : <0x2b>
    <a86>   DW_AT_decl_file   : 21
    <a87>   DW_AT_decl_line   : 19
    <a88>   DW_AT_decl_column : 6
    <a89>   DW_AT_sibling     : <0xab8>
 <2><a8d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a92>   DW_AT_const_value : 0
 <2><a93>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0xba8): XLAT_STYLE_RAW
    <a98>   DW_AT_const_value : 1
 <2><a99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x1013): XLAT_STYLE_ABBREV
    <a9e>   DW_AT_const_value : 2
 <2><a9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x2da): XLAT_STYLE_VERBOSE
    <aa4>   DW_AT_const_value : 3
 <2><aa5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <aaa>   DW_AT_const_value : 0
 <2><aab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ab0>   DW_AT_const_value : 4
 <2><ab1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x10a0): XLAT_STYLE_FMT_D
    <ab6>   DW_AT_const_value : 8
 <2><ab7>: Abbrev Number: 0
 <1><ab8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x30b): xlat_data
    <abd>   DW_AT_byte_size   : 16
    <abe>   DW_AT_decl_file   : 21
    <abf>   DW_AT_decl_line   : 51
    <ac0>   DW_AT_decl_column : 8
    <ac1>   DW_AT_sibling     : <0xae4>
 <2><ac5>: Abbrev Number: 19 (DW_TAG_member)
    <ac6>   DW_AT_name        : val
    <aca>   DW_AT_decl_file   : 21
    <acb>   DW_AT_decl_line   : 52
    <acc>   DW_AT_decl_column : 11
    <acd>   DW_AT_type        : <0x10f>
    <ad1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad4>: Abbrev Number: 19 (DW_TAG_member)
    <ad5>   DW_AT_name        : str
    <ad9>   DW_AT_decl_file   : 21
    <ada>   DW_AT_decl_line   : 53
    <adb>   DW_AT_decl_column : 14
    <adc>   DW_AT_type        : <0x203>
    <ae0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ae3>: Abbrev Number: 0
 <1><ae4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ae5>   DW_AT_type        : <0xab8>
 <1><ae9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <aea>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aee>   DW_AT_byte_size   : 24
    <aef>   DW_AT_decl_file   : 21
    <af0>   DW_AT_decl_line   : 56
    <af1>   DW_AT_decl_column : 8
    <af2>   DW_AT_sibling     : <0xb42>
 <2><af6>: Abbrev Number: 9 (DW_TAG_member)
    <af7>   DW_AT_name        : (indirect string, offset: 0x1083): data
    <afb>   DW_AT_decl_file   : 21
    <afc>   DW_AT_decl_line   : 57
    <afd>   DW_AT_decl_column : 26
    <afe>   DW_AT_type        : <0xb47>
    <b02>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b05>: Abbrev Number: 9 (DW_TAG_member)
    <b06>   DW_AT_name        : (indirect string, offset: 0x82b): flags_strsz
    <b0a>   DW_AT_decl_file   : 21
    <b0b>   DW_AT_decl_line   : 58
    <b0c>   DW_AT_decl_column : 9
    <b0d>   DW_AT_type        : <0x122>
    <b11>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b14>: Abbrev Number: 9 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0xb1a): size
    <b19>   DW_AT_decl_file   : 21
    <b1a>   DW_AT_decl_line   : 59
    <b1b>   DW_AT_decl_column : 11
    <b1c>   DW_AT_type        : <0x103>
    <b20>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b23>: Abbrev Number: 9 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0x181): type
    <b28>   DW_AT_decl_file   : 21
    <b29>   DW_AT_decl_line   : 60
    <b2a>   DW_AT_decl_column : 17
    <b2b>   DW_AT_type        : <0xa56>
    <b2f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b32>: Abbrev Number: 9 (DW_TAG_member)
    <b33>   DW_AT_name        : (indirect string, offset: 0x6f9): flags_mask
    <b37>   DW_AT_decl_file   : 21
    <b38>   DW_AT_decl_line   : 61
    <b39>   DW_AT_decl_column : 11
    <b3a>   DW_AT_type        : <0x10f>
    <b3e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b41>: Abbrev Number: 0
 <1><b42>: Abbrev Number: 3 (DW_TAG_const_type)
    <b43>   DW_AT_type        : <0xae9>
 <1><b47>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b48>   DW_AT_byte_size   : 4
    <b49>   DW_AT_type        : <0xae4>
 <1><b4d>: Abbrev Number: 10 (DW_TAG_array_type)
    <b4e>   DW_AT_type        : <0xb42>
    <b52>   DW_AT_sibling     : <0xb58>
 <2><b56>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b57>: Abbrev Number: 0
 <1><b58>: Abbrev Number: 3 (DW_TAG_const_type)
    <b59>   DW_AT_type        : <0xb4d>
 <1><b5d>: Abbrev Number: 13 (DW_TAG_variable)
    <b5e>   DW_AT_name        : (indirect string, offset: 0xde2): addrfams
    <b62>   DW_AT_decl_file   : 20
    <b63>   DW_AT_decl_line   : 409
    <b65>   DW_AT_decl_column : 26
    <b66>   DW_AT_type        : <0xb58>
    <b6a>   DW_AT_external    : 1
    <b6b>   DW_AT_declaration : 1
 <1><b6c>: Abbrev Number: 13 (DW_TAG_variable)
    <b6d>   DW_AT_name        : (indirect string, offset: 0xcbb): arp_hardware_types
    <b71>   DW_AT_decl_file   : 20
    <b72>   DW_AT_decl_line   : 410
    <b74>   DW_AT_decl_column : 26
    <b75>   DW_AT_type        : <0xb58>
    <b79>   DW_AT_external    : 1
    <b7a>   DW_AT_declaration : 1
 <1><b7b>: Abbrev Number: 13 (DW_TAG_variable)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xf99): at_flags
    <b80>   DW_AT_decl_file   : 20
    <b81>   DW_AT_decl_line   : 411
    <b83>   DW_AT_decl_column : 26
    <b84>   DW_AT_type        : <0xb58>
    <b88>   DW_AT_external    : 1
    <b89>   DW_AT_declaration : 1
 <1><b8a>: Abbrev Number: 13 (DW_TAG_variable)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x46f): clocknames
    <b8f>   DW_AT_decl_file   : 20
    <b90>   DW_AT_decl_line   : 412
    <b92>   DW_AT_decl_column : 26
    <b93>   DW_AT_type        : <0xb58>
    <b97>   DW_AT_external    : 1
    <b98>   DW_AT_declaration : 1
 <1><b99>: Abbrev Number: 13 (DW_TAG_variable)
    <b9a>   DW_AT_name        : (indirect string, offset: 0xf63): dirent_types
    <b9e>   DW_AT_decl_file   : 20
    <b9f>   DW_AT_decl_line   : 413
    <ba1>   DW_AT_decl_column : 26
    <ba2>   DW_AT_type        : <0xb58>
    <ba6>   DW_AT_external    : 1
    <ba7>   DW_AT_declaration : 1
 <1><ba8>: Abbrev Number: 13 (DW_TAG_variable)
    <ba9>   DW_AT_name        : (indirect string, offset: 0x888): ethernet_protocols
    <bad>   DW_AT_decl_file   : 20
    <bae>   DW_AT_decl_line   : 414
    <bb0>   DW_AT_decl_column : 26
    <bb1>   DW_AT_type        : <0xb58>
    <bb5>   DW_AT_external    : 1
    <bb6>   DW_AT_declaration : 1
 <1><bb7>: Abbrev Number: 13 (DW_TAG_variable)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x626): inet_protocols
    <bbc>   DW_AT_decl_file   : 20
    <bbd>   DW_AT_decl_line   : 415
    <bbf>   DW_AT_decl_column : 26
    <bc0>   DW_AT_type        : <0xb58>
    <bc4>   DW_AT_external    : 1
    <bc5>   DW_AT_declaration : 1
 <1><bc6>: Abbrev Number: 13 (DW_TAG_variable)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x2aa): evdev_abs
    <bcb>   DW_AT_decl_file   : 20
    <bcc>   DW_AT_decl_line   : 416
    <bce>   DW_AT_decl_column : 26
    <bcf>   DW_AT_type        : <0xb58>
    <bd3>   DW_AT_external    : 1
    <bd4>   DW_AT_declaration : 1
 <1><bd5>: Abbrev Number: 13 (DW_TAG_variable)
    <bd6>   DW_AT_name        : (indirect string, offset: 0x6ee): audit_arch
    <bda>   DW_AT_decl_file   : 20
    <bdb>   DW_AT_decl_line   : 417
    <bdd>   DW_AT_decl_column : 26
    <bde>   DW_AT_type        : <0xb58>
    <be2>   DW_AT_external    : 1
    <be3>   DW_AT_declaration : 1
 <1><be4>: Abbrev Number: 13 (DW_TAG_variable)
    <be5>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <be9>   DW_AT_decl_file   : 20
    <bea>   DW_AT_decl_line   : 418
    <bec>   DW_AT_decl_column : 26
    <bed>   DW_AT_type        : <0xb58>
    <bf1>   DW_AT_external    : 1
    <bf2>   DW_AT_declaration : 1
 <1><bf3>: Abbrev Number: 13 (DW_TAG_variable)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x450): iffflags
    <bf8>   DW_AT_decl_file   : 20
    <bf9>   DW_AT_decl_line   : 419
    <bfb>   DW_AT_decl_column : 26
    <bfc>   DW_AT_type        : <0xb58>
    <c00>   DW_AT_external    : 1
    <c01>   DW_AT_declaration : 1
 <1><c02>: Abbrev Number: 13 (DW_TAG_variable)
    <c03>   DW_AT_name        : (indirect string, offset: 0xbb7): ip_type_of_services
    <c07>   DW_AT_decl_file   : 20
    <c08>   DW_AT_decl_line   : 420
    <c0a>   DW_AT_decl_column : 26
    <c0b>   DW_AT_type        : <0xb58>
    <c0f>   DW_AT_external    : 1
    <c10>   DW_AT_declaration : 1
 <1><c11>: Abbrev Number: 13 (DW_TAG_variable)
    <c12>   DW_AT_name        : (indirect string, offset: 0x681): ipc_private
    <c16>   DW_AT_decl_file   : 20
    <c17>   DW_AT_decl_line   : 421
    <c19>   DW_AT_decl_column : 26
    <c1a>   DW_AT_type        : <0xb58>
    <c1e>   DW_AT_external    : 1
    <c1f>   DW_AT_declaration : 1
 <1><c20>: Abbrev Number: 13 (DW_TAG_variable)
    <c21>   DW_AT_name        : (indirect string, offset: 0x301): msg_flags
    <c25>   DW_AT_decl_file   : 20
    <c26>   DW_AT_decl_line   : 422
    <c28>   DW_AT_decl_column : 26
    <c29>   DW_AT_type        : <0xb58>
    <c2d>   DW_AT_external    : 1
    <c2e>   DW_AT_declaration : 1
 <1><c2f>: Abbrev Number: 13 (DW_TAG_variable)
    <c30>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c34>   DW_AT_decl_file   : 20
    <c35>   DW_AT_decl_line   : 423
    <c37>   DW_AT_decl_column : 26
    <c38>   DW_AT_type        : <0xb58>
    <c3c>   DW_AT_external    : 1
    <c3d>   DW_AT_declaration : 1
 <1><c3e>: Abbrev Number: 13 (DW_TAG_variable)
    <c3f>   DW_AT_name        : (indirect string, offset: 0xec6): nl_bridge_vlan_flags
    <c43>   DW_AT_decl_file   : 20
    <c44>   DW_AT_decl_line   : 424
    <c46>   DW_AT_decl_column : 26
    <c47>   DW_AT_type        : <0xb58>
    <c4b>   DW_AT_external    : 1
    <c4c>   DW_AT_declaration : 1
 <1><c4d>: Abbrev Number: 13 (DW_TAG_variable)
    <c4e>   DW_AT_name        : (indirect string, offset: 0xd57): nl_netfilter_msg_types
    <c52>   DW_AT_decl_file   : 20
    <c53>   DW_AT_decl_line   : 425
    <c55>   DW_AT_decl_column : 26
    <c56>   DW_AT_type        : <0xb58>
    <c5a>   DW_AT_external    : 1
    <c5b>   DW_AT_declaration : 1
 <1><c5c>: Abbrev Number: 13 (DW_TAG_variable)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x432): nl_route_types
    <c61>   DW_AT_decl_file   : 20
    <c62>   DW_AT_decl_line   : 426
    <c64>   DW_AT_decl_column : 26
    <c65>   DW_AT_type        : <0xb58>
    <c69>   DW_AT_external    : 1
    <c6a>   DW_AT_declaration : 1
 <1><c6b>: Abbrev Number: 13 (DW_TAG_variable)
    <c6c>   DW_AT_name        : (indirect string, offset: 0xe19): open_access_modes
    <c70>   DW_AT_decl_file   : 20
    <c71>   DW_AT_decl_line   : 427
    <c73>   DW_AT_decl_column : 26
    <c74>   DW_AT_type        : <0xb58>
    <c78>   DW_AT_external    : 1
    <c79>   DW_AT_declaration : 1
 <1><c7a>: Abbrev Number: 13 (DW_TAG_variable)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c7f>   DW_AT_decl_file   : 20
    <c80>   DW_AT_decl_line   : 428
    <c82>   DW_AT_decl_column : 26
    <c83>   DW_AT_type        : <0xb58>
    <c87>   DW_AT_external    : 1
    <c88>   DW_AT_declaration : 1
 <1><c89>: Abbrev Number: 13 (DW_TAG_variable)
    <c8a>   DW_AT_name        : (indirect string, offset: 0xbe8): perf_type_id
    <c8e>   DW_AT_decl_file   : 20
    <c8f>   DW_AT_decl_line   : 429
    <c91>   DW_AT_decl_column : 26
    <c92>   DW_AT_type        : <0xb58>
    <c96>   DW_AT_external    : 1
    <c97>   DW_AT_declaration : 1
 <1><c98>: Abbrev Number: 13 (DW_TAG_variable)
    <c99>   DW_AT_name        : (indirect string, offset: 0xdeb): pollflags
    <c9d>   DW_AT_decl_file   : 20
    <c9e>   DW_AT_decl_line   : 430
    <ca0>   DW_AT_decl_column : 26
    <ca1>   DW_AT_type        : <0xb58>
    <ca5>   DW_AT_external    : 1
    <ca6>   DW_AT_declaration : 1
 <1><ca7>: Abbrev Number: 13 (DW_TAG_variable)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x5c7): ptrace_cmds
    <cac>   DW_AT_decl_file   : 20
    <cad>   DW_AT_decl_line   : 431
    <caf>   DW_AT_decl_column : 26
    <cb0>   DW_AT_type        : <0xb58>
    <cb4>   DW_AT_external    : 1
    <cb5>   DW_AT_declaration : 1
 <1><cb6>: Abbrev Number: 13 (DW_TAG_variable)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x7be): resource_flags
    <cbb>   DW_AT_decl_file   : 20
    <cbc>   DW_AT_decl_line   : 432
    <cbe>   DW_AT_decl_column : 26
    <cbf>   DW_AT_type        : <0xb58>
    <cc3>   DW_AT_external    : 1
    <cc4>   DW_AT_declaration : 1
 <1><cc5>: Abbrev Number: 13 (DW_TAG_variable)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x280): route_nexthop_flags
    <cca>   DW_AT_decl_file   : 20
    <ccb>   DW_AT_decl_line   : 433
    <ccd>   DW_AT_decl_column : 26
    <cce>   DW_AT_type        : <0xb58>
    <cd2>   DW_AT_external    : 1
    <cd3>   DW_AT_declaration : 1
 <1><cd4>: Abbrev Number: 13 (DW_TAG_variable)
    <cd5>   DW_AT_name        : (indirect string, offset: 0xe51): routing_protocols
    <cd9>   DW_AT_decl_file   : 20
    <cda>   DW_AT_decl_line   : 434
    <cdc>   DW_AT_decl_column : 26
    <cdd>   DW_AT_type        : <0xb58>
    <ce1>   DW_AT_external    : 1
    <ce2>   DW_AT_declaration : 1
 <1><ce3>: Abbrev Number: 13 (DW_TAG_variable)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x441): routing_scopes
    <ce8>   DW_AT_decl_file   : 20
    <ce9>   DW_AT_decl_line   : 435
    <ceb>   DW_AT_decl_column : 26
    <cec>   DW_AT_type        : <0xb58>
    <cf0>   DW_AT_external    : 1
    <cf1>   DW_AT_declaration : 1
 <1><cf2>: Abbrev Number: 13 (DW_TAG_variable)
    <cf3>   DW_AT_name        : (indirect string, offset: 0xd45): routing_table_ids
    <cf7>   DW_AT_decl_file   : 20
    <cf8>   DW_AT_decl_line   : 436
    <cfa>   DW_AT_decl_column : 26
    <cfb>   DW_AT_type        : <0xb58>
    <cff>   DW_AT_external    : 1
    <d00>   DW_AT_declaration : 1
 <1><d01>: Abbrev Number: 13 (DW_TAG_variable)
    <d02>   DW_AT_name        : (indirect string, offset: 0x65e): routing_types
    <d06>   DW_AT_decl_file   : 20
    <d07>   DW_AT_decl_line   : 437
    <d09>   DW_AT_decl_column : 26
    <d0a>   DW_AT_type        : <0xb58>
    <d0e>   DW_AT_external    : 1
    <d0f>   DW_AT_declaration : 1
 <1><d10>: Abbrev Number: 13 (DW_TAG_variable)
    <d11>   DW_AT_name        : (indirect string, offset: 0x1a5): rwf_flags
    <d15>   DW_AT_decl_file   : 20
    <d16>   DW_AT_decl_line   : 438
    <d18>   DW_AT_decl_column : 26
    <d19>   DW_AT_type        : <0xb58>
    <d1d>   DW_AT_external    : 1
    <d1e>   DW_AT_declaration : 1
 <1><d1f>: Abbrev Number: 13 (DW_TAG_variable)
    <d20>   DW_AT_name        : (indirect string, offset: 0x7f6): seccomp_filter_flags
    <d24>   DW_AT_decl_file   : 20
    <d25>   DW_AT_decl_line   : 439
    <d27>   DW_AT_decl_column : 26
    <d28>   DW_AT_type        : <0xb58>
    <d2c>   DW_AT_external    : 1
    <d2d>   DW_AT_declaration : 1
 <1><d2e>: Abbrev Number: 13 (DW_TAG_variable)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x2c7): seccomp_ret_action
    <d33>   DW_AT_decl_file   : 20
    <d34>   DW_AT_decl_line   : 440
    <d36>   DW_AT_decl_column : 26
    <d37>   DW_AT_type        : <0xb58>
    <d3b>   DW_AT_external    : 1
    <d3c>   DW_AT_declaration : 1
 <1><d3d>: Abbrev Number: 13 (DW_TAG_variable)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x40d): setns_types
    <d42>   DW_AT_decl_file   : 20
    <d43>   DW_AT_decl_line   : 441
    <d45>   DW_AT_decl_column : 26
    <d46>   DW_AT_type        : <0xb58>
    <d4a>   DW_AT_external    : 1
    <d4b>   DW_AT_declaration : 1
 <1><d4c>: Abbrev Number: 13 (DW_TAG_variable)
    <d4d>   DW_AT_name        : (indirect string, offset: 0xdd7): sg_io_info
    <d51>   DW_AT_decl_file   : 20
    <d52>   DW_AT_decl_line   : 442
    <d54>   DW_AT_decl_column : 26
    <d55>   DW_AT_type        : <0xb58>
    <d59>   DW_AT_external    : 1
    <d5a>   DW_AT_declaration : 1
 <1><d5b>: Abbrev Number: 13 (DW_TAG_variable)
    <d5c>   DW_AT_name        : (indirect string, offset: 0xb5d): socketlayers
    <d60>   DW_AT_decl_file   : 20
    <d61>   DW_AT_decl_line   : 443
    <d63>   DW_AT_decl_column : 26
    <d64>   DW_AT_type        : <0xb58>
    <d68>   DW_AT_external    : 1
    <d69>   DW_AT_declaration : 1
 <1><d6a>: Abbrev Number: 13 (DW_TAG_variable)
    <d6b>   DW_AT_name        : (indirect string, offset: 0xd2f): socktypes
    <d6f>   DW_AT_decl_file   : 20
    <d70>   DW_AT_decl_line   : 444
    <d72>   DW_AT_decl_column : 26
    <d73>   DW_AT_type        : <0xb58>
    <d77>   DW_AT_external    : 1
    <d78>   DW_AT_declaration : 1
 <1><d79>: Abbrev Number: 13 (DW_TAG_variable)
    <d7a>   DW_AT_name        : (indirect string, offset: 0xa32): tcp_state_flags
    <d7e>   DW_AT_decl_file   : 20
    <d7f>   DW_AT_decl_line   : 445
    <d81>   DW_AT_decl_column : 26
    <d82>   DW_AT_type        : <0xb58>
    <d86>   DW_AT_external    : 1
    <d87>   DW_AT_declaration : 1
 <1><d88>: Abbrev Number: 13 (DW_TAG_variable)
    <d89>   DW_AT_name        : (indirect string, offset: 0x723): tcp_states
    <d8d>   DW_AT_decl_file   : 20
    <d8e>   DW_AT_decl_line   : 446
    <d90>   DW_AT_decl_column : 26
    <d91>   DW_AT_type        : <0xb58>
    <d95>   DW_AT_external    : 1
    <d96>   DW_AT_declaration : 1
 <1><d97>: Abbrev Number: 13 (DW_TAG_variable)
    <d98>   DW_AT_name        : (indirect string, offset: 0xff6): whence_codes
    <d9c>   DW_AT_decl_file   : 20
    <d9d>   DW_AT_decl_line   : 447
    <d9f>   DW_AT_decl_column : 26
    <da0>   DW_AT_type        : <0xb58>
    <da4>   DW_AT_external    : 1
    <da5>   DW_AT_declaration : 1
 <1><da6>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <da7>   DW_AT_encoding    : 7	(unsigned)
    <da8>   DW_AT_byte_size   : 4
    <da9>   DW_AT_type        : <0x2b>
    <dad>   DW_AT_decl_file   : 20
    <dae>   DW_AT_decl_line   : 508
    <db0>   DW_AT_decl_column : 14
    <db1>   DW_AT_sibling     : <0xdc8>
 <2><db5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x958): CFLAG_NONE
    <dba>   DW_AT_const_value : 0
 <2><dbb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x89b): CFLAG_ONLY_STATS
    <dc0>   DW_AT_const_value : 1
 <2><dc1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xb6a): CFLAG_BOTH
    <dc6>   DW_AT_const_value : 2
 <2><dc7>: Abbrev Number: 0
 <1><dc8>: Abbrev Number: 29 (DW_TAG_typedef)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x10b6): cflag_t
    <dcd>   DW_AT_decl_file   : 20
    <dce>   DW_AT_decl_line   : 512
    <dd0>   DW_AT_decl_column : 3
    <dd1>   DW_AT_type        : <0xda6>
 <1><dd5>: Abbrev Number: 13 (DW_TAG_variable)
    <dd6>   DW_AT_name        : (indirect string, offset: 0xc82): cflag
    <dda>   DW_AT_decl_file   : 20
    <ddb>   DW_AT_decl_line   : 513
    <ddd>   DW_AT_decl_column : 16
    <dde>   DW_AT_type        : <0xdc8>
    <de2>   DW_AT_external    : 1
    <de3>   DW_AT_declaration : 1
 <1><de4>: Abbrev Number: 13 (DW_TAG_variable)
    <de5>   DW_AT_name        : (indirect string, offset: 0x170): Tflag
    <de9>   DW_AT_decl_file   : 20
    <dea>   DW_AT_decl_line   : 514
    <dec>   DW_AT_decl_column : 13
    <ded>   DW_AT_type        : <0x54f>
    <df1>   DW_AT_external    : 1
    <df2>   DW_AT_declaration : 1
 <1><df3>: Abbrev Number: 13 (DW_TAG_variable)
    <df4>   DW_AT_name        : (indirect string, offset: 0x779): Tflag_scale
    <df8>   DW_AT_decl_file   : 20
    <df9>   DW_AT_decl_line   : 515
    <dfb>   DW_AT_decl_column : 12
    <dfc>   DW_AT_type        : <0x64>
    <e00>   DW_AT_external    : 1
    <e01>   DW_AT_declaration : 1
 <1><e02>: Abbrev Number: 13 (DW_TAG_variable)
    <e03>   DW_AT_name        : (indirect string, offset: 0x80b): Tflag_width
    <e07>   DW_AT_decl_file   : 20
    <e08>   DW_AT_decl_line   : 516
    <e0a>   DW_AT_decl_column : 12
    <e0b>   DW_AT_type        : <0x64>
    <e0f>   DW_AT_external    : 1
    <e10>   DW_AT_declaration : 1
 <1><e11>: Abbrev Number: 13 (DW_TAG_variable)
    <e12>   DW_AT_name        : (indirect string, offset: 0xdc9): iflag
    <e16>   DW_AT_decl_file   : 20
    <e17>   DW_AT_decl_line   : 517
    <e19>   DW_AT_decl_column : 13
    <e1a>   DW_AT_type        : <0x54f>
    <e1e>   DW_AT_external    : 1
    <e1f>   DW_AT_declaration : 1
 <1><e20>: Abbrev Number: 13 (DW_TAG_variable)
    <e21>   DW_AT_name        : (indirect string, offset: 0x607): count_wallclock
    <e25>   DW_AT_decl_file   : 20
    <e26>   DW_AT_decl_line   : 518
    <e28>   DW_AT_decl_column : 13
    <e29>   DW_AT_type        : <0x54f>
    <e2d>   DW_AT_external    : 1
    <e2e>   DW_AT_declaration : 1
 <1><e2f>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e30>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e34>   DW_AT_byte_size   : 4
    <e35>   DW_AT_decl_file   : 20
    <e36>   DW_AT_decl_line   : 520
    <e38>   DW_AT_decl_column : 8
    <e39>   DW_AT_sibling     : <0xe4e>
 <2><e3d>: Abbrev Number: 23 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e42>   DW_AT_decl_file   : 20
    <e43>   DW_AT_decl_line   : 521
    <e45>   DW_AT_decl_column : 14
    <e46>   DW_AT_type        : <0x203>
    <e4a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e4d>: Abbrev Number: 0
 <1><e4e>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x72e): path_set
    <e53>   DW_AT_byte_size   : 12
    <e54>   DW_AT_decl_file   : 20
    <e55>   DW_AT_decl_line   : 525
    <e57>   DW_AT_decl_column : 15
    <e58>   DW_AT_sibling     : <0xe8d>
 <2><e5c>: Abbrev Number: 23 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x6bc): paths_selected
    <e61>   DW_AT_decl_file   : 20
    <e62>   DW_AT_decl_line   : 526
    <e64>   DW_AT_decl_column : 24
    <e65>   DW_AT_type        : <0xe8d>
    <e69>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e6c>: Abbrev Number: 23 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0xfe9): num_selected
    <e71>   DW_AT_decl_file   : 20
    <e72>   DW_AT_decl_line   : 527
    <e74>   DW_AT_decl_column : 9
    <e75>   DW_AT_type        : <0x122>
    <e79>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e7c>: Abbrev Number: 23 (DW_TAG_member)
    <e7d>   DW_AT_name        : (indirect string, offset: 0xb1a): size
    <e81>   DW_AT_decl_file   : 20
    <e82>   DW_AT_decl_line   : 528
    <e84>   DW_AT_decl_column : 9
    <e85>   DW_AT_type        : <0x122>
    <e89>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e8e>   DW_AT_byte_size   : 4
    <e8f>   DW_AT_type        : <0xe2f>
 <1><e93>: Abbrev Number: 13 (DW_TAG_variable)
    <e94>   DW_AT_name        : (indirect string, offset: 0x1038): global_path_set
    <e98>   DW_AT_decl_file   : 20
    <e99>   DW_AT_decl_line   : 529
    <e9b>   DW_AT_decl_column : 3
    <e9c>   DW_AT_type        : <0xe4e>
    <ea0>   DW_AT_external    : 1
    <ea1>   DW_AT_declaration : 1
 <1><ea2>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ea3>   DW_AT_name        : (indirect string, offset: 0xf3e): xflag_opts
    <ea7>   DW_AT_encoding    : 7	(unsigned)
    <ea8>   DW_AT_byte_size   : 4
    <ea9>   DW_AT_type        : <0x2b>
    <ead>   DW_AT_decl_file   : 20
    <eae>   DW_AT_decl_line   : 531
    <eb0>   DW_AT_decl_column : 6
    <eb1>   DW_AT_sibling     : <0xed4>
 <2><eb5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x9e9): HEXSTR_NONE
    <eba>   DW_AT_const_value : 0
 <2><ebb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebc>   DW_AT_name        : (indirect string, offset: 0xf7b): HEXSTR_NON_ASCII
    <ec0>   DW_AT_const_value : 1
 <2><ec1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x8d9): HEXSTR_ALL
    <ec6>   DW_AT_const_value : 2
 <2><ec7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x647): HEXSTR_NON_ASCII_CHARS
    <ecc>   DW_AT_const_value : 3
 <2><ecd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ece>   DW_AT_name        : (indirect string, offset: 0x1003): NUM_HEXSTR_OPTS
    <ed2>   DW_AT_const_value : 4
 <2><ed3>: Abbrev Number: 0
 <1><ed4>: Abbrev Number: 13 (DW_TAG_variable)
    <ed5>   DW_AT_name        : (indirect string, offset: 0xd98): xflag
    <ed9>   DW_AT_decl_file   : 20
    <eda>   DW_AT_decl_line   : 544
    <edc>   DW_AT_decl_column : 17
    <edd>   DW_AT_type        : <0x2b>
    <ee1>   DW_AT_external    : 1
    <ee2>   DW_AT_declaration : 1
 <1><ee3>: Abbrev Number: 13 (DW_TAG_variable)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xc3d): followfork
    <ee8>   DW_AT_decl_file   : 20
    <ee9>   DW_AT_decl_line   : 545
    <eeb>   DW_AT_decl_column : 13
    <eec>   DW_AT_type        : <0x54f>
    <ef0>   DW_AT_external    : 1
    <ef1>   DW_AT_declaration : 1
 <1><ef2>: Abbrev Number: 13 (DW_TAG_variable)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x315): output_separately
    <ef7>   DW_AT_decl_file   : 20
    <ef8>   DW_AT_decl_line   : 546
    <efa>   DW_AT_decl_column : 13
    <efb>   DW_AT_type        : <0x54f>
    <eff>   DW_AT_external    : 1
    <f00>   DW_AT_declaration : 1
 <1><f01>: Abbrev Number: 13 (DW_TAG_variable)
    <f02>   DW_AT_name        : (indirect string, offset: 0x225): stack_trace_enabled
    <f06>   DW_AT_decl_file   : 20
    <f07>   DW_AT_decl_line   : 549
    <f09>   DW_AT_decl_column : 13
    <f0a>   DW_AT_type        : <0x54f>
    <f0e>   DW_AT_external    : 1
    <f0f>   DW_AT_declaration : 1
 <1><f10>: Abbrev Number: 13 (DW_TAG_variable)
    <f11>   DW_AT_name        : (indirect string, offset: 0x635): ptrace_setoptions
    <f15>   DW_AT_decl_file   : 20
    <f16>   DW_AT_decl_line   : 553
    <f18>   DW_AT_decl_column : 17
    <f19>   DW_AT_type        : <0x2b>
    <f1d>   DW_AT_external    : 1
    <f1e>   DW_AT_declaration : 1
 <1><f1f>: Abbrev Number: 13 (DW_TAG_variable)
    <f20>   DW_AT_name        : (indirect string, offset: 0x9de): max_strlen
    <f24>   DW_AT_decl_file   : 20
    <f25>   DW_AT_decl_line   : 554
    <f27>   DW_AT_decl_column : 17
    <f28>   DW_AT_type        : <0x2b>
    <f2c>   DW_AT_external    : 1
    <f2d>   DW_AT_declaration : 1
 <1><f2e>: Abbrev Number: 13 (DW_TAG_variable)
    <f2f>   DW_AT_name        : (indirect string, offset: 0xa0c): os_release
    <f33>   DW_AT_decl_file   : 20
    <f34>   DW_AT_decl_line   : 555
    <f36>   DW_AT_decl_column : 17
    <f37>   DW_AT_type        : <0x2b>
    <f3b>   DW_AT_external    : 1
    <f3c>   DW_AT_declaration : 1
 <1><f3d>: Abbrev Number: 13 (DW_TAG_variable)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x6cb): xlat_verbosity
    <f42>   DW_AT_decl_file   : 20
    <f43>   DW_AT_decl_line   : 917
    <f45>   DW_AT_decl_column : 24
    <f46>   DW_AT_type        : <0xa7b>
    <f4a>   DW_AT_external    : 1
    <f4b>   DW_AT_declaration : 1
 <1><f4c>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x5ea): xlat_style_private_flag_bits
    <f51>   DW_AT_encoding    : 7	(unsigned)
    <f52>   DW_AT_byte_size   : 4
    <f53>   DW_AT_type        : <0x2b>
    <f57>   DW_AT_decl_file   : 20
    <f58>   DW_AT_decl_line   : 937
    <f5a>   DW_AT_decl_column : 6
    <f5b>   DW_AT_sibling     : <0xf78>
 <2><f5f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f60>   DW_AT_name        : (indirect string, offset: 0x294): PAF_PRINT_INDICES_BIT
    <f64>   DW_AT_const_value : 5
 <2><f65>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0xad1): PAF_ARRAY_TRUNCATED_BIT
    <f6a>   DW_AT_const_value : 6
 <2><f6b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x3cd): PXF_DEFAULT_STR_BIT
    <f70>   DW_AT_const_value : 7
 <2><f71>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f72>   DW_AT_name        : (indirect string, offset: 0xc1f): SPFF_AUXSTR_MODE_BIT
    <f76>   DW_AT_const_value : 8
 <2><f77>: Abbrev Number: 0
 <1><f78>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f79>   DW_AT_name        : (indirect string, offset: 0xcce): find_xlat_flag_bits
    <f7d>   DW_AT_encoding    : 7	(unsigned)
    <f7e>   DW_AT_byte_size   : 4
    <f7f>   DW_AT_type        : <0x2b>
    <f83>   DW_AT_decl_file   : 20
    <f84>   DW_AT_decl_line   : 1441
    <f86>   DW_AT_decl_column : 6
    <f87>   DW_AT_sibling     : <0xf92>
 <2><f8b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x916): FXL_CASE_SENSITIVE_BIT
    <f90>   DW_AT_const_value : 0
 <2><f91>: Abbrev Number: 0
 <1><f92>: Abbrev Number: 13 (DW_TAG_variable)
    <f93>   DW_AT_name        : (indirect string, offset: 0x9ab): printing_tcp
    <f97>   DW_AT_decl_file   : 20
    <f98>   DW_AT_decl_line   : 1687
    <f9a>   DW_AT_decl_column : 20
    <f9b>   DW_AT_type        : <0x62b>
    <f9f>   DW_AT_external    : 1
    <fa0>   DW_AT_declaration : 1
 <1><fa1>: Abbrev Number: 13 (DW_TAG_variable)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x59e): errnoent
    <fa6>   DW_AT_decl_file   : 20
    <fa7>   DW_AT_decl_line   : 1885
    <fa9>   DW_AT_decl_column : 26
    <faa>   DW_AT_type        : <0x483>
    <fae>   DW_AT_external    : 1
    <faf>   DW_AT_declaration : 1
 <1><fb0>: Abbrev Number: 13 (DW_TAG_variable)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x817): signalent
    <fb5>   DW_AT_decl_file   : 20
    <fb6>   DW_AT_decl_line   : 1886
    <fb8>   DW_AT_decl_column : 26
    <fb9>   DW_AT_type        : <0x483>
    <fbd>   DW_AT_external    : 1
    <fbe>   DW_AT_declaration : 1
 <1><fbf>: Abbrev Number: 13 (DW_TAG_variable)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xe11): nerrnos
    <fc4>   DW_AT_decl_file   : 20
    <fc5>   DW_AT_decl_line   : 1887
    <fc7>   DW_AT_decl_column : 27
    <fc8>   DW_AT_type        : <0x32>
    <fcc>   DW_AT_external    : 1
    <fcd>   DW_AT_declaration : 1
 <1><fce>: Abbrev Number: 13 (DW_TAG_variable)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xfd2): nsignals
    <fd3>   DW_AT_decl_file   : 20
    <fd4>   DW_AT_decl_line   : 1888
    <fd6>   DW_AT_decl_column : 27
    <fd7>   DW_AT_type        : <0x32>
    <fdb>   DW_AT_external    : 1
    <fdc>   DW_AT_declaration : 1
 <1><fdd>: Abbrev Number: 10 (DW_TAG_array_type)
    <fde>   DW_AT_type        : <0x89a>
    <fe2>   DW_AT_sibling     : <0xfe8>
 <2><fe6>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fe7>: Abbrev Number: 0
 <1><fe8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe9>   DW_AT_type        : <0xfdd>
 <1><fed>: Abbrev Number: 13 (DW_TAG_variable)
    <fee>   DW_AT_name        : (indirect string, offset: 0xc99): sysent0
    <ff2>   DW_AT_decl_file   : 20
    <ff3>   DW_AT_decl_line   : 1890
    <ff5>   DW_AT_decl_column : 28
    <ff6>   DW_AT_type        : <0xfe8>
    <ffa>   DW_AT_external    : 1
    <ffb>   DW_AT_declaration : 1
 <1><ffc>: Abbrev Number: 10 (DW_TAG_array_type)
    <ffd>   DW_AT_type        : <0x901>
    <1001>   DW_AT_sibling     : <0x1007>
 <2><1005>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><1006>: Abbrev Number: 0
 <1><1007>: Abbrev Number: 3 (DW_TAG_const_type)
    <1008>   DW_AT_type        : <0xffc>
 <1><100c>: Abbrev Number: 13 (DW_TAG_variable)
    <100d>   DW_AT_name        : (indirect string, offset: 0x102e): ioctlent0
    <1011>   DW_AT_decl_file   : 20
    <1012>   DW_AT_decl_line   : 1891
    <1014>   DW_AT_decl_column : 30
    <1015>   DW_AT_type        : <0x1007>
    <1019>   DW_AT_external    : 1
    <101a>   DW_AT_declaration : 1
 <1><101b>: Abbrev Number: 13 (DW_TAG_variable)
    <101c>   DW_AT_name        : (indirect string, offset: 0xf49): personality_names
    <1020>   DW_AT_decl_file   : 20
    <1021>   DW_AT_decl_line   : 1893
    <1023>   DW_AT_decl_column : 26
    <1024>   DW_AT_type        : <0x483>
    <1028>   DW_AT_external    : 1
    <1029>   DW_AT_declaration : 1
 <1><102a>: Abbrev Number: 13 (DW_TAG_variable)
    <102b>   DW_AT_name        : (indirect string, offset: 0x837): sysent
    <102f>   DW_AT_decl_file   : 20
    <1030>   DW_AT_decl_line   : 1896
    <1032>   DW_AT_decl_column : 29
    <1033>   DW_AT_type        : <0x9e6>
    <1037>   DW_AT_external    : 1
    <1038>   DW_AT_declaration : 1
 <1><1039>: Abbrev Number: 13 (DW_TAG_variable)
    <103a>   DW_AT_name        : (indirect string, offset: 0xc34): ioctlent
    <103e>   DW_AT_decl_file   : 20
    <103f>   DW_AT_decl_line   : 1897
    <1041>   DW_AT_decl_column : 31
    <1042>   DW_AT_type        : <0x1048>
    <1046>   DW_AT_external    : 1
    <1047>   DW_AT_declaration : 1
 <1><1048>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1049>   DW_AT_byte_size   : 4
    <104a>   DW_AT_type        : <0x901>
 <1><104e>: Abbrev Number: 13 (DW_TAG_variable)
    <104f>   DW_AT_name        : (indirect string, offset: 0x821): nsyscalls
    <1053>   DW_AT_decl_file   : 20
    <1054>   DW_AT_decl_line   : 1903
    <1056>   DW_AT_decl_column : 17
    <1057>   DW_AT_type        : <0x2b>
    <105b>   DW_AT_external    : 1
    <105c>   DW_AT_declaration : 1
 <1><105d>: Abbrev Number: 13 (DW_TAG_variable)
    <105e>   DW_AT_name        : (indirect string, offset: 0xe31): nioctlents
    <1062>   DW_AT_decl_file   : 20
    <1063>   DW_AT_decl_line   : 1904
    <1065>   DW_AT_decl_column : 17
    <1066>   DW_AT_type        : <0x2b>
    <106a>   DW_AT_external    : 1
    <106b>   DW_AT_declaration : 1
 <1><106c>: Abbrev Number: 10 (DW_TAG_array_type)
    <106d>   DW_AT_type        : <0x32>
    <1071>   DW_AT_sibling     : <0x107c>
 <2><1075>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1076>   DW_AT_type        : <0x2b>
    <107a>   DW_AT_upper_bound : 2
 <2><107b>: Abbrev Number: 0
 <1><107c>: Abbrev Number: 3 (DW_TAG_const_type)
    <107d>   DW_AT_type        : <0x106c>
 <1><1081>: Abbrev Number: 13 (DW_TAG_variable)
    <1082>   DW_AT_name        : (indirect string, offset: 0xea6): nsyscall_vec
    <1086>   DW_AT_decl_file   : 20
    <1087>   DW_AT_decl_line   : 1906
    <1089>   DW_AT_decl_column : 27
    <108a>   DW_AT_type        : <0x107c>
    <108e>   DW_AT_external    : 1
    <108f>   DW_AT_declaration : 1
 <1><1090>: Abbrev Number: 10 (DW_TAG_array_type)
    <1091>   DW_AT_type        : <0x9ec>
    <1095>   DW_AT_sibling     : <0x10a0>
 <2><1099>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <109a>   DW_AT_type        : <0x2b>
    <109e>   DW_AT_upper_bound : 2
 <2><109f>: Abbrev Number: 0
 <1><10a0>: Abbrev Number: 3 (DW_TAG_const_type)
    <10a1>   DW_AT_type        : <0x1090>
 <1><10a5>: Abbrev Number: 13 (DW_TAG_variable)
    <10a6>   DW_AT_name        : (indirect string, offset: 0x766): sysent_vec
    <10aa>   DW_AT_decl_file   : 20
    <10ab>   DW_AT_decl_line   : 1907
    <10ad>   DW_AT_decl_column : 35
    <10ae>   DW_AT_type        : <0x10a0>
    <10b2>   DW_AT_external    : 1
    <10b3>   DW_AT_declaration : 1
 <1><10b4>: Abbrev Number: 13 (DW_TAG_variable)
    <10b5>   DW_AT_name        : (indirect string, offset: 0x36e): inject_vec
    <10b9>   DW_AT_decl_file   : 20
    <10ba>   DW_AT_decl_line   : 1908
    <10bc>   DW_AT_decl_column : 28
    <10bd>   DW_AT_type        : <0x9f1>
    <10c1>   DW_AT_external    : 1
    <10c2>   DW_AT_declaration : 1
 <1><10c3>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10c4>   DW_AT_name        : (indirect string, offset: 0xd22): audit_arch_t
    <10c8>   DW_AT_byte_size   : 8
    <10c9>   DW_AT_decl_file   : 20
    <10ca>   DW_AT_decl_line   : 1910
    <10cc>   DW_AT_decl_column : 8
    <10cd>   DW_AT_sibling     : <0x10f2>
 <2><10d1>: Abbrev Number: 23 (DW_TAG_member)
    <10d2>   DW_AT_name        : (indirect string, offset: 0x5dc): arch
    <10d6>   DW_AT_decl_file   : 20
    <10d7>   DW_AT_decl_line   : 1911
    <10d9>   DW_AT_decl_column : 15
    <10da>   DW_AT_type        : <0x2b>
    <10de>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10e1>: Abbrev Number: 23 (DW_TAG_member)
    <10e2>   DW_AT_name        : (indirect string, offset: 0x991): flag
    <10e6>   DW_AT_decl_file   : 20
    <10e7>   DW_AT_decl_line   : 1912
    <10e9>   DW_AT_decl_column : 15
    <10ea>   DW_AT_type        : <0x2b>
    <10ee>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10f1>: Abbrev Number: 0
 <1><10f2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f3>   DW_AT_type        : <0x10c3>
 <1><10f7>: Abbrev Number: 10 (DW_TAG_array_type)
    <10f8>   DW_AT_type        : <0x10f2>
    <10fc>   DW_AT_sibling     : <0x1107>
 <2><1100>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1101>   DW_AT_type        : <0x2b>
    <1105>   DW_AT_upper_bound : 2
 <2><1106>: Abbrev Number: 0
 <1><1107>: Abbrev Number: 3 (DW_TAG_const_type)
    <1108>   DW_AT_type        : <0x10f7>
 <1><110c>: Abbrev Number: 13 (DW_TAG_variable)
    <110d>   DW_AT_name        : (indirect string, offset: 0x907): audit_arch_vec
    <1111>   DW_AT_decl_file   : 20
    <1112>   DW_AT_decl_line   : 1915
    <1114>   DW_AT_decl_column : 34
    <1115>   DW_AT_type        : <0x1107>
    <1119>   DW_AT_external    : 1
    <111a>   DW_AT_declaration : 1
 <1><111b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <111c>   DW_AT_byte_size   : 180
    <111d>   DW_AT_decl_file   : 22
    <111e>   DW_AT_decl_line   : 2
    <111f>   DW_AT_decl_column : 9
    <1120>   DW_AT_sibling     : <0x13d5>
 <2><1124>: Abbrev Number: 9 (DW_TAG_member)
    <1125>   DW_AT_name        : (indirect string, offset: 0x83e): block_ioctl
    <1129>   DW_AT_decl_file   : 22
    <112a>   DW_AT_decl_line   : 3
    <112b>   DW_AT_decl_column : 8
    <112c>   DW_AT_type        : <0x13ef>
    <1130>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1133>: Abbrev Number: 9 (DW_TAG_member)
    <1134>   DW_AT_name        : (indirect string, offset: 0xa70): btrfs_ioctl
    <1138>   DW_AT_decl_file   : 22
    <1139>   DW_AT_decl_line   : 6
    <113a>   DW_AT_decl_column : 8
    <113b>   DW_AT_type        : <0x13ef>
    <113f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1142>: Abbrev Number: 9 (DW_TAG_member)
    <1143>   DW_AT_name        : (indirect string, offset: 0x704): evdev_write_ioctl_mpers
    <1147>   DW_AT_decl_file   : 22
    <1148>   DW_AT_decl_line   : 9
    <1149>   DW_AT_decl_column : 8
    <114a>   DW_AT_type        : <0x13ef>
    <114e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1151>: Abbrev Number: 9 (DW_TAG_member)
