Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1738 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x506): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x114): mpers-mx32/struct_statfs64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe94): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3d4): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x100b): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x997): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xde7): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4a3): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x89d): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xee5): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8cd): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7a8): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb71): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xba7): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xcf3): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 6 (DW_TAG_array_type)
    <bb>   DW_AT_type        : <0x64>
    <bf>   DW_AT_sibling     : <0xca>
 <2><c3>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c4>   DW_AT_type        : <0x2b>
    <c8>   DW_AT_upper_bound : 1
 <2><c9>: Abbrev Number: 0
 <1><ca>: Abbrev Number: 4 (DW_TAG_typedef)
    <cb>   DW_AT_name        : (indirect string, offset: 0xc68): __time_t
    <cf>   DW_AT_decl_file   : 1
    <d0>   DW_AT_decl_line   : 160
    <d1>   DW_AT_decl_column : 26
    <d2>   DW_AT_type        : <0x7c>
 <1><d6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d7>   DW_AT_byte_size   : 4
 <1><d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <d9>   DW_AT_type        : <0xd6>
 <1><dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <de>   DW_AT_name        : (indirect string, offset: 0x420): __syscall_slong_t
    <e2>   DW_AT_decl_file   : 1
    <e3>   DW_AT_decl_line   : 196
    <e4>   DW_AT_decl_column : 33
    <e5>   DW_AT_type        : <0x7c>
 <1><e9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ea>   DW_AT_byte_size   : 4
    <eb>   DW_AT_type        : <0xef>
 <1><ef>: Abbrev Number: 2 (DW_TAG_base_type)
    <f0>   DW_AT_byte_size   : 1
    <f1>   DW_AT_encoding    : 6	(signed char)
    <f2>   DW_AT_name        : (indirect string, offset: 0x46c): char
 <1><f6>: Abbrev Number: 3 (DW_TAG_const_type)
    <f7>   DW_AT_type        : <0xef>
 <1><fb>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc>   DW_AT_name        : (indirect string, offset: 0x37d): uint8_t
    <100>   DW_AT_decl_file   : 2
    <101>   DW_AT_decl_line   : 24
    <102>   DW_AT_decl_column : 19
    <103>   DW_AT_type        : <0x45>
 <1><107>: Abbrev Number: 4 (DW_TAG_typedef)
    <108>   DW_AT_name        : (indirect string, offset: 0xb92): uint16_t
    <10c>   DW_AT_decl_file   : 2
    <10d>   DW_AT_decl_line   : 25
    <10e>   DW_AT_decl_column : 20
    <10f>   DW_AT_type        : <0x58>
 <1><113>: Abbrev Number: 4 (DW_TAG_typedef)
    <114>   DW_AT_name        : (indirect string, offset: 0xf8d): uint32_t
    <118>   DW_AT_decl_file   : 2
    <119>   DW_AT_decl_line   : 26
    <11a>   DW_AT_decl_column : 20
    <11b>   DW_AT_type        : <0x70>
 <1><11f>: Abbrev Number: 4 (DW_TAG_typedef)
    <120>   DW_AT_name        : (indirect string, offset: 0xdf7): uint64_t
    <124>   DW_AT_decl_file   : 2
    <125>   DW_AT_decl_line   : 27
    <126>   DW_AT_decl_column : 20
    <127>   DW_AT_type        : <0x8f>
 <1><12b>: Abbrev Number: 2 (DW_TAG_base_type)
    <12c>   DW_AT_byte_size   : 4
    <12d>   DW_AT_encoding    : 5	(signed)
    <12e>   DW_AT_name        : (indirect string, offset: 0x2ed): long int
 <1><132>: Abbrev Number: 4 (DW_TAG_typedef)
    <133>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <137>   DW_AT_decl_file   : 3
    <138>   DW_AT_decl_line   : 209
    <139>   DW_AT_decl_column : 23
    <13a>   DW_AT_type        : <0x2b>
 <1><13e>: Abbrev Number: 3 (DW_TAG_const_type)
    <13f>   DW_AT_type        : <0x132>
 <1><143>: Abbrev Number: 10 (DW_TAG_structure_type)
    <144>   DW_AT_name        : (indirect string, offset: 0xb08): timespec
    <148>   DW_AT_byte_size   : 16
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 10
    <14b>   DW_AT_decl_column : 8
    <14c>   DW_AT_sibling     : <0x16f>
 <2><150>: Abbrev Number: 11 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x10d8): tv_sec
    <155>   DW_AT_decl_file   : 4
    <156>   DW_AT_decl_line   : 12
    <157>   DW_AT_decl_column : 12
    <158>   DW_AT_type        : <0xca>
    <15c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15f>: Abbrev Number: 11 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xe1d): tv_nsec
    <164>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 16
    <166>   DW_AT_decl_column : 21
    <167>   DW_AT_type        : <0xdd>
    <16b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 16
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xaca): long double
 <1><176>: Abbrev Number: 12 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x2a4): __environ
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 543
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x185>
    <183>   DW_AT_external    : 1
    <184>   DW_AT_declaration : 1
 <1><185>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 4
    <187>   DW_AT_type        : <0xe9>
 <1><18b>: Abbrev Number: 12 (DW_TAG_variable)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3cc): environ
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 545
    <193>   DW_AT_decl_column : 15
    <194>   DW_AT_type        : <0x185>
    <198>   DW_AT_external    : 1
    <199>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 13 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0xfe4): optarg
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 36
    <1a1>   DW_AT_decl_column : 14
    <1a2>   DW_AT_type        : <0xe9>
    <1a6>   DW_AT_external    : 1
    <1a7>   DW_AT_declaration : 1
 <1><1a8>: Abbrev Number: 13 (DW_TAG_variable)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x77b): optind
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 50
    <1af>   DW_AT_decl_column : 12
    <1b0>   DW_AT_type        : <0x64>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 13 (DW_TAG_variable)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xc57): opterr
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 55
    <1bd>   DW_AT_decl_column : 12
    <1be>   DW_AT_type        : <0x64>
    <1c2>   DW_AT_external    : 1
    <1c3>   DW_AT_declaration : 1
 <1><1c4>: Abbrev Number: 13 (DW_TAG_variable)
    <1c5>   DW_AT_name        : (indirect string, offset: 0xb57): optopt
    <1c9>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 59
    <1cb>   DW_AT_decl_column : 12
    <1cc>   DW_AT_type        : <0x64>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1d3>   DW_AT_byte_size   : 4
    <1d4>   DW_AT_type        : <0xf6>
 <1><1d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d9>   DW_AT_type        : <0x1d2>
 <1><1dd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1e4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x385): _IO_FILE
    <1e9>   DW_AT_byte_size   : 152
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 49
    <1ec>   DW_AT_decl_column : 8
    <1ed>   DW_AT_sibling     : <0x3a5>
 <2><1f1>: Abbrev Number: 11 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0xa1c): _flags
    <1f6>   DW_AT_decl_file   : 7
    <1f7>   DW_AT_decl_line   : 51
    <1f8>   DW_AT_decl_column : 7
    <1f9>   DW_AT_type        : <0x64>
    <1fd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><200>: Abbrev Number: 11 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x4f9): _IO_read_ptr
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 54
    <207>   DW_AT_decl_column : 9
    <208>   DW_AT_type        : <0xe9>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20f>: Abbrev Number: 11 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0xf3a): _IO_read_end
    <214>   DW_AT_decl_file   : 7
    <215>   DW_AT_decl_line   : 55
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xe9>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21e>: Abbrev Number: 11 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x7e4): _IO_read_base
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xe9>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><22d>: Abbrev Number: 11 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x148): _IO_write_base
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 57
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xe9>
    <239>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23c>: Abbrev Number: 11 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x1044): _IO_write_ptr
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 58
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xe9>
    <248>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24b>: Abbrev Number: 11 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x90f): _IO_write_end
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 59
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xe9>
    <257>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25a>: Abbrev Number: 11 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x980): _IO_buf_base
    <25f>   DW_AT_decl_file   : 7
    <260>   DW_AT_decl_line   : 60
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xe9>
    <266>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><269>: Abbrev Number: 11 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xd8b): _IO_buf_end
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 61
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xe9>
    <275>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><278>: Abbrev Number: 11 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x1f3): _IO_save_base
    <27d>   DW_AT_decl_file   : 7
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xe9>
    <284>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><287>: Abbrev Number: 11 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xcba): _IO_backup_base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 65
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xe9>
    <293>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><296>: Abbrev Number: 11 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 66
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xe9>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a5>: Abbrev Number: 11 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x627): _markers
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 68
    <2ac>   DW_AT_decl_column : 22
    <2ad>   DW_AT_type        : <0x3bf>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b4>: Abbrev Number: 11 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x236): _chain
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 70
    <2bb>   DW_AT_decl_column : 20
    <2bc>   DW_AT_type        : <0x3c5>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c3>: Abbrev Number: 11 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0xfb3): _fileno
    <2c8>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 72
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x64>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d2>: Abbrev Number: 11 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x7d0): _flags2
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 73
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e1>: Abbrev Number: 11 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x849): _old_offset
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 74
    <2e8>   DW_AT_decl_column : 11
    <2e9>   DW_AT_type        : <0xa2>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f0>: Abbrev Number: 11 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x264): _cur_column
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 77
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x24>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ff>: Abbrev Number: 11 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xe43): _vtable_offset
    <304>   DW_AT_decl_file   : 7
    <305>   DW_AT_decl_line   : 78
    <306>   DW_AT_decl_column : 15
    <307>   DW_AT_type        : <0x3e>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30e>: Abbrev Number: 11 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xcca): _shortbuf
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 79
    <315>   DW_AT_decl_column : 8
    <316>   DW_AT_type        : <0x3cb>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><31d>: Abbrev Number: 11 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x19b): _lock
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 81
    <324>   DW_AT_decl_column : 15
    <325>   DW_AT_type        : <0x3db>
    <329>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><32c>: Abbrev Number: 11 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x713): _offset
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 89
    <333>   DW_AT_decl_column : 13
    <334>   DW_AT_type        : <0xae>
    <338>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><33b>: Abbrev Number: 11 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xa5c): _codecvt
    <340>   DW_AT_decl_file   : 7
    <341>   DW_AT_decl_line   : 91
    <342>   DW_AT_decl_column : 23
    <343>   DW_AT_type        : <0x3e7>
    <347>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><34a>: Abbrev Number: 11 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xfc8): _wide_data
    <34f>   DW_AT_decl_file   : 7
    <350>   DW_AT_decl_line   : 92
    <351>   DW_AT_decl_column : 25
    <352>   DW_AT_type        : <0x3f3>
    <356>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><359>: Abbrev Number: 11 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x3f0): _freeres_list
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 93
    <360>   DW_AT_decl_column : 20
    <361>   DW_AT_type        : <0x3c5>
    <365>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><368>: Abbrev Number: 11 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xc2d): _freeres_buf
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 94
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_type        : <0xd6>
    <374>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><377>: Abbrev Number: 11 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x9d5): __pad5
    <37c>   DW_AT_decl_file   : 7
    <37d>   DW_AT_decl_line   : 95
    <37e>   DW_AT_decl_column : 10
    <37f>   DW_AT_type        : <0x132>
    <383>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><386>: Abbrev Number: 11 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0xa40): _mode
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 96
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x64>
    <392>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><395>: Abbrev Number: 11 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x7fe): _unused2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 98
    <39c>   DW_AT_decl_column : 8
    <39d>   DW_AT_type        : <0x3f9>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xaea): FILE
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 7
    <3ac>   DW_AT_decl_column : 25
    <3ad>   DW_AT_type        : <0x1e4>
 <1><3b1>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x498): _IO_lock_t
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 43
    <3b8>   DW_AT_decl_column : 14
 <1><3b9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x32f): _IO_marker
    <3be>   DW_AT_declaration : 1
 <1><3bf>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c1>   DW_AT_type        : <0x3b9>
 <1><3c5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c6>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x1e4>
 <1><3cb>: Abbrev Number: 6 (DW_TAG_array_type)
    <3cc>   DW_AT_type        : <0xef>
    <3d0>   DW_AT_sibling     : <0x3db>
 <2><3d4>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3d5>   DW_AT_type        : <0x2b>
    <3d9>   DW_AT_upper_bound : 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3b1>
 <1><3e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3e6>   DW_AT_declaration : 1
 <1><3e7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3e8>   DW_AT_byte_size   : 4
    <3e9>   DW_AT_type        : <0x3e1>
 <1><3ed>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x399): _IO_wide_data
    <3f2>   DW_AT_declaration : 1
 <1><3f3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3f4>   DW_AT_byte_size   : 4
    <3f5>   DW_AT_type        : <0x3ed>
 <1><3f9>: Abbrev Number: 6 (DW_TAG_array_type)
    <3fa>   DW_AT_type        : <0xef>
    <3fe>   DW_AT_sibling     : <0x409>
 <2><402>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <403>   DW_AT_type        : <0x2b>
    <407>   DW_AT_upper_bound : 39
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 13 (DW_TAG_variable)
    <40a>   DW_AT_name        : (indirect string, offset: 0x5de): stdin
    <40e>   DW_AT_decl_file   : 9
    <40f>   DW_AT_decl_line   : 137
    <410>   DW_AT_decl_column : 14
    <411>   DW_AT_type        : <0x417>
    <415>   DW_AT_external    : 1
    <416>   DW_AT_declaration : 1
 <1><417>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <418>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3a5>
 <1><41d>: Abbrev Number: 13 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x101e): stdout
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 138
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x417>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 13 (DW_TAG_variable)
    <42c>   DW_AT_name        : (indirect string, offset: 0xde0): stderr
    <430>   DW_AT_decl_file   : 9
    <431>   DW_AT_decl_line   : 139
    <432>   DW_AT_decl_column : 14
    <433>   DW_AT_type        : <0x417>
    <437>   DW_AT_external    : 1
    <438>   DW_AT_declaration : 1
 <1><439>: Abbrev Number: 13 (DW_TAG_variable)
    <43a>   DW_AT_name        : (indirect string, offset: 0x276): sys_nerr
    <43e>   DW_AT_decl_file   : 10
    <43f>   DW_AT_decl_line   : 26
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0x64>
    <445>   DW_AT_external    : 1
    <446>   DW_AT_declaration : 1
 <1><447>: Abbrev Number: 6 (DW_TAG_array_type)
    <448>   DW_AT_type        : <0x1d8>
    <44c>   DW_AT_sibling     : <0x452>
 <2><450>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 3 (DW_TAG_const_type)
    <453>   DW_AT_type        : <0x447>
 <1><457>: Abbrev Number: 13 (DW_TAG_variable)
    <458>   DW_AT_name        : (indirect string, offset: 0x5ed): sys_errlist
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 27
    <45e>   DW_AT_decl_column : 26
    <45f>   DW_AT_type        : <0x452>
    <463>   DW_AT_external    : 1
    <464>   DW_AT_declaration : 1
 <1><465>: Abbrev Number: 13 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x291): _sys_nerr
    <46a>   DW_AT_decl_file   : 10
    <46b>   DW_AT_decl_line   : 30
    <46c>   DW_AT_decl_column : 12
    <46d>   DW_AT_type        : <0x64>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 13 (DW_TAG_variable)
    <474>   DW_AT_name        : (indirect string, offset: 0xe62): _sys_errlist
    <478>   DW_AT_decl_file   : 10
    <479>   DW_AT_decl_line   : 31
    <47a>   DW_AT_decl_column : 26
    <47b>   DW_AT_type        : <0x452>
    <47f>   DW_AT_external    : 1
    <480>   DW_AT_declaration : 1
 <1><481>: Abbrev Number: 13 (DW_TAG_variable)
    <482>   DW_AT_name        : (indirect string, offset: 0x6ec): program_invocation_name
    <486>   DW_AT_decl_file   : 11
    <487>   DW_AT_decl_line   : 45
    <488>   DW_AT_decl_column : 14
    <489>   DW_AT_type        : <0xe9>
    <48d>   DW_AT_external    : 1
    <48e>   DW_AT_declaration : 1
 <1><48f>: Abbrev Number: 13 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0xbd2): program_invocation_short_name
    <494>   DW_AT_decl_file   : 11
    <495>   DW_AT_decl_line   : 46
    <496>   DW_AT_decl_column : 14
    <497>   DW_AT_type        : <0xe9>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 6 (DW_TAG_array_type)
    <49e>   DW_AT_type        : <0xe9>
    <4a2>   DW_AT_sibling     : <0x4ad>
 <2><4a6>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4a7>   DW_AT_type        : <0x2b>
    <4ab>   DW_AT_upper_bound : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 13 (DW_TAG_variable)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1e0): __tzname
    <4b2>   DW_AT_decl_file   : 12
    <4b3>   DW_AT_decl_line   : 159
    <4b4>   DW_AT_decl_column : 14
    <4b5>   DW_AT_type        : <0x49d>
    <4b9>   DW_AT_external    : 1
    <4ba>   DW_AT_declaration : 1
 <1><4bb>: Abbrev Number: 13 (DW_TAG_variable)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xecc): __daylight
    <4c0>   DW_AT_decl_file   : 12
    <4c1>   DW_AT_decl_line   : 160
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x64>
    <4c7>   DW_AT_external    : 1
    <4c8>   DW_AT_declaration : 1
 <1><4c9>: Abbrev Number: 13 (DW_TAG_variable)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x38e): __timezone
    <4ce>   DW_AT_decl_file   : 12
    <4cf>   DW_AT_decl_line   : 161
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x12b>
    <4d5>   DW_AT_external    : 1
    <4d6>   DW_AT_declaration : 1
 <1><4d7>: Abbrev Number: 13 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0x9ce): tzname
    <4dc>   DW_AT_decl_file   : 12
    <4dd>   DW_AT_decl_line   : 166
    <4de>   DW_AT_decl_column : 14
    <4df>   DW_AT_type        : <0x49d>
    <4e3>   DW_AT_external    : 1
    <4e4>   DW_AT_declaration : 1
 <1><4e5>: Abbrev Number: 13 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x108e): daylight
    <4ea>   DW_AT_decl_file   : 12
    <4eb>   DW_AT_decl_line   : 174
    <4ec>   DW_AT_decl_column : 12
    <4ed>   DW_AT_type        : <0x64>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 13 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x4dd): timezone
    <4f8>   DW_AT_decl_file   : 12
    <4f9>   DW_AT_decl_line   : 175
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x12b>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 12 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0xf61): getdate_err
    <506>   DW_AT_decl_file   : 12
    <507>   DW_AT_decl_line   : 274
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0x64>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 13 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0x9e1): debug_flag
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 20
    <517>   DW_AT_decl_column : 13
    <518>   DW_AT_type        : <0x51e>
    <51c>   DW_AT_external    : 1
    <51d>   DW_AT_declaration : 1
 <1><51e>: Abbrev Number: 2 (DW_TAG_base_type)
    <51f>   DW_AT_byte_size   : 1
    <520>   DW_AT_encoding    : 2	(boolean)
    <521>   DW_AT_name        : (indirect string, offset: 0x432): _Bool
 <1><525>: Abbrev Number: 3 (DW_TAG_const_type)
    <526>   DW_AT_type        : <0x51e>
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0xaa0): __kernel_long_t
    <52f>   DW_AT_decl_file   : 14
    <530>   DW_AT_decl_line   : 14
    <531>   DW_AT_decl_column : 19
    <532>   DW_AT_type        : <0x88>
 <1><536>: Abbrev Number: 4 (DW_TAG_typedef)
    <537>   DW_AT_name        : (indirect string, offset: 0x5cd): __kernel_ulong_t
    <53b>   DW_AT_decl_file   : 14
    <53c>   DW_AT_decl_line   : 15
    <53d>   DW_AT_decl_column : 28
    <53e>   DW_AT_type        : <0x9b>
 <1><542>: Abbrev Number: 18 (DW_TAG_structure_type)
    <543>   DW_AT_byte_size   : 8
    <544>   DW_AT_decl_file   : 15
    <545>   DW_AT_decl_line   : 79
    <546>   DW_AT_decl_column : 9
    <547>   DW_AT_sibling     : <0x55b>
 <2><54b>: Abbrev Number: 19 (DW_TAG_member)
    <54c>   DW_AT_name        : val
    <550>   DW_AT_decl_file   : 15
    <551>   DW_AT_decl_line   : 80
    <552>   DW_AT_decl_column : 6
    <553>   DW_AT_type        : <0xba>
    <557>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><55a>: Abbrev Number: 0
 <1><55b>: Abbrev Number: 4 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xe52): __kernel_fsid_t
    <560>   DW_AT_decl_file   : 15
    <561>   DW_AT_decl_line   : 81
    <562>   DW_AT_decl_column : 3
    <563>   DW_AT_type        : <0x542>
 <1><567>: Abbrev Number: 4 (DW_TAG_typedef)
    <568>   DW_AT_name        : (indirect string, offset: 0x3fe): kernel_long_t
    <56c>   DW_AT_decl_file   : 16
    <56d>   DW_AT_decl_line   : 16
    <56e>   DW_AT_decl_column : 25
    <56f>   DW_AT_type        : <0x52a>
 <1><573>: Abbrev Number: 4 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x8be): kernel_ulong_t
    <578>   DW_AT_decl_file   : 16
    <579>   DW_AT_decl_line   : 17
    <57a>   DW_AT_decl_column : 26
    <57b>   DW_AT_type        : <0x536>
 <1><57f>: Abbrev Number: 3 (DW_TAG_const_type)
    <580>   DW_AT_type        : <0x573>
 <1><584>: Abbrev Number: 10 (DW_TAG_structure_type)
    <585>   DW_AT_name        : (indirect string, offset: 0xbf0): list_item
    <589>   DW_AT_byte_size   : 8
    <58a>   DW_AT_decl_file   : 17
    <58b>   DW_AT_decl_line   : 92
    <58c>   DW_AT_decl_column : 8
    <58d>   DW_AT_sibling     : <0x5b0>
 <2><591>: Abbrev Number: 11 (DW_TAG_member)
    <592>   DW_AT_name        : (indirect string, offset: 0x10d3): prev
    <596>   DW_AT_decl_file   : 17
    <597>   DW_AT_decl_line   : 93
    <598>   DW_AT_decl_column : 20
    <599>   DW_AT_type        : <0x5b0>
    <59d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a0>: Abbrev Number: 11 (DW_TAG_member)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x10c9): next
    <5a5>   DW_AT_decl_file   : 17
    <5a6>   DW_AT_decl_line   : 94
    <5a7>   DW_AT_decl_column : 20
    <5a8>   DW_AT_type        : <0x5b0>
    <5ac>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5af>: Abbrev Number: 0
 <1><5b0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5b1>   DW_AT_byte_size   : 4
    <5b2>   DW_AT_type        : <0x584>
 <1><5b6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x896): sysent
    <5bb>   DW_AT_byte_size   : 20
    <5bc>   DW_AT_decl_file   : 18
    <5bd>   DW_AT_decl_line   : 13
    <5be>   DW_AT_decl_column : 16
    <5bf>   DW_AT_sibling     : <0x60f>
 <2><5c3>: Abbrev Number: 11 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x1035): nargs
    <5c8>   DW_AT_decl_file   : 18
    <5c9>   DW_AT_decl_line   : 14
    <5ca>   DW_AT_decl_column : 11
    <5cb>   DW_AT_type        : <0x2b>
    <5cf>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d2>: Abbrev Number: 11 (DW_TAG_member)
    <5d3>   DW_AT_name        : (indirect string, offset: 0x98d): sys_flags
    <5d7>   DW_AT_decl_file   : 18
    <5d8>   DW_AT_decl_line   : 15
    <5d9>   DW_AT_decl_column : 6
    <5da>   DW_AT_type        : <0x64>
    <5de>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e1>: Abbrev Number: 19 (DW_TAG_member)
    <5e2>   DW_AT_name        : sen
    <5e6>   DW_AT_decl_file   : 18
    <5e7>   DW_AT_decl_line   : 16
    <5e8>   DW_AT_decl_column : 6
    <5e9>   DW_AT_type        : <0x64>
    <5ed>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f0>: Abbrev Number: 11 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x326): sys_func
    <5f5>   DW_AT_decl_file   : 18
    <5f6>   DW_AT_decl_line   : 17
    <5f7>   DW_AT_decl_column : 8
    <5f8>   DW_AT_type        : <0x87c>
    <5fc>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ff>: Abbrev Number: 11 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0x29b): sys_name
    <604>   DW_AT_decl_file   : 18
    <605>   DW_AT_decl_line   : 18
    <606>   DW_AT_decl_column : 14
    <607>   DW_AT_type        : <0x1d2>
    <60b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><60e>: Abbrev Number: 0
 <1><60f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <610>   DW_AT_prototyped  : 1
    <611>   DW_AT_type        : <0x64>
    <615>   DW_AT_sibling     : <0x61f>
 <2><619>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <61a>   DW_AT_type        : <0x61f>
 <2><61e>: Abbrev Number: 0
 <1><61f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <620>   DW_AT_byte_size   : 4
    <621>   DW_AT_type        : <0x62a>
 <1><625>: Abbrev Number: 3 (DW_TAG_const_type)
    <626>   DW_AT_type        : <0x61f>
 <1><62a>: Abbrev Number: 22 (DW_TAG_structure_type)
    <62b>   DW_AT_name        : tcb
    <62f>   DW_AT_byte_size   : 288
    <631>   DW_AT_decl_file   : 19
    <632>   DW_AT_decl_line   : 262
    <634>   DW_AT_decl_column : 8
    <635>   DW_AT_sibling     : <0x87c>
 <2><639>: Abbrev Number: 23 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0x4f3): flags
    <63e>   DW_AT_decl_file   : 19
    <63f>   DW_AT_decl_line   : 263
    <641>   DW_AT_decl_column : 6
    <642>   DW_AT_type        : <0x64>
    <646>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><649>: Abbrev Number: 24 (DW_TAG_member)
    <64a>   DW_AT_name        : pid
    <64e>   DW_AT_decl_file   : 19
    <64f>   DW_AT_decl_line   : 264
    <651>   DW_AT_decl_column : 6
    <652>   DW_AT_type        : <0x64>
    <656>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><659>: Abbrev Number: 23 (DW_TAG_member)
    <65a>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <65e>   DW_AT_decl_file   : 19
    <65f>   DW_AT_decl_line   : 265
    <661>   DW_AT_decl_column : 6
    <662>   DW_AT_type        : <0x64>
    <666>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><669>: Abbrev Number: 23 (DW_TAG_member)
    <66a>   DW_AT_name        : (indirect string, offset: 0x3b8): currpers
    <66e>   DW_AT_decl_file   : 19
    <66f>   DW_AT_decl_line   : 267
    <671>   DW_AT_decl_column : 15
    <672>   DW_AT_type        : <0x2b>
    <676>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><679>: Abbrev Number: 23 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0xb45): u_error
    <67e>   DW_AT_decl_file   : 19
    <67f>   DW_AT_decl_line   : 269
    <681>   DW_AT_decl_column : 16
    <682>   DW_AT_type        : <0x37>
    <686>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><689>: Abbrev Number: 23 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x1b8): scno
    <68e>   DW_AT_decl_file   : 19
    <68f>   DW_AT_decl_line   : 270
    <691>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0x573>
    <696>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><699>: Abbrev Number: 23 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0xb88): true_scno
    <69e>   DW_AT_decl_file   : 19
    <69f>   DW_AT_decl_line   : 271
    <6a1>   DW_AT_decl_column : 17
    <6a2>   DW_AT_type        : <0x573>
    <6a6>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6a9>: Abbrev Number: 23 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x1c2): u_arg
    <6ae>   DW_AT_decl_file   : 19
    <6af>   DW_AT_decl_line   : 272
    <6b1>   DW_AT_decl_column : 17
    <6b2>   DW_AT_type        : <0x9ac>
    <6b6>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6b9>: Abbrev Number: 23 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9a4): u_rval
    <6be>   DW_AT_decl_file   : 19
    <6bf>   DW_AT_decl_line   : 273
    <6c1>   DW_AT_decl_column : 16
    <6c2>   DW_AT_type        : <0x567>
    <6c6>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6c9>: Abbrev Number: 23 (DW_TAG_member)
    <6ca>   DW_AT_name        : (indirect string, offset: 0xabc): sys_func_rval
    <6ce>   DW_AT_decl_file   : 19
    <6cf>   DW_AT_decl_line   : 274
    <6d1>   DW_AT_decl_column : 6
    <6d2>   DW_AT_type        : <0x64>
    <6d6>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6d9>: Abbrev Number: 23 (DW_TAG_member)
    <6da>   DW_AT_name        : (indirect string, offset: 0xce4): curcol
    <6de>   DW_AT_decl_file   : 19
    <6df>   DW_AT_decl_line   : 275
    <6e1>   DW_AT_decl_column : 6
    <6e2>   DW_AT_type        : <0x64>
    <6e6>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6e9>: Abbrev Number: 23 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x9b6): outf
    <6ee>   DW_AT_decl_file   : 19
    <6ef>   DW_AT_decl_line   : 276
    <6f1>   DW_AT_decl_column : 8
    <6f2>   DW_AT_type        : <0x417>
    <6f6>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6f9>: Abbrev Number: 23 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xf0b): staged_output_data
    <6fe>   DW_AT_decl_file   : 19
    <6ff>   DW_AT_decl_line   : 277
    <701>   DW_AT_decl_column : 29
    <702>   DW_AT_type        : <0x9c2>
    <706>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><709>: Abbrev Number: 23 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0xa87): auxstr
    <70e>   DW_AT_decl_file   : 19
    <70f>   DW_AT_decl_line   : 279
    <711>   DW_AT_decl_column : 14
    <712>   DW_AT_type        : <0x1d2>
    <716>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><719>: Abbrev Number: 23 (DW_TAG_member)
    <71a>   DW_AT_name        : (indirect string, offset: 0x1a1): _priv_data
    <71e>   DW_AT_decl_file   : 19
    <71f>   DW_AT_decl_line   : 280
    <721>   DW_AT_decl_column : 8
    <722>   DW_AT_type        : <0xd6>
    <726>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><729>: Abbrev Number: 23 (DW_TAG_member)
    <72a>   DW_AT_name        : (indirect string, offset: 0xc1d): _free_priv_data
    <72e>   DW_AT_decl_file   : 19
    <72f>   DW_AT_decl_line   : 281
    <731>   DW_AT_decl_column : 9
    <732>   DW_AT_type        : <0x9d4>
    <736>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><739>: Abbrev Number: 23 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0x1b2): s_ent
    <73e>   DW_AT_decl_file   : 19
    <73f>   DW_AT_decl_line   : 282
    <741>   DW_AT_decl_column : 23
    <742>   DW_AT_type        : <0x9da>
    <746>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><749>: Abbrev Number: 23 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <74e>   DW_AT_decl_file   : 19
    <74f>   DW_AT_decl_line   : 285
    <751>   DW_AT_decl_column : 23
    <752>   DW_AT_type        : <0x9da>
    <756>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><75a>: Abbrev Number: 23 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x3ad): inject_vec
    <75f>   DW_AT_decl_file   : 19
    <760>   DW_AT_decl_line   : 286
    <762>   DW_AT_decl_column : 22
    <763>   DW_AT_type        : <0x9e5>
    <767>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><76b>: Abbrev Number: 23 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x807): stime
    <770>   DW_AT_decl_file   : 19
    <771>   DW_AT_decl_line   : 287
    <773>   DW_AT_decl_column : 18
    <774>   DW_AT_type        : <0x143>
    <778>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><77c>: Abbrev Number: 23 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x3c1): ltime
    <781>   DW_AT_decl_file   : 19
    <782>   DW_AT_decl_line   : 288
    <784>   DW_AT_decl_column : 18
    <785>   DW_AT_type        : <0x143>
    <789>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><78d>: Abbrev Number: 23 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0xffc): atime
    <792>   DW_AT_decl_file   : 19
    <793>   DW_AT_decl_line   : 289
    <795>   DW_AT_decl_column : 18
    <796>   DW_AT_type        : <0x143>
    <79a>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><79e>: Abbrev Number: 23 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0x4ed): etime
    <7a3>   DW_AT_decl_file   : 19
    <7a4>   DW_AT_decl_line   : 290
    <7a6>   DW_AT_decl_column : 18
    <7a7>   DW_AT_type        : <0x143>
    <7ab>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7af>: Abbrev Number: 23 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xd48): delay_expiration_time
    <7b4>   DW_AT_decl_file   : 19
    <7b5>   DW_AT_decl_line   : 291
    <7b7>   DW_AT_decl_column : 18
    <7b8>   DW_AT_type        : <0x143>
    <7bc>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7c0>: Abbrev Number: 23 (DW_TAG_member)
    <7c1>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7c5>   DW_AT_decl_file   : 19
    <7c6>   DW_AT_decl_line   : 298
    <7c8>   DW_AT_decl_column : 15
    <7c9>   DW_AT_type        : <0x2b>
    <7cd>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7d1>: Abbrev Number: 23 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0xf47): last_dirfd
    <7d6>   DW_AT_decl_file   : 19
    <7d7>   DW_AT_decl_line   : 301
    <7d9>   DW_AT_decl_column : 6
    <7da>   DW_AT_type        : <0x64>
    <7de>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7e2>: Abbrev Number: 23 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xf6d): mmap_cache
    <7e7>   DW_AT_decl_file   : 19
    <7e8>   DW_AT_decl_line   : 304
    <7ea>   DW_AT_decl_column : 23
    <7eb>   DW_AT_type        : <0xa01>
    <7ef>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7f3>: Abbrev Number: 23 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0xb5e): wait_data_idx
    <7f8>   DW_AT_decl_file   : 19
    <7f9>   DW_AT_decl_line   : 311
    <7fb>   DW_AT_decl_column : 9
    <7fc>   DW_AT_type        : <0x132>
    <800>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><804>: Abbrev Number: 23 (DW_TAG_member)
    <805>   DW_AT_name        : (indirect string, offset: 0xa8e): delayed_wait_data
    <809>   DW_AT_decl_file   : 19
    <80a>   DW_AT_decl_line   : 313
    <80c>   DW_AT_decl_column : 24
    <80d>   DW_AT_type        : <0xa0d>
    <811>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><815>: Abbrev Number: 23 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0xafe): wait_list
    <81a>   DW_AT_decl_file   : 19
    <81b>   DW_AT_decl_line   : 314
    <81d>   DW_AT_decl_column : 19
    <81e>   DW_AT_type        : <0x584>
    <822>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><826>: Abbrev Number: 23 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0x704): vcpu_info_list
    <82b>   DW_AT_decl_file   : 19
    <82c>   DW_AT_decl_line   : 318
    <82e>   DW_AT_decl_column : 20
    <82f>   DW_AT_type        : <0xa19>
    <833>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><837>: Abbrev Number: 23 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0xcaf): unwind_ctx
    <83c>   DW_AT_decl_file   : 19
    <83d>   DW_AT_decl_line   : 322
    <83f>   DW_AT_decl_column : 8
    <840>   DW_AT_type        : <0xd6>
    <844>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><848>: Abbrev Number: 23 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x4d0): unwind_queue
    <84d>   DW_AT_decl_file   : 19
    <84e>   DW_AT_decl_line   : 323
    <850>   DW_AT_decl_column : 25
    <851>   DW_AT_type        : <0xa25>
    <855>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><859>: Abbrev Number: 23 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x196): comm
    <85e>   DW_AT_decl_file   : 19
    <85f>   DW_AT_decl_line   : 327
    <861>   DW_AT_decl_column : 7
    <862>   DW_AT_type        : <0xa2b>
    <866>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><86a>: Abbrev Number: 23 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x246): start_prc
    <86f>   DW_AT_decl_file   : 19
    <870>   DW_AT_decl_line   : 329
    <872>   DW_AT_decl_column : 16
    <873>   DW_AT_type        : <0x37>
    <877>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><87b>: Abbrev Number: 0
 <1><87c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <87d>   DW_AT_byte_size   : 4
    <87e>   DW_AT_type        : <0x60f>
 <1><882>: Abbrev Number: 4 (DW_TAG_typedef)
    <883>   DW_AT_name        : (indirect string, offset: 0x5bf): struct_sysent
    <887>   DW_AT_decl_file   : 18
    <888>   DW_AT_decl_line   : 19
    <889>   DW_AT_decl_column : 3
    <88a>   DW_AT_type        : <0x5b6>
 <1><88e>: Abbrev Number: 3 (DW_TAG_const_type)
    <88f>   DW_AT_type        : <0x882>
 <1><893>: Abbrev Number: 13 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0xd34): current_personality
    <898>   DW_AT_decl_file   : 19
    <899>   DW_AT_decl_line   : 158
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x2b>
    <89f>   DW_AT_external    : 1
    <8a0>   DW_AT_declaration : 1
 <1><8a1>: Abbrev Number: 13 (DW_TAG_variable)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x838): current_wordsize
    <8a6>   DW_AT_decl_file   : 19
    <8a7>   DW_AT_decl_line   : 171
    <8a8>   DW_AT_decl_column : 17
    <8a9>   DW_AT_type        : <0x2b>
    <8ad>   DW_AT_external    : 1
    <8ae>   DW_AT_declaration : 1
 <1><8af>: Abbrev Number: 13 (DW_TAG_variable)
    <8b0>   DW_AT_name        : (indirect string, offset: 0xa65): current_klongsize
    <8b4>   DW_AT_decl_file   : 19
    <8b5>   DW_AT_decl_line   : 176
    <8b6>   DW_AT_decl_column : 17
    <8b7>   DW_AT_type        : <0x2b>
    <8bb>   DW_AT_external    : 1
    <8bc>   DW_AT_declaration : 1
 <1><8bd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8be>   DW_AT_name        : (indirect string, offset: 0xc86): ioctlent
    <8c2>   DW_AT_byte_size   : 8
    <8c3>   DW_AT_decl_file   : 19
    <8c4>   DW_AT_decl_line   : 217
    <8c5>   DW_AT_decl_column : 16
    <8c6>   DW_AT_sibling     : <0x8e9>
 <2><8ca>: Abbrev Number: 11 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xf33): symbol
    <8cf>   DW_AT_decl_file   : 19
    <8d0>   DW_AT_decl_line   : 218
    <8d1>   DW_AT_decl_column : 14
    <8d2>   DW_AT_type        : <0x1d2>
    <8d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d9>: Abbrev Number: 11 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0xcfd): code
    <8de>   DW_AT_decl_file   : 19
    <8df>   DW_AT_decl_line   : 219
    <8e0>   DW_AT_decl_column : 15
    <8e1>   DW_AT_type        : <0x2b>
    <8e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e8>: Abbrev Number: 0
 <1><8e9>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ea>   DW_AT_name        : (indirect string, offset: 0xc47): struct_ioctlent
    <8ee>   DW_AT_decl_file   : 19
    <8ef>   DW_AT_decl_line   : 220
    <8f0>   DW_AT_decl_column : 3
    <8f1>   DW_AT_type        : <0x8bd>
 <1><8f5>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f6>   DW_AT_type        : <0x8e9>
 <1><8fa>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x82c): inject_data
    <8ff>   DW_AT_byte_size   : 10
    <900>   DW_AT_decl_file   : 19
    <901>   DW_AT_decl_line   : 241
    <902>   DW_AT_decl_column : 8
    <903>   DW_AT_sibling     : <0x962>
 <2><907>: Abbrev Number: 11 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0x4f3): flags
    <90c>   DW_AT_decl_file   : 19
    <90d>   DW_AT_decl_line   : 242
    <90e>   DW_AT_decl_column : 10
    <90f>   DW_AT_type        : <0xfb>
    <913>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><916>: Abbrev Number: 11 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0x941): signo
    <91b>   DW_AT_decl_file   : 19
    <91c>   DW_AT_decl_line   : 243
    <91d>   DW_AT_decl_column : 10
    <91e>   DW_AT_type        : <0xfb>
    <922>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><925>: Abbrev Number: 11 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x10b): rval_idx
    <92a>   DW_AT_decl_file   : 19
    <92b>   DW_AT_decl_line   : 244
    <92c>   DW_AT_decl_column : 11
    <92d>   DW_AT_type        : <0x107>
    <931>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><934>: Abbrev Number: 11 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0xcda): delay_idx
    <939>   DW_AT_decl_file   : 19
    <93a>   DW_AT_decl_line   : 245
    <93b>   DW_AT_decl_column : 11
    <93c>   DW_AT_type        : <0x107>
    <940>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><943>: Abbrev Number: 11 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0x619): poke_idx
    <948>   DW_AT_decl_file   : 19
    <949>   DW_AT_decl_line   : 246
    <94a>   DW_AT_decl_column : 11
    <94b>   DW_AT_type        : <0x107>
    <94f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><952>: Abbrev Number: 11 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0x1b8): scno
    <957>   DW_AT_decl_file   : 19
    <958>   DW_AT_decl_line   : 247
    <959>   DW_AT_decl_column : 11
    <95a>   DW_AT_type        : <0x107>
    <95e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><961>: Abbrev Number: 0
 <1><962>: Abbrev Number: 10 (DW_TAG_structure_type)
    <963>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <967>   DW_AT_byte_size   : 16
    <968>   DW_AT_decl_file   : 19
    <969>   DW_AT_decl_line   : 250
    <96a>   DW_AT_decl_column : 8
    <96b>   DW_AT_sibling     : <0x9ac>
 <2><96f>: Abbrev Number: 11 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0xa3a): first
    <974>   DW_AT_decl_file   : 19
    <975>   DW_AT_decl_line   : 251
    <976>   DW_AT_decl_column : 11
    <977>   DW_AT_type        : <0x107>
    <97b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><97e>: Abbrev Number: 11 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0x10fc): last
    <983>   DW_AT_decl_file   : 19
    <984>   DW_AT_decl_line   : 252
    <985>   DW_AT_decl_column : 11
    <986>   DW_AT_type        : <0x107>
    <98a>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><98d>: Abbrev Number: 11 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0x3c7): step
    <992>   DW_AT_decl_file   : 19
    <993>   DW_AT_decl_line   : 253
    <994>   DW_AT_decl_column : 11
    <995>   DW_AT_type        : <0x107>
    <999>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><99c>: Abbrev Number: 11 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0x10ce): data
    <9a1>   DW_AT_decl_file   : 19
    <9a2>   DW_AT_decl_line   : 254
    <9a3>   DW_AT_decl_column : 21
    <9a4>   DW_AT_type        : <0x8fa>
    <9a8>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 6 (DW_TAG_array_type)
    <9ad>   DW_AT_type        : <0x573>
    <9b1>   DW_AT_sibling     : <0x9bc>
 <2><9b5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9b6>   DW_AT_type        : <0x2b>
    <9ba>   DW_AT_upper_bound : 5
 <2><9bb>: Abbrev Number: 0
 <1><9bc>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9bd>   DW_AT_name        : (indirect string, offset: 0xf0b): staged_output_data
    <9c1>   DW_AT_declaration : 1
 <1><9c2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9c3>   DW_AT_byte_size   : 4
    <9c4>   DW_AT_type        : <0x9bc>
 <1><9c8>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9c9>   DW_AT_prototyped  : 1
    <9ca>   DW_AT_sibling     : <0x9d4>
 <2><9ce>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9cf>   DW_AT_type        : <0xd6>
 <2><9d3>: Abbrev Number: 0
 <1><9d4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9c8>
 <1><9da>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9db>   DW_AT_byte_size   : 4
    <9dc>   DW_AT_type        : <0x88e>
 <1><9e0>: Abbrev Number: 3 (DW_TAG_const_type)
    <9e1>   DW_AT_type        : <0x9da>
 <1><9e5>: Abbrev Number: 6 (DW_TAG_array_type)
    <9e6>   DW_AT_type        : <0x9f5>
    <9ea>   DW_AT_sibling     : <0x9f5>
 <2><9ee>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9ef>   DW_AT_type        : <0x2b>
    <9f3>   DW_AT_upper_bound : 2
 <2><9f4>: Abbrev Number: 0
 <1><9f5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9f6>   DW_AT_byte_size   : 4
    <9f7>   DW_AT_type        : <0x962>
 <1><9fb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9fc>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <a00>   DW_AT_declaration : 1
 <1><a01>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9fb>
 <1><a07>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a08>   DW_AT_name        : (indirect string, offset: 0x3e2): tcb_wait_data
    <a0c>   DW_AT_declaration : 1
 <1><a0d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0xa07>
 <1><a13>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a14>   DW_AT_name        : (indirect string, offset: 0x18c): vcpu_info
    <a18>   DW_AT_declaration : 1
 <1><a19>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a1a>   DW_AT_byte_size   : 4
    <a1b>   DW_AT_type        : <0xa13>
 <1><a1f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a20>   DW_AT_name        : (indirect string, offset: 0xeef): unwind_queue_t
    <a24>   DW_AT_declaration : 1
 <1><a25>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_type        : <0xa1f>
 <1><a2b>: Abbrev Number: 6 (DW_TAG_array_type)
    <a2c>   DW_AT_type        : <0xef>
    <a30>   DW_AT_sibling     : <0xa3b>
 <2><a34>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a35>   DW_AT_type        : <0x2b>
    <a39>   DW_AT_upper_bound : 15
 <2><a3a>: Abbrev Number: 0
 <1><a3b>: Abbrev Number: 12 (DW_TAG_variable)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xb9b): stub_sysent
    <a40>   DW_AT_decl_file   : 19
    <a41>   DW_AT_decl_line   : 403
    <a43>   DW_AT_decl_column : 28
    <a44>   DW_AT_type        : <0x88e>
    <a48>   DW_AT_external    : 1
    <a49>   DW_AT_declaration : 1
 <1><a4a>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x10b1): xlat_type
    <a4f>   DW_AT_encoding    : 7	(unsigned)
    <a50>   DW_AT_byte_size   : 4
    <a51>   DW_AT_type        : <0x2b>
    <a55>   DW_AT_decl_file   : 20
    <a56>   DW_AT_decl_line   : 13
    <a57>   DW_AT_decl_column : 6
    <a58>   DW_AT_sibling     : <0xa6f>
 <2><a5c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x2f6): XT_NORMAL
    <a61>   DW_AT_const_value : 0
 <2><a62>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a63>   DW_AT_name        : (indirect string, offset: 0xc5e): XT_SORTED
    <a67>   DW_AT_const_value : 1
 <2><a68>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a69>   DW_AT_name        : (indirect string, offset: 0xdc0): XT_INDEXED
    <a6d>   DW_AT_const_value : 2
 <2><a6e>: Abbrev Number: 0
 <1><a6f>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a70>   DW_AT_name        : (indirect string, offset: 0xbc7): xlat_style
    <a74>   DW_AT_encoding    : 7	(unsigned)
    <a75>   DW_AT_byte_size   : 4
    <a76>   DW_AT_type        : <0x2b>
    <a7a>   DW_AT_decl_file   : 20
    <a7b>   DW_AT_decl_line   : 19
    <a7c>   DW_AT_decl_column : 6
    <a7d>   DW_AT_sibling     : <0xaac>
 <2><a81>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a86>   DW_AT_const_value : 0
 <2><a87>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0xbfa): XLAT_STYLE_RAW
    <a8c>   DW_AT_const_value : 1
 <2><a8d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x107c): XLAT_STYLE_ABBREV
    <a92>   DW_AT_const_value : 2
 <2><a93>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0x313): XLAT_STYLE_VERBOSE
    <a98>   DW_AT_const_value : 3
 <2><a99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a9e>   DW_AT_const_value : 0
 <2><a9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <aa4>   DW_AT_const_value : 4
 <2><aa5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x10eb): XLAT_STYLE_FMT_D
    <aaa>   DW_AT_const_value : 8
 <2><aab>: Abbrev Number: 0
 <1><aac>: Abbrev Number: 10 (DW_TAG_structure_type)
    <aad>   DW_AT_name        : (indirect string, offset: 0x344): xlat_data
    <ab1>   DW_AT_byte_size   : 16
    <ab2>   DW_AT_decl_file   : 20
    <ab3>   DW_AT_decl_line   : 51
    <ab4>   DW_AT_decl_column : 8
    <ab5>   DW_AT_sibling     : <0xad8>
 <2><ab9>: Abbrev Number: 19 (DW_TAG_member)
    <aba>   DW_AT_name        : val
    <abe>   DW_AT_decl_file   : 20
    <abf>   DW_AT_decl_line   : 52
    <ac0>   DW_AT_decl_column : 11
    <ac1>   DW_AT_type        : <0x11f>
    <ac5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac8>: Abbrev Number: 19 (DW_TAG_member)
    <ac9>   DW_AT_name        : str
    <acd>   DW_AT_decl_file   : 20
    <ace>   DW_AT_decl_line   : 53
    <acf>   DW_AT_decl_column : 14
    <ad0>   DW_AT_type        : <0x1d2>
    <ad4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad7>: Abbrev Number: 0
 <1><ad8>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad9>   DW_AT_type        : <0xaac>
 <1><add>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ade>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ae2>   DW_AT_byte_size   : 24
    <ae3>   DW_AT_decl_file   : 20
    <ae4>   DW_AT_decl_line   : 56
    <ae5>   DW_AT_decl_column : 8
    <ae6>   DW_AT_sibling     : <0xb36>
 <2><aea>: Abbrev Number: 11 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x10ce): data
    <aef>   DW_AT_decl_file   : 20
    <af0>   DW_AT_decl_line   : 57
    <af1>   DW_AT_decl_column : 26
    <af2>   DW_AT_type        : <0xb3b>
    <af6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af9>: Abbrev Number: 11 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x88a): flags_strsz
    <afe>   DW_AT_decl_file   : 20
    <aff>   DW_AT_decl_line   : 58
    <b00>   DW_AT_decl_column : 9
    <b01>   DW_AT_type        : <0x132>
    <b05>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b08>: Abbrev Number: 11 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0xb6c): size
    <b0d>   DW_AT_decl_file   : 20
    <b0e>   DW_AT_decl_line   : 59
    <b0f>   DW_AT_decl_column : 11
    <b10>   DW_AT_type        : <0x113>
    <b14>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b17>: Abbrev Number: 11 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x1bd): type
    <b1c>   DW_AT_decl_file   : 20
    <b1d>   DW_AT_decl_line   : 60
    <b1e>   DW_AT_decl_column : 17
    <b1f>   DW_AT_type        : <0xa4a>
    <b23>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b26>: Abbrev Number: 11 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0x758): flags_mask
    <b2b>   DW_AT_decl_file   : 20
    <b2c>   DW_AT_decl_line   : 61
    <b2d>   DW_AT_decl_column : 11
    <b2e>   DW_AT_type        : <0x11f>
    <b32>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b35>: Abbrev Number: 0
 <1><b36>: Abbrev Number: 3 (DW_TAG_const_type)
    <b37>   DW_AT_type        : <0xadd>
 <1><b3b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b3c>   DW_AT_byte_size   : 4
    <b3d>   DW_AT_type        : <0xad8>
 <1><b41>: Abbrev Number: 6 (DW_TAG_array_type)
    <b42>   DW_AT_type        : <0xb36>
    <b46>   DW_AT_sibling     : <0xb4c>
 <2><b4a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b4b>: Abbrev Number: 0
 <1><b4c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b4d>   DW_AT_type        : <0xb41>
 <1><b51>: Abbrev Number: 12 (DW_TAG_variable)
    <b52>   DW_AT_name        : (indirect string, offset: 0xe30): addrfams
    <b56>   DW_AT_decl_file   : 19
    <b57>   DW_AT_decl_line   : 409
    <b59>   DW_AT_decl_column : 26
    <b5a>   DW_AT_type        : <0xb4c>
    <b5e>   DW_AT_external    : 1
    <b5f>   DW_AT_declaration : 1
 <1><b60>: Abbrev Number: 12 (DW_TAG_variable)
    <b61>   DW_AT_name        : (indirect string, offset: 0xd0d): arp_hardware_types
    <b65>   DW_AT_decl_file   : 19
    <b66>   DW_AT_decl_line   : 410
    <b68>   DW_AT_decl_column : 26
    <b69>   DW_AT_type        : <0xb4c>
    <b6d>   DW_AT_external    : 1
    <b6e>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 12 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0x1002): at_flags
    <b74>   DW_AT_decl_file   : 19
    <b75>   DW_AT_decl_line   : 411
    <b77>   DW_AT_decl_column : 26
    <b78>   DW_AT_type        : <0xb4c>
    <b7c>   DW_AT_external    : 1
    <b7d>   DW_AT_declaration : 1
 <1><b7e>: Abbrev Number: 12 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x4ae): clocknames
    <b83>   DW_AT_decl_file   : 19
    <b84>   DW_AT_decl_line   : 412
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb4c>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 12 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0xfbb): dirent_types
    <b92>   DW_AT_decl_file   : 19
    <b93>   DW_AT_decl_line   : 413
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb4c>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 12 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x8db): ethernet_protocols
    <ba1>   DW_AT_decl_file   : 19
    <ba2>   DW_AT_decl_line   : 414
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb4c>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 12 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x66c): inet_protocols
    <bb0>   DW_AT_decl_file   : 19
    <bb1>   DW_AT_decl_line   : 415
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb4c>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 12 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x2e3): evdev_abs
    <bbf>   DW_AT_decl_file   : 19
    <bc0>   DW_AT_decl_line   : 416
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb4c>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 12 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0x74d): audit_arch
    <bce>   DW_AT_decl_file   : 19
    <bcf>   DW_AT_decl_line   : 417
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb4c>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 12 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bdd>   DW_AT_decl_file   : 19
    <bde>   DW_AT_decl_line   : 418
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb4c>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 12 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x48f): iffflags
    <bec>   DW_AT_decl_file   : 19
    <bed>   DW_AT_decl_line   : 419
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb4c>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 12 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xc09): ip_type_of_services
    <bfb>   DW_AT_decl_file   : 19
    <bfc>   DW_AT_decl_line   : 420
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb4c>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 12 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0x6e0): ipc_private
    <c0a>   DW_AT_decl_file   : 19
    <c0b>   DW_AT_decl_line   : 421
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb4c>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 12 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0x33a): msg_flags
    <c19>   DW_AT_decl_file   : 19
    <c1a>   DW_AT_decl_line   : 422
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb4c>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 12 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0x17a): netlink_protocols
    <c28>   DW_AT_decl_file   : 19
    <c29>   DW_AT_decl_line   : 423
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb4c>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 12 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0xf1e): nl_bridge_vlan_flags
    <c37>   DW_AT_decl_file   : 19
    <c38>   DW_AT_decl_line   : 424
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb4c>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 12 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0xda9): nl_netfilter_msg_types
    <c46>   DW_AT_decl_file   : 19
    <c47>   DW_AT_decl_line   : 425
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb4c>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 12 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0x471): nl_route_types
    <c55>   DW_AT_decl_file   : 19
    <c56>   DW_AT_decl_line   : 426
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb4c>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 12 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xe77): open_access_modes
    <c64>   DW_AT_decl_file   : 19
    <c65>   DW_AT_decl_line   : 427
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb4c>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 12 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c73>   DW_AT_decl_file   : 19
    <c74>   DW_AT_decl_line   : 428
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb4c>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 12 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0xc3a): perf_type_id
    <c82>   DW_AT_decl_file   : 19
    <c83>   DW_AT_decl_line   : 429
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb4c>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 12 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xe39): pollflags
    <c91>   DW_AT_decl_file   : 19
    <c92>   DW_AT_decl_line   : 430
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb4c>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 12 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x60d): ptrace_cmds
    <ca0>   DW_AT_decl_file   : 19
    <ca1>   DW_AT_decl_line   : 431
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb4c>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 12 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0x81d): resource_flags
    <caf>   DW_AT_decl_file   : 19
    <cb0>   DW_AT_decl_line   : 432
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb4c>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 12 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0x2b9): route_nexthop_flags
    <cbe>   DW_AT_decl_file   : 19
    <cbf>   DW_AT_decl_line   : 433
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb4c>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 12 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0xea9): routing_protocols
    <ccd>   DW_AT_decl_file   : 19
    <cce>   DW_AT_decl_line   : 434
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb4c>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 12 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x480): routing_scopes
    <cdc>   DW_AT_decl_file   : 19
    <cdd>   DW_AT_decl_line   : 435
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb4c>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 12 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0xd97): routing_table_ids
    <ceb>   DW_AT_decl_file   : 19
    <cec>   DW_AT_decl_line   : 436
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb4c>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 12 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x6bd): routing_types
    <cfa>   DW_AT_decl_file   : 19
    <cfb>   DW_AT_decl_line   : 437
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb4c>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 12 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x1e9): rwf_flags
    <d09>   DW_AT_decl_file   : 19
    <d0a>   DW_AT_decl_line   : 438
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb4c>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 12 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0x855): seccomp_filter_flags
    <d18>   DW_AT_decl_file   : 19
    <d19>   DW_AT_decl_line   : 439
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb4c>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 12 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0x300): seccomp_ret_action
    <d27>   DW_AT_decl_file   : 19
    <d28>   DW_AT_decl_line   : 440
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb4c>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 12 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0x44c): setns_types
    <d36>   DW_AT_decl_file   : 19
    <d37>   DW_AT_decl_line   : 441
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb4c>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 12 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0xe25): sg_io_info
    <d45>   DW_AT_decl_file   : 19
    <d46>   DW_AT_decl_line   : 442
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb4c>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 12 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0xbaf): socketlayers
    <d54>   DW_AT_decl_file   : 19
    <d55>   DW_AT_decl_line   : 443
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb4c>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 12 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0xd81): socktypes
    <d63>   DW_AT_decl_file   : 19
    <d64>   DW_AT_decl_line   : 444
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb4c>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 12 (DW_TAG_variable)
    <d6e>   DW_AT_name        : (indirect string, offset: 0xa77): tcp_state_flags
    <d72>   DW_AT_decl_file   : 19
    <d73>   DW_AT_decl_line   : 445
    <d75>   DW_AT_decl_column : 26
    <d76>   DW_AT_type        : <0xb4c>
    <d7a>   DW_AT_external    : 1
    <d7b>   DW_AT_declaration : 1
 <1><d7c>: Abbrev Number: 12 (DW_TAG_variable)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x782): tcp_states
    <d81>   DW_AT_decl_file   : 19
    <d82>   DW_AT_decl_line   : 446
    <d84>   DW_AT_decl_column : 26
    <d85>   DW_AT_type        : <0xb4c>
    <d89>   DW_AT_external    : 1
    <d8a>   DW_AT_declaration : 1
 <1><d8b>: Abbrev Number: 12 (DW_TAG_variable)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x105f): whence_codes
    <d90>   DW_AT_decl_file   : 19
    <d91>   DW_AT_decl_line   : 447
    <d93>   DW_AT_decl_column : 26
    <d94>   DW_AT_type        : <0xb4c>
    <d98>   DW_AT_external    : 1
    <d99>   DW_AT_declaration : 1
 <1><d9a>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d9b>   DW_AT_encoding    : 7	(unsigned)
    <d9c>   DW_AT_byte_size   : 4
    <d9d>   DW_AT_type        : <0x2b>
    <da1>   DW_AT_decl_file   : 19
    <da2>   DW_AT_decl_line   : 508
    <da4>   DW_AT_decl_column : 14
    <da5>   DW_AT_sibling     : <0xdbc>
 <2><da9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0x9ab): CFLAG_NONE
    <dae>   DW_AT_const_value : 0
 <2><daf>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x8ee): CFLAG_ONLY_STATS
    <db4>   DW_AT_const_value : 1
 <2><db5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0xbbc): CFLAG_BOTH
    <dba>   DW_AT_const_value : 2
 <2><dbb>: Abbrev Number: 0
 <1><dbc>: Abbrev Number: 29 (DW_TAG_typedef)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x1101): cflag_t
    <dc1>   DW_AT_decl_file   : 19
    <dc2>   DW_AT_decl_line   : 512
    <dc4>   DW_AT_decl_column : 3
    <dc5>   DW_AT_type        : <0xd9a>
 <1><dc9>: Abbrev Number: 12 (DW_TAG_variable)
    <dca>   DW_AT_name        : (indirect string, offset: 0xcd4): cflag
    <dce>   DW_AT_decl_file   : 19
    <dcf>   DW_AT_decl_line   : 513
    <dd1>   DW_AT_decl_column : 16
    <dd2>   DW_AT_type        : <0xdbc>
    <dd6>   DW_AT_external    : 1
    <dd7>   DW_AT_declaration : 1
 <1><dd8>: Abbrev Number: 12 (DW_TAG_variable)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x1ac): Tflag
    <ddd>   DW_AT_decl_file   : 19
    <dde>   DW_AT_decl_line   : 514
    <de0>   DW_AT_decl_column : 13
    <de1>   DW_AT_type        : <0x51e>
    <de5>   DW_AT_external    : 1
    <de6>   DW_AT_declaration : 1
 <1><de7>: Abbrev Number: 12 (DW_TAG_variable)
    <de8>   DW_AT_name        : (indirect string, offset: 0x7d8): Tflag_scale
    <dec>   DW_AT_decl_file   : 19
    <ded>   DW_AT_decl_line   : 515
    <def>   DW_AT_decl_column : 12
    <df0>   DW_AT_type        : <0x64>
    <df4>   DW_AT_external    : 1
    <df5>   DW_AT_declaration : 1
 <1><df6>: Abbrev Number: 12 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0x86a): Tflag_width
    <dfb>   DW_AT_decl_file   : 19
    <dfc>   DW_AT_decl_line   : 516
    <dfe>   DW_AT_decl_column : 12
    <dff>   DW_AT_type        : <0x64>
    <e03>   DW_AT_external    : 1
    <e04>   DW_AT_declaration : 1
 <1><e05>: Abbrev Number: 12 (DW_TAG_variable)
    <e06>   DW_AT_name        : (indirect string, offset: 0xe17): iflag
    <e0a>   DW_AT_decl_file   : 19
    <e0b>   DW_AT_decl_line   : 517
    <e0d>   DW_AT_decl_column : 13
    <e0e>   DW_AT_type        : <0x51e>
    <e12>   DW_AT_external    : 1
    <e13>   DW_AT_declaration : 1
 <1><e14>: Abbrev Number: 12 (DW_TAG_variable)
    <e15>   DW_AT_name        : (indirect string, offset: 0x64d): count_wallclock
    <e19>   DW_AT_decl_file   : 19
    <e1a>   DW_AT_decl_line   : 518
    <e1c>   DW_AT_decl_column : 13
    <e1d>   DW_AT_type        : <0x51e>
    <e21>   DW_AT_external    : 1
    <e22>   DW_AT_declaration : 1
 <1><e23>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e24>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e28>   DW_AT_byte_size   : 4
    <e29>   DW_AT_decl_file   : 19
    <e2a>   DW_AT_decl_line   : 520
    <e2c>   DW_AT_decl_column : 8
    <e2d>   DW_AT_sibling     : <0xe42>
 <2><e31>: Abbrev Number: 23 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e36>   DW_AT_decl_file   : 19
    <e37>   DW_AT_decl_line   : 521
    <e39>   DW_AT_decl_column : 14
    <e3a>   DW_AT_type        : <0x1d2>
    <e3e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e43>   DW_AT_name        : (indirect string, offset: 0x78d): path_set
    <e47>   DW_AT_byte_size   : 12
    <e48>   DW_AT_decl_file   : 19
    <e49>   DW_AT_decl_line   : 525
    <e4b>   DW_AT_decl_column : 15
    <e4c>   DW_AT_sibling     : <0xe81>
 <2><e50>: Abbrev Number: 23 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x71b): paths_selected
    <e55>   DW_AT_decl_file   : 19
    <e56>   DW_AT_decl_line   : 526
    <e58>   DW_AT_decl_column : 24
    <e59>   DW_AT_type        : <0xe81>
    <e5d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e60>: Abbrev Number: 23 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0x1052): num_selected
    <e65>   DW_AT_decl_file   : 19
    <e66>   DW_AT_decl_line   : 527
    <e68>   DW_AT_decl_column : 9
    <e69>   DW_AT_type        : <0x132>
    <e6d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e70>: Abbrev Number: 23 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0xb6c): size
    <e75>   DW_AT_decl_file   : 19
    <e76>   DW_AT_decl_line   : 528
    <e78>   DW_AT_decl_column : 9
    <e79>   DW_AT_type        : <0x132>
    <e7d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e82>   DW_AT_byte_size   : 4
    <e83>   DW_AT_type        : <0xe23>
 <1><e87>: Abbrev Number: 12 (DW_TAG_variable)
    <e88>   DW_AT_name        : (indirect string, offset: 0x10a1): global_path_set
    <e8c>   DW_AT_decl_file   : 19
    <e8d>   DW_AT_decl_line   : 529
    <e8f>   DW_AT_decl_column : 3
    <e90>   DW_AT_type        : <0xe42>
    <e94>   DW_AT_external    : 1
    <e95>   DW_AT_declaration : 1
 <1><e96>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e97>   DW_AT_name        : (indirect string, offset: 0xf96): xflag_opts
    <e9b>   DW_AT_encoding    : 7	(unsigned)
    <e9c>   DW_AT_byte_size   : 4
    <e9d>   DW_AT_type        : <0x2b>
    <ea1>   DW_AT_decl_file   : 19
    <ea2>   DW_AT_decl_line   : 531
    <ea4>   DW_AT_decl_column : 6
    <ea5>   DW_AT_sibling     : <0xec8>
 <2><ea9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eaa>   DW_AT_name        : (indirect string, offset: 0xa2e): HEXSTR_NONE
    <eae>   DW_AT_const_value : 0
 <2><eaf>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xfd3): HEXSTR_NON_ASCII
    <eb4>   DW_AT_const_value : 1
 <2><eb5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x92c): HEXSTR_ALL
    <eba>   DW_AT_const_value : 2
 <2><ebb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x69d): HEXSTR_NON_ASCII_CHARS
    <ec0>   DW_AT_const_value : 3
 <2><ec1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x106c): NUM_HEXSTR_OPTS
    <ec6>   DW_AT_const_value : 4
 <2><ec7>: Abbrev Number: 0
 <1><ec8>: Abbrev Number: 12 (DW_TAG_variable)
    <ec9>   DW_AT_name        : (indirect string, offset: 0xdf1): xflag
    <ecd>   DW_AT_decl_file   : 19
    <ece>   DW_AT_decl_line   : 544
    <ed0>   DW_AT_decl_column : 17
    <ed1>   DW_AT_type        : <0x2b>
    <ed5>   DW_AT_external    : 1
    <ed6>   DW_AT_declaration : 1
 <1><ed7>: Abbrev Number: 12 (DW_TAG_variable)
    <ed8>   DW_AT_name        : (indirect string, offset: 0xc8f): followfork
    <edc>   DW_AT_decl_file   : 19
    <edd>   DW_AT_decl_line   : 545
    <edf>   DW_AT_decl_column : 13
    <ee0>   DW_AT_type        : <0x51e>
    <ee4>   DW_AT_external    : 1
    <ee5>   DW_AT_declaration : 1
 <1><ee6>: Abbrev Number: 12 (DW_TAG_variable)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x34e): output_separately
    <eeb>   DW_AT_decl_file   : 19
    <eec>   DW_AT_decl_line   : 546
    <eee>   DW_AT_decl_column : 13
    <eef>   DW_AT_type        : <0x51e>
    <ef3>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef5>: Abbrev Number: 12 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x250): stack_trace_enabled
    <efa>   DW_AT_decl_file   : 19
    <efb>   DW_AT_decl_line   : 549
    <efd>   DW_AT_decl_column : 13
    <efe>   DW_AT_type        : <0x51e>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 12 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0x67b): ptrace_setoptions
    <f09>   DW_AT_decl_file   : 19
    <f0a>   DW_AT_decl_line   : 553
    <f0c>   DW_AT_decl_column : 17
    <f0d>   DW_AT_type        : <0x2b>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 12 (DW_TAG_variable)
    <f14>   DW_AT_name        : (indirect string, offset: 0xa23): max_strlen
    <f18>   DW_AT_decl_file   : 19
    <f19>   DW_AT_decl_line   : 554
    <f1b>   DW_AT_decl_column : 17
    <f1c>   DW_AT_type        : <0x2b>
    <f20>   DW_AT_external    : 1
    <f21>   DW_AT_declaration : 1
 <1><f22>: Abbrev Number: 12 (DW_TAG_variable)
    <f23>   DW_AT_name        : (indirect string, offset: 0xa51): os_release
    <f27>   DW_AT_decl_file   : 19
    <f28>   DW_AT_decl_line   : 555
    <f2a>   DW_AT_decl_column : 17
    <f2b>   DW_AT_type        : <0x2b>
    <f2f>   DW_AT_external    : 1
    <f30>   DW_AT_declaration : 1
 <1><f31>: Abbrev Number: 12 (DW_TAG_variable)
    <f32>   DW_AT_name        : (indirect string, offset: 0x72a): xlat_verbosity
    <f36>   DW_AT_decl_file   : 19
    <f37>   DW_AT_decl_line   : 917
    <f39>   DW_AT_decl_column : 24
    <f3a>   DW_AT_type        : <0xa6f>
    <f3e>   DW_AT_external    : 1
    <f3f>   DW_AT_declaration : 1
 <1><f40>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f41>   DW_AT_name        : (indirect string, offset: 0x630): xlat_style_private_flag_bits
    <f45>   DW_AT_encoding    : 7	(unsigned)
    <f46>   DW_AT_byte_size   : 4
    <f47>   DW_AT_type        : <0x2b>
    <f4b>   DW_AT_decl_file   : 19
    <f4c>   DW_AT_decl_line   : 937
    <f4e>   DW_AT_decl_column : 6
    <f4f>   DW_AT_sibling     : <0xf6c>
 <2><f53>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0x2cd): PAF_PRINT_INDICES_BIT
    <f58>   DW_AT_const_value : 5
 <2><f59>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xb19): PAF_ARRAY_TRUNCATED_BIT
    <f5e>   DW_AT_const_value : 6
 <2><f5f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f60>   DW_AT_name        : (indirect string, offset: 0x40c): PXF_DEFAULT_STR_BIT
    <f64>   DW_AT_const_value : 7
 <2><f65>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0xc71): SPFF_AUXSTR_MODE_BIT
    <f6a>   DW_AT_const_value : 8
 <2><f6b>: Abbrev Number: 0
 <1><f6c>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xd20): find_xlat_flag_bits
    <f71>   DW_AT_encoding    : 7	(unsigned)
    <f72>   DW_AT_byte_size   : 4
    <f73>   DW_AT_type        : <0x2b>
    <f77>   DW_AT_decl_file   : 19
    <f78>   DW_AT_decl_line   : 1441
    <f7a>   DW_AT_decl_column : 6
    <f7b>   DW_AT_sibling     : <0xf86>
 <2><f7f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f80>   DW_AT_name        : (indirect string, offset: 0x969): FXL_CASE_SENSITIVE_BIT
    <f84>   DW_AT_const_value : 0
 <2><f85>: Abbrev Number: 0
 <1><f86>: Abbrev Number: 12 (DW_TAG_variable)
    <f87>   DW_AT_name        : (indirect string, offset: 0x9f6): printing_tcp
    <f8b>   DW_AT_decl_file   : 19
    <f8c>   DW_AT_decl_line   : 1687
    <f8e>   DW_AT_decl_column : 20
    <f8f>   DW_AT_type        : <0x61f>
    <f93>   DW_AT_external    : 1
    <f94>   DW_AT_declaration : 1
 <1><f95>: Abbrev Number: 12 (DW_TAG_variable)
    <f96>   DW_AT_name        : (indirect string, offset: 0x5e4): errnoent
    <f9a>   DW_AT_decl_file   : 19
    <f9b>   DW_AT_decl_line   : 1885
    <f9d>   DW_AT_decl_column : 26
    <f9e>   DW_AT_type        : <0x452>
    <fa2>   DW_AT_external    : 1
    <fa3>   DW_AT_declaration : 1
 <1><fa4>: Abbrev Number: 12 (DW_TAG_variable)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x876): signalent
    <fa9>   DW_AT_decl_file   : 19
    <faa>   DW_AT_decl_line   : 1886
    <fac>   DW_AT_decl_column : 26
    <fad>   DW_AT_type        : <0x452>
    <fb1>   DW_AT_external    : 1
    <fb2>   DW_AT_declaration : 1
 <1><fb3>: Abbrev Number: 12 (DW_TAG_variable)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xe6f): nerrnos
    <fb8>   DW_AT_decl_file   : 19
    <fb9>   DW_AT_decl_line   : 1887
    <fbb>   DW_AT_decl_column : 27
    <fbc>   DW_AT_type        : <0x32>
    <fc0>   DW_AT_external    : 1
    <fc1>   DW_AT_declaration : 1
 <1><fc2>: Abbrev Number: 12 (DW_TAG_variable)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x103b): nsignals
    <fc7>   DW_AT_decl_file   : 19
    <fc8>   DW_AT_decl_line   : 1888
    <fca>   DW_AT_decl_column : 27
    <fcb>   DW_AT_type        : <0x32>
    <fcf>   DW_AT_external    : 1
    <fd0>   DW_AT_declaration : 1
 <1><fd1>: Abbrev Number: 6 (DW_TAG_array_type)
    <fd2>   DW_AT_type        : <0x88e>
    <fd6>   DW_AT_sibling     : <0xfdc>
 <2><fda>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fdb>: Abbrev Number: 0
 <1><fdc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fdd>   DW_AT_type        : <0xfd1>
 <1><fe1>: Abbrev Number: 12 (DW_TAG_variable)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xceb): sysent0
    <fe6>   DW_AT_decl_file   : 19
    <fe7>   DW_AT_decl_line   : 1890
    <fe9>   DW_AT_decl_column : 28
    <fea>   DW_AT_type        : <0xfdc>
    <fee>   DW_AT_external    : 1
    <fef>   DW_AT_declaration : 1
 <1><ff0>: Abbrev Number: 6 (DW_TAG_array_type)
    <ff1>   DW_AT_type        : <0x8f5>
    <ff5>   DW_AT_sibling     : <0xffb>
 <2><ff9>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ffa>: Abbrev Number: 0
 <1><ffb>: Abbrev Number: 3 (DW_TAG_const_type)
    <ffc>   DW_AT_type        : <0xff0>
 <1><1000>: Abbrev Number: 12 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0x1097): ioctlent0
    <1005>   DW_AT_decl_file   : 19
    <1006>   DW_AT_decl_line   : 1891
    <1008>   DW_AT_decl_column : 30
    <1009>   DW_AT_type        : <0xffb>
    <100d>   DW_AT_external    : 1
    <100e>   DW_AT_declaration : 1
 <1><100f>: Abbrev Number: 12 (DW_TAG_variable)
    <1010>   DW_AT_name        : (indirect string, offset: 0xfa1): personality_names
    <1014>   DW_AT_decl_file   : 19
    <1015>   DW_AT_decl_line   : 1893
    <1017>   DW_AT_decl_column : 26
    <1018>   DW_AT_type        : <0x452>
    <101c>   DW_AT_external    : 1
    <101d>   DW_AT_declaration : 1
 <1><101e>: Abbrev Number: 12 (DW_TAG_variable)
    <101f>   DW_AT_name        : (indirect string, offset: 0x896): sysent
    <1023>   DW_AT_decl_file   : 19
    <1024>   DW_AT_decl_line   : 1896
    <1026>   DW_AT_decl_column : 29
    <1027>   DW_AT_type        : <0x9da>
    <102b>   DW_AT_external    : 1
    <102c>   DW_AT_declaration : 1
 <1><102d>: Abbrev Number: 12 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0xc86): ioctlent
    <1032>   DW_AT_decl_file   : 19
    <1033>   DW_AT_decl_line   : 1897
    <1035>   DW_AT_decl_column : 31
    <1036>   DW_AT_type        : <0x103c>
    <103a>   DW_AT_external    : 1
    <103b>   DW_AT_declaration : 1
 <1><103c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <103d>   DW_AT_byte_size   : 4
    <103e>   DW_AT_type        : <0x8f5>
 <1><1042>: Abbrev Number: 12 (DW_TAG_variable)
    <1043>   DW_AT_name        : (indirect string, offset: 0x880): nsyscalls
    <1047>   DW_AT_decl_file   : 19
    <1048>   DW_AT_decl_line   : 1903
    <104a>   DW_AT_decl_column : 17
    <104b>   DW_AT_type        : <0x2b>
    <104f>   DW_AT_external    : 1
    <1050>   DW_AT_declaration : 1
 <1><1051>: Abbrev Number: 12 (DW_TAG_variable)
    <1052>   DW_AT_name        : (indirect string, offset: 0xe89): nioctlents
    <1056>   DW_AT_decl_file   : 19
    <1057>   DW_AT_decl_line   : 1904
    <1059>   DW_AT_decl_column : 17
    <105a>   DW_AT_type        : <0x2b>
    <105e>   DW_AT_external    : 1
    <105f>   DW_AT_declaration : 1
 <1><1060>: Abbrev Number: 6 (DW_TAG_array_type)
    <1061>   DW_AT_type        : <0x32>
    <1065>   DW_AT_sibling     : <0x1070>
 <2><1069>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <106a>   DW_AT_type        : <0x2b>
    <106e>   DW_AT_upper_bound : 2
 <2><106f>: Abbrev Number: 0
 <1><1070>: Abbrev Number: 3 (DW_TAG_const_type)
    <1071>   DW_AT_type        : <0x1060>
 <1><1075>: Abbrev Number: 12 (DW_TAG_variable)
    <1076>   DW_AT_name        : (indirect string, offset: 0xefe): nsyscall_vec
    <107a>   DW_AT_decl_file   : 19
    <107b>   DW_AT_decl_line   : 1906
    <107d>   DW_AT_decl_column : 27
    <107e>   DW_AT_type        : <0x1070>
    <1082>   DW_AT_external    : 1
    <1083>   DW_AT_declaration : 1
 <1><1084>: Abbrev Number: 6 (DW_TAG_array_type)
    <1085>   DW_AT_type        : <0x9e0>
    <1089>   DW_AT_sibling     : <0x1094>
 <2><108d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <108e>   DW_AT_type        : <0x2b>
    <1092>   DW_AT_upper_bound : 2
 <2><1093>: Abbrev Number: 0
 <1><1094>: Abbrev Number: 3 (DW_TAG_const_type)
    <1095>   DW_AT_type        : <0x1084>
 <1><1099>: Abbrev Number: 12 (DW_TAG_variable)
    <109a>   DW_AT_name        : (indirect string, offset: 0x7c5): sysent_vec
    <109e>   DW_AT_decl_file   : 19
    <109f>   DW_AT_decl_line   : 1907
    <10a1>   DW_AT_decl_column : 35
    <10a2>   DW_AT_type        : <0x1094>
    <10a6>   DW_AT_external    : 1
    <10a7>   DW_AT_declaration : 1
 <1><10a8>: Abbrev Number: 12 (DW_TAG_variable)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x3ad): inject_vec
    <10ad>   DW_AT_decl_file   : 19
    <10ae>   DW_AT_decl_line   : 1908
    <10b0>   DW_AT_decl_column : 28
    <10b1>   DW_AT_type        : <0x9e5>
    <10b5>   DW_AT_external    : 1
    <10b6>   DW_AT_declaration : 1
 <1><10b7>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10b8>   DW_AT_name        : (indirect string, offset: 0xd74): audit_arch_t
    <10bc>   DW_AT_byte_size   : 8
    <10bd>   DW_AT_decl_file   : 19
    <10be>   DW_AT_decl_line   : 1910
    <10c0>   DW_AT_decl_column : 8
    <10c1>   DW_AT_sibling     : <0x10e6>
 <2><10c5>: Abbrev Number: 23 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x622): arch
    <10ca>   DW_AT_decl_file   : 19
    <10cb>   DW_AT_decl_line   : 1911
    <10cd>   DW_AT_decl_column : 15
    <10ce>   DW_AT_type        : <0x2b>
    <10d2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d5>: Abbrev Number: 23 (DW_TAG_member)
    <10d6>   DW_AT_name        : (indirect string, offset: 0x9dc): flag
    <10da>   DW_AT_decl_file   : 19
    <10db>   DW_AT_decl_line   : 1912
    <10dd>   DW_AT_decl_column : 15
    <10de>   DW_AT_type        : <0x2b>
    <10e2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e5>: Abbrev Number: 0
 <1><10e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e7>   DW_AT_type        : <0x10b7>
 <1><10eb>: Abbrev Number: 6 (DW_TAG_array_type)
    <10ec>   DW_AT_type        : <0x10e6>
    <10f0>   DW_AT_sibling     : <0x10fb>
 <2><10f4>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10f5>   DW_AT_type        : <0x2b>
    <10f9>   DW_AT_upper_bound : 2
 <2><10fa>: Abbrev Number: 0
 <1><10fb>: Abbrev Number: 3 (DW_TAG_const_type)
    <10fc>   DW_AT_type        : <0x10eb>
 <1><1100>: Abbrev Number: 12 (DW_TAG_variable)
    <1101>   DW_AT_name        : (indirect string, offset: 0x95a): audit_arch_vec
    <1105>   DW_AT_decl_file   : 19
    <1106>   DW_AT_decl_line   : 1915
    <1108>   DW_AT_decl_column : 34
    <1109>   DW_AT_type        : <0x10fb>
    <110d>   DW_AT_external    : 1
    <110e>   DW_AT_declaration : 1
 <1><110f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1110>   DW_AT_byte_size   : 180
    <1111>   DW_AT_decl_file   : 21
    <1112>   DW_AT_decl_line   : 2
    <1113>   DW_AT_decl_column : 9
    <1114>   DW_AT_sibling     : <0x13c9>
 <2><1118>: Abbrev Number: 11 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0x201): block_ioctl
    <111d>   DW_AT_decl_file   : 21
    <111e>   DW_AT_decl_line   : 3
    <111f>   DW_AT_decl_column : 8
    <1120>   DW_AT_type        : <0x13e3>
    <1124>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1127>: Abbrev Number: 11 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0xab0): btrfs_ioctl
    <112c>   DW_AT_decl_file   : 21
    <112d>   DW_AT_decl_line   : 6
    <112e>   DW_AT_decl_column : 8
    <112f>   DW_AT_type        : <0x13e3>
    <1133>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1136>: Abbrev Number: 11 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0x763): evdev_write_ioctl_mpers
    <113b>   DW_AT_decl_file   : 21
    <113c>   DW_AT_decl_line   : 9
    <113d>   DW_AT_decl_column : 8
    <113e>   DW_AT_type        : <0x13e3>
    <1142>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1145>: Abbrev Number: 11 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0x739): get_sock_fprog_size
    <114a>   DW_AT_decl_file   : 21
    <114b>   DW_AT_decl_line   : 12
    <114c>   DW_AT_decl_column : 17
    <114d>   DW_AT_type        : <0x13ef>
    <1151>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1154>: Abbrev Number: 11 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0x1c8): fetch_bpf_fprog
    <1159>   DW_AT_decl_file   : 21
    <115a>   DW_AT_decl_line   : 15
    <115b>   DW_AT_decl_column : 10
    <115c>   DW_AT_type        : <0x140f>
    <1160>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
