Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x339b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x27f): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1021): mpers-mx32/struct_v4l2_ext_controls.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x442): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0xa18): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1616): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x268e): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <41>   DW_AT_name        : (indirect string, offset: 0x1650): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x112): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0x26ae): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x8b1): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x1f12): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0x1152): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x236a): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x115c): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0x20a6): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0x3a8): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0x172e): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0x154d): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x5af): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x1bf9): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0xe5e): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x340): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x1aa1): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xb3e): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x19d5): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xe4b): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0x127e): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x209f): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x23e1): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0x1b20): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x25e): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0xf5d): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0x788): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x233d): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x17fc): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0x889): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x1cb1): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x358): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x21f8): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0x1c6c): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x1738): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x187e): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0xca3): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x5cd): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x1c28): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0x175b): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0xf15): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x21ca): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x14df): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x1e0a): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x992): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x48): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x2378): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x2320): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x20cc): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x26fe): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x1bc): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x428): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x1746): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0x1e29): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x104c): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x2231): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0x207e): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x1d9b): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x1864): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x3f): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0xdef): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xa30): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x19fa): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x1ad2): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x1cce): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x1c22): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0x1531): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0x1466): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x2477): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x83a): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x229d): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0x1d): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x1ff7): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0x148f): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x65a): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x1f2c): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x1327): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x1ce1): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x880): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x22b8): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0xe52): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0x210c): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x156): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0x731): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x18d0): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0xd35): kernel_long_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 16
    <539>   DW_AT_decl_column : 25
    <53a>   DW_AT_type        : <0x51a>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x623): kernel_ulong_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 17
    <545>   DW_AT_decl_column : 26
    <546>   DW_AT_type        : <0x526>
 <1><54a>: Abbrev Number: 3 (DW_TAG_const_type)
    <54b>   DW_AT_type        : <0x53e>
 <1><54f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <550>   DW_AT_name        : (indirect string, offset: 0x1efc): list_item
    <554>   DW_AT_byte_size   : 8
    <555>   DW_AT_decl_file   : 16
    <556>   DW_AT_decl_line   : 92
    <557>   DW_AT_decl_column : 8
    <558>   DW_AT_sibling     : <0x57b>
 <2><55c>: Abbrev Number: 9 (DW_TAG_member)
    <55d>   DW_AT_name        : (indirect string, offset: 0x26f9): prev
    <561>   DW_AT_decl_file   : 16
    <562>   DW_AT_decl_line   : 93
    <563>   DW_AT_decl_column : 20
    <564>   DW_AT_type        : <0x57b>
    <568>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><56b>: Abbrev Number: 9 (DW_TAG_member)
    <56c>   DW_AT_name        : (indirect string, offset: 0x35f): next
    <570>   DW_AT_decl_file   : 16
    <571>   DW_AT_decl_line   : 94
    <572>   DW_AT_decl_column : 20
    <573>   DW_AT_type        : <0x57b>
    <577>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><57a>: Abbrev Number: 0
 <1><57b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <57c>   DW_AT_byte_size   : 4
    <57d>   DW_AT_type        : <0x54f>
 <1><581>: Abbrev Number: 8 (DW_TAG_structure_type)
    <582>   DW_AT_name        : (indirect string, offset: 0x999): sysent
    <586>   DW_AT_byte_size   : 20
    <587>   DW_AT_decl_file   : 17
    <588>   DW_AT_decl_line   : 13
    <589>   DW_AT_decl_column : 16
    <58a>   DW_AT_sibling     : <0x5da>
 <2><58e>: Abbrev Number: 9 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x22d3): nargs
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 14
    <595>   DW_AT_decl_column : 11
    <596>   DW_AT_type        : <0x2b>
    <59a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><59d>: Abbrev Number: 9 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x4bb): sys_flags
    <5a2>   DW_AT_decl_file   : 17
    <5a3>   DW_AT_decl_line   : 15
    <5a4>   DW_AT_decl_column : 6
    <5a5>   DW_AT_type        : <0x64>
    <5a9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5ac>: Abbrev Number: 18 (DW_TAG_member)
    <5ad>   DW_AT_name        : sen
    <5b1>   DW_AT_decl_file   : 17
    <5b2>   DW_AT_decl_line   : 16
    <5b3>   DW_AT_decl_column : 6
    <5b4>   DW_AT_type        : <0x64>
    <5b8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5bb>: Abbrev Number: 9 (DW_TAG_member)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x16ba): sys_func
    <5c0>   DW_AT_decl_file   : 17
    <5c1>   DW_AT_decl_line   : 17
    <5c2>   DW_AT_decl_column : 8
    <5c3>   DW_AT_type        : <0x847>
    <5c7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ca>: Abbrev Number: 9 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x1287): sys_name
    <5cf>   DW_AT_decl_file   : 17
    <5d0>   DW_AT_decl_line   : 18
    <5d1>   DW_AT_decl_column : 14
    <5d2>   DW_AT_type        : <0x1c2>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5d9>: Abbrev Number: 0
 <1><5da>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5db>   DW_AT_prototyped  : 1
    <5dc>   DW_AT_type        : <0x64>
    <5e0>   DW_AT_sibling     : <0x5ea>
 <2><5e4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5e5>   DW_AT_type        : <0x5ea>
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5eb>   DW_AT_byte_size   : 4
    <5ec>   DW_AT_type        : <0x5f5>
 <1><5f0>: Abbrev Number: 3 (DW_TAG_const_type)
    <5f1>   DW_AT_type        : <0x5ea>
 <1><5f5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <5f6>   DW_AT_name        : tcb
    <5fa>   DW_AT_byte_size   : 288
    <5fc>   DW_AT_decl_file   : 18
    <5fd>   DW_AT_decl_line   : 262
    <5ff>   DW_AT_decl_column : 8
    <600>   DW_AT_sibling     : <0x847>
 <2><604>: Abbrev Number: 22 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0x275b): flags
    <609>   DW_AT_decl_file   : 18
    <60a>   DW_AT_decl_line   : 263
    <60c>   DW_AT_decl_column : 6
    <60d>   DW_AT_type        : <0x64>
    <611>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><614>: Abbrev Number: 23 (DW_TAG_member)
    <615>   DW_AT_name        : pid
    <619>   DW_AT_decl_file   : 18
    <61a>   DW_AT_decl_line   : 264
    <61c>   DW_AT_decl_column : 6
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><624>: Abbrev Number: 22 (DW_TAG_member)
    <625>   DW_AT_name        : (indirect string, offset: 0x14c3): qual_flg
    <629>   DW_AT_decl_file   : 18
    <62a>   DW_AT_decl_line   : 265
    <62c>   DW_AT_decl_column : 6
    <62d>   DW_AT_type        : <0x64>
    <631>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><634>: Abbrev Number: 22 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0xdd3): currpers
    <639>   DW_AT_decl_file   : 18
    <63a>   DW_AT_decl_line   : 267
    <63c>   DW_AT_decl_column : 15
    <63d>   DW_AT_type        : <0x2b>
    <641>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><644>: Abbrev Number: 22 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0xaf1): u_error
    <649>   DW_AT_decl_file   : 18
    <64a>   DW_AT_decl_line   : 269
    <64c>   DW_AT_decl_column : 16
    <64d>   DW_AT_type        : <0x37>
    <651>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><654>: Abbrev Number: 22 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0x1729): scno
    <659>   DW_AT_decl_file   : 18
    <65a>   DW_AT_decl_line   : 270
    <65c>   DW_AT_decl_column : 17
    <65d>   DW_AT_type        : <0x53e>
    <661>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><664>: Abbrev Number: 22 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x96c): true_scno
    <669>   DW_AT_decl_file   : 18
    <66a>   DW_AT_decl_line   : 271
    <66c>   DW_AT_decl_column : 17
    <66d>   DW_AT_type        : <0x53e>
    <671>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><674>: Abbrev Number: 22 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x19e): u_arg
    <679>   DW_AT_decl_file   : 18
    <67a>   DW_AT_decl_line   : 272
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x977>
    <681>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><684>: Abbrev Number: 22 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x1200): u_rval
    <689>   DW_AT_decl_file   : 18
    <68a>   DW_AT_decl_line   : 273
    <68c>   DW_AT_decl_column : 16
    <68d>   DW_AT_type        : <0x532>
    <691>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><694>: Abbrev Number: 22 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0x1f37): sys_func_rval
    <699>   DW_AT_decl_file   : 18
    <69a>   DW_AT_decl_line   : 274
    <69c>   DW_AT_decl_column : 6
    <69d>   DW_AT_type        : <0x64>
    <6a1>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6a4>: Abbrev Number: 22 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0xec8): curcol
    <6a9>   DW_AT_decl_file   : 18
    <6aa>   DW_AT_decl_line   : 275
    <6ac>   DW_AT_decl_column : 6
    <6ad>   DW_AT_type        : <0x64>
    <6b1>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6b4>: Abbrev Number: 22 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x15c): outf
    <6b9>   DW_AT_decl_file   : 18
    <6ba>   DW_AT_decl_line   : 276
    <6bc>   DW_AT_decl_column : 8
    <6bd>   DW_AT_type        : <0x407>
    <6c1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6c4>: Abbrev Number: 22 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x1932): staged_output_data
    <6c9>   DW_AT_decl_file   : 18
    <6ca>   DW_AT_decl_line   : 277
    <6cc>   DW_AT_decl_column : 29
    <6cd>   DW_AT_type        : <0x98d>
    <6d1>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6d4>: Abbrev Number: 22 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x139c): auxstr
    <6d9>   DW_AT_decl_file   : 18
    <6da>   DW_AT_decl_line   : 279
    <6dc>   DW_AT_decl_column : 14
    <6dd>   DW_AT_type        : <0x1c2>
    <6e1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6e4>: Abbrev Number: 22 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x1306): _priv_data
    <6e9>   DW_AT_decl_file   : 18
    <6ea>   DW_AT_decl_line   : 280
    <6ec>   DW_AT_decl_column : 8
    <6ed>   DW_AT_type        : <0xc6>
    <6f1>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><6f4>: Abbrev Number: 22 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x1d1e): _free_priv_data
    <6f9>   DW_AT_decl_file   : 18
    <6fa>   DW_AT_decl_line   : 281
    <6fc>   DW_AT_decl_column : 9
    <6fd>   DW_AT_type        : <0x99f>
    <701>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><704>: Abbrev Number: 22 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x1d8c): s_ent
    <709>   DW_AT_decl_file   : 18
    <70a>   DW_AT_decl_line   : 282
    <70c>   DW_AT_decl_column : 23
    <70d>   DW_AT_type        : <0x9a5>
    <711>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><714>: Abbrev Number: 22 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x1971): s_prev_ent
    <719>   DW_AT_decl_file   : 18
    <71a>   DW_AT_decl_line   : 285
    <71c>   DW_AT_decl_column : 23
    <71d>   DW_AT_type        : <0x9a5>
    <721>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><725>: Abbrev Number: 22 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x262b): inject_vec
    <72a>   DW_AT_decl_file   : 18
    <72b>   DW_AT_decl_line   : 286
    <72d>   DW_AT_decl_column : 22
    <72e>   DW_AT_type        : <0x9b0>
    <732>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><736>: Abbrev Number: 22 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x976): stime
    <73b>   DW_AT_decl_file   : 18
    <73c>   DW_AT_decl_line   : 287
    <73e>   DW_AT_decl_column : 18
    <73f>   DW_AT_type        : <0x133>
    <743>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><747>: Abbrev Number: 22 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x196b): ltime
    <74c>   DW_AT_decl_file   : 18
    <74d>   DW_AT_decl_line   : 288
    <74f>   DW_AT_decl_column : 18
    <750>   DW_AT_type        : <0x133>
    <754>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><758>: Abbrev Number: 22 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0x632): atime
    <75d>   DW_AT_decl_file   : 18
    <75e>   DW_AT_decl_line   : 289
    <760>   DW_AT_decl_column : 18
    <761>   DW_AT_type        : <0x133>
    <765>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><769>: Abbrev Number: 22 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0x1076): etime
    <76e>   DW_AT_decl_file   : 18
    <76f>   DW_AT_decl_line   : 290
    <771>   DW_AT_decl_column : 18
    <772>   DW_AT_type        : <0x133>
    <776>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><77a>: Abbrev Number: 22 (DW_TAG_member)
    <77b>   DW_AT_name        : (indirect string, offset: 0x824): delay_expiration_time
    <77f>   DW_AT_decl_file   : 18
    <780>   DW_AT_decl_line   : 291
    <782>   DW_AT_decl_column : 18
    <783>   DW_AT_type        : <0x133>
    <787>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><78b>: Abbrev Number: 22 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x50): pid_ns
    <790>   DW_AT_decl_file   : 18
    <791>   DW_AT_decl_line   : 298
    <793>   DW_AT_decl_column : 15
    <794>   DW_AT_type        : <0x2b>
    <798>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><79c>: Abbrev Number: 22 (DW_TAG_member)
    <79d>   DW_AT_name        : (indirect string, offset: 0x1f61): last_dirfd
    <7a1>   DW_AT_decl_file   : 18
    <7a2>   DW_AT_decl_line   : 301
    <7a4>   DW_AT_decl_column : 6
    <7a5>   DW_AT_type        : <0x64>
    <7a9>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7ad>: Abbrev Number: 22 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0x214c): mmap_cache
    <7b2>   DW_AT_decl_file   : 18
    <7b3>   DW_AT_decl_line   : 304
    <7b5>   DW_AT_decl_column : 23
    <7b6>   DW_AT_type        : <0x9cc>
    <7ba>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7be>: Abbrev Number: 22 (DW_TAG_member)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xc7e): wait_data_idx
    <7c3>   DW_AT_decl_file   : 18
    <7c4>   DW_AT_decl_line   : 311
    <7c6>   DW_AT_decl_column : 9
    <7c7>   DW_AT_type        : <0x122>
    <7cb>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7cf>: Abbrev Number: 22 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x20ed): delayed_wait_data
    <7d4>   DW_AT_decl_file   : 18
    <7d5>   DW_AT_decl_line   : 313
    <7d7>   DW_AT_decl_column : 24
    <7d8>   DW_AT_type        : <0x9d8>
    <7dc>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7e0>: Abbrev Number: 22 (DW_TAG_member)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xa26): wait_list
    <7e5>   DW_AT_decl_file   : 18
    <7e6>   DW_AT_decl_line   : 314
    <7e8>   DW_AT_decl_column : 19
    <7e9>   DW_AT_type        : <0x54f>
    <7ed>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><7f1>: Abbrev Number: 22 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x2065): vcpu_info_list
    <7f6>   DW_AT_decl_file   : 18
    <7f7>   DW_AT_decl_line   : 318
    <7f9>   DW_AT_decl_column : 20
    <7fa>   DW_AT_type        : <0x9e4>
    <7fe>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><802>: Abbrev Number: 22 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0xa40): unwind_ctx
    <807>   DW_AT_decl_file   : 18
    <808>   DW_AT_decl_line   : 322
    <80a>   DW_AT_decl_column : 8
    <80b>   DW_AT_type        : <0xc6>
    <80f>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><813>: Abbrev Number: 22 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0x1ce8): unwind_queue
    <818>   DW_AT_decl_file   : 18
    <819>   DW_AT_decl_line   : 323
    <81b>   DW_AT_decl_column : 25
    <81c>   DW_AT_type        : <0x9f0>
    <820>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><824>: Abbrev Number: 22 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x16f4): comm
    <829>   DW_AT_decl_file   : 18
    <82a>   DW_AT_decl_line   : 327
    <82c>   DW_AT_decl_column : 7
    <82d>   DW_AT_type        : <0x9f6>
    <831>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><835>: Abbrev Number: 22 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0xf85): start_prc
    <83a>   DW_AT_decl_file   : 18
    <83b>   DW_AT_decl_line   : 329
    <83d>   DW_AT_decl_column : 16
    <83e>   DW_AT_type        : <0x37>
    <842>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><846>: Abbrev Number: 0
 <1><847>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <848>   DW_AT_byte_size   : 4
    <849>   DW_AT_type        : <0x5da>
 <1><84d>: Abbrev Number: 4 (DW_TAG_typedef)
    <84e>   DW_AT_name        : (indirect string, offset: 0x141f): struct_sysent
    <852>   DW_AT_decl_file   : 17
    <853>   DW_AT_decl_line   : 19
    <854>   DW_AT_decl_column : 3
    <855>   DW_AT_type        : <0x581>
 <1><859>: Abbrev Number: 3 (DW_TAG_const_type)
    <85a>   DW_AT_type        : <0x84d>
 <1><85e>: Abbrev Number: 11 (DW_TAG_variable)
    <85f>   DW_AT_name        : (indirect string, offset: 0x1b45): current_personality
    <863>   DW_AT_decl_file   : 18
    <864>   DW_AT_decl_line   : 158
    <865>   DW_AT_decl_column : 17
    <866>   DW_AT_type        : <0x2b>
    <86a>   DW_AT_external    : 1
    <86b>   DW_AT_declaration : 1
 <1><86c>: Abbrev Number: 11 (DW_TAG_variable)
    <86d>   DW_AT_name        : (indirect string, offset: 0x10b6): current_wordsize
    <871>   DW_AT_decl_file   : 18
    <872>   DW_AT_decl_line   : 171
    <873>   DW_AT_decl_column : 17
    <874>   DW_AT_type        : <0x2b>
    <878>   DW_AT_external    : 1
    <879>   DW_AT_declaration : 1
 <1><87a>: Abbrev Number: 11 (DW_TAG_variable)
    <87b>   DW_AT_name        : (indirect string, offset: 0x1f4f): current_klongsize
    <87f>   DW_AT_decl_file   : 18
    <880>   DW_AT_decl_line   : 176
    <881>   DW_AT_decl_column : 17
    <882>   DW_AT_type        : <0x2b>
    <886>   DW_AT_external    : 1
    <887>   DW_AT_declaration : 1
 <1><888>: Abbrev Number: 8 (DW_TAG_structure_type)
    <889>   DW_AT_name        : (indirect string, offset: 0xbc2): ioctlent
    <88d>   DW_AT_byte_size   : 8
    <88e>   DW_AT_decl_file   : 18
    <88f>   DW_AT_decl_line   : 217
    <890>   DW_AT_decl_column : 16
    <891>   DW_AT_sibling     : <0x8b4>
 <2><895>: Abbrev Number: 9 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0x339): symbol
    <89a>   DW_AT_decl_file   : 18
    <89b>   DW_AT_decl_line   : 218
    <89c>   DW_AT_decl_column : 14
    <89d>   DW_AT_type        : <0x1c2>
    <8a1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8a4>: Abbrev Number: 9 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x1047): code
    <8a9>   DW_AT_decl_file   : 18
    <8aa>   DW_AT_decl_line   : 219
    <8ab>   DW_AT_decl_column : 15
    <8ac>   DW_AT_type        : <0x2b>
    <8b0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8b3>: Abbrev Number: 0
 <1><8b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b5>   DW_AT_name        : (indirect string, offset: 0x21e8): struct_ioctlent
    <8b9>   DW_AT_decl_file   : 18
    <8ba>   DW_AT_decl_line   : 220
    <8bb>   DW_AT_decl_column : 3
    <8bc>   DW_AT_type        : <0x888>
 <1><8c0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c1>   DW_AT_type        : <0x8b4>
 <1><8c5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x125d): inject_data
    <8ca>   DW_AT_byte_size   : 10
    <8cb>   DW_AT_decl_file   : 18
    <8cc>   DW_AT_decl_line   : 241
    <8cd>   DW_AT_decl_column : 8
    <8ce>   DW_AT_sibling     : <0x92d>
 <2><8d2>: Abbrev Number: 9 (DW_TAG_member)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x275b): flags
    <8d7>   DW_AT_decl_file   : 18
    <8d8>   DW_AT_decl_line   : 242
    <8d9>   DW_AT_decl_column : 10
    <8da>   DW_AT_type        : <0xeb>
    <8de>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e1>: Abbrev Number: 9 (DW_TAG_member)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x1e04): signo
    <8e6>   DW_AT_decl_file   : 18
    <8e7>   DW_AT_decl_line   : 243
    <8e8>   DW_AT_decl_column : 10
    <8e9>   DW_AT_type        : <0xeb>
    <8ed>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8f0>: Abbrev Number: 9 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x2358): rval_idx
    <8f5>   DW_AT_decl_file   : 18
    <8f6>   DW_AT_decl_line   : 244
    <8f7>   DW_AT_decl_column : 11
    <8f8>   DW_AT_type        : <0xf7>
    <8fc>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><8ff>: Abbrev Number: 9 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x1aaa): delay_idx
    <904>   DW_AT_decl_file   : 18
    <905>   DW_AT_decl_line   : 245
    <906>   DW_AT_decl_column : 11
    <907>   DW_AT_type        : <0xf7>
    <90b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><90e>: Abbrev Number: 9 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x2361): poke_idx
    <913>   DW_AT_decl_file   : 18
    <914>   DW_AT_decl_line   : 246
    <915>   DW_AT_decl_column : 11
    <916>   DW_AT_type        : <0xf7>
    <91a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><91d>: Abbrev Number: 9 (DW_TAG_member)
    <91e>   DW_AT_name        : (indirect string, offset: 0x1729): scno
    <922>   DW_AT_decl_file   : 18
    <923>   DW_AT_decl_line   : 247
    <924>   DW_AT_decl_column : 11
    <925>   DW_AT_type        : <0xf7>
    <929>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><92c>: Abbrev Number: 0
 <1><92d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <92e>   DW_AT_name        : (indirect string, offset: 0x8f2): inject_opts
    <932>   DW_AT_byte_size   : 16
    <933>   DW_AT_decl_file   : 18
    <934>   DW_AT_decl_line   : 250
    <935>   DW_AT_decl_column : 8
    <936>   DW_AT_sibling     : <0x977>
 <2><93a>: Abbrev Number: 9 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0xfb9): first
    <93f>   DW_AT_decl_file   : 18
    <940>   DW_AT_decl_line   : 251
    <941>   DW_AT_decl_column : 11
    <942>   DW_AT_type        : <0xf7>
    <946>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><949>: Abbrev Number: 9 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x1a91): last
    <94e>   DW_AT_decl_file   : 18
    <94f>   DW_AT_decl_line   : 252
    <950>   DW_AT_decl_column : 11
    <951>   DW_AT_type        : <0xf7>
    <955>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><958>: Abbrev Number: 9 (DW_TAG_member)
    <959>   DW_AT_name        : (indirect string, offset: 0x268): step
    <95d>   DW_AT_decl_file   : 18
    <95e>   DW_AT_decl_line   : 253
    <95f>   DW_AT_decl_column : 11
    <960>   DW_AT_type        : <0xf7>
    <964>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><967>: Abbrev Number: 9 (DW_TAG_member)
    <968>   DW_AT_name        : (indirect string, offset: 0x1f27): data
    <96c>   DW_AT_decl_file   : 18
    <96d>   DW_AT_decl_line   : 254
    <96e>   DW_AT_decl_column : 21
    <96f>   DW_AT_type        : <0x8c5>
    <973>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><976>: Abbrev Number: 0
 <1><977>: Abbrev Number: 15 (DW_TAG_array_type)
    <978>   DW_AT_type        : <0x53e>
    <97c>   DW_AT_sibling     : <0x987>
 <2><980>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <981>   DW_AT_type        : <0x2b>
    <985>   DW_AT_upper_bound : 5
 <2><986>: Abbrev Number: 0
 <1><987>: Abbrev Number: 14 (DW_TAG_structure_type)
    <988>   DW_AT_name        : (indirect string, offset: 0x1932): staged_output_data
    <98c>   DW_AT_declaration : 1
 <1><98d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <98e>   DW_AT_byte_size   : 4
    <98f>   DW_AT_type        : <0x987>
 <1><993>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <994>   DW_AT_prototyped  : 1
    <995>   DW_AT_sibling     : <0x99f>
 <2><999>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <99a>   DW_AT_type        : <0xc6>
 <2><99e>: Abbrev Number: 0
 <1><99f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a0>   DW_AT_byte_size   : 4
    <9a1>   DW_AT_type        : <0x993>
 <1><9a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a6>   DW_AT_byte_size   : 4
    <9a7>   DW_AT_type        : <0x859>
 <1><9ab>: Abbrev Number: 3 (DW_TAG_const_type)
    <9ac>   DW_AT_type        : <0x9a5>
 <1><9b0>: Abbrev Number: 15 (DW_TAG_array_type)
    <9b1>   DW_AT_type        : <0x9c0>
    <9b5>   DW_AT_sibling     : <0x9c0>
 <2><9b9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9ba>   DW_AT_type        : <0x2b>
    <9be>   DW_AT_upper_bound : 2
 <2><9bf>: Abbrev Number: 0
 <1><9c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c1>   DW_AT_byte_size   : 4
    <9c2>   DW_AT_type        : <0x92d>
 <1><9c6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x10c7): mmap_cache_t
    <9cb>   DW_AT_declaration : 1
 <1><9cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_type        : <0x9c6>
 <1><9d2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x8fe): tcb_wait_data
    <9d7>   DW_AT_declaration : 1
 <1><9d8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d9>   DW_AT_byte_size   : 4
    <9da>   DW_AT_type        : <0x9d2>
 <1><9de>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9df>   DW_AT_name        : (indirect string, offset: 0xd9): vcpu_info
    <9e3>   DW_AT_declaration : 1
 <1><9e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e5>   DW_AT_byte_size   : 4
    <9e6>   DW_AT_type        : <0x9de>
 <1><9ea>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x171a): unwind_queue_t
    <9ef>   DW_AT_declaration : 1
 <1><9f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f1>   DW_AT_byte_size   : 4
    <9f2>   DW_AT_type        : <0x9ea>
 <1><9f6>: Abbrev Number: 15 (DW_TAG_array_type)
    <9f7>   DW_AT_type        : <0xdf>
    <9fb>   DW_AT_sibling     : <0xa06>
 <2><9ff>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a00>   DW_AT_type        : <0x2b>
    <a04>   DW_AT_upper_bound : 15
 <2><a05>: Abbrev Number: 0
 <1><a06>: Abbrev Number: 10 (DW_TAG_variable)
    <a07>   DW_AT_name        : (indirect string, offset: 0x1a05): stub_sysent
    <a0b>   DW_AT_decl_file   : 18
    <a0c>   DW_AT_decl_line   : 403
    <a0e>   DW_AT_decl_column : 28
    <a0f>   DW_AT_type        : <0x859>
    <a13>   DW_AT_external    : 1
    <a14>   DW_AT_declaration : 1
 <1><a15>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a16>   DW_AT_name        : (indirect string, offset: 0xcbf): xlat_type
    <a1a>   DW_AT_encoding    : 7	(unsigned)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0x2b>
    <a20>   DW_AT_decl_file   : 19
    <a21>   DW_AT_decl_line   : 13
    <a22>   DW_AT_decl_column : 6
    <a23>   DW_AT_sibling     : <0xa3a>
 <2><a27>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a28>   DW_AT_name        : (indirect string, offset: 0x3f0): XT_NORMAL
    <a2c>   DW_AT_const_value : 0
 <2><a2d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x741): XT_SORTED
    <a32>   DW_AT_const_value : 1
 <2><a33>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a34>   DW_AT_name        : (indirect string, offset: 0x10ab): XT_INDEXED
    <a38>   DW_AT_const_value : 2
 <2><a39>: Abbrev Number: 0
 <1><a3a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x206): xlat_style
    <a3f>   DW_AT_encoding    : 7	(unsigned)
    <a40>   DW_AT_byte_size   : 4
    <a41>   DW_AT_type        : <0x2b>
    <a45>   DW_AT_decl_file   : 19
    <a46>   DW_AT_decl_line   : 19
    <a47>   DW_AT_decl_column : 6
    <a48>   DW_AT_sibling     : <0xa77>
 <2><a4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x269b): XLAT_STYLE_DEFAULT
    <a51>   DW_AT_const_value : 0
 <2><a52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0x15fd): XLAT_STYLE_RAW
    <a57>   DW_AT_const_value : 1
 <2><a58>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0x22c1): XLAT_STYLE_ABBREV
    <a5d>   DW_AT_const_value : 2
 <2><a5e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0x1241): XLAT_STYLE_VERBOSE
    <a63>   DW_AT_const_value : 3
 <2><a64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0x16e3): XLAT_STYLE_FMT_X
    <a69>   DW_AT_const_value : 0
 <2><a6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x16c3): XLAT_STYLE_FMT_U
    <a6f>   DW_AT_const_value : 4
 <2><a70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a71>   DW_AT_name        : (indirect string, offset: 0x1682): XLAT_STYLE_FMT_D
    <a75>   DW_AT_const_value : 8
 <2><a76>: Abbrev Number: 0
 <1><a77>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a78>   DW_AT_name        : (indirect string, offset: 0x19b6): xlat_data
    <a7c>   DW_AT_byte_size   : 16
    <a7d>   DW_AT_decl_file   : 19
    <a7e>   DW_AT_decl_line   : 51
    <a7f>   DW_AT_decl_column : 8
    <a80>   DW_AT_sibling     : <0xaa3>
 <2><a84>: Abbrev Number: 18 (DW_TAG_member)
    <a85>   DW_AT_name        : val
    <a89>   DW_AT_decl_file   : 19
    <a8a>   DW_AT_decl_line   : 52
    <a8b>   DW_AT_decl_column : 11
    <a8c>   DW_AT_type        : <0x10f>
    <a90>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a93>: Abbrev Number: 18 (DW_TAG_member)
    <a94>   DW_AT_name        : str
    <a98>   DW_AT_decl_file   : 19
    <a99>   DW_AT_decl_line   : 53
    <a9a>   DW_AT_decl_column : 14
    <a9b>   DW_AT_type        : <0x1c2>
    <a9f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aa2>: Abbrev Number: 0
 <1><aa3>: Abbrev Number: 3 (DW_TAG_const_type)
    <aa4>   DW_AT_type        : <0xa77>
 <1><aa8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x1a55): xlat
    <aad>   DW_AT_byte_size   : 24
    <aae>   DW_AT_decl_file   : 19
    <aaf>   DW_AT_decl_line   : 56
    <ab0>   DW_AT_decl_column : 8
    <ab1>   DW_AT_sibling     : <0xb01>
 <2><ab5>: Abbrev Number: 9 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x1f27): data
    <aba>   DW_AT_decl_file   : 19
    <abb>   DW_AT_decl_line   : 57
    <abc>   DW_AT_decl_column : 26
    <abd>   DW_AT_type        : <0xb06>
    <ac1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac4>: Abbrev Number: 9 (DW_TAG_member)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x1440): flags_strsz
    <ac9>   DW_AT_decl_file   : 19
    <aca>   DW_AT_decl_line   : 58
    <acb>   DW_AT_decl_column : 9
    <acc>   DW_AT_type        : <0x122>
    <ad0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ad3>: Abbrev Number: 9 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xdce): size
    <ad8>   DW_AT_decl_file   : 19
    <ad9>   DW_AT_decl_line   : 59
    <ada>   DW_AT_decl_column : 11
    <adb>   DW_AT_type        : <0x103>
    <adf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ae2>: Abbrev Number: 9 (DW_TAG_member)
    <ae3>   DW_AT_name        : (indirect string, offset: 0x80b): type
    <ae7>   DW_AT_decl_file   : 19
    <ae8>   DW_AT_decl_line   : 60
    <ae9>   DW_AT_decl_column : 17
    <aea>   DW_AT_type        : <0xa15>
    <aee>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><af1>: Abbrev Number: 9 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0x15d5): flags_mask
    <af6>   DW_AT_decl_file   : 19
    <af7>   DW_AT_decl_line   : 61
    <af8>   DW_AT_decl_column : 11
    <af9>   DW_AT_type        : <0x10f>
    <afd>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b00>: Abbrev Number: 0
 <1><b01>: Abbrev Number: 3 (DW_TAG_const_type)
    <b02>   DW_AT_type        : <0xaa8>
 <1><b06>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b07>   DW_AT_byte_size   : 4
    <b08>   DW_AT_type        : <0xaa3>
 <1><b0c>: Abbrev Number: 15 (DW_TAG_array_type)
    <b0d>   DW_AT_type        : <0xb01>
    <b11>   DW_AT_sibling     : <0xb17>
 <2><b15>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b16>: Abbrev Number: 0
 <1><b17>: Abbrev Number: 3 (DW_TAG_const_type)
    <b18>   DW_AT_type        : <0xb0c>
 <1><b1c>: Abbrev Number: 10 (DW_TAG_variable)
    <b1d>   DW_AT_name        : (indirect string, offset: 0xff5): addrfams
    <b21>   DW_AT_decl_file   : 18
    <b22>   DW_AT_decl_line   : 409
    <b24>   DW_AT_decl_column : 26
    <b25>   DW_AT_type        : <0xb17>
    <b29>   DW_AT_external    : 1
    <b2a>   DW_AT_declaration : 1
 <1><b2b>: Abbrev Number: 10 (DW_TAG_variable)
    <b2c>   DW_AT_name        : (indirect string, offset: 0x24b6): arp_hardware_types
    <b30>   DW_AT_decl_file   : 18
    <b31>   DW_AT_decl_line   : 410
    <b33>   DW_AT_decl_column : 26
    <b34>   DW_AT_type        : <0xb17>
    <b38>   DW_AT_external    : 1
    <b39>   DW_AT_declaration : 1
 <1><b3a>: Abbrev Number: 10 (DW_TAG_variable)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x136c): at_flags
    <b3f>   DW_AT_decl_file   : 18
    <b40>   DW_AT_decl_line   : 411
    <b42>   DW_AT_decl_column : 26
    <b43>   DW_AT_type        : <0xb17>
    <b47>   DW_AT_external    : 1
    <b48>   DW_AT_declaration : 1
 <1><b49>: Abbrev Number: 10 (DW_TAG_variable)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x10a0): clocknames
    <b4e>   DW_AT_decl_file   : 18
    <b4f>   DW_AT_decl_line   : 412
    <b51>   DW_AT_decl_column : 26
    <b52>   DW_AT_type        : <0xb17>
    <b56>   DW_AT_external    : 1
    <b57>   DW_AT_declaration : 1
 <1><b58>: Abbrev Number: 10 (DW_TAG_variable)
    <b59>   DW_AT_name        : (indirect string, offset: 0xa4b): dirent_types
    <b5d>   DW_AT_decl_file   : 18
    <b5e>   DW_AT_decl_line   : 413
    <b60>   DW_AT_decl_column : 26
    <b61>   DW_AT_type        : <0xb17>
    <b65>   DW_AT_external    : 1
    <b66>   DW_AT_declaration : 1
 <1><b67>: Abbrev Number: 10 (DW_TAG_variable)
    <b68>   DW_AT_name        : (indirect string, offset: 0x846): ethernet_protocols
    <b6c>   DW_AT_decl_file   : 18
    <b6d>   DW_AT_decl_line   : 414
    <b6f>   DW_AT_decl_column : 26
    <b70>   DW_AT_type        : <0xb17>
    <b74>   DW_AT_external    : 1
    <b75>   DW_AT_declaration : 1
 <1><b76>: Abbrev Number: 10 (DW_TAG_variable)
    <b77>   DW_AT_name        : (indirect string, offset: 0x170b): inet_protocols
    <b7b>   DW_AT_decl_file   : 18
    <b7c>   DW_AT_decl_line   : 415
    <b7e>   DW_AT_decl_column : 26
    <b7f>   DW_AT_type        : <0xb17>
    <b83>   DW_AT_external    : 1
    <b84>   DW_AT_declaration : 1
 <1><b85>: Abbrev Number: 10 (DW_TAG_variable)
    <b86>   DW_AT_name        : (indirect string, offset: 0x2074): evdev_abs
    <b8a>   DW_AT_decl_file   : 18
    <b8b>   DW_AT_decl_line   : 416
    <b8d>   DW_AT_decl_column : 26
    <b8e>   DW_AT_type        : <0xb17>
    <b92>   DW_AT_external    : 1
    <b93>   DW_AT_declaration : 1
 <1><b94>: Abbrev Number: 10 (DW_TAG_variable)
    <b95>   DW_AT_name        : (indirect string, offset: 0x1960): audit_arch
    <b99>   DW_AT_decl_file   : 18
    <b9a>   DW_AT_decl_line   : 417
    <b9c>   DW_AT_decl_column : 26
    <b9d>   DW_AT_type        : <0xb17>
    <ba1>   DW_AT_external    : 1
    <ba2>   DW_AT_declaration : 1
 <1><ba3>: Abbrev Number: 10 (DW_TAG_variable)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x3bf): evdev_ev
    <ba8>   DW_AT_decl_file   : 18
    <ba9>   DW_AT_decl_line   : 418
    <bab>   DW_AT_decl_column : 26
    <bac>   DW_AT_type        : <0xb17>
    <bb0>   DW_AT_external    : 1
    <bb1>   DW_AT_declaration : 1
 <1><bb2>: Abbrev Number: 10 (DW_TAG_variable)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x1207): iffflags
    <bb7>   DW_AT_decl_file   : 18
    <bb8>   DW_AT_decl_line   : 419
    <bba>   DW_AT_decl_column : 26
    <bbb>   DW_AT_type        : <0xb17>
    <bbf>   DW_AT_external    : 1
    <bc0>   DW_AT_declaration : 1
 <1><bc1>: Abbrev Number: 10 (DW_TAG_variable)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x7e2): ip_type_of_services
    <bc6>   DW_AT_decl_file   : 18
    <bc7>   DW_AT_decl_line   : 420
    <bc9>   DW_AT_decl_column : 26
    <bca>   DW_AT_type        : <0xb17>
    <bce>   DW_AT_external    : 1
    <bcf>   DW_AT_declaration : 1
 <1><bd0>: Abbrev Number: 10 (DW_TAG_variable)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x2093): ipc_private
    <bd5>   DW_AT_decl_file   : 18
    <bd6>   DW_AT_decl_line   : 421
    <bd8>   DW_AT_decl_column : 26
    <bd9>   DW_AT_type        : <0xb17>
    <bdd>   DW_AT_external    : 1
    <bde>   DW_AT_declaration : 1
 <1><bdf>: Abbrev Number: 10 (DW_TAG_variable)
    <be0>   DW_AT_name        : (indirect string, offset: 0x160c): msg_flags
    <be4>   DW_AT_decl_file   : 18
    <be5>   DW_AT_decl_line   : 422
    <be7>   DW_AT_decl_column : 26
    <be8>   DW_AT_type        : <0xb17>
    <bec>   DW_AT_external    : 1
    <bed>   DW_AT_declaration : 1
 <1><bee>: Abbrev Number: 10 (DW_TAG_variable)
    <bef>   DW_AT_name        : (indirect string, offset: 0x1fd3): netlink_protocols
    <bf3>   DW_AT_decl_file   : 18
    <bf4>   DW_AT_decl_line   : 423
    <bf6>   DW_AT_decl_column : 26
    <bf7>   DW_AT_type        : <0xb17>
    <bfb>   DW_AT_external    : 1
    <bfc>   DW_AT_declaration : 1
 <1><bfd>: Abbrev Number: 10 (DW_TAG_variable)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x26b8): nl_bridge_vlan_flags
    <c02>   DW_AT_decl_file   : 18
    <c03>   DW_AT_decl_line   : 424
    <c05>   DW_AT_decl_column : 26
    <c06>   DW_AT_type        : <0xb17>
    <c0a>   DW_AT_external    : 1
    <c0b>   DW_AT_declaration : 1
 <1><c0c>: Abbrev Number: 10 (DW_TAG_variable)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x1639): nl_netfilter_msg_types
    <c11>   DW_AT_decl_file   : 18
    <c12>   DW_AT_decl_line   : 425
    <c14>   DW_AT_decl_column : 26
    <c15>   DW_AT_type        : <0xb17>
    <c19>   DW_AT_external    : 1
    <c1a>   DW_AT_declaration : 1
 <1><c1b>: Abbrev Number: 10 (DW_TAG_variable)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x20bd): nl_route_types
    <c20>   DW_AT_decl_file   : 18
    <c21>   DW_AT_decl_line   : 426
    <c23>   DW_AT_decl_column : 26
    <c24>   DW_AT_type        : <0xb17>
    <c28>   DW_AT_external    : 1
    <c29>   DW_AT_declaration : 1
 <1><c2a>: Abbrev Number: 10 (DW_TAG_variable)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x89f): open_access_modes
    <c2f>   DW_AT_decl_file   : 18
    <c30>   DW_AT_decl_line   : 427
    <c32>   DW_AT_decl_column : 26
    <c33>   DW_AT_type        : <0xb17>
    <c37>   DW_AT_external    : 1
    <c38>   DW_AT_declaration : 1
 <1><c39>: Abbrev Number: 10 (DW_TAG_variable)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x16aa): open_mode_flags
    <c3e>   DW_AT_decl_file   : 18
    <c3f>   DW_AT_decl_line   : 428
    <c41>   DW_AT_decl_column : 26
    <c42>   DW_AT_type        : <0xb17>
    <c46>   DW_AT_external    : 1
    <c47>   DW_AT_declaration : 1
 <1><c48>: Abbrev Number: 10 (DW_TAG_variable)
    <c49>   DW_AT_name        : (indirect string, offset: 0x1332): perf_type_id
    <c4d>   DW_AT_decl_file   : 18
    <c4e>   DW_AT_decl_line   : 429
    <c50>   DW_AT_decl_column : 26
    <c51>   DW_AT_type        : <0xb17>
    <c55>   DW_AT_external    : 1
    <c56>   DW_AT_declaration : 1
 <1><c57>: Abbrev Number: 10 (DW_TAG_variable)
    <c58>   DW_AT_name        : (indirect string, offset: 0x3fa): pollflags
    <c5c>   DW_AT_decl_file   : 18
    <c5d>   DW_AT_decl_line   : 430
    <c5f>   DW_AT_decl_column : 26
    <c60>   DW_AT_type        : <0xb17>
    <c64>   DW_AT_external    : 1
    <c65>   DW_AT_declaration : 1
 <1><c66>: Abbrev Number: 10 (DW_TAG_variable)
    <c67>   DW_AT_name        : (indirect string, offset: 0x1210): ptrace_cmds
    <c6b>   DW_AT_decl_file   : 18
    <c6c>   DW_AT_decl_line   : 431
    <c6e>   DW_AT_decl_column : 26
    <c6f>   DW_AT_type        : <0xb17>
    <c73>   DW_AT_external    : 1
    <c74>   DW_AT_declaration : 1
 <1><c75>: Abbrev Number: 10 (DW_TAG_variable)
    <c76>   DW_AT_name        : (indirect string, offset: 0x2497): resource_flags
    <c7a>   DW_AT_decl_file   : 18
    <c7b>   DW_AT_decl_line   : 432
    <c7d>   DW_AT_decl_column : 26
    <c7e>   DW_AT_type        : <0xb17>
    <c82>   DW_AT_external    : 1
    <c83>   DW_AT_declaration : 1
 <1><c84>: Abbrev Number: 10 (DW_TAG_variable)
    <c85>   DW_AT_name        : (indirect string, offset: 0x2344): route_nexthop_flags
    <c89>   DW_AT_decl_file   : 18
    <c8a>   DW_AT_decl_line   : 433
    <c8c>   DW_AT_decl_column : 26
    <c8d>   DW_AT_type        : <0xb17>
    <c91>   DW_AT_external    : 1
    <c92>   DW_AT_declaration : 1
 <1><c93>: Abbrev Number: 10 (DW_TAG_variable)
    <c94>   DW_AT_name        : (indirect string, offset: 0x15b1): routing_protocols
    <c98>   DW_AT_decl_file   : 18
    <c99>   DW_AT_decl_line   : 434
    <c9b>   DW_AT_decl_column : 26
    <c9c>   DW_AT_type        : <0xb17>
    <ca0>   DW_AT_external    : 1
    <ca1>   DW_AT_declaration : 1
 <1><ca2>: Abbrev Number: 10 (DW_TAG_variable)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x42e): routing_scopes
    <ca7>   DW_AT_decl_file   : 18
    <ca8>   DW_AT_decl_line   : 435
    <caa>   DW_AT_decl_column : 26
    <cab>   DW_AT_type        : <0xb17>
    <caf>   DW_AT_external    : 1
    <cb0>   DW_AT_declaration : 1
 <1><cb1>: Abbrev Number: 10 (DW_TAG_variable)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x165c): routing_table_ids
    <cb6>   DW_AT_decl_file   : 18
    <cb7>   DW_AT_decl_line   : 436
    <cb9>   DW_AT_decl_column : 26
    <cba>   DW_AT_type        : <0xb17>
    <cbe>   DW_AT_external    : 1
    <cbf>   DW_AT_declaration : 1
 <1><cc0>: Abbrev Number: 10 (DW_TAG_variable)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x2380): routing_types
    <cc5>   DW_AT_decl_file   : 18
    <cc6>   DW_AT_decl_line   : 437
    <cc8>   DW_AT_decl_column : 26
    <cc9>   DW_AT_type        : <0xb17>
    <ccd>   DW_AT_external    : 1
    <cce>   DW_AT_declaration : 1
 <1><ccf>: Abbrev Number: 10 (DW_TAG_variable)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x21c0): rwf_flags
    <cd4>   DW_AT_decl_file   : 18
    <cd5>   DW_AT_decl_line   : 438
    <cd7>   DW_AT_decl_column : 26
    <cd8>   DW_AT_type        : <0xb17>
    <cdc>   DW_AT_external    : 1
    <cdd>   DW_AT_declaration : 1
 <1><cde>: Abbrev Number: 10 (DW_TAG_variable)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x2572): seccomp_filter_flags
    <ce3>   DW_AT_decl_file   : 18
    <ce4>   DW_AT_decl_line   : 439
    <ce6>   DW_AT_decl_column : 26
    <ce7>   DW_AT_type        : <0xb17>
    <ceb>   DW_AT_external    : 1
    <cec>   DW_AT_declaration : 1
 <1><ced>: Abbrev Number: 10 (DW_TAG_variable)
    <cee>   DW_AT_name        : (indirect string, offset: 0x718): seccomp_ret_action
    <cf2>   DW_AT_decl_file   : 18
    <cf3>   DW_AT_decl_line   : 440
    <cf5>   DW_AT_decl_column : 26
    <cf6>   DW_AT_type        : <0xb17>
    <cfa>   DW_AT_external    : 1
    <cfb>   DW_AT_declaration : 1
 <1><cfc>: Abbrev Number: 10 (DW_TAG_variable)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x1ba5): setns_types
    <d01>   DW_AT_decl_file   : 18
    <d02>   DW_AT_decl_line   : 441
    <d04>   DW_AT_decl_column : 26
    <d05>   DW_AT_type        : <0xb17>
    <d09>   DW_AT_external    : 1
    <d0a>   DW_AT_declaration : 1
 <1><d0b>: Abbrev Number: 10 (DW_TAG_variable)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x18c5): sg_io_info
    <d10>   DW_AT_decl_file   : 18
    <d11>   DW_AT_decl_line   : 442
    <d13>   DW_AT_decl_column : 26
    <d14>   DW_AT_type        : <0xb17>
    <d18>   DW_AT_external    : 1
    <d19>   DW_AT_declaration : 1
 <1><d1a>: Abbrev Number: 10 (DW_TAG_variable)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x2655): socketlayers
    <d1f>   DW_AT_decl_file   : 18
    <d20>   DW_AT_decl_line   : 443
    <d22>   DW_AT_decl_column : 26
    <d23>   DW_AT_type        : <0xb17>
    <d27>   DW_AT_external    : 1
    <d28>   DW_AT_declaration : 1
 <1><d29>: Abbrev Number: 10 (DW_TAG_variable)
    <d2a>   DW_AT_name        : (indirect string, offset: 0xa58): socktypes
    <d2e>   DW_AT_decl_file   : 18
    <d2f>   DW_AT_decl_line   : 444
    <d31>   DW_AT_decl_column : 26
    <d32>   DW_AT_type        : <0xb17>
    <d36>   DW_AT_external    : 1
    <d37>   DW_AT_declaration : 1
 <1><d38>: Abbrev Number: 10 (DW_TAG_variable)
    <d39>   DW_AT_name        : (indirect string, offset: 0x1a32): tcp_state_flags
    <d3d>   DW_AT_decl_file   : 18
    <d3e>   DW_AT_decl_line   : 445
    <d40>   DW_AT_decl_column : 26
    <d41>   DW_AT_type        : <0xb17>
    <d45>   DW_AT_external    : 1
    <d46>   DW_AT_declaration : 1
 <1><d47>: Abbrev Number: 10 (DW_TAG_variable)
    <d48>   DW_AT_name        : (indirect string, offset: 0x18e1): tcp_states
    <d4c>   DW_AT_decl_file   : 18
    <d4d>   DW_AT_decl_line   : 446
    <d4f>   DW_AT_decl_column : 26
    <d50>   DW_AT_type        : <0xb17>
    <d54>   DW_AT_external    : 1
    <d55>   DW_AT_declaration : 1
 <1><d56>: Abbrev Number: 10 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0x20ff): whence_codes
    <d5b>   DW_AT_decl_file   : 18
    <d5c>   DW_AT_decl_line   : 447
    <d5e>   DW_AT_decl_column : 26
    <d5f>   DW_AT_type        : <0xb17>
    <d63>   DW_AT_external    : 1
    <d64>   DW_AT_declaration : 1
 <1><d65>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d66>   DW_AT_encoding    : 7	(unsigned)
    <d67>   DW_AT_byte_size   : 4
    <d68>   DW_AT_type        : <0x2b>
    <d6c>   DW_AT_decl_file   : 18
    <d6d>   DW_AT_decl_line   : 508
    <d6f>   DW_AT_decl_column : 14
    <d70>   DW_AT_sibling     : <0xd87>
 <2><d74>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d75>   DW_AT_name        : (indirect string, offset: 0xd92): CFLAG_NONE
    <d79>   DW_AT_const_value : 0
 <2><d7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x5db): CFLAG_ONLY_STATS
    <d7f>   DW_AT_const_value : 1
 <2><d80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d81>   DW_AT_name        : (indirect string, offset: 0x1a96): CFLAG_BOTH
    <d85>   DW_AT_const_value : 2
 <2><d86>: Abbrev Number: 0
 <1><d87>: Abbrev Number: 28 (DW_TAG_typedef)
    <d88>   DW_AT_name        : (indirect string, offset: 0x1239): cflag_t
    <d8c>   DW_AT_decl_file   : 18
    <d8d>   DW_AT_decl_line   : 512
    <d8f>   DW_AT_decl_column : 3
    <d90>   DW_AT_type        : <0xd65>
 <1><d94>: Abbrev Number: 10 (DW_TAG_variable)
    <d95>   DW_AT_name        : (indirect string, offset: 0x4fd): cflag
    <d99>   DW_AT_decl_file   : 18
    <d9a>   DW_AT_decl_line   : 513
    <d9c>   DW_AT_decl_column : 16
    <d9d>   DW_AT_type        : <0xd87>
    <da1>   DW_AT_external    : 1
    <da2>   DW_AT_declaration : 1
 <1><da3>: Abbrev Number: 10 (DW_TAG_variable)
    <da4>   DW_AT_name        : (indirect string, offset: 0x114c): Tflag
    <da8>   DW_AT_decl_file   : 18
    <da9>   DW_AT_decl_line   : 514
    <dab>   DW_AT_decl_column : 13
    <dac>   DW_AT_type        : <0x50e>
    <db0>   DW_AT_external    : 1
    <db1>   DW_AT_declaration : 1
 <1><db2>: Abbrev Number: 10 (DW_TAG_variable)
    <db3>   DW_AT_name        : (indirect string, offset: 0x1eb4): Tflag_scale
    <db7>   DW_AT_decl_file   : 18
    <db8>   DW_AT_decl_line   : 515
    <dba>   DW_AT_decl_column : 12
    <dbb>   DW_AT_type        : <0x64>
    <dbf>   DW_AT_external    : 1
    <dc0>   DW_AT_declaration : 1
 <1><dc1>: Abbrev Number: 10 (DW_TAG_variable)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xe2f): Tflag_width
    <dc6>   DW_AT_decl_file   : 18
    <dc7>   DW_AT_decl_line   : 516
    <dc9>   DW_AT_decl_column : 12
    <dca>   DW_AT_type        : <0x64>
    <dce>   DW_AT_external    : 1
    <dcf>   DW_AT_declaration : 1
 <1><dd0>: Abbrev Number: 10 (DW_TAG_variable)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x17): iflag
    <dd5>   DW_AT_decl_file   : 18
    <dd6>   DW_AT_decl_line   : 517
    <dd8>   DW_AT_decl_column : 13
    <dd9>   DW_AT_type        : <0x50e>
    <ddd>   DW_AT_external    : 1
    <dde>   DW_AT_declaration : 1
 <1><ddf>: Abbrev Number: 10 (DW_TAG_variable)
    <de0>   DW_AT_name        : (indirect string, offset: 0x21c): count_wallclock
    <de4>   DW_AT_decl_file   : 18
    <de5>   DW_AT_decl_line   : 518
    <de7>   DW_AT_decl_column : 13
    <de8>   DW_AT_type        : <0x50e>
    <dec>   DW_AT_external    : 1
    <ded>   DW_AT_declaration : 1
 <1><dee>: Abbrev Number: 29 (DW_TAG_structure_type)
    <def>   DW_AT_name        : (indirect string, offset: 0xa6a): path_set_item
    <df3>   DW_AT_byte_size   : 4
    <df4>   DW_AT_decl_file   : 18
    <df5>   DW_AT_decl_line   : 520
    <df7>   DW_AT_decl_column : 8
    <df8>   DW_AT_sibling     : <0xe0d>
 <2><dfc>: Abbrev Number: 22 (DW_TAG_member)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x17ef): path
    <e01>   DW_AT_decl_file   : 18
    <e02>   DW_AT_decl_line   : 521
    <e04>   DW_AT_decl_column : 14
    <e05>   DW_AT_type        : <0x1c2>
    <e09>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e0c>: Abbrev Number: 0
 <1><e0d>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x185b): path_set
    <e12>   DW_AT_byte_size   : 12
    <e13>   DW_AT_decl_file   : 18
    <e14>   DW_AT_decl_line   : 525
    <e16>   DW_AT_decl_column : 15
    <e17>   DW_AT_sibling     : <0xe4c>
 <2><e1b>: Abbrev Number: 22 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x1aee): paths_selected
    <e20>   DW_AT_decl_file   : 18
    <e21>   DW_AT_decl_line   : 526
    <e23>   DW_AT_decl_column : 24
    <e24>   DW_AT_type        : <0xe4c>
    <e28>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e2b>: Abbrev Number: 22 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x1fc6): num_selected
    <e30>   DW_AT_decl_file   : 18
    <e31>   DW_AT_decl_line   : 527
    <e33>   DW_AT_decl_column : 9
    <e34>   DW_AT_type        : <0x122>
    <e38>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e3b>: Abbrev Number: 22 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0xdce): size
    <e40>   DW_AT_decl_file   : 18
    <e41>   DW_AT_decl_line   : 528
    <e43>   DW_AT_decl_column : 9
    <e44>   DW_AT_type        : <0x122>
    <e48>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e4b>: Abbrev Number: 0
 <1><e4c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4d>   DW_AT_byte_size   : 4
    <e4e>   DW_AT_type        : <0xdee>
 <1><e52>: Abbrev Number: 10 (DW_TAG_variable)
    <e53>   DW_AT_name        : (indirect string, offset: 0xe3b): global_path_set
    <e57>   DW_AT_decl_file   : 18
    <e58>   DW_AT_decl_line   : 529
    <e5a>   DW_AT_decl_column : 3
    <e5b>   DW_AT_type        : <0xe0d>
    <e5f>   DW_AT_external    : 1
    <e60>   DW_AT_declaration : 1
 <1><e61>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e62>   DW_AT_name        : (indirect string, offset: 0x180e): xflag_opts
    <e66>   DW_AT_encoding    : 7	(unsigned)
    <e67>   DW_AT_byte_size   : 4
    <e68>   DW_AT_type        : <0x2b>
    <e6c>   DW_AT_decl_file   : 18
    <e6d>   DW_AT_decl_line   : 531
    <e6f>   DW_AT_decl_column : 6
    <e70>   DW_AT_sibling     : <0xe93>
 <2><e74>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e75>   DW_AT_name        : (indirect string, offset: 0x6d7): HEXSTR_NONE
    <e79>   DW_AT_const_value : 0
 <2><e7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e7b>   DW_AT_name        : (indirect string, offset: 0xe1e): HEXSTR_NON_ASCII
    <e7f>   DW_AT_const_value : 1
 <2><e80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e81>   DW_AT_name        : (indirect string, offset: 0x14f6): HEXSTR_ALL
    <e85>   DW_AT_const_value : 2
 <2><e86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e87>   DW_AT_name        : (indirect string, offset: 0xfb): HEXSTR_NON_ASCII_CHARS
    <e8b>   DW_AT_const_value : 3
 <2><e8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x1629): NUM_HEXSTR_OPTS
    <e91>   DW_AT_const_value : 4
 <2><e92>: Abbrev Number: 0
 <1><e93>: Abbrev Number: 10 (DW_TAG_variable)
    <e94>   DW_AT_name        : (indirect string, offset: 0x5c1): xflag
    <e98>   DW_AT_decl_file   : 18
    <e99>   DW_AT_decl_line   : 544
    <e9b>   DW_AT_decl_column : 17
    <e9c>   DW_AT_type        : <0x2b>
    <ea0>   DW_AT_external    : 1
    <ea1>   DW_AT_declaration : 1
 <1><ea2>: Abbrev Number: 10 (DW_TAG_variable)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x2023): followfork
    <ea7>   DW_AT_decl_file   : 18
    <ea8>   DW_AT_decl_line   : 545
    <eaa>   DW_AT_decl_column : 13
    <eab>   DW_AT_type        : <0x50e>
    <eaf>   DW_AT_external    : 1
    <eb0>   DW_AT_declaration : 1
 <1><eb1>: Abbrev Number: 10 (DW_TAG_variable)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x396): output_separately
    <eb6>   DW_AT_decl_file   : 18
    <eb7>   DW_AT_decl_line   : 546
    <eb9>   DW_AT_decl_column : 13
    <eba>   DW_AT_type        : <0x50e>
    <ebe>   DW_AT_external    : 1
    <ebf>   DW_AT_declaration : 1
 <1><ec0>: Abbrev Number: 10 (DW_TAG_variable)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x166e): stack_trace_enabled
    <ec5>   DW_AT_decl_file   : 18
    <ec6>   DW_AT_decl_line   : 549
    <ec8>   DW_AT_decl_column : 13
    <ec9>   DW_AT_type        : <0x50e>
    <ecd>   DW_AT_external    : 1
    <ece>   DW_AT_declaration : 1
 <1><ecf>: Abbrev Number: 10 (DW_TAG_variable)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x100f): ptrace_setoptions
    <ed4>   DW_AT_decl_file   : 18
    <ed5>   DW_AT_decl_line   : 553
    <ed7>   DW_AT_decl_column : 17
    <ed8>   DW_AT_type        : <0x2b>
    <edc>   DW_AT_external    : 1
    <edd>   DW_AT_declaration : 1
 <1><ede>: Abbrev Number: 10 (DW_TAG_variable)
    <edf>   DW_AT_name        : (indirect string, offset: 0xaa2): max_strlen
    <ee3>   DW_AT_decl_file   : 18
    <ee4>   DW_AT_decl_line   : 554
    <ee6>   DW_AT_decl_column : 17
    <ee7>   DW_AT_type        : <0x2b>
    <eeb>   DW_AT_external    : 1
    <eec>   DW_AT_declaration : 1
 <1><eed>: Abbrev Number: 10 (DW_TAG_variable)
    <eee>   DW_AT_name        : (indirect string, offset: 0x59b): os_release
    <ef2>   DW_AT_decl_file   : 18
    <ef3>   DW_AT_decl_line   : 555
    <ef5>   DW_AT_decl_column : 17
    <ef6>   DW_AT_type        : <0x2b>
    <efa>   DW_AT_external    : 1
    <efb>   DW_AT_declaration : 1
 <1><efc>: Abbrev Number: 10 (DW_TAG_variable)
    <efd>   DW_AT_name        : (indirect string, offset: 0x2215): xlat_verbosity
    <f01>   DW_AT_decl_file   : 18
    <f02>   DW_AT_decl_line   : 917
    <f04>   DW_AT_decl_column : 24
    <f05>   DW_AT_type        : <0xa3a>
    <f09>   DW_AT_external    : 1
    <f0a>   DW_AT_declaration : 1
 <1><f0b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x1dae): xlat_style_private_flag_bits
    <f10>   DW_AT_encoding    : 7	(unsigned)
    <f11>   DW_AT_byte_size   : 4
    <f12>   DW_AT_type        : <0x2b>
    <f16>   DW_AT_decl_file   : 18
    <f17>   DW_AT_decl_line   : 937
    <f19>   DW_AT_decl_column : 6
    <f1a>   DW_AT_sibling     : <0xf37>
 <2><f1e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x4a5): PAF_PRINT_INDICES_BIT
    <f23>   DW_AT_const_value : 5
 <2><f24>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x2045): PAF_ARRAY_TRUNCATED_BIT
    <f29>   DW_AT_const_value : 6
 <2><f2a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x1be5): PXF_DEFAULT_STR_BIT
    <f2f>   DW_AT_const_value : 7
 <2><f30>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0xdf4): SPFF_AUXSTR_MODE_BIT
    <f35>   DW_AT_const_value : 8
 <2><f36>: Abbrev Number: 0
 <1><f37>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f38>   DW_AT_name        : (indirect string, offset: 0x10ff): find_xlat_flag_bits
    <f3c>   DW_AT_encoding    : 7	(unsigned)
    <f3d>   DW_AT_byte_size   : 4
    <f3e>   DW_AT_type        : <0x2b>
    <f42>   DW_AT_decl_file   : 18
    <f43>   DW_AT_decl_line   : 1441
    <f45>   DW_AT_decl_column : 6
    <f46>   DW_AT_sibling     : <0xf51>
 <2><f4a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xd43): FXL_CASE_SENSITIVE_BIT
    <f4f>   DW_AT_const_value : 0
 <2><f50>: Abbrev Number: 0
 <1><f51>: Abbrev Number: 10 (DW_TAG_variable)
    <f52>   DW_AT_name        : (indirect string, offset: 0x2224): printing_tcp
    <f56>   DW_AT_decl_file   : 18
    <f57>   DW_AT_decl_line   : 1687
    <f59>   DW_AT_decl_column : 20
    <f5a>   DW_AT_type        : <0x5ea>
    <f5e>   DW_AT_external    : 1
    <f5f>   DW_AT_declaration : 1
 <1><f60>: Abbrev Number: 10 (DW_TAG_variable)
    <f61>   DW_AT_name        : (indirect string, offset: 0x2569): errnoent
    <f65>   DW_AT_decl_file   : 18
    <f66>   DW_AT_decl_line   : 1885
    <f68>   DW_AT_decl_column : 26
    <f69>   DW_AT_type        : <0x442>
    <f6d>   DW_AT_external    : 1
    <f6e>   DW_AT_declaration : 1
 <1><f6f>: Abbrev Number: 10 (DW_TAG_variable)
    <f70>   DW_AT_name        : (indirect string, offset: 0x1f45): signalent
    <f74>   DW_AT_decl_file   : 18
    <f75>   DW_AT_decl_line   : 1886
    <f77>   DW_AT_decl_column : 26
    <f78>   DW_AT_type        : <0x442>
    <f7c>   DW_AT_external    : 1
    <f7d>   DW_AT_declaration : 1
 <1><f7e>: Abbrev Number: 10 (DW_TAG_variable)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xa62): nerrnos
    <f83>   DW_AT_decl_file   : 18
    <f84>   DW_AT_decl_line   : 1887
    <f86>   DW_AT_decl_column : 27
    <f87>   DW_AT_type        : <0x32>
    <f8b>   DW_AT_external    : 1
    <f8c>   DW_AT_declaration : 1
 <1><f8d>: Abbrev Number: 10 (DW_TAG_variable)
    <f8e>   DW_AT_name        : (indirect string, offset: 0x2603): nsignals
    <f92>   DW_AT_decl_file   : 18
    <f93>   DW_AT_decl_line   : 1888
    <f95>   DW_AT_decl_column : 27
    <f96>   DW_AT_type        : <0x32>
    <f9a>   DW_AT_external    : 1
    <f9b>   DW_AT_declaration : 1
 <1><f9c>: Abbrev Number: 15 (DW_TAG_array_type)
    <f9d>   DW_AT_type        : <0x859>
    <fa1>   DW_AT_sibling     : <0xfa7>
 <2><fa5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fa6>: Abbrev Number: 0
 <1><fa7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fa8>   DW_AT_type        : <0xf9c>
 <1><fac>: Abbrev Number: 10 (DW_TAG_variable)
    <fad>   DW_AT_name        : (indirect string, offset: 0x1e48): sysent0
    <fb1>   DW_AT_decl_file   : 18
    <fb2>   DW_AT_decl_line   : 1890
    <fb4>   DW_AT_decl_column : 28
    <fb5>   DW_AT_type        : <0xfa7>
    <fb9>   DW_AT_external    : 1
    <fba>   DW_AT_declaration : 1
 <1><fbb>: Abbrev Number: 15 (DW_TAG_array_type)
    <fbc>   DW_AT_type        : <0x8c0>
    <fc0>   DW_AT_sibling     : <0xfc6>
 <2><fc4>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc5>: Abbrev Number: 0
 <1><fc6>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc7>   DW_AT_type        : <0xfbb>
 <1><fcb>: Abbrev Number: 10 (DW_TAG_variable)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x2186): ioctlent0
    <fd0>   DW_AT_decl_file   : 18
    <fd1>   DW_AT_decl_line   : 1891
    <fd3>   DW_AT_decl_column : 30
    <fd4>   DW_AT_type        : <0xfc6>
    <fd8>   DW_AT_external    : 1
    <fd9>   DW_AT_declaration : 1
 <1><fda>: Abbrev Number: 10 (DW_TAG_variable)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x1fe5): personality_names
    <fdf>   DW_AT_decl_file   : 18
    <fe0>   DW_AT_decl_line   : 1893
    <fe2>   DW_AT_decl_column : 26
    <fe3>   DW_AT_type        : <0x442>
    <fe7>   DW_AT_external    : 1
    <fe8>   DW_AT_declaration : 1
 <1><fe9>: Abbrev Number: 10 (DW_TAG_variable)
    <fea>   DW_AT_name        : (indirect string, offset: 0x999): sysent
    <fee>   DW_AT_decl_file   : 18
    <fef>   DW_AT_decl_line   : 1896
    <ff1>   DW_AT_decl_column : 29
    <ff2>   DW_AT_type        : <0x9a5>
    <ff6>   DW_AT_external    : 1
    <ff7>   DW_AT_declaration : 1
 <1><ff8>: Abbrev Number: 10 (DW_TAG_variable)
    <ff9>   DW_AT_name        : (indirect string, offset: 0xbc2): ioctlent
    <ffd>   DW_AT_decl_file   : 18
    <ffe>   DW_AT_decl_line   : 1897
    <1000>   DW_AT_decl_column : 31
    <1001>   DW_AT_type        : <0x1007>
    <1005>   DW_AT_external    : 1
    <1006>   DW_AT_declaration : 1
 <1><1007>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1008>   DW_AT_byte_size   : 4
    <1009>   DW_AT_type        : <0x8c0>
 <1><100d>: Abbrev Number: 10 (DW_TAG_variable)
    <100e>   DW_AT_name        : (indirect string, offset: 0x13c9): nsyscalls
    <1012>   DW_AT_decl_file   : 18
    <1013>   DW_AT_decl_line   : 1903
    <1015>   DW_AT_decl_column : 17
    <1016>   DW_AT_type        : <0x2b>
    <101a>   DW_AT_external    : 1
    <101b>   DW_AT_declaration : 1
 <1><101c>: Abbrev Number: 10 (DW_TAG_variable)
    <101d>   DW_AT_name        : (indirect string, offset: 0x1e78): nioctlents
    <1021>   DW_AT_decl_file   : 18
    <1022>   DW_AT_decl_line   : 1904
    <1024>   DW_AT_decl_column : 17
    <1025>   DW_AT_type        : <0x2b>
    <1029>   DW_AT_external    : 1
    <102a>   DW_AT_declaration : 1
 <1><102b>: Abbrev Number: 15 (DW_TAG_array_type)
    <102c>   DW_AT_type        : <0x32>
    <1030>   DW_AT_sibling     : <0x103b>
 <2><1034>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1035>   DW_AT_type        : <0x2b>
    <1039>   DW_AT_upper_bound : 2
 <2><103a>: Abbrev Number: 0
 <1><103b>: Abbrev Number: 3 (DW_TAG_const_type)
    <103c>   DW_AT_type        : <0x102b>
 <1><1040>: Abbrev Number: 10 (DW_TAG_variable)
    <1041>   DW_AT_name        : (indirect string, offset: 0x1ac5): nsyscall_vec
    <1045>   DW_AT_decl_file   : 18
    <1046>   DW_AT_decl_line   : 1906
    <1048>   DW_AT_decl_column : 27
    <1049>   DW_AT_type        : <0x103b>
    <104d>   DW_AT_external    : 1
    <104e>   DW_AT_declaration : 1
 <1><104f>: Abbrev Number: 15 (DW_TAG_array_type)
    <1050>   DW_AT_type        : <0x9ab>
    <1054>   DW_AT_sibling     : <0x105f>
 <2><1058>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1059>   DW_AT_type        : <0x2b>
    <105d>   DW_AT_upper_bound : 2
 <2><105e>: Abbrev Number: 0
 <1><105f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1060>   DW_AT_type        : <0x104f>
 <1><1064>: Abbrev Number: 10 (DW_TAG_variable)
    <1065>   DW_AT_name        : (indirect string, offset: 0x1803): sysent_vec
    <1069>   DW_AT_decl_file   : 18
    <106a>   DW_AT_decl_line   : 1907
    <106c>   DW_AT_decl_column : 35
    <106d>   DW_AT_type        : <0x105f>
    <1071>   DW_AT_external    : 1
    <1072>   DW_AT_declaration : 1
 <1><1073>: Abbrev Number: 10 (DW_TAG_variable)
    <1074>   DW_AT_name        : (indirect string, offset: 0x262b): inject_vec
    <1078>   DW_AT_decl_file   : 18
    <1079>   DW_AT_decl_line   : 1908
    <107b>   DW_AT_decl_column : 28
    <107c>   DW_AT_type        : <0x9b0>
    <1080>   DW_AT_external    : 1
    <1081>   DW_AT_declaration : 1
 <1><1082>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1083>   DW_AT_name        : (indirect string, offset: 0x1167): audit_arch_t
    <1087>   DW_AT_byte_size   : 8
    <1088>   DW_AT_decl_file   : 18
    <1089>   DW_AT_decl_line   : 1910
    <108b>   DW_AT_decl_column : 8
    <108c>   DW_AT_sibling     : <0x10b1>
 <2><1090>: Abbrev Number: 22 (DW_TAG_member)
    <1091>   DW_AT_name        : (indirect string, offset: 0x1cdc): arch
    <1095>   DW_AT_decl_file   : 18
    <1096>   DW_AT_decl_line   : 1911
    <1098>   DW_AT_decl_column : 15
    <1099>   DW_AT_type        : <0x2b>
    <109d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10a0>: Abbrev Number: 22 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x1501): flag
    <10a5>   DW_AT_decl_file   : 18
    <10a6>   DW_AT_decl_line   : 1912
    <10a8>   DW_AT_decl_column : 15
    <10a9>   DW_AT_type        : <0x2b>
    <10ad>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10b0>: Abbrev Number: 0
 <1><10b1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b2>   DW_AT_type        : <0x1082>
 <1><10b6>: Abbrev Number: 15 (DW_TAG_array_type)
    <10b7>   DW_AT_type        : <0x10b1>
    <10bb>   DW_AT_sibling     : <0x10c6>
 <2><10bf>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10c0>   DW_AT_type        : <0x2b>
    <10c4>   DW_AT_upper_bound : 2
 <2><10c5>: Abbrev Number: 0
 <1><10c6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c7>   DW_AT_type        : <0x10b6>
 <1><10cb>: Abbrev Number: 10 (DW_TAG_variable)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x9cb): audit_arch_vec
    <10d0>   DW_AT_decl_file   : 18
    <10d1>   DW_AT_decl_line   : 1915
    <10d3>   DW_AT_decl_column : 34
    <10d4>   DW_AT_type        : <0x10c6>
    <10d8>   DW_AT_external    : 1
    <10d9>   DW_AT_declaration : 1
 <1><10da>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10db>   DW_AT_byte_size   : 180
    <10dc>   DW_AT_decl_file   : 20
    <10dd>   DW_AT_decl_line   : 2
    <10de>   DW_AT_decl_column : 9
    <10df>   DW_AT_sibling     : <0x1394>
 <2><10e3>: Abbrev Number: 9 (DW_TAG_member)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x64e): block_ioctl
    <10e8>   DW_AT_decl_file   : 20
    <10e9>   DW_AT_decl_line   : 3
    <10ea>   DW_AT_decl_column : 8
    <10eb>   DW_AT_type        : <0x13ae>
    <10ef>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10f2>: Abbrev Number: 9 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0xdad): btrfs_ioctl
    <10f7>   DW_AT_decl_file   : 20
    <10f8>   DW_AT_decl_line   : 6
    <10f9>   DW_AT_decl_column : 8
    <10fa>   DW_AT_type        : <0x13ae>
    <10fe>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1101>: Abbrev Number: 9 (DW_TAG_member)
    <1102>   DW_AT_name        : (indirect string, offset: 0x10e7): evdev_write_ioctl_mpers
    <1106>   DW_AT_decl_file   : 20
    <1107>   DW_AT_decl_line   : 9
    <1108>   DW_AT_decl_column : 8
    <1109>   DW_AT_type        : <0x13ae>
    <110d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1110>: Abbrev Number: 9 (DW_TAG_member)
    <1111>   DW_AT_name        : (indirect string, offset: 0x133): get_sock_fprog_size
    <1115>   DW_AT_decl_file   : 20
    <1116>   DW_AT_decl_line   : 12
    <1117>   DW_AT_decl_column : 17
    <1118>   DW_AT_type        : <0x13ba>
    <111c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><111f>: Abbrev Number: 9 (DW_TAG_member)
    <1120>   DW_AT_name        : (indirect string, offset: 0x238e): fetch_bpf_fprog
    <1124>   DW_AT_decl_file   : 20
    <1125>   DW_AT_decl_line   : 15
    <1126>   DW_AT_decl_column : 10
    <1127>   DW_AT_type        : <0x13da>
    <112b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><112e>: Abbrev Number: 9 (DW_TAG_member)
    <112f>   DW_AT_name        : (indirect string, offset: 0x14cc): fetch_struct_flock
    <1133>   DW_AT_decl_file   : 20
    <1134>   DW_AT_decl_line   : 18
    <1135>   DW_AT_decl_column : 10
    <1136>   DW_AT_type        : <0x13da>
    <113a>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><113d>: Abbrev Number: 9 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x18ff): fetch_struct_flock64
    <1142>   DW_AT_decl_file   : 20
    <1143>   DW_AT_decl_line   : 21
    <1144>   DW_AT_decl_column : 10
    <1145>   DW_AT_type        : <0x13da>
    <1149>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
