Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1744 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x51d): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc38): mpers-mx32/struct_blk_user_trace_setup.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xf85): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c2): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10f4): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0xa1a): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x35f): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x258): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xed9): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4b7): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8e8): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xfd6): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x927): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7db): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbfa): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xc30): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xdd5): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xd4a): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x424): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x480): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x36b): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xc1b): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x107e): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xee9): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2be): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb91): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x11fa): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xf0f): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xdf>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 31
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 16
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xb53): long double
 <1><176>: Abbrev Number: 12 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x275): __environ
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 543
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x185>
    <183>   DW_AT_external    : 1
    <184>   DW_AT_declaration : 1
 <1><185>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 4
    <187>   DW_AT_type        : <0xd9>
 <1><18b>: Abbrev Number: 12 (DW_TAG_variable)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3ba): environ
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 545
    <193>   DW_AT_decl_column : 15
    <194>   DW_AT_type        : <0x185>
    <198>   DW_AT_external    : 1
    <199>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 13 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0x10d5): optarg
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 36
    <1a1>   DW_AT_decl_column : 14
    <1a2>   DW_AT_type        : <0xd9>
    <1a6>   DW_AT_external    : 1
    <1a7>   DW_AT_declaration : 1
 <1><1a8>: Abbrev Number: 13 (DW_TAG_variable)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x79e): optind
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 50
    <1af>   DW_AT_decl_column : 12
    <1b0>   DW_AT_type        : <0x64>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 13 (DW_TAG_variable)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xd25): opterr
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 55
    <1bd>   DW_AT_decl_column : 12
    <1be>   DW_AT_type        : <0x64>
    <1c2>   DW_AT_external    : 1
    <1c3>   DW_AT_declaration : 1
 <1><1c4>: Abbrev Number: 13 (DW_TAG_variable)
    <1c5>   DW_AT_name        : (indirect string, offset: 0xbe0): optopt
    <1c9>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 59
    <1cb>   DW_AT_decl_column : 12
    <1cc>   DW_AT_type        : <0x64>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d3>   DW_AT_byte_size   : 4
    <1d4>   DW_AT_type        : <0xe6>
 <1><1d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d9>   DW_AT_type        : <0x1d2>
 <1><1dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1e4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x373): _IO_FILE
    <1e9>   DW_AT_byte_size   : 152
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 49
    <1ec>   DW_AT_decl_column : 8
    <1ed>   DW_AT_sibling     : <0x3a5>
 <2><1f1>: Abbrev Number: 9 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0xa96): _flags
    <1f6>   DW_AT_decl_file   : 7
    <1f7>   DW_AT_decl_line   : 51
    <1f8>   DW_AT_decl_column : 7
    <1f9>   DW_AT_type        : <0x64>
    <1fd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x510): _IO_read_ptr
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 54
    <207>   DW_AT_decl_column : 9
    <208>   DW_AT_type        : <0xd9>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x102b): _IO_read_end
    <214>   DW_AT_decl_file   : 7
    <215>   DW_AT_decl_line   : 55
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xd9>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x820): _IO_read_base
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xd9>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x13b): _IO_write_base
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 57
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xd9>
    <239>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x112d): _IO_write_ptr
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 58
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xd9>
    <248>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x97f): _IO_write_end
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 59
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xd9>
    <257>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xa03): _IO_buf_base
    <25f>   DW_AT_decl_file   : 7
    <260>   DW_AT_decl_line   : 60
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xd9>
    <266>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xe6d): _IO_buf_end
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 61
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xd9>
    <275>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x1cc): _IO_save_base
    <27d>   DW_AT_decl_file   : 7
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xd9>
    <284>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xd9c): _IO_backup_base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 65
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xd9>
    <293>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 66
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xd9>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x646): _markers
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 68
    <2ac>   DW_AT_decl_column : 22
    <2ad>   DW_AT_type        : <0x3bf>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x20f): _chain
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 70
    <2bb>   DW_AT_decl_column : 20
    <2bc>   DW_AT_type        : <0x3c5>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x10a4): _fileno
    <2c8>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 72
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x64>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x80c): _flags2
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 73
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x894): _old_offset
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 74
    <2e8>   DW_AT_decl_column : 11
    <2e9>   DW_AT_type        : <0xa2>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x23d): _cur_column
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 77
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x24>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xf44): _vtable_offset
    <304>   DW_AT_decl_file   : 7
    <305>   DW_AT_decl_line   : 78
    <306>   DW_AT_decl_column : 15
    <307>   DW_AT_type        : <0x3e>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xdac): _shortbuf
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 79
    <315>   DW_AT_decl_column : 8
    <316>   DW_AT_type        : <0x3cb>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x17c): _lock
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 81
    <324>   DW_AT_decl_column : 15
    <325>   DW_AT_type        : <0x3db>
    <329>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x736): _offset
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 89
    <333>   DW_AT_decl_column : 13
    <334>   DW_AT_type        : <0xae>
    <338>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xad6): _codecvt
    <340>   DW_AT_decl_file   : 7
    <341>   DW_AT_decl_line   : 91
    <342>   DW_AT_decl_column : 23
    <343>   DW_AT_type        : <0x3e7>
    <347>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0x10b9): _wide_data
    <34f>   DW_AT_decl_file   : 7
    <350>   DW_AT_decl_line   : 92
    <351>   DW_AT_decl_column : 25
    <352>   DW_AT_type        : <0x3f3>
    <356>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x3de): _freeres_list
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 93
    <360>   DW_AT_decl_column : 20
    <361>   DW_AT_type        : <0x3c5>
    <365>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xcfb): _freeres_buf
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 94
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_type        : <0xc6>
    <374>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0xa58): __pad5
    <37c>   DW_AT_decl_file   : 7
    <37d>   DW_AT_decl_line   : 95
    <37e>   DW_AT_decl_column : 10
    <37f>   DW_AT_type        : <0x122>
    <383>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0xaba): _mode
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 96
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x64>
    <392>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x849): _unused2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 98
    <39c>   DW_AT_decl_column : 8
    <39d>   DW_AT_type        : <0x3f9>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xb73): FILE
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 7
    <3ac>   DW_AT_decl_column : 25
    <3ad>   DW_AT_type        : <0x1e4>
 <1><3b1>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x4ac): _IO_lock_t
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 43
    <3b8>   DW_AT_decl_column : 14
 <1><3b9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x30f): _IO_marker
    <3be>   DW_AT_declaration : 1
 <1><3bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c1>   DW_AT_type        : <0x3b9>
 <1><3c5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c6>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x1e4>
 <1><3cb>: Abbrev Number: 10 (DW_TAG_array_type)
    <3cc>   DW_AT_type        : <0xdf>
    <3d0>   DW_AT_sibling     : <0x3db>
 <2><3d4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3d5>   DW_AT_type        : <0x2b>
    <3d9>   DW_AT_upper_bound : 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3b1>
 <1><3e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3e6>   DW_AT_declaration : 1
 <1><3e7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e8>   DW_AT_byte_size   : 4
    <3e9>   DW_AT_type        : <0x3e1>
 <1><3ed>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x387): _IO_wide_data
    <3f2>   DW_AT_declaration : 1
 <1><3f3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f4>   DW_AT_byte_size   : 4
    <3f5>   DW_AT_type        : <0x3ed>
 <1><3f9>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fa>   DW_AT_type        : <0xdf>
    <3fe>   DW_AT_sibling     : <0x409>
 <2><402>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <403>   DW_AT_type        : <0x2b>
    <407>   DW_AT_upper_bound : 39
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 13 (DW_TAG_variable)
    <40a>   DW_AT_name        : (indirect string, offset: 0x5f5): stdin
    <40e>   DW_AT_decl_file   : 9
    <40f>   DW_AT_decl_line   : 137
    <410>   DW_AT_decl_column : 14
    <411>   DW_AT_type        : <0x417>
    <415>   DW_AT_external    : 1
    <416>   DW_AT_declaration : 1
 <1><417>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <418>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3a5>
 <1><41d>: Abbrev Number: 13 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x1107): stdout
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 138
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x417>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 13 (DW_TAG_variable)
    <42c>   DW_AT_name        : (indirect string, offset: 0xed2): stderr
    <430>   DW_AT_decl_file   : 9
    <431>   DW_AT_decl_line   : 139
    <432>   DW_AT_decl_column : 14
    <433>   DW_AT_type        : <0x417>
    <437>   DW_AT_external    : 1
    <438>   DW_AT_declaration : 1
 <1><439>: Abbrev Number: 13 (DW_TAG_variable)
    <43a>   DW_AT_name        : (indirect string, offset: 0x24f): sys_nerr
    <43e>   DW_AT_decl_file   : 10
    <43f>   DW_AT_decl_line   : 26
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0x64>
    <445>   DW_AT_external    : 1
    <446>   DW_AT_declaration : 1
 <1><447>: Abbrev Number: 10 (DW_TAG_array_type)
    <448>   DW_AT_type        : <0x1d8>
    <44c>   DW_AT_sibling     : <0x452>
 <2><450>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 3 (DW_TAG_const_type)
    <453>   DW_AT_type        : <0x447>
 <1><457>: Abbrev Number: 13 (DW_TAG_variable)
    <458>   DW_AT_name        : (indirect string, offset: 0x60c): sys_errlist
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 27
    <45e>   DW_AT_decl_column : 26
    <45f>   DW_AT_type        : <0x452>
    <463>   DW_AT_external    : 1
    <464>   DW_AT_declaration : 1
 <1><465>: Abbrev Number: 13 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x262): _sys_nerr
    <46a>   DW_AT_decl_file   : 10
    <46b>   DW_AT_decl_line   : 30
    <46c>   DW_AT_decl_column : 12
    <46d>   DW_AT_type        : <0x64>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 13 (DW_TAG_variable)
    <474>   DW_AT_name        : (indirect string, offset: 0xf53): _sys_errlist
    <478>   DW_AT_decl_file   : 10
    <479>   DW_AT_decl_line   : 31
    <47a>   DW_AT_decl_column : 26
    <47b>   DW_AT_type        : <0x452>
    <47f>   DW_AT_external    : 1
    <480>   DW_AT_declaration : 1
 <1><481>: Abbrev Number: 13 (DW_TAG_variable)
    <482>   DW_AT_name        : (indirect string, offset: 0x70f): program_invocation_name
    <486>   DW_AT_decl_file   : 11
    <487>   DW_AT_decl_line   : 45
    <488>   DW_AT_decl_column : 14
    <489>   DW_AT_type        : <0xd9>
    <48d>   DW_AT_external    : 1
    <48e>   DW_AT_declaration : 1
 <1><48f>: Abbrev Number: 13 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0xc84): program_invocation_short_name
    <494>   DW_AT_decl_file   : 11
    <495>   DW_AT_decl_line   : 46
    <496>   DW_AT_decl_column : 14
    <497>   DW_AT_type        : <0xd9>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 10 (DW_TAG_array_type)
    <49e>   DW_AT_type        : <0xd9>
    <4a2>   DW_AT_sibling     : <0x4ad>
 <2><4a6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4a7>   DW_AT_type        : <0x2b>
    <4ab>   DW_AT_upper_bound : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 13 (DW_TAG_variable)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1b9): __tzname
    <4b2>   DW_AT_decl_file   : 12
    <4b3>   DW_AT_decl_line   : 159
    <4b4>   DW_AT_decl_column : 14
    <4b5>   DW_AT_type        : <0x49d>
    <4b9>   DW_AT_external    : 1
    <4ba>   DW_AT_declaration : 1
 <1><4bb>: Abbrev Number: 13 (DW_TAG_variable)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xfbd): __daylight
    <4c0>   DW_AT_decl_file   : 12
    <4c1>   DW_AT_decl_line   : 160
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x64>
    <4c7>   DW_AT_external    : 1
    <4c8>   DW_AT_declaration : 1
 <1><4c9>: Abbrev Number: 13 (DW_TAG_variable)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x37c): __timezone
    <4ce>   DW_AT_decl_file   : 12
    <4cf>   DW_AT_decl_line   : 161
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x11b>
    <4d5>   DW_AT_external    : 1
    <4d6>   DW_AT_declaration : 1
 <1><4d7>: Abbrev Number: 13 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0xa51): tzname
    <4dc>   DW_AT_decl_file   : 12
    <4dd>   DW_AT_decl_line   : 166
    <4de>   DW_AT_decl_column : 14
    <4df>   DW_AT_type        : <0x49d>
    <4e3>   DW_AT_external    : 1
    <4e4>   DW_AT_declaration : 1
 <1><4e5>: Abbrev Number: 13 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x1177): daylight
    <4ea>   DW_AT_decl_file   : 12
    <4eb>   DW_AT_decl_line   : 174
    <4ec>   DW_AT_decl_column : 12
    <4ed>   DW_AT_type        : <0x64>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 13 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x4fb): timezone
    <4f8>   DW_AT_decl_file   : 12
    <4f9>   DW_AT_decl_line   : 175
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x11b>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 12 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0x1052): getdate_err
    <506>   DW_AT_decl_file   : 12
    <507>   DW_AT_decl_line   : 274
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0x64>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 13 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0xa64): debug_flag
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 20
    <517>   DW_AT_decl_column : 13
    <518>   DW_AT_type        : <0x51e>
    <51c>   DW_AT_external    : 1
    <51d>   DW_AT_declaration : 1
 <1><51e>: Abbrev Number: 2 (DW_TAG_base_type)
    <51f>   DW_AT_byte_size   : 1
    <520>   DW_AT_encoding    : 2	(boolean)
    <521>   DW_AT_name        : (indirect string, offset: 0x436): _Bool
 <1><525>: Abbrev Number: 3 (DW_TAG_const_type)
    <526>   DW_AT_type        : <0x51e>
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0xb29): __kernel_long_t
    <52f>   DW_AT_decl_file   : 14
    <530>   DW_AT_decl_line   : 14
    <531>   DW_AT_decl_column : 19
    <532>   DW_AT_type        : <0x88>
 <1><536>: Abbrev Number: 4 (DW_TAG_typedef)
    <537>   DW_AT_name        : (indirect string, offset: 0x5e4): __kernel_ulong_t
    <53b>   DW_AT_decl_file   : 14
    <53c>   DW_AT_decl_line   : 15
    <53d>   DW_AT_decl_column : 28
    <53e>   DW_AT_type        : <0x9b>
 <1><542>: Abbrev Number: 4 (DW_TAG_typedef)
    <543>   DW_AT_name        : (indirect string, offset: 0x3ec): kernel_long_t
    <547>   DW_AT_decl_file   : 15
    <548>   DW_AT_decl_line   : 16
    <549>   DW_AT_decl_column : 25
    <54a>   DW_AT_type        : <0x52a>
 <1><54e>: Abbrev Number: 4 (DW_TAG_typedef)
    <54f>   DW_AT_name        : (indirect string, offset: 0x918): kernel_ulong_t
    <553>   DW_AT_decl_file   : 15
    <554>   DW_AT_decl_line   : 17
    <555>   DW_AT_decl_column : 26
    <556>   DW_AT_type        : <0x536>
 <1><55a>: Abbrev Number: 3 (DW_TAG_const_type)
    <55b>   DW_AT_type        : <0x54e>
 <1><55f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <560>   DW_AT_name        : (indirect string, offset: 0xca2): list_item
    <564>   DW_AT_byte_size   : 8
    <565>   DW_AT_decl_file   : 16
    <566>   DW_AT_decl_line   : 92
    <567>   DW_AT_decl_column : 8
    <568>   DW_AT_sibling     : <0x58b>
 <2><56c>: Abbrev Number: 9 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x11f5): prev
    <571>   DW_AT_decl_file   : 16
    <572>   DW_AT_decl_line   : 93
    <573>   DW_AT_decl_column : 20
    <574>   DW_AT_type        : <0x58b>
    <578>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x11d6): next
    <580>   DW_AT_decl_file   : 16
    <581>   DW_AT_decl_line   : 94
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x58b>
    <587>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><58a>: Abbrev Number: 0
 <1><58b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <58c>   DW_AT_byte_size   : 4
    <58d>   DW_AT_type        : <0x55f>
 <1><591>: Abbrev Number: 8 (DW_TAG_structure_type)
    <592>   DW_AT_name        : (indirect string, offset: 0x8e1): sysent
    <596>   DW_AT_byte_size   : 20
    <597>   DW_AT_decl_file   : 17
    <598>   DW_AT_decl_line   : 13
    <599>   DW_AT_decl_column : 16
    <59a>   DW_AT_sibling     : <0x5ea>
 <2><59e>: Abbrev Number: 9 (DW_TAG_member)
    <59f>   DW_AT_name        : (indirect string, offset: 0x111e): nargs
    <5a3>   DW_AT_decl_file   : 17
    <5a4>   DW_AT_decl_line   : 14
    <5a5>   DW_AT_decl_column : 11
    <5a6>   DW_AT_type        : <0x2b>
    <5aa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xa10): sys_flags
    <5b2>   DW_AT_decl_file   : 17
    <5b3>   DW_AT_decl_line   : 15
    <5b4>   DW_AT_decl_column : 6
    <5b5>   DW_AT_type        : <0x64>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5bc>: Abbrev Number: 18 (DW_TAG_member)
    <5bd>   DW_AT_name        : sen
    <5c1>   DW_AT_decl_file   : 17
    <5c2>   DW_AT_decl_line   : 16
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x64>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5cb>: Abbrev Number: 9 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x2f7): sys_func
    <5d0>   DW_AT_decl_file   : 17
    <5d1>   DW_AT_decl_line   : 17
    <5d2>   DW_AT_decl_column : 8
    <5d3>   DW_AT_type        : <0x857>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x26c): sys_name
    <5df>   DW_AT_decl_file   : 17
    <5e0>   DW_AT_decl_line   : 18
    <5e1>   DW_AT_decl_column : 14
    <5e2>   DW_AT_type        : <0x1d2>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5eb>   DW_AT_prototyped  : 1
    <5ec>   DW_AT_type        : <0x64>
    <5f0>   DW_AT_sibling     : <0x5fa>
 <2><5f4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5f5>   DW_AT_type        : <0x5fa>
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5fb>   DW_AT_byte_size   : 4
    <5fc>   DW_AT_type        : <0x605>
 <1><600>: Abbrev Number: 3 (DW_TAG_const_type)
    <601>   DW_AT_type        : <0x5fa>
 <1><605>: Abbrev Number: 21 (DW_TAG_structure_type)
    <606>   DW_AT_name        : tcb
    <60a>   DW_AT_byte_size   : 288
    <60c>   DW_AT_decl_file   : 18
    <60d>   DW_AT_decl_line   : 262
    <60f>   DW_AT_decl_column : 8
    <610>   DW_AT_sibling     : <0x857>
 <2><614>: Abbrev Number: 22 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x50a): flags
    <619>   DW_AT_decl_file   : 18
    <61a>   DW_AT_decl_line   : 263
    <61c>   DW_AT_decl_column : 6
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><624>: Abbrev Number: 23 (DW_TAG_member)
    <625>   DW_AT_name        : pid
    <629>   DW_AT_decl_file   : 18
    <62a>   DW_AT_decl_line   : 264
    <62c>   DW_AT_decl_column : 6
    <62d>   DW_AT_type        : <0x64>
    <631>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><634>: Abbrev Number: 22 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <639>   DW_AT_decl_file   : 18
    <63a>   DW_AT_decl_line   : 265
    <63c>   DW_AT_decl_column : 6
    <63d>   DW_AT_type        : <0x64>
    <641>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><644>: Abbrev Number: 22 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x3a6): currpers
    <649>   DW_AT_decl_file   : 18
    <64a>   DW_AT_decl_line   : 267
    <64c>   DW_AT_decl_column : 15
    <64d>   DW_AT_type        : <0x2b>
    <651>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><654>: Abbrev Number: 22 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0xbc6): u_error
    <659>   DW_AT_decl_file   : 18
    <65a>   DW_AT_decl_line   : 269
    <65c>   DW_AT_decl_column : 16
    <65d>   DW_AT_type        : <0x37>
    <661>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><664>: Abbrev Number: 22 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x199): scno
    <669>   DW_AT_decl_file   : 18
    <66a>   DW_AT_decl_line   : 270
    <66c>   DW_AT_decl_column : 17
    <66d>   DW_AT_type        : <0x54e>
    <671>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><674>: Abbrev Number: 22 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0xc11): true_scno
    <679>   DW_AT_decl_file   : 18
    <67a>   DW_AT_decl_line   : 271
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x54e>
    <681>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><684>: Abbrev Number: 22 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x1a3): u_arg
    <689>   DW_AT_decl_file   : 18
    <68a>   DW_AT_decl_line   : 272
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x987>
    <691>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><694>: Abbrev Number: 22 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0xa27): u_rval
    <699>   DW_AT_decl_file   : 18
    <69a>   DW_AT_decl_line   : 273
    <69c>   DW_AT_decl_column : 16
    <69d>   DW_AT_type        : <0x542>
    <6a1>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6a4>: Abbrev Number: 22 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0xb45): sys_func_rval
    <6a9>   DW_AT_decl_file   : 18
    <6aa>   DW_AT_decl_line   : 274
    <6ac>   DW_AT_decl_column : 6
    <6ad>   DW_AT_type        : <0x64>
    <6b1>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6b4>: Abbrev Number: 22 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0xdc6): curcol
    <6b9>   DW_AT_decl_file   : 18
    <6ba>   DW_AT_decl_line   : 275
    <6bc>   DW_AT_decl_column : 6
    <6bd>   DW_AT_type        : <0x64>
    <6c1>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6c4>: Abbrev Number: 22 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0xa39): outf
    <6c9>   DW_AT_decl_file   : 18
    <6ca>   DW_AT_decl_line   : 276
    <6cc>   DW_AT_decl_column : 8
    <6cd>   DW_AT_type        : <0x417>
    <6d1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6d4>: Abbrev Number: 22 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0xffc): staged_output_data
    <6d9>   DW_AT_decl_file   : 18
    <6da>   DW_AT_decl_line   : 277
    <6dc>   DW_AT_decl_column : 29
    <6dd>   DW_AT_type        : <0x99d>
    <6e1>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6e4>: Abbrev Number: 22 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0xb01): auxstr
    <6e9>   DW_AT_decl_file   : 18
    <6ea>   DW_AT_decl_line   : 279
    <6ec>   DW_AT_decl_column : 14
    <6ed>   DW_AT_type        : <0x1d2>
    <6f1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6f4>: Abbrev Number: 22 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x182): _priv_data
    <6f9>   DW_AT_decl_file   : 18
    <6fa>   DW_AT_decl_line   : 280
    <6fc>   DW_AT_decl_column : 8
    <6fd>   DW_AT_type        : <0xc6>
    <701>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><704>: Abbrev Number: 22 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xccf): _free_priv_data
    <709>   DW_AT_decl_file   : 18
    <70a>   DW_AT_decl_line   : 281
    <70c>   DW_AT_decl_column : 9
    <70d>   DW_AT_type        : <0x9af>
    <711>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><714>: Abbrev Number: 22 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x193): s_ent
    <719>   DW_AT_decl_file   : 18
    <71a>   DW_AT_decl_line   : 282
    <71c>   DW_AT_decl_column : 23
    <71d>   DW_AT_type        : <0x9b5>
    <721>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><724>: Abbrev Number: 22 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <729>   DW_AT_decl_file   : 18
    <72a>   DW_AT_decl_line   : 285
    <72c>   DW_AT_decl_column : 23
    <72d>   DW_AT_type        : <0x9b5>
    <731>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><735>: Abbrev Number: 22 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0x39b): inject_vec
    <73a>   DW_AT_decl_file   : 18
    <73b>   DW_AT_decl_line   : 286
    <73d>   DW_AT_decl_column : 22
    <73e>   DW_AT_type        : <0x9c0>
    <742>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><746>: Abbrev Number: 22 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x852): stime
    <74b>   DW_AT_decl_file   : 18
    <74c>   DW_AT_decl_line   : 287
    <74e>   DW_AT_decl_column : 18
    <74f>   DW_AT_type        : <0x133>
    <753>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><757>: Abbrev Number: 22 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x3af): ltime
    <75c>   DW_AT_decl_file   : 18
    <75d>   DW_AT_decl_line   : 288
    <75f>   DW_AT_decl_column : 18
    <760>   DW_AT_type        : <0x133>
    <764>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><768>: Abbrev Number: 22 (DW_TAG_member)
    <769>   DW_AT_name        : (indirect string, offset: 0x10dc): atime
    <76d>   DW_AT_decl_file   : 18
    <76e>   DW_AT_decl_line   : 289
    <770>   DW_AT_decl_column : 18
    <771>   DW_AT_type        : <0x133>
    <775>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><779>: Abbrev Number: 22 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x504): etime
    <77e>   DW_AT_decl_file   : 18
    <77f>   DW_AT_decl_line   : 290
    <781>   DW_AT_decl_column : 18
    <782>   DW_AT_type        : <0x133>
    <786>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><78a>: Abbrev Number: 22 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0xe2a): delay_expiration_time
    <78f>   DW_AT_decl_file   : 18
    <790>   DW_AT_decl_line   : 291
    <792>   DW_AT_decl_column : 18
    <793>   DW_AT_type        : <0x133>
    <797>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><79b>: Abbrev Number: 22 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a0>   DW_AT_decl_file   : 18
    <7a1>   DW_AT_decl_line   : 298
    <7a3>   DW_AT_decl_column : 15
    <7a4>   DW_AT_type        : <0x2b>
    <7a8>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7ac>: Abbrev Number: 22 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x1038): last_dirfd
    <7b1>   DW_AT_decl_file   : 18
    <7b2>   DW_AT_decl_line   : 301
    <7b4>   DW_AT_decl_column : 6
    <7b5>   DW_AT_type        : <0x64>
    <7b9>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7bd>: Abbrev Number: 22 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x105e): mmap_cache
    <7c2>   DW_AT_decl_file   : 18
    <7c3>   DW_AT_decl_line   : 304
    <7c5>   DW_AT_decl_column : 23
    <7c6>   DW_AT_type        : <0x9dc>
    <7ca>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ce>: Abbrev Number: 22 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0xbe7): wait_data_idx
    <7d3>   DW_AT_decl_file   : 18
    <7d4>   DW_AT_decl_line   : 311
    <7d6>   DW_AT_decl_column : 9
    <7d7>   DW_AT_type        : <0x122>
    <7db>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7df>: Abbrev Number: 22 (DW_TAG_member)
    <7e0>   DW_AT_name        : (indirect string, offset: 0xb08): delayed_wait_data
    <7e4>   DW_AT_decl_file   : 18
    <7e5>   DW_AT_decl_line   : 313
    <7e7>   DW_AT_decl_column : 24
    <7e8>   DW_AT_type        : <0x9e8>
    <7ec>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f0>: Abbrev Number: 22 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0xb87): wait_list
    <7f5>   DW_AT_decl_file   : 18
    <7f6>   DW_AT_decl_line   : 314
    <7f8>   DW_AT_decl_column : 19
    <7f9>   DW_AT_type        : <0x55f>
    <7fd>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><801>: Abbrev Number: 22 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0x727): vcpu_info_list
    <806>   DW_AT_decl_file   : 18
    <807>   DW_AT_decl_line   : 318
    <809>   DW_AT_decl_column : 20
    <80a>   DW_AT_type        : <0x9f4>
    <80e>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><812>: Abbrev Number: 22 (DW_TAG_member)
    <813>   DW_AT_name        : (indirect string, offset: 0xd91): unwind_ctx
    <817>   DW_AT_decl_file   : 18
    <818>   DW_AT_decl_line   : 322
    <81a>   DW_AT_decl_column : 8
    <81b>   DW_AT_type        : <0xc6>
    <81f>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><823>: Abbrev Number: 22 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x4ee): unwind_queue
    <828>   DW_AT_decl_file   : 18
    <829>   DW_AT_decl_line   : 323
    <82b>   DW_AT_decl_column : 25
    <82c>   DW_AT_type        : <0xa00>
    <830>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><834>: Abbrev Number: 22 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x177): comm
    <839>   DW_AT_decl_file   : 18
    <83a>   DW_AT_decl_line   : 327
    <83c>   DW_AT_decl_column : 7
    <83d>   DW_AT_type        : <0xa06>
    <841>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><845>: Abbrev Number: 22 (DW_TAG_member)
    <846>   DW_AT_name        : (indirect string, offset: 0x21f): start_prc
    <84a>   DW_AT_decl_file   : 18
    <84b>   DW_AT_decl_line   : 329
    <84d>   DW_AT_decl_column : 16
    <84e>   DW_AT_type        : <0x37>
    <852>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><856>: Abbrev Number: 0
 <1><857>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <858>   DW_AT_byte_size   : 4
    <859>   DW_AT_type        : <0x5ea>
 <1><85d>: Abbrev Number: 4 (DW_TAG_typedef)
    <85e>   DW_AT_name        : (indirect string, offset: 0x5d6): struct_sysent
    <862>   DW_AT_decl_file   : 17
    <863>   DW_AT_decl_line   : 19
    <864>   DW_AT_decl_column : 3
    <865>   DW_AT_type        : <0x591>
 <1><869>: Abbrev Number: 3 (DW_TAG_const_type)
    <86a>   DW_AT_type        : <0x85d>
 <1><86e>: Abbrev Number: 13 (DW_TAG_variable)
    <86f>   DW_AT_name        : (indirect string, offset: 0xe16): current_personality
    <873>   DW_AT_decl_file   : 18
    <874>   DW_AT_decl_line   : 158
    <875>   DW_AT_decl_column : 17
    <876>   DW_AT_type        : <0x2b>
    <87a>   DW_AT_external    : 1
    <87b>   DW_AT_declaration : 1
 <1><87c>: Abbrev Number: 13 (DW_TAG_variable)
    <87d>   DW_AT_name        : (indirect string, offset: 0x883): current_wordsize
    <881>   DW_AT_decl_file   : 18
    <882>   DW_AT_decl_line   : 171
    <883>   DW_AT_decl_column : 17
    <884>   DW_AT_type        : <0x2b>
    <888>   DW_AT_external    : 1
    <889>   DW_AT_declaration : 1
 <1><88a>: Abbrev Number: 13 (DW_TAG_variable)
    <88b>   DW_AT_name        : (indirect string, offset: 0xadf): current_klongsize
    <88f>   DW_AT_decl_file   : 18
    <890>   DW_AT_decl_line   : 176
    <891>   DW_AT_decl_column : 17
    <892>   DW_AT_type        : <0x2b>
    <896>   DW_AT_external    : 1
    <897>   DW_AT_declaration : 1
 <1><898>: Abbrev Number: 8 (DW_TAG_structure_type)
    <899>   DW_AT_name        : (indirect string, offset: 0xd68): ioctlent
    <89d>   DW_AT_byte_size   : 8
    <89e>   DW_AT_decl_file   : 18
    <89f>   DW_AT_decl_line   : 217
    <8a0>   DW_AT_decl_column : 16
    <8a1>   DW_AT_sibling     : <0x8c4>
 <2><8a5>: Abbrev Number: 9 (DW_TAG_member)
    <8a6>   DW_AT_name        : (indirect string, offset: 0x1024): symbol
    <8aa>   DW_AT_decl_file   : 18
    <8ab>   DW_AT_decl_line   : 218
    <8ac>   DW_AT_decl_column : 14
    <8ad>   DW_AT_type        : <0x1d2>
    <8b1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b4>: Abbrev Number: 9 (DW_TAG_member)
    <8b5>   DW_AT_name        : (indirect string, offset: 0xddf): code
    <8b9>   DW_AT_decl_file   : 18
    <8ba>   DW_AT_decl_line   : 219
    <8bb>   DW_AT_decl_column : 15
    <8bc>   DW_AT_type        : <0x2b>
    <8c0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8c3>: Abbrev Number: 0
 <1><8c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c5>   DW_AT_name        : (indirect string, offset: 0xd15): struct_ioctlent
    <8c9>   DW_AT_decl_file   : 18
    <8ca>   DW_AT_decl_line   : 220
    <8cb>   DW_AT_decl_column : 3
    <8cc>   DW_AT_type        : <0x898>
 <1><8d0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8d1>   DW_AT_type        : <0x8c4>
 <1><8d5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x877): inject_data
    <8da>   DW_AT_byte_size   : 10
    <8db>   DW_AT_decl_file   : 18
    <8dc>   DW_AT_decl_line   : 241
    <8dd>   DW_AT_decl_column : 8
    <8de>   DW_AT_sibling     : <0x93d>
 <2><8e2>: Abbrev Number: 9 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x50a): flags
    <8e7>   DW_AT_decl_file   : 18
    <8e8>   DW_AT_decl_line   : 242
    <8e9>   DW_AT_decl_column : 10
    <8ea>   DW_AT_type        : <0xeb>
    <8ee>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f1>: Abbrev Number: 9 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x9b1): signo
    <8f6>   DW_AT_decl_file   : 18
    <8f7>   DW_AT_decl_line   : 243
    <8f8>   DW_AT_decl_column : 10
    <8f9>   DW_AT_type        : <0xeb>
    <8fd>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><900>: Abbrev Number: 9 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x109): rval_idx
    <905>   DW_AT_decl_file   : 18
    <906>   DW_AT_decl_line   : 244
    <907>   DW_AT_decl_column : 11
    <908>   DW_AT_type        : <0xf7>
    <90c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><90f>: Abbrev Number: 9 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0xdbc): delay_idx
    <914>   DW_AT_decl_file   : 18
    <915>   DW_AT_decl_line   : 245
    <916>   DW_AT_decl_column : 11
    <917>   DW_AT_type        : <0xf7>
    <91b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><91e>: Abbrev Number: 9 (DW_TAG_member)
    <91f>   DW_AT_name        : (indirect string, offset: 0x638): poke_idx
    <923>   DW_AT_decl_file   : 18
    <924>   DW_AT_decl_line   : 246
    <925>   DW_AT_decl_column : 11
    <926>   DW_AT_type        : <0xf7>
    <92a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><92d>: Abbrev Number: 9 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x199): scno
    <932>   DW_AT_decl_file   : 18
    <933>   DW_AT_decl_line   : 247
    <934>   DW_AT_decl_column : 11
    <935>   DW_AT_type        : <0xf7>
    <939>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><93c>: Abbrev Number: 0
 <1><93d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <93e>   DW_AT_name        : (indirect string, offset: 0xea): inject_opts
    <942>   DW_AT_byte_size   : 16
    <943>   DW_AT_decl_file   : 18
    <944>   DW_AT_decl_line   : 250
    <945>   DW_AT_decl_column : 8
    <946>   DW_AT_sibling     : <0x987>
 <2><94a>: Abbrev Number: 9 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0xab4): first
    <94f>   DW_AT_decl_file   : 18
    <950>   DW_AT_decl_line   : 251
    <951>   DW_AT_decl_column : 11
    <952>   DW_AT_type        : <0xf7>
    <956>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><959>: Abbrev Number: 9 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0x121e): last
    <95e>   DW_AT_decl_file   : 18
    <95f>   DW_AT_decl_line   : 252
    <960>   DW_AT_decl_column : 11
    <961>   DW_AT_type        : <0xf7>
    <965>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><968>: Abbrev Number: 9 (DW_TAG_member)
    <969>   DW_AT_name        : (indirect string, offset: 0x3b5): step
    <96d>   DW_AT_decl_file   : 18
    <96e>   DW_AT_decl_line   : 253
    <96f>   DW_AT_decl_column : 11
    <970>   DW_AT_type        : <0xf7>
    <974>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><977>: Abbrev Number: 9 (DW_TAG_member)
    <978>   DW_AT_name        : (indirect string, offset: 0x11db): data
    <97c>   DW_AT_decl_file   : 18
    <97d>   DW_AT_decl_line   : 254
    <97e>   DW_AT_decl_column : 21
    <97f>   DW_AT_type        : <0x8d5>
    <983>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><986>: Abbrev Number: 0
 <1><987>: Abbrev Number: 10 (DW_TAG_array_type)
    <988>   DW_AT_type        : <0x54e>
    <98c>   DW_AT_sibling     : <0x997>
 <2><990>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <991>   DW_AT_type        : <0x2b>
    <995>   DW_AT_upper_bound : 5
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 16 (DW_TAG_structure_type)
    <998>   DW_AT_name        : (indirect string, offset: 0xffc): staged_output_data
    <99c>   DW_AT_declaration : 1
 <1><99d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <99e>   DW_AT_byte_size   : 4
    <99f>   DW_AT_type        : <0x997>
 <1><9a3>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a4>   DW_AT_prototyped  : 1
    <9a5>   DW_AT_sibling     : <0x9af>
 <2><9a9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9aa>   DW_AT_type        : <0xc6>
 <2><9ae>: Abbrev Number: 0
 <1><9af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b0>   DW_AT_byte_size   : 4
    <9b1>   DW_AT_type        : <0x9a3>
 <1><9b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b6>   DW_AT_byte_size   : 4
    <9b7>   DW_AT_type        : <0x869>
 <1><9bb>: Abbrev Number: 3 (DW_TAG_const_type)
    <9bc>   DW_AT_type        : <0x9b5>
 <1><9c0>: Abbrev Number: 10 (DW_TAG_array_type)
    <9c1>   DW_AT_type        : <0x9d0>
    <9c5>   DW_AT_sibling     : <0x9d0>
 <2><9c9>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9ca>   DW_AT_type        : <0x2b>
    <9ce>   DW_AT_upper_bound : 2
 <2><9cf>: Abbrev Number: 0
 <1><9d0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d1>   DW_AT_byte_size   : 4
    <9d2>   DW_AT_type        : <0x93d>
 <1><9d6>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9db>   DW_AT_declaration : 1
 <1><9dc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9dd>   DW_AT_byte_size   : 4
    <9de>   DW_AT_type        : <0x9d6>
 <1><9e2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x3d0): tcb_wait_data
    <9e7>   DW_AT_declaration : 1
 <1><9e8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e9>   DW_AT_byte_size   : 4
    <9ea>   DW_AT_type        : <0x9e2>
 <1><9ee>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x16d): vcpu_info
    <9f3>   DW_AT_declaration : 1
 <1><9f4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f5>   DW_AT_byte_size   : 4
    <9f6>   DW_AT_type        : <0x9ee>
 <1><9fa>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9fb>   DW_AT_name        : (indirect string, offset: 0xfe0): unwind_queue_t
    <9ff>   DW_AT_declaration : 1
 <1><a00>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a01>   DW_AT_byte_size   : 4
    <a02>   DW_AT_type        : <0x9fa>
 <1><a06>: Abbrev Number: 10 (DW_TAG_array_type)
    <a07>   DW_AT_type        : <0xdf>
    <a0b>   DW_AT_sibling     : <0xa16>
 <2><a0f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a10>   DW_AT_type        : <0x2b>
    <a14>   DW_AT_upper_bound : 15
 <2><a15>: Abbrev Number: 0
 <1><a16>: Abbrev Number: 12 (DW_TAG_variable)
    <a17>   DW_AT_name        : (indirect string, offset: 0xc24): stub_sysent
    <a1b>   DW_AT_decl_file   : 18
    <a1c>   DW_AT_decl_line   : 403
    <a1e>   DW_AT_decl_column : 28
    <a1f>   DW_AT_type        : <0x869>
    <a23>   DW_AT_external    : 1
    <a24>   DW_AT_declaration : 1
 <1><a25>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a26>   DW_AT_name        : (indirect string, offset: 0x11be): xlat_type
    <a2a>   DW_AT_encoding    : 7	(unsigned)
    <a2b>   DW_AT_byte_size   : 4
    <a2c>   DW_AT_type        : <0x2b>
    <a30>   DW_AT_decl_file   : 19
    <a31>   DW_AT_decl_line   : 13
    <a32>   DW_AT_decl_column : 6
    <a33>   DW_AT_sibling     : <0xa4a>
 <2><a37>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a38>   DW_AT_name        : (indirect string, offset: 0x2c7): XT_NORMAL
    <a3c>   DW_AT_const_value : 0
 <2><a3d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3e>   DW_AT_name        : (indirect string, offset: 0xd2c): XT_SORTED
    <a42>   DW_AT_const_value : 1
 <2><a43>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a44>   DW_AT_name        : (indirect string, offset: 0xea7): XT_INDEXED
    <a48>   DW_AT_const_value : 2
 <2><a49>: Abbrev Number: 0
 <1><a4a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4b>   DW_AT_name        : (indirect string, offset: 0xc79): xlat_style
    <a4f>   DW_AT_encoding    : 7	(unsigned)
    <a50>   DW_AT_byte_size   : 4
    <a51>   DW_AT_type        : <0x2b>
    <a55>   DW_AT_decl_file   : 19
    <a56>   DW_AT_decl_line   : 19
    <a57>   DW_AT_decl_column : 6
    <a58>   DW_AT_sibling     : <0xa87>
 <2><a5c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xf6): XLAT_STYLE_DEFAULT
    <a61>   DW_AT_const_value : 0
 <2><a62>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a63>   DW_AT_name        : (indirect string, offset: 0xcac): XLAT_STYLE_RAW
    <a67>   DW_AT_const_value : 1
 <2><a68>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a69>   DW_AT_name        : (indirect string, offset: 0x1165): XLAT_STYLE_ABBREV
    <a6d>   DW_AT_const_value : 2
 <2><a6e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x2e4): XLAT_STYLE_VERBOSE
    <a73>   DW_AT_const_value : 3
 <2><a74>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a75>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a79>   DW_AT_const_value : 0
 <2><a7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a7f>   DW_AT_const_value : 4
 <2><a80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0x120d): XLAT_STYLE_FMT_D
    <a85>   DW_AT_const_value : 8
 <2><a86>: Abbrev Number: 0
 <1><a87>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a88>   DW_AT_name        : (indirect string, offset: 0x324): xlat_data
    <a8c>   DW_AT_byte_size   : 16
    <a8d>   DW_AT_decl_file   : 19
    <a8e>   DW_AT_decl_line   : 51
    <a8f>   DW_AT_decl_column : 8
    <a90>   DW_AT_sibling     : <0xab3>
 <2><a94>: Abbrev Number: 18 (DW_TAG_member)
    <a95>   DW_AT_name        : val
    <a99>   DW_AT_decl_file   : 19
    <a9a>   DW_AT_decl_line   : 52
    <a9b>   DW_AT_decl_column : 11
    <a9c>   DW_AT_type        : <0x10f>
    <aa0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aa3>: Abbrev Number: 18 (DW_TAG_member)
    <aa4>   DW_AT_name        : str
    <aa8>   DW_AT_decl_file   : 19
    <aa9>   DW_AT_decl_line   : 53
    <aaa>   DW_AT_decl_column : 14
    <aab>   DW_AT_type        : <0x1d2>
    <aaf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ab2>: Abbrev Number: 0
 <1><ab3>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab4>   DW_AT_type        : <0xa87>
 <1><ab8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <abd>   DW_AT_byte_size   : 24
    <abe>   DW_AT_decl_file   : 19
    <abf>   DW_AT_decl_line   : 56
    <ac0>   DW_AT_decl_column : 8
    <ac1>   DW_AT_sibling     : <0xb11>
 <2><ac5>: Abbrev Number: 9 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x11db): data
    <aca>   DW_AT_decl_file   : 19
    <acb>   DW_AT_decl_line   : 57
    <acc>   DW_AT_decl_column : 26
    <acd>   DW_AT_type        : <0xb16>
    <ad1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad4>: Abbrev Number: 9 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0x8d5): flags_strsz
    <ad9>   DW_AT_decl_file   : 19
    <ada>   DW_AT_decl_line   : 58
    <adb>   DW_AT_decl_column : 9
    <adc>   DW_AT_type        : <0x122>
    <ae0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ae3>: Abbrev Number: 9 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0xbf5): size
    <ae8>   DW_AT_decl_file   : 19
    <ae9>   DW_AT_decl_line   : 59
    <aea>   DW_AT_decl_column : 11
    <aeb>   DW_AT_type        : <0x103>
    <aef>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af2>: Abbrev Number: 9 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x19e): type
    <af7>   DW_AT_decl_file   : 19
    <af8>   DW_AT_decl_line   : 60
    <af9>   DW_AT_decl_column : 17
    <afa>   DW_AT_type        : <0xa25>
    <afe>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b01>: Abbrev Number: 9 (DW_TAG_member)
    <b02>   DW_AT_name        : (indirect string, offset: 0x77b): flags_mask
    <b06>   DW_AT_decl_file   : 19
    <b07>   DW_AT_decl_line   : 61
    <b08>   DW_AT_decl_column : 11
    <b09>   DW_AT_type        : <0x10f>
    <b0d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b10>: Abbrev Number: 0
 <1><b11>: Abbrev Number: 3 (DW_TAG_const_type)
    <b12>   DW_AT_type        : <0xab8>
 <1><b16>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b17>   DW_AT_byte_size   : 4
    <b18>   DW_AT_type        : <0xab3>
 <1><b1c>: Abbrev Number: 10 (DW_TAG_array_type)
    <b1d>   DW_AT_type        : <0xb11>
    <b21>   DW_AT_sibling     : <0xb27>
 <2><b25>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b26>: Abbrev Number: 0
 <1><b27>: Abbrev Number: 3 (DW_TAG_const_type)
    <b28>   DW_AT_type        : <0xb1c>
 <1><b2c>: Abbrev Number: 12 (DW_TAG_variable)
    <b2d>   DW_AT_name        : (indirect string, offset: 0xf22): addrfams
    <b31>   DW_AT_decl_file   : 18
    <b32>   DW_AT_decl_line   : 409
    <b34>   DW_AT_decl_column : 26
    <b35>   DW_AT_type        : <0xb27>
    <b39>   DW_AT_external    : 1
    <b3a>   DW_AT_declaration : 1
 <1><b3b>: Abbrev Number: 12 (DW_TAG_variable)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xdef): arp_hardware_types
    <b40>   DW_AT_decl_file   : 18
    <b41>   DW_AT_decl_line   : 410
    <b43>   DW_AT_decl_column : 26
    <b44>   DW_AT_type        : <0xb27>
    <b48>   DW_AT_external    : 1
    <b49>   DW_AT_declaration : 1
 <1><b4a>: Abbrev Number: 12 (DW_TAG_variable)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x10e2): at_flags
    <b4f>   DW_AT_decl_file   : 18
    <b50>   DW_AT_decl_line   : 411
    <b52>   DW_AT_decl_column : 26
    <b53>   DW_AT_type        : <0xb27>
    <b57>   DW_AT_external    : 1
    <b58>   DW_AT_declaration : 1
 <1><b59>: Abbrev Number: 12 (DW_TAG_variable)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x4cc): clocknames
    <b5e>   DW_AT_decl_file   : 18
    <b5f>   DW_AT_decl_line   : 412
    <b61>   DW_AT_decl_column : 26
    <b62>   DW_AT_type        : <0xb27>
    <b66>   DW_AT_external    : 1
    <b67>   DW_AT_declaration : 1
 <1><b68>: Abbrev Number: 12 (DW_TAG_variable)
    <b69>   DW_AT_name        : (indirect string, offset: 0x10ac): dirent_types
    <b6d>   DW_AT_decl_file   : 18
    <b6e>   DW_AT_decl_line   : 413
    <b70>   DW_AT_decl_column : 26
    <b71>   DW_AT_type        : <0xb27>
    <b75>   DW_AT_external    : 1
    <b76>   DW_AT_declaration : 1
 <1><b77>: Abbrev Number: 12 (DW_TAG_variable)
    <b78>   DW_AT_name        : (indirect string, offset: 0x94b): ethernet_protocols
    <b7c>   DW_AT_decl_file   : 18
    <b7d>   DW_AT_decl_line   : 414
    <b7f>   DW_AT_decl_column : 26
    <b80>   DW_AT_type        : <0xb27>
    <b84>   DW_AT_external    : 1
    <b85>   DW_AT_declaration : 1
 <1><b86>: Abbrev Number: 12 (DW_TAG_variable)
    <b87>   DW_AT_name        : (indirect string, offset: 0x68b): inet_protocols
    <b8b>   DW_AT_decl_file   : 18
    <b8c>   DW_AT_decl_line   : 415
    <b8e>   DW_AT_decl_column : 26
    <b8f>   DW_AT_type        : <0xb27>
    <b93>   DW_AT_external    : 1
    <b94>   DW_AT_declaration : 1
 <1><b95>: Abbrev Number: 12 (DW_TAG_variable)
    <b96>   DW_AT_name        : (indirect string, offset: 0x2b4): evdev_abs
    <b9a>   DW_AT_decl_file   : 18
    <b9b>   DW_AT_decl_line   : 416
    <b9d>   DW_AT_decl_column : 26
    <b9e>   DW_AT_type        : <0xb27>
    <ba2>   DW_AT_external    : 1
    <ba3>   DW_AT_declaration : 1
 <1><ba4>: Abbrev Number: 12 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x770): audit_arch
    <ba9>   DW_AT_decl_file   : 18
    <baa>   DW_AT_decl_line   : 417
    <bac>   DW_AT_decl_column : 26
    <bad>   DW_AT_type        : <0xb27>
    <bb1>   DW_AT_external    : 1
    <bb2>   DW_AT_declaration : 1
 <1><bb3>: Abbrev Number: 12 (DW_TAG_variable)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bb8>   DW_AT_decl_file   : 18
    <bb9>   DW_AT_decl_line   : 418
    <bbb>   DW_AT_decl_column : 26
    <bbc>   DW_AT_type        : <0xb27>
    <bc0>   DW_AT_external    : 1
    <bc1>   DW_AT_declaration : 1
 <1><bc2>: Abbrev Number: 12 (DW_TAG_variable)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x4a3): iffflags
    <bc7>   DW_AT_decl_file   : 18
    <bc8>   DW_AT_decl_line   : 419
    <bca>   DW_AT_decl_column : 26
    <bcb>   DW_AT_type        : <0xb27>
    <bcf>   DW_AT_external    : 1
    <bd0>   DW_AT_declaration : 1
 <1><bd1>: Abbrev Number: 12 (DW_TAG_variable)
    <bd2>   DW_AT_name        : (indirect string, offset: 0xcbb): ip_type_of_services
    <bd6>   DW_AT_decl_file   : 18
    <bd7>   DW_AT_decl_line   : 420
    <bd9>   DW_AT_decl_column : 26
    <bda>   DW_AT_type        : <0xb27>
    <bde>   DW_AT_external    : 1
    <bdf>   DW_AT_declaration : 1
 <1><be0>: Abbrev Number: 12 (DW_TAG_variable)
    <be1>   DW_AT_name        : (indirect string, offset: 0x6f3): ipc_private
    <be5>   DW_AT_decl_file   : 18
    <be6>   DW_AT_decl_line   : 421
    <be8>   DW_AT_decl_column : 26
    <be9>   DW_AT_type        : <0xb27>
    <bed>   DW_AT_external    : 1
    <bee>   DW_AT_declaration : 1
 <1><bef>: Abbrev Number: 12 (DW_TAG_variable)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x31a): msg_flags
    <bf4>   DW_AT_decl_file   : 18
    <bf5>   DW_AT_decl_line   : 422
    <bf7>   DW_AT_decl_column : 26
    <bf8>   DW_AT_type        : <0xb27>
    <bfc>   DW_AT_external    : 1
    <bfd>   DW_AT_declaration : 1
 <1><bfe>: Abbrev Number: 12 (DW_TAG_variable)
    <bff>   DW_AT_name        : (indirect string, offset: 0x112): netlink_protocols
    <c03>   DW_AT_decl_file   : 18
    <c04>   DW_AT_decl_line   : 423
    <c06>   DW_AT_decl_column : 26
    <c07>   DW_AT_type        : <0xb27>
    <c0b>   DW_AT_external    : 1
    <c0c>   DW_AT_declaration : 1
 <1><c0d>: Abbrev Number: 12 (DW_TAG_variable)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x100f): nl_bridge_vlan_flags
    <c12>   DW_AT_decl_file   : 18
    <c13>   DW_AT_decl_line   : 424
    <c15>   DW_AT_decl_column : 26
    <c16>   DW_AT_type        : <0xb27>
    <c1a>   DW_AT_external    : 1
    <c1b>   DW_AT_declaration : 1
 <1><c1c>: Abbrev Number: 12 (DW_TAG_variable)
    <c1d>   DW_AT_name        : (indirect string, offset: 0xe8b): nl_netfilter_msg_types
    <c21>   DW_AT_decl_file   : 18
    <c22>   DW_AT_decl_line   : 425
    <c24>   DW_AT_decl_column : 26
    <c25>   DW_AT_type        : <0xb27>
    <c29>   DW_AT_external    : 1
    <c2a>   DW_AT_declaration : 1
 <1><c2b>: Abbrev Number: 12 (DW_TAG_variable)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x485): nl_route_types
    <c30>   DW_AT_decl_file   : 18
    <c31>   DW_AT_decl_line   : 426
    <c33>   DW_AT_decl_column : 26
    <c34>   DW_AT_type        : <0xb27>
    <c38>   DW_AT_external    : 1
    <c39>   DW_AT_declaration : 1
 <1><c3a>: Abbrev Number: 12 (DW_TAG_variable)
    <c3b>   DW_AT_name        : (indirect string, offset: 0xf68): open_access_modes
    <c3f>   DW_AT_decl_file   : 18
    <c40>   DW_AT_decl_line   : 427
    <c42>   DW_AT_decl_column : 26
    <c43>   DW_AT_type        : <0xb27>
    <c47>   DW_AT_external    : 1
    <c48>   DW_AT_declaration : 1
 <1><c49>: Abbrev Number: 12 (DW_TAG_variable)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c4e>   DW_AT_decl_file   : 18
    <c4f>   DW_AT_decl_line   : 428
    <c51>   DW_AT_decl_column : 26
    <c52>   DW_AT_type        : <0xb27>
    <c56>   DW_AT_external    : 1
    <c57>   DW_AT_declaration : 1
 <1><c58>: Abbrev Number: 12 (DW_TAG_variable)
    <c59>   DW_AT_name        : (indirect string, offset: 0xd08): perf_type_id
    <c5d>   DW_AT_decl_file   : 18
    <c5e>   DW_AT_decl_line   : 429
    <c60>   DW_AT_decl_column : 26
    <c61>   DW_AT_type        : <0xb27>
    <c65>   DW_AT_external    : 1
    <c66>   DW_AT_declaration : 1
 <1><c67>: Abbrev Number: 12 (DW_TAG_variable)
    <c68>   DW_AT_name        : (indirect string, offset: 0xf2b): pollflags
    <c6c>   DW_AT_decl_file   : 18
    <c6d>   DW_AT_decl_line   : 430
    <c6f>   DW_AT_decl_column : 26
    <c70>   DW_AT_type        : <0xb27>
    <c74>   DW_AT_external    : 1
    <c75>   DW_AT_declaration : 1
 <1><c76>: Abbrev Number: 12 (DW_TAG_variable)
    <c77>   DW_AT_name        : (indirect string, offset: 0x62c): ptrace_cmds
    <c7b>   DW_AT_decl_file   : 18
    <c7c>   DW_AT_decl_line   : 431
    <c7e>   DW_AT_decl_column : 26
    <c7f>   DW_AT_type        : <0xb27>
    <c83>   DW_AT_external    : 1
    <c84>   DW_AT_declaration : 1
 <1><c85>: Abbrev Number: 12 (DW_TAG_variable)
    <c86>   DW_AT_name        : (indirect string, offset: 0x868): resource_flags
    <c8a>   DW_AT_decl_file   : 18
    <c8b>   DW_AT_decl_line   : 432
    <c8d>   DW_AT_decl_column : 26
    <c8e>   DW_AT_type        : <0xb27>
    <c92>   DW_AT_external    : 1
    <c93>   DW_AT_declaration : 1
 <1><c94>: Abbrev Number: 12 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0x28a): route_nexthop_flags
    <c99>   DW_AT_decl_file   : 18
    <c9a>   DW_AT_decl_line   : 433
    <c9c>   DW_AT_decl_column : 26
    <c9d>   DW_AT_type        : <0xb27>
    <ca1>   DW_AT_external    : 1
    <ca2>   DW_AT_declaration : 1
 <1><ca3>: Abbrev Number: 12 (DW_TAG_variable)
    <ca4>   DW_AT_name        : (indirect string, offset: 0xf9a): routing_protocols
    <ca8>   DW_AT_decl_file   : 18
    <ca9>   DW_AT_decl_line   : 434
    <cab>   DW_AT_decl_column : 26
    <cac>   DW_AT_type        : <0xb27>
    <cb0>   DW_AT_external    : 1
    <cb1>   DW_AT_declaration : 1
 <1><cb2>: Abbrev Number: 12 (DW_TAG_variable)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x494): routing_scopes
    <cb7>   DW_AT_decl_file   : 18
    <cb8>   DW_AT_decl_line   : 435
    <cba>   DW_AT_decl_column : 26
    <cbb>   DW_AT_type        : <0xb27>
    <cbf>   DW_AT_external    : 1
    <cc0>   DW_AT_declaration : 1
 <1><cc1>: Abbrev Number: 12 (DW_TAG_variable)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xe79): routing_table_ids
    <cc6>   DW_AT_decl_file   : 18
    <cc7>   DW_AT_decl_line   : 436
    <cc9>   DW_AT_decl_column : 26
    <cca>   DW_AT_type        : <0xb27>
    <cce>   DW_AT_external    : 1
    <ccf>   DW_AT_declaration : 1
 <1><cd0>: Abbrev Number: 12 (DW_TAG_variable)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x6c3): routing_types
    <cd5>   DW_AT_decl_file   : 18
    <cd6>   DW_AT_decl_line   : 437
    <cd8>   DW_AT_decl_column : 26
    <cd9>   DW_AT_type        : <0xb27>
    <cdd>   DW_AT_external    : 1
    <cde>   DW_AT_declaration : 1
 <1><cdf>: Abbrev Number: 12 (DW_TAG_variable)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x1c2): rwf_flags
    <ce4>   DW_AT_decl_file   : 18
    <ce5>   DW_AT_decl_line   : 438
    <ce7>   DW_AT_decl_column : 26
    <ce8>   DW_AT_type        : <0xb27>
    <cec>   DW_AT_external    : 1
    <ced>   DW_AT_declaration : 1
 <1><cee>: Abbrev Number: 12 (DW_TAG_variable)
    <cef>   DW_AT_name        : (indirect string, offset: 0x8a0): seccomp_filter_flags
    <cf3>   DW_AT_decl_file   : 18
    <cf4>   DW_AT_decl_line   : 439
    <cf6>   DW_AT_decl_column : 26
    <cf7>   DW_AT_type        : <0xb27>
    <cfb>   DW_AT_external    : 1
    <cfc>   DW_AT_declaration : 1
 <1><cfd>: Abbrev Number: 12 (DW_TAG_variable)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x2d1): seccomp_ret_action
    <d02>   DW_AT_decl_file   : 18
    <d03>   DW_AT_decl_line   : 440
    <d05>   DW_AT_decl_column : 26
    <d06>   DW_AT_type        : <0xb27>
    <d0a>   DW_AT_external    : 1
    <d0b>   DW_AT_declaration : 1
 <1><d0c>: Abbrev Number: 12 (DW_TAG_variable)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x450): setns_types
    <d11>   DW_AT_decl_file   : 18
    <d12>   DW_AT_decl_line   : 441
    <d14>   DW_AT_decl_column : 26
    <d15>   DW_AT_type        : <0xb27>
    <d19>   DW_AT_external    : 1
    <d1a>   DW_AT_declaration : 1
 <1><d1b>: Abbrev Number: 12 (DW_TAG_variable)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xf17): sg_io_info
    <d20>   DW_AT_decl_file   : 18
    <d21>   DW_AT_decl_line   : 442
    <d23>   DW_AT_decl_column : 26
    <d24>   DW_AT_type        : <0xb27>
    <d28>   DW_AT_external    : 1
    <d29>   DW_AT_declaration : 1
 <1><d2a>: Abbrev Number: 12 (DW_TAG_variable)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xc61): socketlayers
    <d2f>   DW_AT_decl_file   : 18
    <d30>   DW_AT_decl_line   : 443
    <d32>   DW_AT_decl_column : 26
    <d33>   DW_AT_type        : <0xb27>
    <d37>   DW_AT_external    : 1
    <d38>   DW_AT_declaration : 1
 <1><d39>: Abbrev Number: 12 (DW_TAG_variable)
    <d3a>   DW_AT_name        : (indirect string, offset: 0xe63): socktypes
    <d3e>   DW_AT_decl_file   : 18
    <d3f>   DW_AT_decl_line   : 444
    <d41>   DW_AT_decl_column : 26
    <d42>   DW_AT_type        : <0xb27>
    <d46>   DW_AT_external    : 1
    <d47>   DW_AT_declaration : 1
 <1><d48>: Abbrev Number: 12 (DW_TAG_variable)
    <d49>   DW_AT_name        : (indirect string, offset: 0xaf1): tcp_state_flags
    <d4d>   DW_AT_decl_file   : 18
    <d4e>   DW_AT_decl_line   : 445
    <d50>   DW_AT_decl_column : 26
    <d51>   DW_AT_type        : <0xb27>
    <d55>   DW_AT_external    : 1
    <d56>   DW_AT_declaration : 1
 <1><d57>: Abbrev Number: 12 (DW_TAG_variable)
    <d58>   DW_AT_name        : (indirect string, offset: 0x7a5): tcp_states
    <d5c>   DW_AT_decl_file   : 18
    <d5d>   DW_AT_decl_line   : 446
    <d5f>   DW_AT_decl_column : 26
    <d60>   DW_AT_type        : <0xb27>
    <d64>   DW_AT_external    : 1
    <d65>   DW_AT_declaration : 1
 <1><d66>: Abbrev Number: 12 (DW_TAG_variable)
    <d67>   DW_AT_name        : (indirect string, offset: 0x1148): whence_codes
    <d6b>   DW_AT_decl_file   : 18
    <d6c>   DW_AT_decl_line   : 447
    <d6e>   DW_AT_decl_column : 26
    <d6f>   DW_AT_type        : <0xb27>
    <d73>   DW_AT_external    : 1
    <d74>   DW_AT_declaration : 1
 <1><d75>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d76>   DW_AT_encoding    : 7	(unsigned)
    <d77>   DW_AT_byte_size   : 4
    <d78>   DW_AT_type        : <0x2b>
    <d7c>   DW_AT_decl_file   : 18
    <d7d>   DW_AT_decl_line   : 508
    <d7f>   DW_AT_decl_column : 14
    <d80>   DW_AT_sibling     : <0xd97>
 <2><d84>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d85>   DW_AT_name        : (indirect string, offset: 0xa2e): CFLAG_NONE
    <d89>   DW_AT_const_value : 0
 <2><d8a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x95e): CFLAG_ONLY_STATS
    <d8f>   DW_AT_const_value : 1
 <2><d90>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d91>   DW_AT_name        : (indirect string, offset: 0xc6e): CFLAG_BOTH
    <d95>   DW_AT_const_value : 2
 <2><d96>: Abbrev Number: 0
 <1><d97>: Abbrev Number: 28 (DW_TAG_typedef)
    <d98>   DW_AT_name        : (indirect string, offset: 0x1223): cflag_t
    <d9c>   DW_AT_decl_file   : 18
    <d9d>   DW_AT_decl_line   : 512
    <d9f>   DW_AT_decl_column : 3
    <da0>   DW_AT_type        : <0xd75>
 <1><da4>: Abbrev Number: 12 (DW_TAG_variable)
    <da5>   DW_AT_name        : (indirect string, offset: 0xdb6): cflag
    <da9>   DW_AT_decl_file   : 18
    <daa>   DW_AT_decl_line   : 513
    <dac>   DW_AT_decl_column : 16
    <dad>   DW_AT_type        : <0xd97>
    <db1>   DW_AT_external    : 1
    <db2>   DW_AT_declaration : 1
 <1><db3>: Abbrev Number: 12 (DW_TAG_variable)
    <db4>   DW_AT_name        : (indirect string, offset: 0x18d): Tflag
    <db8>   DW_AT_decl_file   : 18
    <db9>   DW_AT_decl_line   : 514
    <dbb>   DW_AT_decl_column : 13
    <dbc>   DW_AT_type        : <0x51e>
    <dc0>   DW_AT_external    : 1
    <dc1>   DW_AT_declaration : 1
 <1><dc2>: Abbrev Number: 12 (DW_TAG_variable)
    <dc3>   DW_AT_name        : (indirect string, offset: 0x814): Tflag_scale
    <dc7>   DW_AT_decl_file   : 18
    <dc8>   DW_AT_decl_line   : 515
    <dca>   DW_AT_decl_column : 12
    <dcb>   DW_AT_type        : <0x64>
    <dcf>   DW_AT_external    : 1
    <dd0>   DW_AT_declaration : 1
 <1><dd1>: Abbrev Number: 12 (DW_TAG_variable)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x8b5): Tflag_width
    <dd6>   DW_AT_decl_file   : 18
    <dd7>   DW_AT_decl_line   : 516
    <dd9>   DW_AT_decl_column : 12
    <dda>   DW_AT_type        : <0x64>
    <dde>   DW_AT_external    : 1
    <ddf>   DW_AT_declaration : 1
 <1><de0>: Abbrev Number: 12 (DW_TAG_variable)
    <de1>   DW_AT_name        : (indirect string, offset: 0xf09): iflag
    <de5>   DW_AT_decl_file   : 18
    <de6>   DW_AT_decl_line   : 517
    <de8>   DW_AT_decl_column : 13
    <de9>   DW_AT_type        : <0x51e>
    <ded>   DW_AT_external    : 1
    <dee>   DW_AT_declaration : 1
 <1><def>: Abbrev Number: 12 (DW_TAG_variable)
    <df0>   DW_AT_name        : (indirect string, offset: 0x66c): count_wallclock
    <df4>   DW_AT_decl_file   : 18
    <df5>   DW_AT_decl_line   : 518
    <df7>   DW_AT_decl_column : 13
    <df8>   DW_AT_type        : <0x51e>
    <dfc>   DW_AT_external    : 1
    <dfd>   DW_AT_declaration : 1
 <1><dfe>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dff>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e03>   DW_AT_byte_size   : 4
    <e04>   DW_AT_decl_file   : 18
    <e05>   DW_AT_decl_line   : 520
    <e07>   DW_AT_decl_column : 8
    <e08>   DW_AT_sibling     : <0xe1d>
 <2><e0c>: Abbrev Number: 22 (DW_TAG_member)
    <e0d>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e11>   DW_AT_decl_file   : 18
    <e12>   DW_AT_decl_line   : 521
    <e14>   DW_AT_decl_column : 14
    <e15>   DW_AT_type        : <0x1d2>
    <e19>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e1c>: Abbrev Number: 0
 <1><e1d>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x7b0): path_set
    <e22>   DW_AT_byte_size   : 12
    <e23>   DW_AT_decl_file   : 18
    <e24>   DW_AT_decl_line   : 525
    <e26>   DW_AT_decl_column : 15
    <e27>   DW_AT_sibling     : <0xe5c>
 <2><e2b>: Abbrev Number: 22 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x73e): paths_selected
    <e30>   DW_AT_decl_file   : 18
    <e31>   DW_AT_decl_line   : 526
    <e33>   DW_AT_decl_column : 24
    <e34>   DW_AT_type        : <0xe5c>
    <e38>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3b>: Abbrev Number: 22 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x113b): num_selected
    <e40>   DW_AT_decl_file   : 18
    <e41>   DW_AT_decl_line   : 527
    <e43>   DW_AT_decl_column : 9
    <e44>   DW_AT_type        : <0x122>
    <e48>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e4b>: Abbrev Number: 22 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0xbf5): size
    <e50>   DW_AT_decl_file   : 18
    <e51>   DW_AT_decl_line   : 528
    <e53>   DW_AT_decl_column : 9
    <e54>   DW_AT_type        : <0x122>
    <e58>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e5b>: Abbrev Number: 0
 <1><e5c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e5d>   DW_AT_byte_size   : 4
    <e5e>   DW_AT_type        : <0xdfe>
 <1><e62>: Abbrev Number: 12 (DW_TAG_variable)
    <e63>   DW_AT_name        : (indirect string, offset: 0x119b): global_path_set
    <e67>   DW_AT_decl_file   : 18
    <e68>   DW_AT_decl_line   : 529
    <e6a>   DW_AT_decl_column : 3
    <e6b>   DW_AT_type        : <0xe1d>
    <e6f>   DW_AT_external    : 1
    <e70>   DW_AT_declaration : 1
 <1><e71>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e72>   DW_AT_name        : (indirect string, offset: 0x1087): xflag_opts
    <e76>   DW_AT_encoding    : 7	(unsigned)
    <e77>   DW_AT_byte_size   : 4
    <e78>   DW_AT_type        : <0x2b>
    <e7c>   DW_AT_decl_file   : 18
    <e7d>   DW_AT_decl_line   : 531
    <e7f>   DW_AT_decl_column : 6
    <e80>   DW_AT_sibling     : <0xea3>
 <2><e84>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e85>   DW_AT_name        : (indirect string, offset: 0xaa8): HEXSTR_NONE
    <e89>   DW_AT_const_value : 0
 <2><e8a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x10c4): HEXSTR_NON_ASCII
    <e8f>   DW_AT_const_value : 1
 <2><e90>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e91>   DW_AT_name        : (indirect string, offset: 0x99c): HEXSTR_ALL
    <e95>   DW_AT_const_value : 2
 <2><e96>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0x6ac): HEXSTR_NON_ASCII_CHARS
    <e9b>   DW_AT_const_value : 3
 <2><e9c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x1155): NUM_HEXSTR_OPTS
    <ea1>   DW_AT_const_value : 4
 <2><ea2>: Abbrev Number: 0
 <1><ea3>: Abbrev Number: 12 (DW_TAG_variable)
    <ea4>   DW_AT_name        : (indirect string, offset: 0xee3): xflag
    <ea8>   DW_AT_decl_file   : 18
    <ea9>   DW_AT_decl_line   : 544
    <eab>   DW_AT_decl_column : 17
    <eac>   DW_AT_type        : <0x2b>
    <eb0>   DW_AT_external    : 1
    <eb1>   DW_AT_declaration : 1
 <1><eb2>: Abbrev Number: 12 (DW_TAG_variable)
    <eb3>   DW_AT_name        : (indirect string, offset: 0xd71): followfork
    <eb7>   DW_AT_decl_file   : 18
    <eb8>   DW_AT_decl_line   : 545
    <eba>   DW_AT_decl_column : 13
    <ebb>   DW_AT_type        : <0x51e>
    <ebf>   DW_AT_external    : 1
    <ec0>   DW_AT_declaration : 1
 <1><ec1>: Abbrev Number: 12 (DW_TAG_variable)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x32e): output_separately
    <ec6>   DW_AT_decl_file   : 18
    <ec7>   DW_AT_decl_line   : 546
    <ec9>   DW_AT_decl_column : 13
    <eca>   DW_AT_type        : <0x51e>
    <ece>   DW_AT_external    : 1
    <ecf>   DW_AT_declaration : 1
 <1><ed0>: Abbrev Number: 12 (DW_TAG_variable)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x229): stack_trace_enabled
    <ed5>   DW_AT_decl_file   : 18
    <ed6>   DW_AT_decl_line   : 549
    <ed8>   DW_AT_decl_column : 13
    <ed9>   DW_AT_type        : <0x51e>
    <edd>   DW_AT_external    : 1
    <ede>   DW_AT_declaration : 1
 <1><edf>: Abbrev Number: 12 (DW_TAG_variable)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x69a): ptrace_setoptions
    <ee4>   DW_AT_decl_file   : 18
    <ee5>   DW_AT_decl_line   : 553
    <ee7>   DW_AT_decl_column : 17
    <ee8>   DW_AT_type        : <0x2b>
    <eec>   DW_AT_external    : 1
    <eed>   DW_AT_declaration : 1
 <1><eee>: Abbrev Number: 12 (DW_TAG_variable)
    <eef>   DW_AT_name        : (indirect string, offset: 0xa9d): max_strlen
    <ef3>   DW_AT_decl_file   : 18
    <ef4>   DW_AT_decl_line   : 554
    <ef6>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0x2b>
    <efb>   DW_AT_external    : 1
    <efc>   DW_AT_declaration : 1
 <1><efd>: Abbrev Number: 12 (DW_TAG_variable)
    <efe>   DW_AT_name        : (indirect string, offset: 0xacb): os_release
    <f02>   DW_AT_decl_file   : 18
    <f03>   DW_AT_decl_line   : 555
    <f05>   DW_AT_decl_column : 17
    <f06>   DW_AT_type        : <0x2b>
    <f0a>   DW_AT_external    : 1
    <f0b>   DW_AT_declaration : 1
 <1><f0c>: Abbrev Number: 12 (DW_TAG_variable)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x74d): xlat_verbosity
    <f11>   DW_AT_decl_file   : 18
    <f12>   DW_AT_decl_line   : 917
    <f14>   DW_AT_decl_column : 24
    <f15>   DW_AT_type        : <0xa4a>
    <f19>   DW_AT_external    : 1
    <f1a>   DW_AT_declaration : 1
 <1><f1b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x64f): xlat_style_private_flag_bits
    <f20>   DW_AT_encoding    : 7	(unsigned)
    <f21>   DW_AT_byte_size   : 4
    <f22>   DW_AT_type        : <0x2b>
    <f26>   DW_AT_decl_file   : 18
    <f27>   DW_AT_decl_line   : 937
    <f29>   DW_AT_decl_column : 6
    <f2a>   DW_AT_sibling     : <0xf47>
 <2><f2e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x29e): PAF_PRINT_INDICES_BIT
    <f33>   DW_AT_const_value : 5
 <2><f34>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f35>   DW_AT_name        : (indirect string, offset: 0xb9a): PAF_ARRAY_TRUNCATED_BIT
    <f39>   DW_AT_const_value : 6
 <2><f3a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x410): PXF_DEFAULT_STR_BIT
    <f3f>   DW_AT_const_value : 7
 <2><f40>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f41>   DW_AT_name        : (indirect string, offset: 0xd53): SPFF_AUXSTR_MODE_BIT
    <f45>   DW_AT_const_value : 8
 <2><f46>: Abbrev Number: 0
 <1><f47>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f48>   DW_AT_name        : (indirect string, offset: 0xe02): find_xlat_flag_bits
    <f4c>   DW_AT_encoding    : 7	(unsigned)
    <f4d>   DW_AT_byte_size   : 4
    <f4e>   DW_AT_type        : <0x2b>
    <f52>   DW_AT_decl_file   : 18
    <f53>   DW_AT_decl_line   : 1441
    <f55>   DW_AT_decl_column : 6
    <f56>   DW_AT_sibling     : <0xf61>
 <2><f5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x9d9): FXL_CASE_SENSITIVE_BIT
    <f5f>   DW_AT_const_value : 0
 <2><f60>: Abbrev Number: 0
 <1><f61>: Abbrev Number: 12 (DW_TAG_variable)
    <f62>   DW_AT_name        : (indirect string, offset: 0xa79): printing_tcp
    <f66>   DW_AT_decl_file   : 18
    <f67>   DW_AT_decl_line   : 1687
    <f69>   DW_AT_decl_column : 20
    <f6a>   DW_AT_type        : <0x5fa>
    <f6e>   DW_AT_external    : 1
    <f6f>   DW_AT_declaration : 1
 <1><f70>: Abbrev Number: 12 (DW_TAG_variable)
    <f71>   DW_AT_name        : (indirect string, offset: 0x603): errnoent
    <f75>   DW_AT_decl_file   : 18
    <f76>   DW_AT_decl_line   : 1885
    <f78>   DW_AT_decl_column : 26
    <f79>   DW_AT_type        : <0x452>
    <f7d>   DW_AT_external    : 1
    <f7e>   DW_AT_declaration : 1
 <1><f7f>: Abbrev Number: 12 (DW_TAG_variable)
    <f80>   DW_AT_name        : (indirect string, offset: 0x8c1): signalent
    <f84>   DW_AT_decl_file   : 18
    <f85>   DW_AT_decl_line   : 1886
    <f87>   DW_AT_decl_column : 26
    <f88>   DW_AT_type        : <0x452>
    <f8c>   DW_AT_external    : 1
    <f8d>   DW_AT_declaration : 1
 <1><f8e>: Abbrev Number: 12 (DW_TAG_variable)
    <f8f>   DW_AT_name        : (indirect string, offset: 0xf60): nerrnos
    <f93>   DW_AT_decl_file   : 18
    <f94>   DW_AT_decl_line   : 1887
    <f96>   DW_AT_decl_column : 27
    <f97>   DW_AT_type        : <0x32>
    <f9b>   DW_AT_external    : 1
    <f9c>   DW_AT_declaration : 1
 <1><f9d>: Abbrev Number: 12 (DW_TAG_variable)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x1124): nsignals
    <fa2>   DW_AT_decl_file   : 18
    <fa3>   DW_AT_decl_line   : 1888
    <fa5>   DW_AT_decl_column : 27
    <fa6>   DW_AT_type        : <0x32>
    <faa>   DW_AT_external    : 1
    <fab>   DW_AT_declaration : 1
 <1><fac>: Abbrev Number: 10 (DW_TAG_array_type)
    <fad>   DW_AT_type        : <0x869>
    <fb1>   DW_AT_sibling     : <0xfb7>
 <2><fb5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb6>: Abbrev Number: 0
 <1><fb7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb8>   DW_AT_type        : <0xfac>
 <1><fbc>: Abbrev Number: 12 (DW_TAG_variable)
    <fbd>   DW_AT_name        : (indirect string, offset: 0xdcd): sysent0
    <fc1>   DW_AT_decl_file   : 18
    <fc2>   DW_AT_decl_line   : 1890
    <fc4>   DW_AT_decl_column : 28
    <fc5>   DW_AT_type        : <0xfb7>
    <fc9>   DW_AT_external    : 1
    <fca>   DW_AT_declaration : 1
 <1><fcb>: Abbrev Number: 10 (DW_TAG_array_type)
    <fcc>   DW_AT_type        : <0x8d0>
    <fd0>   DW_AT_sibling     : <0xfd6>
 <2><fd4>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd5>: Abbrev Number: 0
 <1><fd6>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd7>   DW_AT_type        : <0xfcb>
 <1><fdb>: Abbrev Number: 12 (DW_TAG_variable)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x1191): ioctlent0
    <fe0>   DW_AT_decl_file   : 18
    <fe1>   DW_AT_decl_line   : 1891
    <fe3>   DW_AT_decl_column : 30
    <fe4>   DW_AT_type        : <0xfd6>
    <fe8>   DW_AT_external    : 1
    <fe9>   DW_AT_declaration : 1
 <1><fea>: Abbrev Number: 12 (DW_TAG_variable)
    <feb>   DW_AT_name        : (indirect string, offset: 0x1092): personality_names
    <fef>   DW_AT_decl_file   : 18
    <ff0>   DW_AT_decl_line   : 1893
    <ff2>   DW_AT_decl_column : 26
    <ff3>   DW_AT_type        : <0x452>
    <ff7>   DW_AT_external    : 1
    <ff8>   DW_AT_declaration : 1
 <1><ff9>: Abbrev Number: 12 (DW_TAG_variable)
    <ffa>   DW_AT_name        : (indirect string, offset: 0x8e1): sysent
    <ffe>   DW_AT_decl_file   : 18
    <fff>   DW_AT_decl_line   : 1896
    <1001>   DW_AT_decl_column : 29
    <1002>   DW_AT_type        : <0x9b5>
    <1006>   DW_AT_external    : 1
    <1007>   DW_AT_declaration : 1
 <1><1008>: Abbrev Number: 12 (DW_TAG_variable)
    <1009>   DW_AT_name        : (indirect string, offset: 0xd68): ioctlent
    <100d>   DW_AT_decl_file   : 18
    <100e>   DW_AT_decl_line   : 1897
    <1010>   DW_AT_decl_column : 31
    <1011>   DW_AT_type        : <0x1017>
    <1015>   DW_AT_external    : 1
    <1016>   DW_AT_declaration : 1
 <1><1017>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1018>   DW_AT_byte_size   : 4
    <1019>   DW_AT_type        : <0x8d0>
 <1><101d>: Abbrev Number: 12 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0x8cb): nsyscalls
    <1022>   DW_AT_decl_file   : 18
    <1023>   DW_AT_decl_line   : 1903
    <1025>   DW_AT_decl_column : 17
    <1026>   DW_AT_type        : <0x2b>
    <102a>   DW_AT_external    : 1
    <102b>   DW_AT_declaration : 1
 <1><102c>: Abbrev Number: 12 (DW_TAG_variable)
    <102d>   DW_AT_name        : (indirect string, offset: 0xf7a): nioctlents
    <1031>   DW_AT_decl_file   : 18
    <1032>   DW_AT_decl_line   : 1904
    <1034>   DW_AT_decl_column : 17
    <1035>   DW_AT_type        : <0x2b>
    <1039>   DW_AT_external    : 1
    <103a>   DW_AT_declaration : 1
 <1><103b>: Abbrev Number: 10 (DW_TAG_array_type)
    <103c>   DW_AT_type        : <0x32>
    <1040>   DW_AT_sibling     : <0x104b>
 <2><1044>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1045>   DW_AT_type        : <0x2b>
    <1049>   DW_AT_upper_bound : 2
 <2><104a>: Abbrev Number: 0
 <1><104b>: Abbrev Number: 3 (DW_TAG_const_type)
    <104c>   DW_AT_type        : <0x103b>
 <1><1050>: Abbrev Number: 12 (DW_TAG_variable)
    <1051>   DW_AT_name        : (indirect string, offset: 0xfef): nsyscall_vec
    <1055>   DW_AT_decl_file   : 18
    <1056>   DW_AT_decl_line   : 1906
    <1058>   DW_AT_decl_column : 27
    <1059>   DW_AT_type        : <0x104b>
    <105d>   DW_AT_external    : 1
    <105e>   DW_AT_declaration : 1
 <1><105f>: Abbrev Number: 10 (DW_TAG_array_type)
    <1060>   DW_AT_type        : <0x9bb>
    <1064>   DW_AT_sibling     : <0x106f>
 <2><1068>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1069>   DW_AT_type        : <0x2b>
    <106d>   DW_AT_upper_bound : 2
 <2><106e>: Abbrev Number: 0
 <1><106f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1070>   DW_AT_type        : <0x105f>
 <1><1074>: Abbrev Number: 12 (DW_TAG_variable)
    <1075>   DW_AT_name        : (indirect string, offset: 0x801): sysent_vec
    <1079>   DW_AT_decl_file   : 18
    <107a>   DW_AT_decl_line   : 1907
    <107c>   DW_AT_decl_column : 35
    <107d>   DW_AT_type        : <0x106f>
    <1081>   DW_AT_external    : 1
    <1082>   DW_AT_declaration : 1
 <1><1083>: Abbrev Number: 12 (DW_TAG_variable)
    <1084>   DW_AT_name        : (indirect string, offset: 0x39b): inject_vec
    <1088>   DW_AT_decl_file   : 18
    <1089>   DW_AT_decl_line   : 1908
    <108b>   DW_AT_decl_column : 28
    <108c>   DW_AT_type        : <0x9c0>
    <1090>   DW_AT_external    : 1
    <1091>   DW_AT_declaration : 1
 <1><1092>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1093>   DW_AT_name        : (indirect string, offset: 0xe56): audit_arch_t
    <1097>   DW_AT_byte_size   : 8
    <1098>   DW_AT_decl_file   : 18
    <1099>   DW_AT_decl_line   : 1910
    <109b>   DW_AT_decl_column : 8
    <109c>   DW_AT_sibling     : <0x10c1>
 <2><10a0>: Abbrev Number: 22 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x641): arch
    <10a5>   DW_AT_decl_file   : 18
    <10a6>   DW_AT_decl_line   : 1911
    <10a8>   DW_AT_decl_column : 15
    <10a9>   DW_AT_type        : <0x2b>
    <10ad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b0>: Abbrev Number: 22 (DW_TAG_member)
    <10b1>   DW_AT_name        : (indirect string, offset: 0xa5f): flag
    <10b5>   DW_AT_decl_file   : 18
    <10b6>   DW_AT_decl_line   : 1912
    <10b8>   DW_AT_decl_column : 15
    <10b9>   DW_AT_type        : <0x2b>
    <10bd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c0>: Abbrev Number: 0
 <1><10c1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c2>   DW_AT_type        : <0x1092>
 <1><10c6>: Abbrev Number: 10 (DW_TAG_array_type)
    <10c7>   DW_AT_type        : <0x10c1>
    <10cb>   DW_AT_sibling     : <0x10d6>
 <2><10cf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10d0>   DW_AT_type        : <0x2b>
    <10d4>   DW_AT_upper_bound : 2
 <2><10d5>: Abbrev Number: 0
 <1><10d6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d7>   DW_AT_type        : <0x10c6>
 <1><10db>: Abbrev Number: 12 (DW_TAG_variable)
    <10dc>   DW_AT_name        : (indirect string, offset: 0x9ca): audit_arch_vec
    <10e0>   DW_AT_decl_file   : 18
    <10e1>   DW_AT_decl_line   : 1915
    <10e3>   DW_AT_decl_column : 34
    <10e4>   DW_AT_type        : <0x10d6>
    <10e8>   DW_AT_external    : 1
    <10e9>   DW_AT_declaration : 1
 <1><10ea>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10eb>   DW_AT_byte_size   : 180
    <10ec>   DW_AT_decl_file   : 20
    <10ed>   DW_AT_decl_line   : 2
    <10ee>   DW_AT_decl_column : 9
    <10ef>   DW_AT_sibling     : <0x13a4>
 <2><10f3>: Abbrev Number: 9 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x1da): block_ioctl
    <10f8>   DW_AT_decl_file   : 20
    <10f9>   DW_AT_decl_line   : 3
    <10fa>   DW_AT_decl_column : 8
    <10fb>   DW_AT_type        : <0x13be>
    <10ff>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1102>: Abbrev Number: 9 (DW_TAG_member)
    <1103>   DW_AT_name        : (indirect string, offset: 0xb39): btrfs_ioctl
    <1107>   DW_AT_decl_file   : 20
    <1108>   DW_AT_decl_line   : 6
    <1109>   DW_AT_decl_column : 8
    <110a>   DW_AT_type        : <0x13be>
    <110e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1111>: Abbrev Number: 9 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0x786): evdev_write_ioctl_mpers
    <1116>   DW_AT_decl_file   : 20
    <1117>   DW_AT_decl_line   : 9
    <1118>   DW_AT_decl_column : 8
    <1119>   DW_AT_type        : <0x13be>
    <111d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1120>: Abbrev Number: 9 (DW_TAG_member)
    <1121>   DW_AT_name        : (indirect string, offset: 0x75c): get_sock_fprog_size
    <1125>   DW_AT_decl_file   : 20
    <1126>   DW_AT_decl_line   : 12
    <1127>   DW_AT_decl_column : 17
    <1128>   DW_AT_type        : <0x13ca>
    <112c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><112f>: Abbrev Number: 9 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0x1a9): fetch_bpf_fprog
    <1134>   DW_AT_decl_file   : 20
    <1135>   DW_AT_decl_line   : 15
    <1136>   DW_AT_decl_column : 10
    <1137>   DW_AT_type        : <0x13ea>
    <113b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><113e>: Abbrev Number: 9 (DW_TAG_member)
    <113f>   DW_AT_name        : (indirect string, offset: 0x9b7): fetch_struct_flock
    <1143>   DW_AT_decl_file   : 20
    <1144>   DW_AT_decl_line   : 18
    <1145>   DW_AT_decl_column : 10
    <1146>   DW_AT_type        : <0x13ea>
    <114a>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><114d>: Abbrev Number: 9 (DW_TAG_member)
    <114e>   DW_AT_name        : (indirect string, offset: 0xd7c): fetch_struct_flock64
    <1152>   DW_AT_decl_file   : 20
    <1153>   DW_AT_decl_line   : 21
