Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x17b1 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x50c): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xad8): mpers-mx32/struct_ifreq.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xeef): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3ad): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1076): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9be): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe52): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4b0): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ad): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf40): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8dd): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x79f): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xba1): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbe3): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd54): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xcc1): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x411): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x304): __caddr_t
    <de>   DW_AT_decl_file   : 1
    <df>   DW_AT_decl_line   : 203
    <e0>   DW_AT_decl_column : 15
    <e1>   DW_AT_type        : <0xe5>
 <1><e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6>   DW_AT_byte_size   : 4
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 2 (DW_TAG_base_type)
    <ec>   DW_AT_byte_size   : 1
    <ed>   DW_AT_encoding    : 6	(signed char)
    <ee>   DW_AT_name        : (indirect string, offset: 0x45d): char
 <1><f2>: Abbrev Number: 3 (DW_TAG_const_type)
    <f3>   DW_AT_type        : <0xeb>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x35c): uint8_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 24
    <fe>   DW_AT_decl_column : 19
    <ff>   DW_AT_type        : <0x45>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xbce): uint16_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 25
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x58>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xffa): uint32_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 26
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x70>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xe62): uint64_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 27
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x8f>
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 4
    <129>   DW_AT_encoding    : 5	(signed)
    <12a>   DW_AT_name        : (indirect string, offset: 0x2c2): long int
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xb4a): timespec
    <144>   DW_AT_byte_size   : 16
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x114e): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xba>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe88): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xcd>
    <167>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xb0c): long double
 <1><172>: Abbrev Number: 10 (DW_TAG_variable)
    <173>   DW_AT_name        : (indirect string, offset: 0x279): __environ
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 543
    <17a>   DW_AT_decl_column : 15
    <17b>   DW_AT_type        : <0x181>
    <17f>   DW_AT_external    : 1
    <180>   DW_AT_declaration : 1
 <1><181>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <182>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0xe5>
 <1><187>: Abbrev Number: 10 (DW_TAG_variable)
    <188>   DW_AT_name        : (indirect string, offset: 0x3a5): environ
    <18c>   DW_AT_decl_file   : 5
    <18d>   DW_AT_decl_line   : 545
    <18f>   DW_AT_decl_column : 15
    <190>   DW_AT_type        : <0x181>
    <194>   DW_AT_external    : 1
    <195>   DW_AT_declaration : 1
 <1><196>: Abbrev Number: 11 (DW_TAG_variable)
    <197>   DW_AT_name        : (indirect string, offset: 0x105a): optarg
    <19b>   DW_AT_decl_file   : 6
    <19c>   DW_AT_decl_line   : 36
    <19d>   DW_AT_decl_column : 14
    <19e>   DW_AT_type        : <0xe5>
    <1a2>   DW_AT_external    : 1
    <1a3>   DW_AT_declaration : 1
 <1><1a4>: Abbrev Number: 11 (DW_TAG_variable)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x772): optind
    <1a9>   DW_AT_decl_file   : 6
    <1aa>   DW_AT_decl_line   : 50
    <1ab>   DW_AT_decl_column : 12
    <1ac>   DW_AT_type        : <0x64>
    <1b0>   DW_AT_external    : 1
    <1b1>   DW_AT_declaration : 1
 <1><1b2>: Abbrev Number: 11 (DW_TAG_variable)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xc9b): opterr
    <1b7>   DW_AT_decl_file   : 6
    <1b8>   DW_AT_decl_line   : 55
    <1b9>   DW_AT_decl_column : 12
    <1ba>   DW_AT_type        : <0x64>
    <1be>   DW_AT_external    : 1
    <1bf>   DW_AT_declaration : 1
 <1><1c0>: Abbrev Number: 11 (DW_TAG_variable)
    <1c1>   DW_AT_name        : (indirect string, offset: 0xb87): optopt
    <1c5>   DW_AT_decl_file   : 6
    <1c6>   DW_AT_decl_line   : 59
    <1c7>   DW_AT_decl_column : 12
    <1c8>   DW_AT_type        : <0x64>
    <1cc>   DW_AT_external    : 1
    <1cd>   DW_AT_declaration : 1
 <1><1ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1cf>   DW_AT_byte_size   : 4
    <1d0>   DW_AT_type        : <0xf2>
 <1><1d4>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d5>   DW_AT_type        : <0x1ce>
 <1><1d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0x1df>
 <1><1df>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1e0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x364): _IO_FILE
    <1e5>   DW_AT_byte_size   : 152
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 49
    <1e8>   DW_AT_decl_column : 8
    <1e9>   DW_AT_sibling     : <0x3a1>
 <2><1ed>: Abbrev Number: 9 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0xa3a): _flags
    <1f2>   DW_AT_decl_file   : 7
    <1f3>   DW_AT_decl_line   : 51
    <1f4>   DW_AT_decl_column : 7
    <1f5>   DW_AT_type        : <0x64>
    <1f9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1fc>: Abbrev Number: 9 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x4ff): _IO_read_ptr
    <201>   DW_AT_decl_file   : 7
    <202>   DW_AT_decl_line   : 54
    <203>   DW_AT_decl_column : 9
    <204>   DW_AT_type        : <0xe5>
    <208>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20b>: Abbrev Number: 9 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0xf95): _IO_read_end
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 55
    <212>   DW_AT_decl_column : 9
    <213>   DW_AT_type        : <0xe5>
    <217>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21a>: Abbrev Number: 9 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x7db): _IO_read_base
    <21f>   DW_AT_decl_file   : 7
    <220>   DW_AT_decl_line   : 56
    <221>   DW_AT_decl_column : 9
    <222>   DW_AT_type        : <0xe5>
    <226>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x12e): _IO_write_base
    <22e>   DW_AT_decl_file   : 7
    <22f>   DW_AT_decl_line   : 57
    <230>   DW_AT_decl_column : 9
    <231>   DW_AT_type        : <0xe5>
    <235>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><238>: Abbrev Number: 9 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x10ba): _IO_write_ptr
    <23d>   DW_AT_decl_file   : 7
    <23e>   DW_AT_decl_line   : 58
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0xe5>
    <244>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><247>: Abbrev Number: 9 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0x929): _IO_write_end
    <24c>   DW_AT_decl_file   : 7
    <24d>   DW_AT_decl_line   : 59
    <24e>   DW_AT_decl_column : 9
    <24f>   DW_AT_type        : <0xe5>
    <253>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><256>: Abbrev Number: 9 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x9a7): _IO_buf_base
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 60
    <25d>   DW_AT_decl_column : 9
    <25e>   DW_AT_type        : <0xe5>
    <262>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><265>: Abbrev Number: 9 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0xdec): _IO_buf_end
    <26a>   DW_AT_decl_file   : 7
    <26b>   DW_AT_decl_line   : 61
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0xe5>
    <271>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><274>: Abbrev Number: 9 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x1d6): _IO_save_base
    <279>   DW_AT_decl_file   : 7
    <27a>   DW_AT_decl_line   : 64
    <27b>   DW_AT_decl_column : 9
    <27c>   DW_AT_type        : <0xe5>
    <280>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><283>: Abbrev Number: 9 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0xd13): _IO_backup_base
    <288>   DW_AT_decl_file   : 7
    <289>   DW_AT_decl_line   : 65
    <28a>   DW_AT_decl_column : 9
    <28b>   DW_AT_type        : <0xe5>
    <28f>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><292>: Abbrev Number: 9 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0xb6): _IO_save_end
    <297>   DW_AT_decl_file   : 7
    <298>   DW_AT_decl_line   : 66
    <299>   DW_AT_decl_column : 9
    <29a>   DW_AT_type        : <0xe5>
    <29e>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a1>: Abbrev Number: 9 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x62d): _markers
    <2a6>   DW_AT_decl_file   : 7
    <2a7>   DW_AT_decl_line   : 68
    <2a8>   DW_AT_decl_column : 22
    <2a9>   DW_AT_type        : <0x3bb>
    <2ad>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b0>: Abbrev Number: 9 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x219): _chain
    <2b5>   DW_AT_decl_file   : 7
    <2b6>   DW_AT_decl_line   : 70
    <2b7>   DW_AT_decl_column : 20
    <2b8>   DW_AT_type        : <0x3c1>
    <2bc>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2bf>: Abbrev Number: 9 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x1020): _fileno
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 72
    <2c6>   DW_AT_decl_column : 7
    <2c7>   DW_AT_type        : <0x64>
    <2cb>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2ce>: Abbrev Number: 9 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x7c7): _flags2
    <2d3>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 73
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x64>
    <2da>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2dd>: Abbrev Number: 9 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x859): _old_offset
    <2e2>   DW_AT_decl_file   : 7
    <2e3>   DW_AT_decl_line   : 74
    <2e4>   DW_AT_decl_column : 11
    <2e5>   DW_AT_type        : <0xa2>
    <2e9>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2ec>: Abbrev Number: 9 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x247): _cur_column
    <2f1>   DW_AT_decl_file   : 7
    <2f2>   DW_AT_decl_line   : 77
    <2f3>   DW_AT_decl_column : 18
    <2f4>   DW_AT_type        : <0x24>
    <2f8>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2fb>: Abbrev Number: 9 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0xeae): _vtable_offset
    <300>   DW_AT_decl_file   : 7
    <301>   DW_AT_decl_line   : 78
    <302>   DW_AT_decl_column : 15
    <303>   DW_AT_type        : <0x3e>
    <307>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30a>: Abbrev Number: 9 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0xd23): _shortbuf
    <30f>   DW_AT_decl_file   : 7
    <310>   DW_AT_decl_line   : 79
    <311>   DW_AT_decl_column : 8
    <312>   DW_AT_type        : <0x3c7>
    <316>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><319>: Abbrev Number: 9 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x16f): _lock
    <31e>   DW_AT_decl_file   : 7
    <31f>   DW_AT_decl_line   : 81
    <320>   DW_AT_decl_column : 15
    <321>   DW_AT_type        : <0x3d7>
    <325>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><328>: Abbrev Number: 9 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x70a): _offset
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 89
    <32f>   DW_AT_decl_column : 13
    <330>   DW_AT_type        : <0xae>
    <334>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><337>: Abbrev Number: 9 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0xa7a): _codecvt
    <33c>   DW_AT_decl_file   : 7
    <33d>   DW_AT_decl_line   : 91
    <33e>   DW_AT_decl_column : 23
    <33f>   DW_AT_type        : <0x3e3>
    <343>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><346>: Abbrev Number: 9 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x103e): _wide_data
    <34b>   DW_AT_decl_file   : 7
    <34c>   DW_AT_decl_line   : 92
    <34d>   DW_AT_decl_column : 25
    <34e>   DW_AT_type        : <0x3ef>
    <352>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><355>: Abbrev Number: 9 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x3c9): _freeres_list
    <35a>   DW_AT_decl_file   : 7
    <35b>   DW_AT_decl_line   : 93
    <35c>   DW_AT_decl_column : 20
    <35d>   DW_AT_type        : <0x3c1>
    <361>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><364>: Abbrev Number: 9 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0xc71): _freeres_buf
    <369>   DW_AT_decl_file   : 7
    <36a>   DW_AT_decl_line   : 94
    <36b>   DW_AT_decl_column : 9
    <36c>   DW_AT_type        : <0xc6>
    <370>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><373>: Abbrev Number: 9 (DW_TAG_member)
    <374>   DW_AT_name        : (indirect string, offset: 0x9fc): __pad5
    <378>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 95
    <37a>   DW_AT_decl_column : 10
    <37b>   DW_AT_type        : <0x12e>
    <37f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><382>: Abbrev Number: 9 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xa5e): _mode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 96
    <389>   DW_AT_decl_column : 7
    <38a>   DW_AT_type        : <0x64>
    <38e>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><391>: Abbrev Number: 9 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x7ff): _unused2
    <396>   DW_AT_decl_file   : 7
    <397>   DW_AT_decl_line   : 98
    <398>   DW_AT_decl_column : 8
    <399>   DW_AT_type        : <0x3f5>
    <39d>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a0>: Abbrev Number: 0
 <1><3a1>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xb2c): FILE
    <3a6>   DW_AT_decl_file   : 8
    <3a7>   DW_AT_decl_line   : 7
    <3a8>   DW_AT_decl_column : 25
    <3a9>   DW_AT_type        : <0x1e0>
 <1><3ad>: Abbrev Number: 13 (DW_TAG_typedef)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x49c): _IO_lock_t
    <3b2>   DW_AT_decl_file   : 7
    <3b3>   DW_AT_decl_line   : 43
    <3b4>   DW_AT_decl_column : 14
 <1><3b5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x30e): _IO_marker
    <3ba>   DW_AT_declaration : 1
 <1><3bb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bc>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x3b5>
 <1><3c1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c3>   DW_AT_type        : <0x1e0>
 <1><3c7>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c8>   DW_AT_type        : <0xeb>
    <3cc>   DW_AT_sibling     : <0x3d7>
 <2><3d0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3d1>   DW_AT_type        : <0x2b>
    <3d5>   DW_AT_upper_bound : 0
 <2><3d6>: Abbrev Number: 0
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3ad>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x79): _IO_codecvt
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x378): _IO_wide_data
    <3ee>   DW_AT_declaration : 1
 <1><3ef>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f0>   DW_AT_byte_size   : 4
    <3f1>   DW_AT_type        : <0x3e9>
 <1><3f5>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f6>   DW_AT_type        : <0xeb>
    <3fa>   DW_AT_sibling     : <0x405>
 <2><3fe>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3ff>   DW_AT_type        : <0x2b>
    <403>   DW_AT_upper_bound : 39
 <2><404>: Abbrev Number: 0
 <1><405>: Abbrev Number: 11 (DW_TAG_variable)
    <406>   DW_AT_name        : (indirect string, offset: 0x5e4): stdin
    <40a>   DW_AT_decl_file   : 9
    <40b>   DW_AT_decl_line   : 137
    <40c>   DW_AT_decl_column : 14
    <40d>   DW_AT_type        : <0x413>
    <411>   DW_AT_external    : 1
    <412>   DW_AT_declaration : 1
 <1><413>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_type        : <0x3a1>
 <1><419>: Abbrev Number: 11 (DW_TAG_variable)
    <41a>   DW_AT_name        : (indirect string, offset: 0x1089): stdout
    <41e>   DW_AT_decl_file   : 9
    <41f>   DW_AT_decl_line   : 138
    <420>   DW_AT_decl_column : 14
    <421>   DW_AT_type        : <0x413>
    <425>   DW_AT_external    : 1
    <426>   DW_AT_declaration : 1
 <1><427>: Abbrev Number: 11 (DW_TAG_variable)
    <428>   DW_AT_name        : (indirect string, offset: 0xe4b): stderr
    <42c>   DW_AT_decl_file   : 9
    <42d>   DW_AT_decl_line   : 139
    <42e>   DW_AT_decl_column : 14
    <42f>   DW_AT_type        : <0x413>
    <433>   DW_AT_external    : 1
    <434>   DW_AT_declaration : 1
 <1><435>: Abbrev Number: 11 (DW_TAG_variable)
    <436>   DW_AT_name        : (indirect string, offset: 0x253): sys_nerr
    <43a>   DW_AT_decl_file   : 10
    <43b>   DW_AT_decl_line   : 26
    <43c>   DW_AT_decl_column : 12
    <43d>   DW_AT_type        : <0x64>
    <441>   DW_AT_external    : 1
    <442>   DW_AT_declaration : 1
 <1><443>: Abbrev Number: 15 (DW_TAG_array_type)
    <444>   DW_AT_type        : <0x1d4>
    <448>   DW_AT_sibling     : <0x44e>
 <2><44c>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><44d>: Abbrev Number: 0
 <1><44e>: Abbrev Number: 3 (DW_TAG_const_type)
    <44f>   DW_AT_type        : <0x443>
 <1><453>: Abbrev Number: 11 (DW_TAG_variable)
    <454>   DW_AT_name        : (indirect string, offset: 0x5f3): sys_errlist
    <458>   DW_AT_decl_file   : 10
    <459>   DW_AT_decl_line   : 27
    <45a>   DW_AT_decl_column : 26
    <45b>   DW_AT_type        : <0x44e>
    <45f>   DW_AT_external    : 1
    <460>   DW_AT_declaration : 1
 <1><461>: Abbrev Number: 11 (DW_TAG_variable)
    <462>   DW_AT_name        : (indirect string, offset: 0x266): _sys_nerr
    <466>   DW_AT_decl_file   : 10
    <467>   DW_AT_decl_line   : 30
    <468>   DW_AT_decl_column : 12
    <469>   DW_AT_type        : <0x64>
    <46d>   DW_AT_external    : 1
    <46e>   DW_AT_declaration : 1
 <1><46f>: Abbrev Number: 11 (DW_TAG_variable)
    <470>   DW_AT_name        : (indirect string, offset: 0xebd): _sys_errlist
    <474>   DW_AT_decl_file   : 10
    <475>   DW_AT_decl_line   : 31
    <476>   DW_AT_decl_column : 26
    <477>   DW_AT_type        : <0x44e>
    <47b>   DW_AT_external    : 1
    <47c>   DW_AT_declaration : 1
 <1><47d>: Abbrev Number: 11 (DW_TAG_variable)
    <47e>   DW_AT_name        : (indirect string, offset: 0x6e3): program_invocation_name
    <482>   DW_AT_decl_file   : 11
    <483>   DW_AT_decl_line   : 45
    <484>   DW_AT_decl_column : 14
    <485>   DW_AT_type        : <0xe5>
    <489>   DW_AT_external    : 1
    <48a>   DW_AT_declaration : 1
 <1><48b>: Abbrev Number: 11 (DW_TAG_variable)
    <48c>   DW_AT_name        : (indirect string, offset: 0xc0e): program_invocation_short_name
    <490>   DW_AT_decl_file   : 11
    <491>   DW_AT_decl_line   : 46
    <492>   DW_AT_decl_column : 14
    <493>   DW_AT_type        : <0xe5>
    <497>   DW_AT_external    : 1
    <498>   DW_AT_declaration : 1
 <1><499>: Abbrev Number: 15 (DW_TAG_array_type)
    <49a>   DW_AT_type        : <0xe5>
    <49e>   DW_AT_sibling     : <0x4a9>
 <2><4a2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4a3>   DW_AT_type        : <0x2b>
    <4a7>   DW_AT_upper_bound : 1
 <2><4a8>: Abbrev Number: 0
 <1><4a9>: Abbrev Number: 11 (DW_TAG_variable)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x1c3): __tzname
    <4ae>   DW_AT_decl_file   : 12
    <4af>   DW_AT_decl_line   : 159
    <4b0>   DW_AT_decl_column : 14
    <4b1>   DW_AT_type        : <0x499>
    <4b5>   DW_AT_external    : 1
    <4b6>   DW_AT_declaration : 1
 <1><4b7>: Abbrev Number: 11 (DW_TAG_variable)
    <4b8>   DW_AT_name        : (indirect string, offset: 0xf27): __daylight
    <4bc>   DW_AT_decl_file   : 12
    <4bd>   DW_AT_decl_line   : 160
    <4be>   DW_AT_decl_column : 12
    <4bf>   DW_AT_type        : <0x64>
    <4c3>   DW_AT_external    : 1
    <4c4>   DW_AT_declaration : 1
 <1><4c5>: Abbrev Number: 11 (DW_TAG_variable)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x36d): __timezone
    <4ca>   DW_AT_decl_file   : 12
    <4cb>   DW_AT_decl_line   : 161
    <4cc>   DW_AT_decl_column : 17
    <4cd>   DW_AT_type        : <0x127>
    <4d1>   DW_AT_external    : 1
    <4d2>   DW_AT_declaration : 1
 <1><4d3>: Abbrev Number: 11 (DW_TAG_variable)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x9f5): tzname
    <4d8>   DW_AT_decl_file   : 12
    <4d9>   DW_AT_decl_line   : 166
    <4da>   DW_AT_decl_column : 14
    <4db>   DW_AT_type        : <0x499>
    <4df>   DW_AT_external    : 1
    <4e0>   DW_AT_declaration : 1
 <1><4e1>: Abbrev Number: 11 (DW_TAG_variable)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x1104): daylight
    <4e6>   DW_AT_decl_file   : 12
    <4e7>   DW_AT_decl_line   : 174
    <4e8>   DW_AT_decl_column : 12
    <4e9>   DW_AT_type        : <0x64>
    <4ed>   DW_AT_external    : 1
    <4ee>   DW_AT_declaration : 1
 <1><4ef>: Abbrev Number: 11 (DW_TAG_variable)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x4ea): timezone
    <4f4>   DW_AT_decl_file   : 12
    <4f5>   DW_AT_decl_line   : 175
    <4f6>   DW_AT_decl_column : 17
    <4f7>   DW_AT_type        : <0x127>
    <4fb>   DW_AT_external    : 1
    <4fc>   DW_AT_declaration : 1
 <1><4fd>: Abbrev Number: 10 (DW_TAG_variable)
    <4fe>   DW_AT_name        : (indirect string, offset: 0xfc5): getdate_err
    <502>   DW_AT_decl_file   : 12
    <503>   DW_AT_decl_line   : 274
    <505>   DW_AT_decl_column : 12
    <506>   DW_AT_type        : <0x64>
    <50a>   DW_AT_external    : 1
    <50b>   DW_AT_declaration : 1
 <1><50c>: Abbrev Number: 11 (DW_TAG_variable)
    <50d>   DW_AT_name        : (indirect string, offset: 0xa08): debug_flag
    <511>   DW_AT_decl_file   : 13
    <512>   DW_AT_decl_line   : 20
    <513>   DW_AT_decl_column : 13
    <514>   DW_AT_type        : <0x51a>
    <518>   DW_AT_external    : 1
    <519>   DW_AT_declaration : 1
 <1><51a>: Abbrev Number: 2 (DW_TAG_base_type)
    <51b>   DW_AT_byte_size   : 1
    <51c>   DW_AT_encoding    : 2	(boolean)
    <51d>   DW_AT_name        : (indirect string, offset: 0x423): _Bool
 <1><521>: Abbrev Number: 3 (DW_TAG_const_type)
    <522>   DW_AT_type        : <0x51a>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0xac8): __kernel_long_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 14
    <52d>   DW_AT_decl_column : 19
    <52e>   DW_AT_type        : <0x88>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x5d3): __kernel_ulong_t
    <537>   DW_AT_decl_file   : 14
    <538>   DW_AT_decl_line   : 15
    <539>   DW_AT_decl_column : 28
    <53a>   DW_AT_type        : <0x9b>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x3d7): kernel_long_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 16
    <545>   DW_AT_decl_column : 25
    <546>   DW_AT_type        : <0x526>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x8ce): kernel_ulong_t
    <54f>   DW_AT_decl_file   : 15
    <550>   DW_AT_decl_line   : 17
    <551>   DW_AT_decl_column : 26
    <552>   DW_AT_type        : <0x532>
 <1><556>: Abbrev Number: 3 (DW_TAG_const_type)
    <557>   DW_AT_type        : <0x54a>
 <1><55b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <55c>   DW_AT_name        : (indirect string, offset: 0xc2c): list_item
    <560>   DW_AT_byte_size   : 8
    <561>   DW_AT_decl_file   : 16
    <562>   DW_AT_decl_line   : 92
    <563>   DW_AT_decl_column : 8
    <564>   DW_AT_sibling     : <0x587>
 <2><568>: Abbrev Number: 9 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x1149): prev
    <56d>   DW_AT_decl_file   : 16
    <56e>   DW_AT_decl_line   : 93
    <56f>   DW_AT_decl_column : 20
    <570>   DW_AT_type        : <0x587>
    <574>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><577>: Abbrev Number: 9 (DW_TAG_member)
    <578>   DW_AT_name        : (indirect string, offset: 0x113f): next
    <57c>   DW_AT_decl_file   : 16
    <57d>   DW_AT_decl_line   : 94
    <57e>   DW_AT_decl_column : 20
    <57f>   DW_AT_type        : <0x587>
    <583>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><586>: Abbrev Number: 0
 <1><587>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <588>   DW_AT_byte_size   : 4
    <589>   DW_AT_type        : <0x55b>
 <1><58d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <58e>   DW_AT_name        : (indirect string, offset: 0x8a6): sysent
    <592>   DW_AT_byte_size   : 20
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 13
    <595>   DW_AT_decl_column : 16
    <596>   DW_AT_sibling     : <0x5e6>
 <2><59a>: Abbrev Number: 9 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x10a0): nargs
    <59f>   DW_AT_decl_file   : 17
    <5a0>   DW_AT_decl_line   : 14
    <5a1>   DW_AT_decl_column : 11
    <5a2>   DW_AT_type        : <0x2b>
    <5a6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a9>: Abbrev Number: 9 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0x9b4): sys_flags
    <5ae>   DW_AT_decl_file   : 17
    <5af>   DW_AT_decl_line   : 15
    <5b0>   DW_AT_decl_column : 6
    <5b1>   DW_AT_type        : <0x64>
    <5b5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b8>: Abbrev Number: 18 (DW_TAG_member)
    <5b9>   DW_AT_name        : sen
    <5bd>   DW_AT_decl_file   : 17
    <5be>   DW_AT_decl_line   : 16
    <5bf>   DW_AT_decl_column : 6
    <5c0>   DW_AT_type        : <0x64>
    <5c4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5c7>: Abbrev Number: 9 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0x2fb): sys_func
    <5cc>   DW_AT_decl_file   : 17
    <5cd>   DW_AT_decl_line   : 17
    <5ce>   DW_AT_decl_column : 8
    <5cf>   DW_AT_type        : <0x853>
    <5d3>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5d6>: Abbrev Number: 9 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x270): sys_name
    <5db>   DW_AT_decl_file   : 17
    <5dc>   DW_AT_decl_line   : 18
    <5dd>   DW_AT_decl_column : 14
    <5de>   DW_AT_type        : <0x1ce>
    <5e2>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e5>: Abbrev Number: 0
 <1><5e6>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5e7>   DW_AT_prototyped  : 1
    <5e8>   DW_AT_type        : <0x64>
    <5ec>   DW_AT_sibling     : <0x5f6>
 <2><5f0>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5f1>   DW_AT_type        : <0x5f6>
 <2><5f5>: Abbrev Number: 0
 <1><5f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5f7>   DW_AT_byte_size   : 4
    <5f8>   DW_AT_type        : <0x601>
 <1><5fc>: Abbrev Number: 3 (DW_TAG_const_type)
    <5fd>   DW_AT_type        : <0x5f6>
 <1><601>: Abbrev Number: 21 (DW_TAG_structure_type)
    <602>   DW_AT_name        : tcb
    <606>   DW_AT_byte_size   : 288
    <608>   DW_AT_decl_file   : 18
    <609>   DW_AT_decl_line   : 262
    <60b>   DW_AT_decl_column : 8
    <60c>   DW_AT_sibling     : <0x853>
 <2><610>: Abbrev Number: 22 (DW_TAG_member)
    <611>   DW_AT_name        : (indirect string, offset: 0x4f9): flags
    <615>   DW_AT_decl_file   : 18
    <616>   DW_AT_decl_line   : 263
    <618>   DW_AT_decl_column : 6
    <619>   DW_AT_type        : <0x64>
    <61d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><620>: Abbrev Number: 23 (DW_TAG_member)
    <621>   DW_AT_name        : pid
    <625>   DW_AT_decl_file   : 18
    <626>   DW_AT_decl_line   : 264
    <628>   DW_AT_decl_column : 6
    <629>   DW_AT_type        : <0x64>
    <62d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><630>: Abbrev Number: 22 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x58): qual_flg
    <635>   DW_AT_decl_file   : 18
    <636>   DW_AT_decl_line   : 265
    <638>   DW_AT_decl_column : 6
    <639>   DW_AT_type        : <0x64>
    <63d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><640>: Abbrev Number: 22 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x391): currpers
    <645>   DW_AT_decl_file   : 18
    <646>   DW_AT_decl_line   : 267
    <648>   DW_AT_decl_column : 15
    <649>   DW_AT_type        : <0x2b>
    <64d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><650>: Abbrev Number: 22 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0xb7f): u_error
    <655>   DW_AT_decl_file   : 18
    <656>   DW_AT_decl_line   : 269
    <658>   DW_AT_decl_column : 16
    <659>   DW_AT_type        : <0x37>
    <65d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><660>: Abbrev Number: 22 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x1a3): scno
    <665>   DW_AT_decl_file   : 18
    <666>   DW_AT_decl_line   : 270
    <668>   DW_AT_decl_column : 17
    <669>   DW_AT_type        : <0x54a>
    <66d>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><670>: Abbrev Number: 22 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0xbc4): true_scno
    <675>   DW_AT_decl_file   : 18
    <676>   DW_AT_decl_line   : 271
    <678>   DW_AT_decl_column : 17
    <679>   DW_AT_type        : <0x54a>
    <67d>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><680>: Abbrev Number: 22 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x1ad): u_arg
    <685>   DW_AT_decl_file   : 18
    <686>   DW_AT_decl_line   : 272
    <688>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x983>
    <68d>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><690>: Abbrev Number: 22 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x9cb): u_rval
    <695>   DW_AT_decl_file   : 18
    <696>   DW_AT_decl_line   : 273
    <698>   DW_AT_decl_column : 16
    <699>   DW_AT_type        : <0x53e>
    <69d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6a0>: Abbrev Number: 22 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0xafe): sys_func_rval
    <6a5>   DW_AT_decl_file   : 18
    <6a6>   DW_AT_decl_line   : 274
    <6a8>   DW_AT_decl_column : 6
    <6a9>   DW_AT_type        : <0x64>
    <6ad>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6b0>: Abbrev Number: 22 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0xd45): curcol
    <6b5>   DW_AT_decl_file   : 18
    <6b6>   DW_AT_decl_line   : 275
    <6b8>   DW_AT_decl_column : 6
    <6b9>   DW_AT_type        : <0x64>
    <6bd>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6c0>: Abbrev Number: 22 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x9dd): outf
    <6c5>   DW_AT_decl_file   : 18
    <6c6>   DW_AT_decl_line   : 276
    <6c8>   DW_AT_decl_column : 8
    <6c9>   DW_AT_type        : <0x413>
    <6cd>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xf66): staged_output_data
    <6d5>   DW_AT_decl_file   : 18
    <6d6>   DW_AT_decl_line   : 277
    <6d8>   DW_AT_decl_column : 29
    <6d9>   DW_AT_type        : <0x999>
    <6dd>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6e0>: Abbrev Number: 22 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xaaf): auxstr
    <6e5>   DW_AT_decl_file   : 18
    <6e6>   DW_AT_decl_line   : 279
    <6e8>   DW_AT_decl_column : 14
    <6e9>   DW_AT_type        : <0x1ce>
    <6ed>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6f0>: Abbrev Number: 22 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x175): _priv_data
    <6f5>   DW_AT_decl_file   : 18
    <6f6>   DW_AT_decl_line   : 280
    <6f8>   DW_AT_decl_column : 8
    <6f9>   DW_AT_type        : <0xc6>
    <6fd>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><700>: Abbrev Number: 22 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0xc59): _free_priv_data
    <705>   DW_AT_decl_file   : 18
    <706>   DW_AT_decl_line   : 281
    <708>   DW_AT_decl_column : 9
    <709>   DW_AT_type        : <0x9ab>
    <70d>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><710>: Abbrev Number: 22 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0x186): s_ent
    <715>   DW_AT_decl_file   : 18
    <716>   DW_AT_decl_line   : 282
    <718>   DW_AT_decl_column : 23
    <719>   DW_AT_type        : <0x9b1>
    <71d>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><720>: Abbrev Number: 22 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <725>   DW_AT_decl_file   : 18
    <726>   DW_AT_decl_line   : 285
    <728>   DW_AT_decl_column : 23
    <729>   DW_AT_type        : <0x9b1>
    <72d>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><731>: Abbrev Number: 22 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x386): inject_vec
    <736>   DW_AT_decl_file   : 18
    <737>   DW_AT_decl_line   : 286
    <739>   DW_AT_decl_column : 22
    <73a>   DW_AT_type        : <0x9bc>
    <73e>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x808): stime
    <747>   DW_AT_decl_file   : 18
    <748>   DW_AT_decl_line   : 287
    <74a>   DW_AT_decl_column : 18
    <74b>   DW_AT_type        : <0x13f>
    <74f>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><753>: Abbrev Number: 22 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x39a): ltime
    <758>   DW_AT_decl_file   : 18
    <759>   DW_AT_decl_line   : 288
    <75b>   DW_AT_decl_column : 18
    <75c>   DW_AT_type        : <0x13f>
    <760>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><764>: Abbrev Number: 22 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x1061): atime
    <769>   DW_AT_decl_file   : 18
    <76a>   DW_AT_decl_line   : 289
    <76c>   DW_AT_decl_column : 18
    <76d>   DW_AT_type        : <0x13f>
    <771>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><775>: Abbrev Number: 22 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0x4f3): etime
    <77a>   DW_AT_decl_file   : 18
    <77b>   DW_AT_decl_line   : 290
    <77d>   DW_AT_decl_column : 18
    <77e>   DW_AT_type        : <0x13f>
    <782>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><786>: Abbrev Number: 22 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0xda9): delay_expiration_time
    <78b>   DW_AT_decl_file   : 18
    <78c>   DW_AT_decl_line   : 291
    <78e>   DW_AT_decl_column : 18
    <78f>   DW_AT_type        : <0x13f>
    <793>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><797>: Abbrev Number: 22 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <79c>   DW_AT_decl_file   : 18
    <79d>   DW_AT_decl_line   : 298
    <79f>   DW_AT_decl_column : 15
    <7a0>   DW_AT_type        : <0x2b>
    <7a4>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7a8>: Abbrev Number: 22 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0xfa2): last_dirfd
    <7ad>   DW_AT_decl_file   : 18
    <7ae>   DW_AT_decl_line   : 301
    <7b0>   DW_AT_decl_column : 6
    <7b1>   DW_AT_type        : <0x64>
    <7b5>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7b9>: Abbrev Number: 22 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0xfda): mmap_cache
    <7be>   DW_AT_decl_file   : 18
    <7bf>   DW_AT_decl_line   : 304
    <7c1>   DW_AT_decl_column : 23
    <7c2>   DW_AT_type        : <0x9d8>
    <7c6>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ca>: Abbrev Number: 22 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xb8e): wait_data_idx
    <7cf>   DW_AT_decl_file   : 18
    <7d0>   DW_AT_decl_line   : 311
    <7d2>   DW_AT_decl_column : 9
    <7d3>   DW_AT_type        : <0x12e>
    <7d7>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7db>: Abbrev Number: 22 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xab6): delayed_wait_data
    <7e0>   DW_AT_decl_file   : 18
    <7e1>   DW_AT_decl_line   : 313
    <7e3>   DW_AT_decl_column : 24
    <7e4>   DW_AT_type        : <0x9e4>
    <7e8>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7ec>: Abbrev Number: 22 (DW_TAG_member)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xb40): wait_list
    <7f1>   DW_AT_decl_file   : 18
    <7f2>   DW_AT_decl_line   : 314
    <7f4>   DW_AT_decl_column : 19
    <7f5>   DW_AT_type        : <0x55b>
    <7f9>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><7fd>: Abbrev Number: 22 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x6fb): vcpu_info_list
    <802>   DW_AT_decl_file   : 18
    <803>   DW_AT_decl_line   : 318
    <805>   DW_AT_decl_column : 20
    <806>   DW_AT_type        : <0x9f0>
    <80a>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0xd08): unwind_ctx
    <813>   DW_AT_decl_file   : 18
    <814>   DW_AT_decl_line   : 322
    <816>   DW_AT_decl_column : 8
    <817>   DW_AT_type        : <0xc6>
    <81b>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><81f>: Abbrev Number: 22 (DW_TAG_member)
    <820>   DW_AT_name        : (indirect string, offset: 0x4dd): unwind_queue
    <824>   DW_AT_decl_file   : 18
    <825>   DW_AT_decl_line   : 323
    <827>   DW_AT_decl_column : 25
    <828>   DW_AT_type        : <0x9fc>
    <82c>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><830>: Abbrev Number: 22 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x16a): comm
    <835>   DW_AT_decl_file   : 18
    <836>   DW_AT_decl_line   : 327
    <838>   DW_AT_decl_column : 7
    <839>   DW_AT_type        : <0xa02>
    <83d>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><841>: Abbrev Number: 22 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x229): start_prc
    <846>   DW_AT_decl_file   : 18
    <847>   DW_AT_decl_line   : 329
    <849>   DW_AT_decl_column : 16
    <84a>   DW_AT_type        : <0x37>
    <84e>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><852>: Abbrev Number: 0
 <1><853>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <854>   DW_AT_byte_size   : 4
    <855>   DW_AT_type        : <0x5e6>
 <1><859>: Abbrev Number: 4 (DW_TAG_typedef)
    <85a>   DW_AT_name        : (indirect string, offset: 0x5c5): struct_sysent
    <85e>   DW_AT_decl_file   : 17
    <85f>   DW_AT_decl_line   : 19
    <860>   DW_AT_decl_column : 3
    <861>   DW_AT_type        : <0x58d>
 <1><865>: Abbrev Number: 3 (DW_TAG_const_type)
    <866>   DW_AT_type        : <0x859>
 <1><86a>: Abbrev Number: 11 (DW_TAG_variable)
    <86b>   DW_AT_name        : (indirect string, offset: 0xd95): current_personality
    <86f>   DW_AT_decl_file   : 18
    <870>   DW_AT_decl_line   : 158
    <871>   DW_AT_decl_column : 17
    <872>   DW_AT_type        : <0x2b>
    <876>   DW_AT_external    : 1
    <877>   DW_AT_declaration : 1
 <1><878>: Abbrev Number: 11 (DW_TAG_variable)
    <879>   DW_AT_name        : (indirect string, offset: 0x848): current_wordsize
    <87d>   DW_AT_decl_file   : 18
    <87e>   DW_AT_decl_line   : 171
    <87f>   DW_AT_decl_column : 17
    <880>   DW_AT_type        : <0x2b>
    <884>   DW_AT_external    : 1
    <885>   DW_AT_declaration : 1
 <1><886>: Abbrev Number: 11 (DW_TAG_variable)
    <887>   DW_AT_name        : (indirect string, offset: 0xa83): current_klongsize
    <88b>   DW_AT_decl_file   : 18
    <88c>   DW_AT_decl_line   : 176
    <88d>   DW_AT_decl_column : 17
    <88e>   DW_AT_type        : <0x2b>
    <892>   DW_AT_external    : 1
    <893>   DW_AT_declaration : 1
 <1><894>: Abbrev Number: 8 (DW_TAG_structure_type)
    <895>   DW_AT_name        : (indirect string, offset: 0xcdf): ioctlent
    <899>   DW_AT_byte_size   : 8
    <89a>   DW_AT_decl_file   : 18
    <89b>   DW_AT_decl_line   : 217
    <89c>   DW_AT_decl_column : 16
    <89d>   DW_AT_sibling     : <0x8c0>
 <2><8a1>: Abbrev Number: 9 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xf8e): symbol
    <8a6>   DW_AT_decl_file   : 18
    <8a7>   DW_AT_decl_line   : 218
    <8a8>   DW_AT_decl_column : 14
    <8a9>   DW_AT_type        : <0x1ce>
    <8ad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b0>: Abbrev Number: 9 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xd5e): code
    <8b5>   DW_AT_decl_file   : 18
    <8b6>   DW_AT_decl_line   : 219
    <8b7>   DW_AT_decl_column : 15
    <8b8>   DW_AT_type        : <0x2b>
    <8bc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8bf>: Abbrev Number: 0
 <1><8c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xc8b): struct_ioctlent
    <8c5>   DW_AT_decl_file   : 18
    <8c6>   DW_AT_decl_line   : 220
    <8c7>   DW_AT_decl_column : 3
    <8c8>   DW_AT_type        : <0x894>
 <1><8cc>: Abbrev Number: 3 (DW_TAG_const_type)
    <8cd>   DW_AT_type        : <0x8c0>
 <1><8d1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x83c): inject_data
    <8d6>   DW_AT_byte_size   : 10
    <8d7>   DW_AT_decl_file   : 18
    <8d8>   DW_AT_decl_line   : 241
    <8d9>   DW_AT_decl_column : 8
    <8da>   DW_AT_sibling     : <0x939>
 <2><8de>: Abbrev Number: 9 (DW_TAG_member)
    <8df>   DW_AT_name        : (indirect string, offset: 0x4f9): flags
    <8e3>   DW_AT_decl_file   : 18
    <8e4>   DW_AT_decl_line   : 242
    <8e5>   DW_AT_decl_column : 10
    <8e6>   DW_AT_type        : <0xf7>
    <8ea>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ed>: Abbrev Number: 9 (DW_TAG_member)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x968): signo
    <8f2>   DW_AT_decl_file   : 18
    <8f3>   DW_AT_decl_line   : 243
    <8f4>   DW_AT_decl_column : 10
    <8f5>   DW_AT_type        : <0xf7>
    <8f9>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8fc>: Abbrev Number: 9 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xfc): rval_idx
    <901>   DW_AT_decl_file   : 18
    <902>   DW_AT_decl_line   : 244
    <903>   DW_AT_decl_column : 11
    <904>   DW_AT_type        : <0x103>
    <908>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><90b>: Abbrev Number: 9 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0xd33): delay_idx
    <910>   DW_AT_decl_file   : 18
    <911>   DW_AT_decl_line   : 245
    <912>   DW_AT_decl_column : 11
    <913>   DW_AT_type        : <0x103>
    <917>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><91a>: Abbrev Number: 9 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x61f): poke_idx
    <91f>   DW_AT_decl_file   : 18
    <920>   DW_AT_decl_line   : 246
    <921>   DW_AT_decl_column : 11
    <922>   DW_AT_type        : <0x103>
    <926>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><929>: Abbrev Number: 9 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0x1a3): scno
    <92e>   DW_AT_decl_file   : 18
    <92f>   DW_AT_decl_line   : 247
    <930>   DW_AT_decl_column : 11
    <931>   DW_AT_type        : <0x103>
    <935>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 8 (DW_TAG_structure_type)
    <93a>   DW_AT_name        : (indirect string, offset: 0xdd): inject_opts
    <93e>   DW_AT_byte_size   : 16
    <93f>   DW_AT_decl_file   : 18
    <940>   DW_AT_decl_line   : 250
    <941>   DW_AT_decl_column : 8
    <942>   DW_AT_sibling     : <0x983>
 <2><946>: Abbrev Number: 9 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0xa58): first
    <94b>   DW_AT_decl_file   : 18
    <94c>   DW_AT_decl_line   : 251
    <94d>   DW_AT_decl_column : 11
    <94e>   DW_AT_type        : <0x103>
    <952>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><955>: Abbrev Number: 9 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x1172): last
    <95a>   DW_AT_decl_file   : 18
    <95b>   DW_AT_decl_line   : 252
    <95c>   DW_AT_decl_column : 11
    <95d>   DW_AT_type        : <0x103>
    <961>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><964>: Abbrev Number: 9 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x3a0): step
    <969>   DW_AT_decl_file   : 18
    <96a>   DW_AT_decl_line   : 253
    <96b>   DW_AT_decl_column : 11
    <96c>   DW_AT_type        : <0x103>
    <970>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><973>: Abbrev Number: 9 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x1144): data
    <978>   DW_AT_decl_file   : 18
    <979>   DW_AT_decl_line   : 254
    <97a>   DW_AT_decl_column : 21
    <97b>   DW_AT_type        : <0x8d1>
    <97f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><982>: Abbrev Number: 0
 <1><983>: Abbrev Number: 15 (DW_TAG_array_type)
    <984>   DW_AT_type        : <0x54a>
    <988>   DW_AT_sibling     : <0x993>
 <2><98c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <98d>   DW_AT_type        : <0x2b>
    <991>   DW_AT_upper_bound : 5
 <2><992>: Abbrev Number: 0
 <1><993>: Abbrev Number: 14 (DW_TAG_structure_type)
    <994>   DW_AT_name        : (indirect string, offset: 0xf66): staged_output_data
    <998>   DW_AT_declaration : 1
 <1><999>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <99a>   DW_AT_byte_size   : 4
    <99b>   DW_AT_type        : <0x993>
 <1><99f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a0>   DW_AT_prototyped  : 1
    <9a1>   DW_AT_sibling     : <0x9ab>
 <2><9a5>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9a6>   DW_AT_type        : <0xc6>
 <2><9aa>: Abbrev Number: 0
 <1><9ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ac>   DW_AT_byte_size   : 4
    <9ad>   DW_AT_type        : <0x99f>
 <1><9b1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b2>   DW_AT_byte_size   : 4
    <9b3>   DW_AT_type        : <0x865>
 <1><9b7>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b8>   DW_AT_type        : <0x9b1>
 <1><9bc>: Abbrev Number: 15 (DW_TAG_array_type)
    <9bd>   DW_AT_type        : <0x9cc>
    <9c1>   DW_AT_sibling     : <0x9cc>
 <2><9c5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9c6>   DW_AT_type        : <0x2b>
    <9ca>   DW_AT_upper_bound : 2
 <2><9cb>: Abbrev Number: 0
 <1><9cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_type        : <0x939>
 <1><9d2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xa9): mmap_cache_t
    <9d7>   DW_AT_declaration : 1
 <1><9d8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d9>   DW_AT_byte_size   : 4
    <9da>   DW_AT_type        : <0x9d2>
 <1><9de>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9df>   DW_AT_name        : (indirect string, offset: 0x3bb): tcb_wait_data
    <9e3>   DW_AT_declaration : 1
 <1><9e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e5>   DW_AT_byte_size   : 4
    <9e6>   DW_AT_type        : <0x9de>
 <1><9ea>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x160): vcpu_info
    <9ef>   DW_AT_declaration : 1
 <1><9f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f1>   DW_AT_byte_size   : 4
    <9f2>   DW_AT_type        : <0x9ea>
 <1><9f6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f7>   DW_AT_name        : (indirect string, offset: 0xf4a): unwind_queue_t
    <9fb>   DW_AT_declaration : 1
 <1><9fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x9f6>
 <1><a02>: Abbrev Number: 15 (DW_TAG_array_type)
    <a03>   DW_AT_type        : <0xeb>
    <a07>   DW_AT_sibling     : <0xa12>
 <2><a0b>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a0c>   DW_AT_type        : <0x2b>
    <a10>   DW_AT_upper_bound : 15
 <2><a11>: Abbrev Number: 0
 <1><a12>: Abbrev Number: 10 (DW_TAG_variable)
    <a13>   DW_AT_name        : (indirect string, offset: 0xbd7): stub_sysent
    <a17>   DW_AT_decl_file   : 18
    <a18>   DW_AT_decl_line   : 403
    <a1a>   DW_AT_decl_column : 28
    <a1b>   DW_AT_type        : <0x865>
    <a1f>   DW_AT_external    : 1
    <a20>   DW_AT_declaration : 1
 <1><a21>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a22>   DW_AT_name        : (indirect string, offset: 0x1127): xlat_type
    <a26>   DW_AT_encoding    : 7	(unsigned)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_type        : <0x2b>
    <a2c>   DW_AT_decl_file   : 19
    <a2d>   DW_AT_decl_line   : 13
    <a2e>   DW_AT_decl_column : 6
    <a2f>   DW_AT_sibling     : <0xa46>
 <2><a33>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a34>   DW_AT_name        : (indirect string, offset: 0x2cb): XT_NORMAL
    <a38>   DW_AT_const_value : 0
 <2><a39>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3a>   DW_AT_name        : (indirect string, offset: 0xcae): XT_SORTED
    <a3e>   DW_AT_const_value : 1
 <2><a3f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a40>   DW_AT_name        : (indirect string, offset: 0xe2d): XT_INDEXED
    <a44>   DW_AT_const_value : 2
 <2><a45>: Abbrev Number: 0
 <1><a46>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a47>   DW_AT_name        : (indirect string, offset: 0xc03): xlat_style
    <a4b>   DW_AT_encoding    : 7	(unsigned)
    <a4c>   DW_AT_byte_size   : 4
    <a4d>   DW_AT_type        : <0x2b>
    <a51>   DW_AT_decl_file   : 19
    <a52>   DW_AT_decl_line   : 19
    <a53>   DW_AT_decl_column : 6
    <a54>   DW_AT_sibling     : <0xa83>
 <2><a58>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0xe9): XLAT_STYLE_DEFAULT
    <a5d>   DW_AT_const_value : 0
 <2><a5e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xc36): XLAT_STYLE_RAW
    <a63>   DW_AT_const_value : 1
 <2><a64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0x10f2): XLAT_STYLE_ABBREV
    <a69>   DW_AT_const_value : 2
 <2><a6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x2e8): XLAT_STYLE_VERBOSE
    <a6f>   DW_AT_const_value : 3
 <2><a70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a71>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a75>   DW_AT_const_value : 0
 <2><a76>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a77>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a7b>   DW_AT_const_value : 4
 <2><a7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x1161): XLAT_STYLE_FMT_D
    <a81>   DW_AT_const_value : 8
 <2><a82>: Abbrev Number: 0
 <1><a83>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a84>   DW_AT_name        : (indirect string, offset: 0x323): xlat_data
    <a88>   DW_AT_byte_size   : 16
    <a89>   DW_AT_decl_file   : 19
    <a8a>   DW_AT_decl_line   : 51
    <a8b>   DW_AT_decl_column : 8
    <a8c>   DW_AT_sibling     : <0xaaf>
 <2><a90>: Abbrev Number: 18 (DW_TAG_member)
    <a91>   DW_AT_name        : val
    <a95>   DW_AT_decl_file   : 19
    <a96>   DW_AT_decl_line   : 52
    <a97>   DW_AT_decl_column : 11
    <a98>   DW_AT_type        : <0x11b>
    <a9c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a9f>: Abbrev Number: 18 (DW_TAG_member)
    <aa0>   DW_AT_name        : str
    <aa4>   DW_AT_decl_file   : 19
    <aa5>   DW_AT_decl_line   : 53
    <aa6>   DW_AT_decl_column : 14
    <aa7>   DW_AT_type        : <0x1ce>
    <aab>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aae>: Abbrev Number: 0
 <1><aaf>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab0>   DW_AT_type        : <0xa83>
 <1><ab4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ab9>   DW_AT_byte_size   : 24
    <aba>   DW_AT_decl_file   : 19
    <abb>   DW_AT_decl_line   : 56
    <abc>   DW_AT_decl_column : 8
    <abd>   DW_AT_sibling     : <0xb0d>
 <2><ac1>: Abbrev Number: 9 (DW_TAG_member)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x1144): data
    <ac6>   DW_AT_decl_file   : 19
    <ac7>   DW_AT_decl_line   : 57
    <ac8>   DW_AT_decl_column : 26
    <ac9>   DW_AT_type        : <0xb12>
    <acd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad0>: Abbrev Number: 9 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x89a): flags_strsz
    <ad5>   DW_AT_decl_file   : 19
    <ad6>   DW_AT_decl_line   : 58
    <ad7>   DW_AT_decl_column : 9
    <ad8>   DW_AT_type        : <0x12e>
    <adc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><adf>: Abbrev Number: 9 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xb9c): size
    <ae4>   DW_AT_decl_file   : 19
    <ae5>   DW_AT_decl_line   : 59
    <ae6>   DW_AT_decl_column : 11
    <ae7>   DW_AT_type        : <0x10f>
    <aeb>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aee>: Abbrev Number: 9 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x1a8): type
    <af3>   DW_AT_decl_file   : 19
    <af4>   DW_AT_decl_line   : 60
    <af5>   DW_AT_decl_column : 17
    <af6>   DW_AT_type        : <0xa21>
    <afa>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><afd>: Abbrev Number: 9 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x74f): flags_mask
    <b02>   DW_AT_decl_file   : 19
    <b03>   DW_AT_decl_line   : 61
    <b04>   DW_AT_decl_column : 11
    <b05>   DW_AT_type        : <0x11b>
    <b09>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b0c>: Abbrev Number: 0
 <1><b0d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0e>   DW_AT_type        : <0xab4>
 <1><b12>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b13>   DW_AT_byte_size   : 4
    <b14>   DW_AT_type        : <0xaaf>
 <1><b18>: Abbrev Number: 15 (DW_TAG_array_type)
    <b19>   DW_AT_type        : <0xb0d>
    <b1d>   DW_AT_sibling     : <0xb23>
 <2><b21>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b22>: Abbrev Number: 0
 <1><b23>: Abbrev Number: 3 (DW_TAG_const_type)
    <b24>   DW_AT_type        : <0xb18>
 <1><b28>: Abbrev Number: 10 (DW_TAG_variable)
    <b29>   DW_AT_name        : (indirect string, offset: 0xe9b): addrfams
    <b2d>   DW_AT_decl_file   : 18
    <b2e>   DW_AT_decl_line   : 409
    <b30>   DW_AT_decl_column : 26
    <b31>   DW_AT_type        : <0xb23>
    <b35>   DW_AT_external    : 1
    <b36>   DW_AT_declaration : 1
 <1><b37>: Abbrev Number: 10 (DW_TAG_variable)
    <b38>   DW_AT_name        : (indirect string, offset: 0xd6e): arp_hardware_types
    <b3c>   DW_AT_decl_file   : 18
    <b3d>   DW_AT_decl_line   : 410
    <b3f>   DW_AT_decl_column : 26
    <b40>   DW_AT_type        : <0xb23>
    <b44>   DW_AT_external    : 1
    <b45>   DW_AT_declaration : 1
 <1><b46>: Abbrev Number: 10 (DW_TAG_variable)
    <b47>   DW_AT_name        : (indirect string, offset: 0x1067): at_flags
    <b4b>   DW_AT_decl_file   : 18
    <b4c>   DW_AT_decl_line   : 411
    <b4e>   DW_AT_decl_column : 26
    <b4f>   DW_AT_type        : <0xb23>
    <b53>   DW_AT_external    : 1
    <b54>   DW_AT_declaration : 1
 <1><b55>: Abbrev Number: 10 (DW_TAG_variable)
    <b56>   DW_AT_name        : (indirect string, offset: 0x4bb): clocknames
    <b5a>   DW_AT_decl_file   : 18
    <b5b>   DW_AT_decl_line   : 412
    <b5d>   DW_AT_decl_column : 26
    <b5e>   DW_AT_type        : <0xb23>
    <b62>   DW_AT_external    : 1
    <b63>   DW_AT_declaration : 1
 <1><b64>: Abbrev Number: 10 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0x1028): dirent_types
    <b69>   DW_AT_decl_file   : 18
    <b6a>   DW_AT_decl_line   : 413
    <b6c>   DW_AT_decl_column : 26
    <b6d>   DW_AT_type        : <0xb23>
    <b71>   DW_AT_external    : 1
    <b72>   DW_AT_declaration : 1
 <1><b73>: Abbrev Number: 10 (DW_TAG_variable)
    <b74>   DW_AT_name        : (indirect string, offset: 0x8eb): ethernet_protocols
    <b78>   DW_AT_decl_file   : 18
    <b79>   DW_AT_decl_line   : 414
    <b7b>   DW_AT_decl_column : 26
    <b7c>   DW_AT_type        : <0xb23>
    <b80>   DW_AT_external    : 1
    <b81>   DW_AT_declaration : 1
 <1><b82>: Abbrev Number: 10 (DW_TAG_variable)
    <b83>   DW_AT_name        : (indirect string, offset: 0x672): inet_protocols
    <b87>   DW_AT_decl_file   : 18
    <b88>   DW_AT_decl_line   : 415
    <b8a>   DW_AT_decl_column : 26
    <b8b>   DW_AT_type        : <0xb23>
    <b8f>   DW_AT_external    : 1
    <b90>   DW_AT_declaration : 1
 <1><b91>: Abbrev Number: 10 (DW_TAG_variable)
    <b92>   DW_AT_name        : (indirect string, offset: 0x2b8): evdev_abs
    <b96>   DW_AT_decl_file   : 18
    <b97>   DW_AT_decl_line   : 416
    <b99>   DW_AT_decl_column : 26
    <b9a>   DW_AT_type        : <0xb23>
    <b9e>   DW_AT_external    : 1
    <b9f>   DW_AT_declaration : 1
 <1><ba0>: Abbrev Number: 10 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x744): audit_arch
    <ba5>   DW_AT_decl_file   : 18
    <ba6>   DW_AT_decl_line   : 417
    <ba8>   DW_AT_decl_column : 26
    <ba9>   DW_AT_type        : <0xb23>
    <bad>   DW_AT_external    : 1
    <bae>   DW_AT_declaration : 1
 <1><baf>: Abbrev Number: 10 (DW_TAG_variable)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x95): evdev_ev
    <bb4>   DW_AT_decl_file   : 18
    <bb5>   DW_AT_decl_line   : 418
    <bb7>   DW_AT_decl_column : 26
    <bb8>   DW_AT_type        : <0xb23>
    <bbc>   DW_AT_external    : 1
    <bbd>   DW_AT_declaration : 1
 <1><bbe>: Abbrev Number: 10 (DW_TAG_variable)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x486): iffflags
    <bc3>   DW_AT_decl_file   : 18
    <bc4>   DW_AT_decl_line   : 419
    <bc6>   DW_AT_decl_column : 26
    <bc7>   DW_AT_type        : <0xb23>
    <bcb>   DW_AT_external    : 1
    <bcc>   DW_AT_declaration : 1
 <1><bcd>: Abbrev Number: 10 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0xc45): ip_type_of_services
    <bd2>   DW_AT_decl_file   : 18
    <bd3>   DW_AT_decl_line   : 420
    <bd5>   DW_AT_decl_column : 26
    <bd6>   DW_AT_type        : <0xb23>
    <bda>   DW_AT_external    : 1
    <bdb>   DW_AT_declaration : 1
 <1><bdc>: Abbrev Number: 10 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x6cd): ipc_private
    <be1>   DW_AT_decl_file   : 18
    <be2>   DW_AT_decl_line   : 421
    <be4>   DW_AT_decl_column : 26
    <be5>   DW_AT_type        : <0xb23>
    <be9>   DW_AT_external    : 1
    <bea>   DW_AT_declaration : 1
 <1><beb>: Abbrev Number: 10 (DW_TAG_variable)
    <bec>   DW_AT_name        : (indirect string, offset: 0x319): msg_flags
    <bf0>   DW_AT_decl_file   : 18
    <bf1>   DW_AT_decl_line   : 422
    <bf3>   DW_AT_decl_column : 26
    <bf4>   DW_AT_type        : <0xb23>
    <bf8>   DW_AT_external    : 1
    <bf9>   DW_AT_declaration : 1
 <1><bfa>: Abbrev Number: 10 (DW_TAG_variable)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x105): netlink_protocols
    <bff>   DW_AT_decl_file   : 18
    <c00>   DW_AT_decl_line   : 423
    <c02>   DW_AT_decl_column : 26
    <c03>   DW_AT_type        : <0xb23>
    <c07>   DW_AT_external    : 1
    <c08>   DW_AT_declaration : 1
 <1><c09>: Abbrev Number: 10 (DW_TAG_variable)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xf79): nl_bridge_vlan_flags
    <c0e>   DW_AT_decl_file   : 18
    <c0f>   DW_AT_decl_line   : 424
    <c11>   DW_AT_decl_column : 26
    <c12>   DW_AT_type        : <0xb23>
    <c16>   DW_AT_external    : 1
    <c17>   DW_AT_declaration : 1
 <1><c18>: Abbrev Number: 10 (DW_TAG_variable)
    <c19>   DW_AT_name        : (indirect string, offset: 0xe16): nl_netfilter_msg_types
    <c1d>   DW_AT_decl_file   : 18
    <c1e>   DW_AT_decl_line   : 425
    <c20>   DW_AT_decl_column : 26
    <c21>   DW_AT_type        : <0xb23>
    <c25>   DW_AT_external    : 1
    <c26>   DW_AT_declaration : 1
 <1><c27>: Abbrev Number: 10 (DW_TAG_variable)
    <c28>   DW_AT_name        : (indirect string, offset: 0x468): nl_route_types
    <c2c>   DW_AT_decl_file   : 18
    <c2d>   DW_AT_decl_line   : 426
    <c2f>   DW_AT_decl_column : 26
    <c30>   DW_AT_type        : <0xb23>
    <c34>   DW_AT_external    : 1
    <c35>   DW_AT_declaration : 1
 <1><c36>: Abbrev Number: 10 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0xed2): open_access_modes
    <c3b>   DW_AT_decl_file   : 18
    <c3c>   DW_AT_decl_line   : 427
    <c3e>   DW_AT_decl_column : 26
    <c3f>   DW_AT_type        : <0xb23>
    <c43>   DW_AT_external    : 1
    <c44>   DW_AT_declaration : 1
 <1><c45>: Abbrev Number: 10 (DW_TAG_variable)
    <c46>   DW_AT_name        : (indirect string, offset: 0x85): open_mode_flags
    <c4a>   DW_AT_decl_file   : 18
    <c4b>   DW_AT_decl_line   : 428
    <c4d>   DW_AT_decl_column : 26
    <c4e>   DW_AT_type        : <0xb23>
    <c52>   DW_AT_external    : 1
    <c53>   DW_AT_declaration : 1
 <1><c54>: Abbrev Number: 10 (DW_TAG_variable)
    <c55>   DW_AT_name        : (indirect string, offset: 0xc7e): perf_type_id
    <c59>   DW_AT_decl_file   : 18
    <c5a>   DW_AT_decl_line   : 429
    <c5c>   DW_AT_decl_column : 26
    <c5d>   DW_AT_type        : <0xb23>
    <c61>   DW_AT_external    : 1
    <c62>   DW_AT_declaration : 1
 <1><c63>: Abbrev Number: 10 (DW_TAG_variable)
    <c64>   DW_AT_name        : (indirect string, offset: 0xea4): pollflags
    <c68>   DW_AT_decl_file   : 18
    <c69>   DW_AT_decl_line   : 430
    <c6b>   DW_AT_decl_column : 26
    <c6c>   DW_AT_type        : <0xb23>
    <c70>   DW_AT_external    : 1
    <c71>   DW_AT_declaration : 1
 <1><c72>: Abbrev Number: 10 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0x613): ptrace_cmds
    <c77>   DW_AT_decl_file   : 18
    <c78>   DW_AT_decl_line   : 431
    <c7a>   DW_AT_decl_column : 26
    <c7b>   DW_AT_type        : <0xb23>
    <c7f>   DW_AT_external    : 1
    <c80>   DW_AT_declaration : 1
 <1><c81>: Abbrev Number: 10 (DW_TAG_variable)
    <c82>   DW_AT_name        : (indirect string, offset: 0x82d): resource_flags
    <c86>   DW_AT_decl_file   : 18
    <c87>   DW_AT_decl_line   : 432
    <c89>   DW_AT_decl_column : 26
    <c8a>   DW_AT_type        : <0xb23>
    <c8e>   DW_AT_external    : 1
    <c8f>   DW_AT_declaration : 1
 <1><c90>: Abbrev Number: 10 (DW_TAG_variable)
    <c91>   DW_AT_name        : (indirect string, offset: 0x28e): route_nexthop_flags
    <c95>   DW_AT_decl_file   : 18
    <c96>   DW_AT_decl_line   : 433
    <c98>   DW_AT_decl_column : 26
    <c99>   DW_AT_type        : <0xb23>
    <c9d>   DW_AT_external    : 1
    <c9e>   DW_AT_declaration : 1
 <1><c9f>: Abbrev Number: 10 (DW_TAG_variable)
    <ca0>   DW_AT_name        : (indirect string, offset: 0xf04): routing_protocols
    <ca4>   DW_AT_decl_file   : 18
    <ca5>   DW_AT_decl_line   : 434
    <ca7>   DW_AT_decl_column : 26
    <ca8>   DW_AT_type        : <0xb23>
    <cac>   DW_AT_external    : 1
    <cad>   DW_AT_declaration : 1
 <1><cae>: Abbrev Number: 10 (DW_TAG_variable)
    <caf>   DW_AT_name        : (indirect string, offset: 0x477): routing_scopes
    <cb3>   DW_AT_decl_file   : 18
    <cb4>   DW_AT_decl_line   : 435
    <cb6>   DW_AT_decl_column : 26
    <cb7>   DW_AT_type        : <0xb23>
    <cbb>   DW_AT_external    : 1
    <cbc>   DW_AT_declaration : 1
 <1><cbd>: Abbrev Number: 10 (DW_TAG_variable)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xdf8): routing_table_ids
    <cc2>   DW_AT_decl_file   : 18
    <cc3>   DW_AT_decl_line   : 436
    <cc5>   DW_AT_decl_column : 26
    <cc6>   DW_AT_type        : <0xb23>
    <cca>   DW_AT_external    : 1
    <ccb>   DW_AT_declaration : 1
 <1><ccc>: Abbrev Number: 10 (DW_TAG_variable)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x6aa): routing_types
    <cd1>   DW_AT_decl_file   : 18
    <cd2>   DW_AT_decl_line   : 437
    <cd4>   DW_AT_decl_column : 26
    <cd5>   DW_AT_type        : <0xb23>
    <cd9>   DW_AT_external    : 1
    <cda>   DW_AT_declaration : 1
 <1><cdb>: Abbrev Number: 10 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x1cc): rwf_flags
    <ce0>   DW_AT_decl_file   : 18
    <ce1>   DW_AT_decl_line   : 438
    <ce3>   DW_AT_decl_column : 26
    <ce4>   DW_AT_type        : <0xb23>
    <ce8>   DW_AT_external    : 1
    <ce9>   DW_AT_declaration : 1
 <1><cea>: Abbrev Number: 10 (DW_TAG_variable)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x865): seccomp_filter_flags
    <cef>   DW_AT_decl_file   : 18
    <cf0>   DW_AT_decl_line   : 439
    <cf2>   DW_AT_decl_column : 26
    <cf3>   DW_AT_type        : <0xb23>
    <cf7>   DW_AT_external    : 1
    <cf8>   DW_AT_declaration : 1
 <1><cf9>: Abbrev Number: 10 (DW_TAG_variable)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x2d5): seccomp_ret_action
    <cfe>   DW_AT_decl_file   : 18
    <cff>   DW_AT_decl_line   : 440
    <d01>   DW_AT_decl_column : 26
    <d02>   DW_AT_type        : <0xb23>
    <d06>   DW_AT_external    : 1
    <d07>   DW_AT_declaration : 1
 <1><d08>: Abbrev Number: 10 (DW_TAG_variable)
    <d09>   DW_AT_name        : (indirect string, offset: 0x43d): setns_types
    <d0d>   DW_AT_decl_file   : 18
    <d0e>   DW_AT_decl_line   : 441
    <d10>   DW_AT_decl_column : 26
    <d11>   DW_AT_type        : <0xb23>
    <d15>   DW_AT_external    : 1
    <d16>   DW_AT_declaration : 1
 <1><d17>: Abbrev Number: 10 (DW_TAG_variable)
    <d18>   DW_AT_name        : (indirect string, offset: 0xe90): sg_io_info
    <d1c>   DW_AT_decl_file   : 18
    <d1d>   DW_AT_decl_line   : 442
    <d1f>   DW_AT_decl_column : 26
    <d20>   DW_AT_type        : <0xb23>
    <d24>   DW_AT_external    : 1
    <d25>   DW_AT_declaration : 1
 <1><d26>: Abbrev Number: 10 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0xbeb): socketlayers
    <d2b>   DW_AT_decl_file   : 18
    <d2c>   DW_AT_decl_line   : 443
    <d2e>   DW_AT_decl_column : 26
    <d2f>   DW_AT_type        : <0xb23>
    <d33>   DW_AT_external    : 1
    <d34>   DW_AT_declaration : 1
 <1><d35>: Abbrev Number: 10 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0xde2): socktypes
    <d3a>   DW_AT_decl_file   : 18
    <d3b>   DW_AT_decl_line   : 444
    <d3d>   DW_AT_decl_column : 26
    <d3e>   DW_AT_type        : <0xb23>
    <d42>   DW_AT_external    : 1
    <d43>   DW_AT_declaration : 1
 <1><d44>: Abbrev Number: 10 (DW_TAG_variable)
    <d45>   DW_AT_name        : (indirect string, offset: 0xa95): tcp_state_flags
    <d49>   DW_AT_decl_file   : 18
    <d4a>   DW_AT_decl_line   : 445
    <d4c>   DW_AT_decl_column : 26
    <d4d>   DW_AT_type        : <0xb23>
    <d51>   DW_AT_external    : 1
    <d52>   DW_AT_declaration : 1
 <1><d53>: Abbrev Number: 10 (DW_TAG_variable)
    <d54>   DW_AT_name        : (indirect string, offset: 0x779): tcp_states
    <d58>   DW_AT_decl_file   : 18
    <d59>   DW_AT_decl_line   : 446
    <d5b>   DW_AT_decl_column : 26
    <d5c>   DW_AT_type        : <0xb23>
    <d60>   DW_AT_external    : 1
    <d61>   DW_AT_declaration : 1
 <1><d62>: Abbrev Number: 10 (DW_TAG_variable)
    <d63>   DW_AT_name        : (indirect string, offset: 0x10d5): whence_codes
    <d67>   DW_AT_decl_file   : 18
    <d68>   DW_AT_decl_line   : 447
    <d6a>   DW_AT_decl_column : 26
    <d6b>   DW_AT_type        : <0xb23>
    <d6f>   DW_AT_external    : 1
    <d70>   DW_AT_declaration : 1
 <1><d71>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d72>   DW_AT_encoding    : 7	(unsigned)
    <d73>   DW_AT_byte_size   : 4
    <d74>   DW_AT_type        : <0x2b>
    <d78>   DW_AT_decl_file   : 18
    <d79>   DW_AT_decl_line   : 508
    <d7b>   DW_AT_decl_column : 14
    <d7c>   DW_AT_sibling     : <0xd93>
 <2><d80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d81>   DW_AT_name        : (indirect string, offset: 0x9d2): CFLAG_NONE
    <d85>   DW_AT_const_value : 0
 <2><d86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d87>   DW_AT_name        : (indirect string, offset: 0x8fe): CFLAG_ONLY_STATS
    <d8b>   DW_AT_const_value : 1
 <2><d8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xbf8): CFLAG_BOTH
    <d91>   DW_AT_const_value : 2
 <2><d92>: Abbrev Number: 0
 <1><d93>: Abbrev Number: 28 (DW_TAG_typedef)
    <d94>   DW_AT_name        : (indirect string, offset: 0x1177): cflag_t
    <d98>   DW_AT_decl_file   : 18
    <d99>   DW_AT_decl_line   : 512
    <d9b>   DW_AT_decl_column : 3
    <d9c>   DW_AT_type        : <0xd71>
 <1><da0>: Abbrev Number: 10 (DW_TAG_variable)
    <da1>   DW_AT_name        : (indirect string, offset: 0xd2d): cflag
    <da5>   DW_AT_decl_file   : 18
    <da6>   DW_AT_decl_line   : 513
    <da8>   DW_AT_decl_column : 16
    <da9>   DW_AT_type        : <0xd93>
    <dad>   DW_AT_external    : 1
    <dae>   DW_AT_declaration : 1
 <1><daf>: Abbrev Number: 10 (DW_TAG_variable)
    <db0>   DW_AT_name        : (indirect string, offset: 0x180): Tflag
    <db4>   DW_AT_decl_file   : 18
    <db5>   DW_AT_decl_line   : 514
    <db7>   DW_AT_decl_column : 13
    <db8>   DW_AT_type        : <0x51a>
    <dbc>   DW_AT_external    : 1
    <dbd>   DW_AT_declaration : 1
 <1><dbe>: Abbrev Number: 10 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x7cf): Tflag_scale
    <dc3>   DW_AT_decl_file   : 18
    <dc4>   DW_AT_decl_line   : 515
    <dc6>   DW_AT_decl_column : 12
    <dc7>   DW_AT_type        : <0x64>
    <dcb>   DW_AT_external    : 1
    <dcc>   DW_AT_declaration : 1
 <1><dcd>: Abbrev Number: 10 (DW_TAG_variable)
    <dce>   DW_AT_name        : (indirect string, offset: 0x87a): Tflag_width
    <dd2>   DW_AT_decl_file   : 18
    <dd3>   DW_AT_decl_line   : 516
    <dd5>   DW_AT_decl_column : 12
    <dd6>   DW_AT_type        : <0x64>
    <dda>   DW_AT_external    : 1
    <ddb>   DW_AT_declaration : 1
 <1><ddc>: Abbrev Number: 10 (DW_TAG_variable)
    <ddd>   DW_AT_name        : (indirect string, offset: 0xe82): iflag
    <de1>   DW_AT_decl_file   : 18
    <de2>   DW_AT_decl_line   : 517
    <de4>   DW_AT_decl_column : 13
    <de5>   DW_AT_type        : <0x51a>
    <de9>   DW_AT_external    : 1
    <dea>   DW_AT_declaration : 1
 <1><deb>: Abbrev Number: 10 (DW_TAG_variable)
    <dec>   DW_AT_name        : (indirect string, offset: 0x653): count_wallclock
    <df0>   DW_AT_decl_file   : 18
    <df1>   DW_AT_decl_line   : 518
    <df3>   DW_AT_decl_column : 13
    <df4>   DW_AT_type        : <0x51a>
    <df8>   DW_AT_external    : 1
    <df9>   DW_AT_declaration : 1
 <1><dfa>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x4a): path_set_item
    <dff>   DW_AT_byte_size   : 4
    <e00>   DW_AT_decl_file   : 18
    <e01>   DW_AT_decl_line   : 520
    <e03>   DW_AT_decl_column : 8
    <e04>   DW_AT_sibling     : <0xe19>
 <2><e08>: Abbrev Number: 22 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0xc3): path
    <e0d>   DW_AT_decl_file   : 18
    <e0e>   DW_AT_decl_line   : 521
    <e10>   DW_AT_decl_column : 14
    <e11>   DW_AT_type        : <0x1ce>
    <e15>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e18>: Abbrev Number: 0
 <1><e19>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x784): path_set
    <e1e>   DW_AT_byte_size   : 12
    <e1f>   DW_AT_decl_file   : 18
    <e20>   DW_AT_decl_line   : 525
    <e22>   DW_AT_decl_column : 15
    <e23>   DW_AT_sibling     : <0xe58>
 <2><e27>: Abbrev Number: 22 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x712): paths_selected
    <e2c>   DW_AT_decl_file   : 18
    <e2d>   DW_AT_decl_line   : 526
    <e2f>   DW_AT_decl_column : 24
    <e30>   DW_AT_type        : <0xe58>
    <e34>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e37>: Abbrev Number: 22 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x10c8): num_selected
    <e3c>   DW_AT_decl_file   : 18
    <e3d>   DW_AT_decl_line   : 527
    <e3f>   DW_AT_decl_column : 9
    <e40>   DW_AT_type        : <0x12e>
    <e44>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e47>: Abbrev Number: 22 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0xb9c): size
    <e4c>   DW_AT_decl_file   : 18
    <e4d>   DW_AT_decl_line   : 528
    <e4f>   DW_AT_decl_column : 9
    <e50>   DW_AT_type        : <0x12e>
    <e54>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e57>: Abbrev Number: 0
 <1><e58>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e59>   DW_AT_byte_size   : 4
    <e5a>   DW_AT_type        : <0xdfa>
 <1><e5e>: Abbrev Number: 10 (DW_TAG_variable)
    <e5f>   DW_AT_name        : (indirect string, offset: 0x1117): global_path_set
    <e63>   DW_AT_decl_file   : 18
    <e64>   DW_AT_decl_line   : 529
    <e66>   DW_AT_decl_column : 3
    <e67>   DW_AT_type        : <0xe19>
    <e6b>   DW_AT_external    : 1
    <e6c>   DW_AT_declaration : 1
 <1><e6d>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x1003): xflag_opts
    <e72>   DW_AT_encoding    : 7	(unsigned)
    <e73>   DW_AT_byte_size   : 4
    <e74>   DW_AT_type        : <0x2b>
    <e78>   DW_AT_decl_file   : 18
    <e79>   DW_AT_decl_line   : 531
    <e7b>   DW_AT_decl_column : 6
    <e7c>   DW_AT_sibling     : <0xe9f>
 <2><e80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e81>   DW_AT_name        : (indirect string, offset: 0xa4c): HEXSTR_NONE
    <e85>   DW_AT_const_value : 0
 <2><e86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e87>   DW_AT_name        : (indirect string, offset: 0x1049): HEXSTR_NON_ASCII
    <e8b>   DW_AT_const_value : 1
 <2><e8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x953): HEXSTR_ALL
    <e91>   DW_AT_const_value : 2
 <2><e92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e93>   DW_AT_name        : (indirect string, offset: 0x693): HEXSTR_NON_ASCII_CHARS
    <e97>   DW_AT_const_value : 3
 <2><e98>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e99>   DW_AT_name        : (indirect string, offset: 0x10e2): NUM_HEXSTR_OPTS
    <e9d>   DW_AT_const_value : 4
 <2><e9e>: Abbrev Number: 0
 <1><e9f>: Abbrev Number: 10 (DW_TAG_variable)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xe5c): xflag
    <ea4>   DW_AT_decl_file   : 18
    <ea5>   DW_AT_decl_line   : 544
    <ea7>   DW_AT_decl_column : 17
    <ea8>   DW_AT_type        : <0x2b>
    <eac>   DW_AT_external    : 1
    <ead>   DW_AT_declaration : 1
 <1><eae>: Abbrev Number: 10 (DW_TAG_variable)
    <eaf>   DW_AT_name        : (indirect string, offset: 0xce8): followfork
    <eb3>   DW_AT_decl_file   : 18
    <eb4>   DW_AT_decl_line   : 545
    <eb6>   DW_AT_decl_column : 13
    <eb7>   DW_AT_type        : <0x51a>
    <ebb>   DW_AT_external    : 1
    <ebc>   DW_AT_declaration : 1
 <1><ebd>: Abbrev Number: 10 (DW_TAG_variable)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x32d): output_separately
    <ec2>   DW_AT_decl_file   : 18
    <ec3>   DW_AT_decl_line   : 546
    <ec5>   DW_AT_decl_column : 13
    <ec6>   DW_AT_type        : <0x51a>
    <eca>   DW_AT_external    : 1
    <ecb>   DW_AT_declaration : 1
 <1><ecc>: Abbrev Number: 10 (DW_TAG_variable)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x233): stack_trace_enabled
    <ed1>   DW_AT_decl_file   : 18
    <ed2>   DW_AT_decl_line   : 549
    <ed4>   DW_AT_decl_column : 13
    <ed5>   DW_AT_type        : <0x51a>
    <ed9>   DW_AT_external    : 1
    <eda>   DW_AT_declaration : 1
 <1><edb>: Abbrev Number: 10 (DW_TAG_variable)
    <edc>   DW_AT_name        : (indirect string, offset: 0x681): ptrace_setoptions
    <ee0>   DW_AT_decl_file   : 18
    <ee1>   DW_AT_decl_line   : 553
    <ee3>   DW_AT_decl_column : 17
    <ee4>   DW_AT_type        : <0x2b>
    <ee8>   DW_AT_external    : 1
    <ee9>   DW_AT_declaration : 1
 <1><eea>: Abbrev Number: 10 (DW_TAG_variable)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xa41): max_strlen
    <eef>   DW_AT_decl_file   : 18
    <ef0>   DW_AT_decl_line   : 554
    <ef2>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0x2b>
    <ef7>   DW_AT_external    : 1
    <ef8>   DW_AT_declaration : 1
 <1><ef9>: Abbrev Number: 10 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0xa6f): os_release
    <efe>   DW_AT_decl_file   : 18
    <eff>   DW_AT_decl_line   : 555
    <f01>   DW_AT_decl_column : 17
    <f02>   DW_AT_type        : <0x2b>
    <f06>   DW_AT_external    : 1
    <f07>   DW_AT_declaration : 1
 <1><f08>: Abbrev Number: 10 (DW_TAG_variable)
    <f09>   DW_AT_name        : (indirect string, offset: 0x721): xlat_verbosity
    <f0d>   DW_AT_decl_file   : 18
    <f0e>   DW_AT_decl_line   : 917
    <f10>   DW_AT_decl_column : 24
    <f11>   DW_AT_type        : <0xa46>
    <f15>   DW_AT_external    : 1
    <f16>   DW_AT_declaration : 1
 <1><f17>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f18>   DW_AT_name        : (indirect string, offset: 0x636): xlat_style_private_flag_bits
    <f1c>   DW_AT_encoding    : 7	(unsigned)
    <f1d>   DW_AT_byte_size   : 4
    <f1e>   DW_AT_type        : <0x2b>
    <f22>   DW_AT_decl_file   : 18
    <f23>   DW_AT_decl_line   : 937
    <f25>   DW_AT_decl_column : 6
    <f26>   DW_AT_sibling     : <0xf43>
 <2><f2a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x2a2): PAF_PRINT_INDICES_BIT
    <f2f>   DW_AT_const_value : 5
 <2><f30>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0xb53): PAF_ARRAY_TRUNCATED_BIT
    <f35>   DW_AT_const_value : 6
 <2><f36>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x3fd): PXF_DEFAULT_STR_BIT
    <f3b>   DW_AT_const_value : 7
 <2><f3c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0xcca): SPFF_AUXSTR_MODE_BIT
    <f41>   DW_AT_const_value : 8
 <2><f42>: Abbrev Number: 0
 <1><f43>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f44>   DW_AT_name        : (indirect string, offset: 0xd81): find_xlat_flag_bits
    <f48>   DW_AT_encoding    : 7	(unsigned)
    <f49>   DW_AT_byte_size   : 4
    <f4a>   DW_AT_type        : <0x2b>
    <f4e>   DW_AT_decl_file   : 18
    <f4f>   DW_AT_decl_line   : 1441
    <f51>   DW_AT_decl_column : 6
    <f52>   DW_AT_sibling     : <0xf5d>
 <2><f56>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0x990): FXL_CASE_SENSITIVE_BIT
    <f5b>   DW_AT_const_value : 0
 <2><f5c>: Abbrev Number: 0
 <1><f5d>: Abbrev Number: 10 (DW_TAG_variable)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xa1d): printing_tcp
    <f62>   DW_AT_decl_file   : 18
    <f63>   DW_AT_decl_line   : 1687
    <f65>   DW_AT_decl_column : 20
    <f66>   DW_AT_type        : <0x5f6>
    <f6a>   DW_AT_external    : 1
    <f6b>   DW_AT_declaration : 1
 <1><f6c>: Abbrev Number: 10 (DW_TAG_variable)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x5ea): errnoent
    <f71>   DW_AT_decl_file   : 18
    <f72>   DW_AT_decl_line   : 1885
    <f74>   DW_AT_decl_column : 26
    <f75>   DW_AT_type        : <0x44e>
    <f79>   DW_AT_external    : 1
    <f7a>   DW_AT_declaration : 1
 <1><f7b>: Abbrev Number: 10 (DW_TAG_variable)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x886): signalent
    <f80>   DW_AT_decl_file   : 18
    <f81>   DW_AT_decl_line   : 1886
    <f83>   DW_AT_decl_column : 26
    <f84>   DW_AT_type        : <0x44e>
    <f88>   DW_AT_external    : 1
    <f89>   DW_AT_declaration : 1
 <1><f8a>: Abbrev Number: 10 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xeca): nerrnos
    <f8f>   DW_AT_decl_file   : 18
    <f90>   DW_AT_decl_line   : 1887
    <f92>   DW_AT_decl_column : 27
    <f93>   DW_AT_type        : <0x32>
    <f97>   DW_AT_external    : 1
    <f98>   DW_AT_declaration : 1
 <1><f99>: Abbrev Number: 10 (DW_TAG_variable)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x10b1): nsignals
    <f9e>   DW_AT_decl_file   : 18
    <f9f>   DW_AT_decl_line   : 1888
    <fa1>   DW_AT_decl_column : 27
    <fa2>   DW_AT_type        : <0x32>
    <fa6>   DW_AT_external    : 1
    <fa7>   DW_AT_declaration : 1
 <1><fa8>: Abbrev Number: 15 (DW_TAG_array_type)
    <fa9>   DW_AT_type        : <0x865>
    <fad>   DW_AT_sibling     : <0xfb3>
 <2><fb1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb2>: Abbrev Number: 0
 <1><fb3>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb4>   DW_AT_type        : <0xfa8>
 <1><fb8>: Abbrev Number: 10 (DW_TAG_variable)
    <fb9>   DW_AT_name        : (indirect string, offset: 0xd4c): sysent0
    <fbd>   DW_AT_decl_file   : 18
    <fbe>   DW_AT_decl_line   : 1890
    <fc0>   DW_AT_decl_column : 28
    <fc1>   DW_AT_type        : <0xfb3>
    <fc5>   DW_AT_external    : 1
    <fc6>   DW_AT_declaration : 1
 <1><fc7>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc8>   DW_AT_type        : <0x8cc>
    <fcc>   DW_AT_sibling     : <0xfd2>
 <2><fd0>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd1>: Abbrev Number: 0
 <1><fd2>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd3>   DW_AT_type        : <0xfc7>
 <1><fd7>: Abbrev Number: 10 (DW_TAG_variable)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x110d): ioctlent0
    <fdc>   DW_AT_decl_file   : 18
    <fdd>   DW_AT_decl_line   : 1891
    <fdf>   DW_AT_decl_column : 30
    <fe0>   DW_AT_type        : <0xfd2>
    <fe4>   DW_AT_external    : 1
    <fe5>   DW_AT_declaration : 1
 <1><fe6>: Abbrev Number: 10 (DW_TAG_variable)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x100e): personality_names
    <feb>   DW_AT_decl_file   : 18
    <fec>   DW_AT_decl_line   : 1893
    <fee>   DW_AT_decl_column : 26
    <fef>   DW_AT_type        : <0x44e>
    <ff3>   DW_AT_external    : 1
    <ff4>   DW_AT_declaration : 1
 <1><ff5>: Abbrev Number: 10 (DW_TAG_variable)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x8a6): sysent
    <ffa>   DW_AT_decl_file   : 18
    <ffb>   DW_AT_decl_line   : 1896
    <ffd>   DW_AT_decl_column : 29
    <ffe>   DW_AT_type        : <0x9b1>
    <1002>   DW_AT_external    : 1
    <1003>   DW_AT_declaration : 1
 <1><1004>: Abbrev Number: 10 (DW_TAG_variable)
    <1005>   DW_AT_name        : (indirect string, offset: 0xcdf): ioctlent
    <1009>   DW_AT_decl_file   : 18
    <100a>   DW_AT_decl_line   : 1897
    <100c>   DW_AT_decl_column : 31
    <100d>   DW_AT_type        : <0x1013>
    <1011>   DW_AT_external    : 1
    <1012>   DW_AT_declaration : 1
 <1><1013>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1014>   DW_AT_byte_size   : 4
    <1015>   DW_AT_type        : <0x8cc>
 <1><1019>: Abbrev Number: 10 (DW_TAG_variable)
    <101a>   DW_AT_name        : (indirect string, offset: 0x890): nsyscalls
    <101e>   DW_AT_decl_file   : 18
    <101f>   DW_AT_decl_line   : 1903
    <1021>   DW_AT_decl_column : 17
    <1022>   DW_AT_type        : <0x2b>
    <1026>   DW_AT_external    : 1
    <1027>   DW_AT_declaration : 1
 <1><1028>: Abbrev Number: 10 (DW_TAG_variable)
    <1029>   DW_AT_name        : (indirect string, offset: 0xee4): nioctlents
    <102d>   DW_AT_decl_file   : 18
    <102e>   DW_AT_decl_line   : 1904
    <1030>   DW_AT_decl_column : 17
    <1031>   DW_AT_type        : <0x2b>
    <1035>   DW_AT_external    : 1
    <1036>   DW_AT_declaration : 1
 <1><1037>: Abbrev Number: 15 (DW_TAG_array_type)
    <1038>   DW_AT_type        : <0x32>
    <103c>   DW_AT_sibling     : <0x1047>
 <2><1040>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1041>   DW_AT_type        : <0x2b>
    <1045>   DW_AT_upper_bound : 2
 <2><1046>: Abbrev Number: 0
 <1><1047>: Abbrev Number: 3 (DW_TAG_const_type)
    <1048>   DW_AT_type        : <0x1037>
 <1><104c>: Abbrev Number: 10 (DW_TAG_variable)
    <104d>   DW_AT_name        : (indirect string, offset: 0xf59): nsyscall_vec
    <1051>   DW_AT_decl_file   : 18
    <1052>   DW_AT_decl_line   : 1906
    <1054>   DW_AT_decl_column : 27
    <1055>   DW_AT_type        : <0x1047>
    <1059>   DW_AT_external    : 1
    <105a>   DW_AT_declaration : 1
 <1><105b>: Abbrev Number: 15 (DW_TAG_array_type)
    <105c>   DW_AT_type        : <0x9b7>
    <1060>   DW_AT_sibling     : <0x106b>
 <2><1064>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1065>   DW_AT_type        : <0x2b>
    <1069>   DW_AT_upper_bound : 2
 <2><106a>: Abbrev Number: 0
 <1><106b>: Abbrev Number: 3 (DW_TAG_const_type)
    <106c>   DW_AT_type        : <0x105b>
 <1><1070>: Abbrev Number: 10 (DW_TAG_variable)
    <1071>   DW_AT_name        : (indirect string, offset: 0x7bc): sysent_vec
    <1075>   DW_AT_decl_file   : 18
    <1076>   DW_AT_decl_line   : 1907
    <1078>   DW_AT_decl_column : 35
    <1079>   DW_AT_type        : <0x106b>
    <107d>   DW_AT_external    : 1
    <107e>   DW_AT_declaration : 1
 <1><107f>: Abbrev Number: 10 (DW_TAG_variable)
    <1080>   DW_AT_name        : (indirect string, offset: 0x386): inject_vec
    <1084>   DW_AT_decl_file   : 18
    <1085>   DW_AT_decl_line   : 1908
    <1087>   DW_AT_decl_column : 28
    <1088>   DW_AT_type        : <0x9bc>
    <108c>   DW_AT_external    : 1
    <108d>   DW_AT_declaration : 1
 <1><108e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <108f>   DW_AT_name        : (indirect string, offset: 0xdd5): audit_arch_t
    <1093>   DW_AT_byte_size   : 8
    <1094>   DW_AT_decl_file   : 18
    <1095>   DW_AT_decl_line   : 1910
    <1097>   DW_AT_decl_column : 8
    <1098>   DW_AT_sibling     : <0x10bd>
 <2><109c>: Abbrev Number: 22 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0x628): arch
    <10a1>   DW_AT_decl_file   : 18
    <10a2>   DW_AT_decl_line   : 1911
    <10a4>   DW_AT_decl_column : 15
    <10a5>   DW_AT_type        : <0x2b>
    <10a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ac>: Abbrev Number: 22 (DW_TAG_member)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xa03): flag
    <10b1>   DW_AT_decl_file   : 18
    <10b2>   DW_AT_decl_line   : 1912
    <10b4>   DW_AT_decl_column : 15
    <10b5>   DW_AT_type        : <0x2b>
    <10b9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10bc>: Abbrev Number: 0
 <1><10bd>: Abbrev Number: 3 (DW_TAG_const_type)
    <10be>   DW_AT_type        : <0x108e>
 <1><10c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <10c3>   DW_AT_type        : <0x10bd>
    <10c7>   DW_AT_sibling     : <0x10d2>
 <2><10cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10cc>   DW_AT_type        : <0x2b>
    <10d0>   DW_AT_upper_bound : 2
 <2><10d1>: Abbrev Number: 0
 <1><10d2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d3>   DW_AT_type        : <0x10c2>
 <1><10d7>: Abbrev Number: 10 (DW_TAG_variable)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x981): audit_arch_vec
    <10dc>   DW_AT_decl_file   : 18
    <10dd>   DW_AT_decl_line   : 1915
    <10df>   DW_AT_decl_column : 34
    <10e0>   DW_AT_type        : <0x10d2>
    <10e4>   DW_AT_external    : 1
    <10e5>   DW_AT_declaration : 1
 <1><10e6>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e7>   DW_AT_byte_size   : 180
    <10e8>   DW_AT_decl_file   : 20
    <10e9>   DW_AT_decl_line   : 2
    <10ea>   DW_AT_decl_column : 9
    <10eb>   DW_AT_sibling     : <0x13a0>
 <2><10ef>: Abbrev Number: 9 (DW_TAG_member)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x1e4): block_ioctl
    <10f4>   DW_AT_decl_file   : 20
    <10f5>   DW_AT_decl_line   : 3
    <10f6>   DW_AT_decl_column : 8
    <10f7>   DW_AT_type        : <0x13ba>
    <10fb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10fe>: Abbrev Number: 9 (DW_TAG_member)
    <10ff>   DW_AT_name        : (indirect string, offset: 0xaf2): btrfs_ioctl
    <1103>   DW_AT_decl_file   : 20
    <1104>   DW_AT_decl_line   : 6
    <1105>   DW_AT_decl_column : 8
    <1106>   DW_AT_type        : <0x13ba>
    <110a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><110d>: Abbrev Number: 9 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x75a): evdev_write_ioctl_mpers
    <1112>   DW_AT_decl_file   : 20
    <1113>   DW_AT_decl_line   : 9
    <1114>   DW_AT_decl_column : 8
    <1115>   DW_AT_type        : <0x13ba>
    <1119>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><111c>: Abbrev Number: 9 (DW_TAG_member)
    <111d>   DW_AT_name        : (indirect string, offset: 0x730): get_sock_fprog_size
    <1121>   DW_AT_decl_file   : 20
    <1122>   DW_AT_decl_line   : 12
    <1123>   DW_AT_decl_column : 17
    <1124>   DW_AT_type        : <0x13c6>
    <1128>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><112b>: Abbrev Number: 9 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x1b3): fetch_bpf_fprog
    <1130>   DW_AT_decl_file   : 20
    <1131>   DW_AT_decl_line   : 15
    <1132>   DW_AT_decl_column : 10
    <1133>   DW_AT_type        : <0x13e6>
    <1137>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><113a>: Abbrev Number: 9 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x96e): fetch_struct_flock
    <113f>   DW_AT_decl_file   : 20
    <1140>   DW_AT_decl_line   : 18
    <1141>   DW_AT_decl_column : 10
    <1142>   DW_AT_type        : <0x13e6>
    <1146>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1149>: Abbrev Number: 9 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0xcf3): fetch_struct_flock64
    <114e>   DW_AT_decl_file   : 20
    <114f>   DW_AT_decl_line   : 21
    <1150>   DW_AT_decl_column : 10
    <1151>   DW_AT_type        : <0x13e6>
    <1155>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><1158>: Abbrev Number: 9 (DW_TAG_member)
    <1159>   DW_AT_name        : (indirect string, offset: 0x14d): fetch_struct_iovec
