Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x170f (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x50b): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xfb9): mpers-mx32/struct_mmsghdr.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe85): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3ae): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1007): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x98c): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xddc): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x485): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x88c): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xed6): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8bc): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x78f): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb4b): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb81): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xccd): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc42): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x402): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x44e): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x5d2): __socklen_t
    <f0>   DW_AT_decl_file   : 1
    <f1>   DW_AT_decl_line   : 209
    <f2>   DW_AT_decl_column : 23
    <f3>   DW_AT_type        : <0x2b>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x35d): uint8_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 24
    <fe>   DW_AT_decl_column : 19
    <ff>   DW_AT_type        : <0x45>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xb6c): uint16_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 25
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x58>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xf7e): uint32_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 26
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x70>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xdec): uint64_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 27
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x8f>
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 4
    <129>   DW_AT_encoding    : 5	(signed)
    <12a>   DW_AT_name        : (indirect string, offset: 0x2cd): long int
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x32): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xaf4): timespec
    <144>   DW_AT_byte_size   : 16
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x10dd): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xba>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe12): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xcd>
    <167>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xab6): long double
 <1><172>: Abbrev Number: 10 (DW_TAG_typedef)
    <173>   DW_AT_name        : (indirect string, offset: 0x11): socklen_t
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 274
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xeb>
 <1><17f>: Abbrev Number: 11 (DW_TAG_variable)
    <180>   DW_AT_name        : (indirect string, offset: 0x284): __environ
    <184>   DW_AT_decl_file   : 5
    <185>   DW_AT_decl_line   : 543
    <187>   DW_AT_decl_column : 15
    <188>   DW_AT_type        : <0x18e>
    <18c>   DW_AT_external    : 1
    <18d>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18f>   DW_AT_byte_size   : 4
    <190>   DW_AT_type        : <0xd9>
 <1><194>: Abbrev Number: 11 (DW_TAG_variable)
    <195>   DW_AT_name        : (indirect string, offset: 0x3a6): environ
    <199>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 545
    <19c>   DW_AT_decl_column : 15
    <19d>   DW_AT_type        : <0x18e>
    <1a1>   DW_AT_external    : 1
    <1a2>   DW_AT_declaration : 1
 <1><1a3>: Abbrev Number: 12 (DW_TAG_variable)
    <1a4>   DW_AT_name        : (indirect string, offset: 0xff1): optarg
    <1a8>   DW_AT_decl_file   : 6
    <1a9>   DW_AT_decl_line   : 36
    <1aa>   DW_AT_decl_column : 14
    <1ab>   DW_AT_type        : <0xd9>
    <1af>   DW_AT_external    : 1
    <1b0>   DW_AT_declaration : 1
 <1><1b1>: Abbrev Number: 12 (DW_TAG_variable)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x762): optind
    <1b6>   DW_AT_decl_file   : 6
    <1b7>   DW_AT_decl_line   : 50
    <1b8>   DW_AT_decl_column : 12
    <1b9>   DW_AT_type        : <0x64>
    <1bd>   DW_AT_external    : 1
    <1be>   DW_AT_declaration : 1
 <1><1bf>: Abbrev Number: 12 (DW_TAG_variable)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xc31): opterr
    <1c4>   DW_AT_decl_file   : 6
    <1c5>   DW_AT_decl_line   : 55
    <1c6>   DW_AT_decl_column : 12
    <1c7>   DW_AT_type        : <0x64>
    <1cb>   DW_AT_external    : 1
    <1cc>   DW_AT_declaration : 1
 <1><1cd>: Abbrev Number: 12 (DW_TAG_variable)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xb31): optopt
    <1d2>   DW_AT_decl_file   : 6
    <1d3>   DW_AT_decl_line   : 59
    <1d4>   DW_AT_decl_column : 12
    <1d5>   DW_AT_type        : <0x64>
    <1d9>   DW_AT_external    : 1
    <1da>   DW_AT_declaration : 1
 <1><1db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1dc>   DW_AT_byte_size   : 4
    <1dd>   DW_AT_type        : <0xe6>
 <1><1e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e2>   DW_AT_type        : <0x1db>
 <1><1e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e7>   DW_AT_byte_size   : 4
    <1e8>   DW_AT_type        : <0x1ec>
 <1><1ec>: Abbrev Number: 13 (DW_TAG_const_type)
 <1><1ed>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x365): _IO_FILE
    <1f2>   DW_AT_byte_size   : 152
    <1f3>   DW_AT_decl_file   : 7
    <1f4>   DW_AT_decl_line   : 49
    <1f5>   DW_AT_decl_column : 8
    <1f6>   DW_AT_sibling     : <0x3ae>
 <2><1fa>: Abbrev Number: 9 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0xa08): _flags
    <1ff>   DW_AT_decl_file   : 7
    <200>   DW_AT_decl_line   : 51
    <201>   DW_AT_decl_column : 7
    <202>   DW_AT_type        : <0x64>
    <206>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><209>: Abbrev Number: 9 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x4fe): _IO_read_ptr
    <20e>   DW_AT_decl_file   : 7
    <20f>   DW_AT_decl_line   : 54
    <210>   DW_AT_decl_column : 9
    <211>   DW_AT_type        : <0xd9>
    <215>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><218>: Abbrev Number: 9 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0xf2b): _IO_read_end
    <21d>   DW_AT_decl_file   : 7
    <21e>   DW_AT_decl_line   : 55
    <21f>   DW_AT_decl_column : 9
    <220>   DW_AT_type        : <0xd9>
    <224>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><227>: Abbrev Number: 9 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x7cb): _IO_read_base
    <22c>   DW_AT_decl_file   : 7
    <22d>   DW_AT_decl_line   : 56
    <22e>   DW_AT_decl_column : 9
    <22f>   DW_AT_type        : <0xd9>
    <233>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><236>: Abbrev Number: 9 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <23b>   DW_AT_decl_file   : 7
    <23c>   DW_AT_decl_line   : 57
    <23d>   DW_AT_decl_column : 9
    <23e>   DW_AT_type        : <0xd9>
    <242>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><245>: Abbrev Number: 9 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x1049): _IO_write_ptr
    <24a>   DW_AT_decl_file   : 7
    <24b>   DW_AT_decl_line   : 58
    <24c>   DW_AT_decl_column : 9
    <24d>   DW_AT_type        : <0xd9>
    <251>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><254>: Abbrev Number: 9 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x904): _IO_write_end
    <259>   DW_AT_decl_file   : 7
    <25a>   DW_AT_decl_line   : 59
    <25b>   DW_AT_decl_column : 9
    <25c>   DW_AT_type        : <0xd9>
    <260>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><263>: Abbrev Number: 9 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x975): _IO_buf_base
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 60
    <26a>   DW_AT_decl_column : 9
    <26b>   DW_AT_type        : <0xd9>
    <26f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><272>: Abbrev Number: 9 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0xd74): _IO_buf_end
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 61
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0xd9>
    <27e>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><281>: Abbrev Number: 9 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x1d0): _IO_save_base
    <286>   DW_AT_decl_file   : 7
    <287>   DW_AT_decl_line   : 64
    <288>   DW_AT_decl_column : 9
    <289>   DW_AT_type        : <0xd9>
    <28d>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><290>: Abbrev Number: 9 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xc94): _IO_backup_base
    <295>   DW_AT_decl_file   : 7
    <296>   DW_AT_decl_line   : 65
    <297>   DW_AT_decl_column : 9
    <298>   DW_AT_type        : <0xd9>
    <29c>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29f>: Abbrev Number: 9 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0xbf): _IO_save_end
    <2a4>   DW_AT_decl_file   : 7
    <2a5>   DW_AT_decl_line   : 66
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_type        : <0xd9>
    <2ab>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ae>: Abbrev Number: 9 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x627): _markers
    <2b3>   DW_AT_decl_file   : 7
    <2b4>   DW_AT_decl_line   : 68
    <2b5>   DW_AT_decl_column : 22
    <2b6>   DW_AT_type        : <0x3c8>
    <2ba>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bd>: Abbrev Number: 9 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x213): _chain
    <2c2>   DW_AT_decl_file   : 7
    <2c3>   DW_AT_decl_line   : 70
    <2c4>   DW_AT_decl_column : 20
    <2c5>   DW_AT_type        : <0x3ce>
    <2c9>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2cc>: Abbrev Number: 9 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xfa4): _fileno
    <2d1>   DW_AT_decl_file   : 7
    <2d2>   DW_AT_decl_line   : 72
    <2d3>   DW_AT_decl_column : 7
    <2d4>   DW_AT_type        : <0x64>
    <2d8>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2db>: Abbrev Number: 9 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x7b7): _flags2
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 73
    <2e2>   DW_AT_decl_column : 7
    <2e3>   DW_AT_type        : <0x64>
    <2e7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2ea>: Abbrev Number: 9 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x838): _old_offset
    <2ef>   DW_AT_decl_file   : 7
    <2f0>   DW_AT_decl_line   : 74
    <2f1>   DW_AT_decl_column : 11
    <2f2>   DW_AT_type        : <0xa2>
    <2f6>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f9>: Abbrev Number: 9 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x241): _cur_column
    <2fe>   DW_AT_decl_file   : 7
    <2ff>   DW_AT_decl_line   : 77
    <300>   DW_AT_decl_column : 18
    <301>   DW_AT_type        : <0x24>
    <305>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><308>: Abbrev Number: 9 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0xe38): _vtable_offset
    <30d>   DW_AT_decl_file   : 7
    <30e>   DW_AT_decl_line   : 78
    <30f>   DW_AT_decl_column : 15
    <310>   DW_AT_type        : <0x3e>
    <314>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><317>: Abbrev Number: 9 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0xca4): _shortbuf
    <31c>   DW_AT_decl_file   : 7
    <31d>   DW_AT_decl_line   : 79
    <31e>   DW_AT_decl_column : 8
    <31f>   DW_AT_type        : <0x3d4>
    <323>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><326>: Abbrev Number: 9 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <32b>   DW_AT_decl_file   : 7
    <32c>   DW_AT_decl_line   : 81
    <32d>   DW_AT_decl_column : 15
    <32e>   DW_AT_type        : <0x3e4>
    <332>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><335>: Abbrev Number: 9 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x6fa): _offset
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 89
    <33c>   DW_AT_decl_column : 13
    <33d>   DW_AT_type        : <0xae>
    <341>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><344>: Abbrev Number: 9 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xa48): _codecvt
    <349>   DW_AT_decl_file   : 7
    <34a>   DW_AT_decl_line   : 91
    <34b>   DW_AT_decl_column : 23
    <34c>   DW_AT_type        : <0x3f0>
    <350>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><353>: Abbrev Number: 9 (DW_TAG_member)
    <354>   DW_AT_name        : (indirect string, offset: 0xfd5): _wide_data
    <358>   DW_AT_decl_file   : 7
    <359>   DW_AT_decl_line   : 92
    <35a>   DW_AT_decl_column : 25
    <35b>   DW_AT_type        : <0x3fc>
    <35f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><362>: Abbrev Number: 9 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x3ca): _freeres_list
    <367>   DW_AT_decl_file   : 7
    <368>   DW_AT_decl_line   : 93
    <369>   DW_AT_decl_column : 20
    <36a>   DW_AT_type        : <0x3ce>
    <36e>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><371>: Abbrev Number: 9 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0xc07): _freeres_buf
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 94
    <378>   DW_AT_decl_column : 9
    <379>   DW_AT_type        : <0xc6>
    <37d>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><380>: Abbrev Number: 9 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x9ca): __pad5
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 95
    <387>   DW_AT_decl_column : 10
    <388>   DW_AT_type        : <0x12e>
    <38c>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38f>: Abbrev Number: 9 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0xa2c): _mode
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 96
    <396>   DW_AT_decl_column : 7
    <397>   DW_AT_type        : <0x64>
    <39b>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39e>: Abbrev Number: 9 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x7e5): _unused2
    <3a3>   DW_AT_decl_file   : 7
    <3a4>   DW_AT_decl_line   : 98
    <3a5>   DW_AT_decl_column : 8
    <3a6>   DW_AT_type        : <0x402>
    <3aa>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3ad>: Abbrev Number: 0
 <1><3ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <3af>   DW_AT_name        : (indirect string, offset: 0xad6): FILE
    <3b3>   DW_AT_decl_file   : 8
    <3b4>   DW_AT_decl_line   : 7
    <3b5>   DW_AT_decl_column : 25
    <3b6>   DW_AT_type        : <0x1ed>
 <1><3ba>: Abbrev Number: 14 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x47a): _IO_lock_t
    <3bf>   DW_AT_decl_file   : 7
    <3c0>   DW_AT_decl_line   : 43
    <3c1>   DW_AT_decl_column : 14
 <1><3c2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x30f): _IO_marker
    <3c7>   DW_AT_declaration : 1
 <1><3c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c9>   DW_AT_byte_size   : 4
    <3ca>   DW_AT_type        : <0x3c2>
 <1><3ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 4
    <3d0>   DW_AT_type        : <0x1ed>
 <1><3d4>: Abbrev Number: 16 (DW_TAG_array_type)
    <3d5>   DW_AT_type        : <0xdf>
    <3d9>   DW_AT_sibling     : <0x3e4>
 <2><3dd>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <3de>   DW_AT_type        : <0x2b>
    <3e2>   DW_AT_upper_bound : 0
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e5>   DW_AT_byte_size   : 4
    <3e6>   DW_AT_type        : <0x3ba>
 <1><3ea>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x82): _IO_codecvt
    <3ef>   DW_AT_declaration : 1
 <1><3f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x3ea>
 <1><3f6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x379): _IO_wide_data
    <3fb>   DW_AT_declaration : 1
 <1><3fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fd>   DW_AT_byte_size   : 4
    <3fe>   DW_AT_type        : <0x3f6>
 <1><402>: Abbrev Number: 16 (DW_TAG_array_type)
    <403>   DW_AT_type        : <0xdf>
    <407>   DW_AT_sibling     : <0x412>
 <2><40b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <40c>   DW_AT_type        : <0x2b>
    <410>   DW_AT_upper_bound : 39
 <2><411>: Abbrev Number: 0
 <1><412>: Abbrev Number: 12 (DW_TAG_variable)
    <413>   DW_AT_name        : (indirect string, offset: 0x5de): stdin
    <417>   DW_AT_decl_file   : 9
    <418>   DW_AT_decl_line   : 137
    <419>   DW_AT_decl_column : 14
    <41a>   DW_AT_type        : <0x420>
    <41e>   DW_AT_external    : 1
    <41f>   DW_AT_declaration : 1
 <1><420>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <421>   DW_AT_byte_size   : 4
    <422>   DW_AT_type        : <0x3ae>
 <1><426>: Abbrev Number: 12 (DW_TAG_variable)
    <427>   DW_AT_name        : (indirect string, offset: 0x101a): stdout
    <42b>   DW_AT_decl_file   : 9
    <42c>   DW_AT_decl_line   : 138
    <42d>   DW_AT_decl_column : 14
    <42e>   DW_AT_type        : <0x420>
    <432>   DW_AT_external    : 1
    <433>   DW_AT_declaration : 1
 <1><434>: Abbrev Number: 12 (DW_TAG_variable)
    <435>   DW_AT_name        : (indirect string, offset: 0xdd5): stderr
    <439>   DW_AT_decl_file   : 9
    <43a>   DW_AT_decl_line   : 139
    <43b>   DW_AT_decl_column : 14
    <43c>   DW_AT_type        : <0x420>
    <440>   DW_AT_external    : 1
    <441>   DW_AT_declaration : 1
 <1><442>: Abbrev Number: 12 (DW_TAG_variable)
    <443>   DW_AT_name        : (indirect string, offset: 0x24d): sys_nerr
    <447>   DW_AT_decl_file   : 10
    <448>   DW_AT_decl_line   : 26
    <449>   DW_AT_decl_column : 12
    <44a>   DW_AT_type        : <0x64>
    <44e>   DW_AT_external    : 1
    <44f>   DW_AT_declaration : 1
 <1><450>: Abbrev Number: 16 (DW_TAG_array_type)
    <451>   DW_AT_type        : <0x1e1>
    <455>   DW_AT_sibling     : <0x45b>
 <2><459>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><45a>: Abbrev Number: 0
 <1><45b>: Abbrev Number: 3 (DW_TAG_const_type)
    <45c>   DW_AT_type        : <0x450>
 <1><460>: Abbrev Number: 12 (DW_TAG_variable)
    <461>   DW_AT_name        : (indirect string, offset: 0x5ed): sys_errlist
    <465>   DW_AT_decl_file   : 10
    <466>   DW_AT_decl_line   : 27
    <467>   DW_AT_decl_column : 26
    <468>   DW_AT_type        : <0x45b>
    <46c>   DW_AT_external    : 1
    <46d>   DW_AT_declaration : 1
 <1><46e>: Abbrev Number: 12 (DW_TAG_variable)
    <46f>   DW_AT_name        : (indirect string, offset: 0x271): _sys_nerr
    <473>   DW_AT_decl_file   : 10
    <474>   DW_AT_decl_line   : 30
    <475>   DW_AT_decl_column : 12
    <476>   DW_AT_type        : <0x64>
    <47a>   DW_AT_external    : 1
    <47b>   DW_AT_declaration : 1
 <1><47c>: Abbrev Number: 12 (DW_TAG_variable)
    <47d>   DW_AT_name        : (indirect string, offset: 0xe47): _sys_errlist
    <481>   DW_AT_decl_file   : 10
    <482>   DW_AT_decl_line   : 31
    <483>   DW_AT_decl_column : 26
    <484>   DW_AT_type        : <0x45b>
    <488>   DW_AT_external    : 1
    <489>   DW_AT_declaration : 1
 <1><48a>: Abbrev Number: 12 (DW_TAG_variable)
    <48b>   DW_AT_name        : (indirect string, offset: 0x6d3): program_invocation_name
    <48f>   DW_AT_decl_file   : 11
    <490>   DW_AT_decl_line   : 45
    <491>   DW_AT_decl_column : 14
    <492>   DW_AT_type        : <0xd9>
    <496>   DW_AT_external    : 1
    <497>   DW_AT_declaration : 1
 <1><498>: Abbrev Number: 12 (DW_TAG_variable)
    <499>   DW_AT_name        : (indirect string, offset: 0xbac): program_invocation_short_name
    <49d>   DW_AT_decl_file   : 11
    <49e>   DW_AT_decl_line   : 46
    <49f>   DW_AT_decl_column : 14
    <4a0>   DW_AT_type        : <0xd9>
    <4a4>   DW_AT_external    : 1
    <4a5>   DW_AT_declaration : 1
 <1><4a6>: Abbrev Number: 16 (DW_TAG_array_type)
    <4a7>   DW_AT_type        : <0xd9>
    <4ab>   DW_AT_sibling     : <0x4b6>
 <2><4af>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <4b0>   DW_AT_type        : <0x2b>
    <4b4>   DW_AT_upper_bound : 1
 <2><4b5>: Abbrev Number: 0
 <1><4b6>: Abbrev Number: 12 (DW_TAG_variable)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x1bd): __tzname
    <4bb>   DW_AT_decl_file   : 12
    <4bc>   DW_AT_decl_line   : 159
    <4bd>   DW_AT_decl_column : 14
    <4be>   DW_AT_type        : <0x4a6>
    <4c2>   DW_AT_external    : 1
    <4c3>   DW_AT_declaration : 1
 <1><4c4>: Abbrev Number: 12 (DW_TAG_variable)
    <4c5>   DW_AT_name        : (indirect string, offset: 0xebd): __daylight
    <4c9>   DW_AT_decl_file   : 12
    <4ca>   DW_AT_decl_line   : 160
    <4cb>   DW_AT_decl_column : 12
    <4cc>   DW_AT_type        : <0x64>
    <4d0>   DW_AT_external    : 1
    <4d1>   DW_AT_declaration : 1
 <1><4d2>: Abbrev Number: 12 (DW_TAG_variable)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x36e): __timezone
    <4d7>   DW_AT_decl_file   : 12
    <4d8>   DW_AT_decl_line   : 161
    <4d9>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0x127>
    <4de>   DW_AT_external    : 1
    <4df>   DW_AT_declaration : 1
 <1><4e0>: Abbrev Number: 12 (DW_TAG_variable)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x9c3): tzname
    <4e5>   DW_AT_decl_file   : 12
    <4e6>   DW_AT_decl_line   : 166
    <4e7>   DW_AT_decl_column : 14
    <4e8>   DW_AT_type        : <0x4a6>
    <4ec>   DW_AT_external    : 1
    <4ed>   DW_AT_declaration : 1
 <1><4ee>: Abbrev Number: 12 (DW_TAG_variable)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x1093): daylight
    <4f3>   DW_AT_decl_file   : 12
    <4f4>   DW_AT_decl_line   : 174
    <4f5>   DW_AT_decl_column : 12
    <4f6>   DW_AT_type        : <0x64>
    <4fa>   DW_AT_external    : 1
    <4fb>   DW_AT_declaration : 1
 <1><4fc>: Abbrev Number: 12 (DW_TAG_variable)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x4dd): timezone
    <501>   DW_AT_decl_file   : 12
    <502>   DW_AT_decl_line   : 175
    <503>   DW_AT_decl_column : 17
    <504>   DW_AT_type        : <0x127>
    <508>   DW_AT_external    : 1
    <509>   DW_AT_declaration : 1
 <1><50a>: Abbrev Number: 11 (DW_TAG_variable)
    <50b>   DW_AT_name        : (indirect string, offset: 0xf52): getdate_err
    <50f>   DW_AT_decl_file   : 12
    <510>   DW_AT_decl_line   : 274
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0x64>
    <517>   DW_AT_external    : 1
    <518>   DW_AT_declaration : 1
 <1><519>: Abbrev Number: 12 (DW_TAG_variable)
    <51a>   DW_AT_name        : (indirect string, offset: 0x9d6): debug_flag
    <51e>   DW_AT_decl_file   : 13
    <51f>   DW_AT_decl_line   : 20
    <520>   DW_AT_decl_column : 13
    <521>   DW_AT_type        : <0x527>
    <525>   DW_AT_external    : 1
    <526>   DW_AT_declaration : 1
 <1><527>: Abbrev Number: 2 (DW_TAG_base_type)
    <528>   DW_AT_byte_size   : 1
    <529>   DW_AT_encoding    : 2	(boolean)
    <52a>   DW_AT_name        : (indirect string, offset: 0x414): _Bool
 <1><52e>: Abbrev Number: 3 (DW_TAG_const_type)
    <52f>   DW_AT_type        : <0x527>
 <1><533>: Abbrev Number: 4 (DW_TAG_typedef)
    <534>   DW_AT_name        : (indirect string, offset: 0xa8c): __kernel_long_t
    <538>   DW_AT_decl_file   : 14
    <539>   DW_AT_decl_line   : 14
    <53a>   DW_AT_decl_column : 19
    <53b>   DW_AT_type        : <0x88>
 <1><53f>: Abbrev Number: 4 (DW_TAG_typedef)
    <540>   DW_AT_name        : (indirect string, offset: 0x42): __kernel_ulong_t
    <544>   DW_AT_decl_file   : 14
    <545>   DW_AT_decl_line   : 15
    <546>   DW_AT_decl_column : 28
    <547>   DW_AT_type        : <0x9b>
 <1><54b>: Abbrev Number: 4 (DW_TAG_typedef)
    <54c>   DW_AT_name        : (indirect string, offset: 0x3d8): kernel_long_t
    <550>   DW_AT_decl_file   : 15
    <551>   DW_AT_decl_line   : 16
    <552>   DW_AT_decl_column : 25
    <553>   DW_AT_type        : <0x533>
 <1><557>: Abbrev Number: 4 (DW_TAG_typedef)
    <558>   DW_AT_name        : (indirect string, offset: 0x8ad): kernel_ulong_t
    <55c>   DW_AT_decl_file   : 15
    <55d>   DW_AT_decl_line   : 17
    <55e>   DW_AT_decl_column : 26
    <55f>   DW_AT_type        : <0x53f>
 <1><563>: Abbrev Number: 3 (DW_TAG_const_type)
    <564>   DW_AT_type        : <0x557>
 <1><568>: Abbrev Number: 8 (DW_TAG_structure_type)
    <569>   DW_AT_name        : (indirect string, offset: 0xbca): list_item
    <56d>   DW_AT_byte_size   : 8
    <56e>   DW_AT_decl_file   : 16
    <56f>   DW_AT_decl_line   : 92
    <570>   DW_AT_decl_column : 8
    <571>   DW_AT_sibling     : <0x594>
 <2><575>: Abbrev Number: 9 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0x10d8): prev
    <57a>   DW_AT_decl_file   : 16
    <57b>   DW_AT_decl_line   : 93
    <57c>   DW_AT_decl_column : 20
    <57d>   DW_AT_type        : <0x594>
    <581>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><584>: Abbrev Number: 9 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x10ce): next
    <589>   DW_AT_decl_file   : 16
    <58a>   DW_AT_decl_line   : 94
    <58b>   DW_AT_decl_column : 20
    <58c>   DW_AT_type        : <0x594>
    <590>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><593>: Abbrev Number: 0
 <1><594>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <595>   DW_AT_byte_size   : 4
    <596>   DW_AT_type        : <0x568>
 <1><59a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59b>   DW_AT_name        : (indirect string, offset: 0x885): sysent
    <59f>   DW_AT_byte_size   : 20
    <5a0>   DW_AT_decl_file   : 17
    <5a1>   DW_AT_decl_line   : 13
    <5a2>   DW_AT_decl_column : 16
    <5a3>   DW_AT_sibling     : <0x5f3>
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x1031): nargs
    <5ac>   DW_AT_decl_file   : 17
    <5ad>   DW_AT_decl_line   : 14
    <5ae>   DW_AT_decl_column : 11
    <5af>   DW_AT_type        : <0x2b>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b6>: Abbrev Number: 9 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x982): sys_flags
    <5bb>   DW_AT_decl_file   : 17
    <5bc>   DW_AT_decl_line   : 15
    <5bd>   DW_AT_decl_column : 6
    <5be>   DW_AT_type        : <0x64>
    <5c2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c5>: Abbrev Number: 19 (DW_TAG_member)
    <5c6>   DW_AT_name        : sen
    <5ca>   DW_AT_decl_file   : 17
    <5cb>   DW_AT_decl_line   : 16
    <5cc>   DW_AT_decl_column : 6
    <5cd>   DW_AT_type        : <0x64>
    <5d1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d4>: Abbrev Number: 9 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x306): sys_func
    <5d9>   DW_AT_decl_file   : 17
    <5da>   DW_AT_decl_line   : 17
    <5db>   DW_AT_decl_column : 8
    <5dc>   DW_AT_type        : <0x860>
    <5e0>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e3>: Abbrev Number: 9 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x27b): sys_name
    <5e8>   DW_AT_decl_file   : 17
    <5e9>   DW_AT_decl_line   : 18
    <5ea>   DW_AT_decl_column : 14
    <5eb>   DW_AT_type        : <0x1db>
    <5ef>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5f4>   DW_AT_prototyped  : 1
    <5f5>   DW_AT_type        : <0x64>
    <5f9>   DW_AT_sibling     : <0x603>
 <2><5fd>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5fe>   DW_AT_type        : <0x603>
 <2><602>: Abbrev Number: 0
 <1><603>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <604>   DW_AT_byte_size   : 4
    <605>   DW_AT_type        : <0x60e>
 <1><609>: Abbrev Number: 3 (DW_TAG_const_type)
    <60a>   DW_AT_type        : <0x603>
 <1><60e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <60f>   DW_AT_name        : tcb
    <613>   DW_AT_byte_size   : 288
    <615>   DW_AT_decl_file   : 18
    <616>   DW_AT_decl_line   : 262
    <618>   DW_AT_decl_column : 8
    <619>   DW_AT_sibling     : <0x860>
 <2><61d>: Abbrev Number: 23 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x4f8): flags
    <622>   DW_AT_decl_file   : 18
    <623>   DW_AT_decl_line   : 263
    <625>   DW_AT_decl_column : 6
    <626>   DW_AT_type        : <0x64>
    <62a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><62d>: Abbrev Number: 24 (DW_TAG_member)
    <62e>   DW_AT_name        : pid
    <632>   DW_AT_decl_file   : 18
    <633>   DW_AT_decl_line   : 264
    <635>   DW_AT_decl_column : 6
    <636>   DW_AT_type        : <0x64>
    <63a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><63d>: Abbrev Number: 23 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x61): qual_flg
    <642>   DW_AT_decl_file   : 18
    <643>   DW_AT_decl_line   : 265
    <645>   DW_AT_decl_column : 6
    <646>   DW_AT_type        : <0x64>
    <64a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><64d>: Abbrev Number: 23 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x392): currpers
    <652>   DW_AT_decl_file   : 18
    <653>   DW_AT_decl_line   : 267
    <655>   DW_AT_decl_column : 15
    <656>   DW_AT_type        : <0x2b>
    <65a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><65d>: Abbrev Number: 23 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0xb29): u_error
    <662>   DW_AT_decl_file   : 18
    <663>   DW_AT_decl_line   : 269
    <665>   DW_AT_decl_column : 16
    <666>   DW_AT_type        : <0x37>
    <66a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><66d>: Abbrev Number: 23 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x19d): scno
    <672>   DW_AT_decl_file   : 18
    <673>   DW_AT_decl_line   : 270
    <675>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0x557>
    <67a>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67d>: Abbrev Number: 23 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0xb62): true_scno
    <682>   DW_AT_decl_file   : 18
    <683>   DW_AT_decl_line   : 271
    <685>   DW_AT_decl_column : 17
    <686>   DW_AT_type        : <0x557>
    <68a>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><68d>: Abbrev Number: 23 (DW_TAG_member)
    <68e>   DW_AT_name        : (indirect string, offset: 0x1a7): u_arg
    <692>   DW_AT_decl_file   : 18
    <693>   DW_AT_decl_line   : 272
    <695>   DW_AT_decl_column : 17
    <696>   DW_AT_type        : <0x990>
    <69a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><69d>: Abbrev Number: 23 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x999): u_rval
    <6a2>   DW_AT_decl_file   : 18
    <6a3>   DW_AT_decl_line   : 273
    <6a5>   DW_AT_decl_column : 16
    <6a6>   DW_AT_type        : <0x54b>
    <6aa>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6ad>: Abbrev Number: 23 (DW_TAG_member)
    <6ae>   DW_AT_name        : (indirect string, offset: 0xaa8): sys_func_rval
    <6b2>   DW_AT_decl_file   : 18
    <6b3>   DW_AT_decl_line   : 274
    <6b5>   DW_AT_decl_column : 6
    <6b6>   DW_AT_type        : <0x64>
    <6ba>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6bd>: Abbrev Number: 23 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0xcbe): curcol
    <6c2>   DW_AT_decl_file   : 18
    <6c3>   DW_AT_decl_line   : 275
    <6c5>   DW_AT_decl_column : 6
    <6c6>   DW_AT_type        : <0x64>
    <6ca>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6cd>: Abbrev Number: 23 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x9ab): outf
    <6d2>   DW_AT_decl_file   : 18
    <6d3>   DW_AT_decl_line   : 276
    <6d5>   DW_AT_decl_column : 8
    <6d6>   DW_AT_type        : <0x420>
    <6da>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6dd>: Abbrev Number: 23 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0xefc): staged_output_data
    <6e2>   DW_AT_decl_file   : 18
    <6e3>   DW_AT_decl_line   : 277
    <6e5>   DW_AT_decl_column : 29
    <6e6>   DW_AT_type        : <0x9a6>
    <6ea>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6ed>: Abbrev Number: 23 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xa73): auxstr
    <6f2>   DW_AT_decl_file   : 18
    <6f3>   DW_AT_decl_line   : 279
    <6f5>   DW_AT_decl_column : 14
    <6f6>   DW_AT_type        : <0x1db>
    <6fa>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6fd>: Abbrev Number: 23 (DW_TAG_member)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <702>   DW_AT_decl_file   : 18
    <703>   DW_AT_decl_line   : 280
    <705>   DW_AT_decl_column : 8
    <706>   DW_AT_type        : <0xc6>
    <70a>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><70d>: Abbrev Number: 23 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0xbf7): _free_priv_data
    <712>   DW_AT_decl_file   : 18
    <713>   DW_AT_decl_line   : 281
    <715>   DW_AT_decl_column : 9
    <716>   DW_AT_type        : <0x9b8>
    <71a>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><71d>: Abbrev Number: 23 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <722>   DW_AT_decl_file   : 18
    <723>   DW_AT_decl_line   : 282
    <725>   DW_AT_decl_column : 23
    <726>   DW_AT_type        : <0x9be>
    <72a>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><72d>: Abbrev Number: 23 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0x20): s_prev_ent
    <732>   DW_AT_decl_file   : 18
    <733>   DW_AT_decl_line   : 285
    <735>   DW_AT_decl_column : 23
    <736>   DW_AT_type        : <0x9be>
    <73a>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><73e>: Abbrev Number: 23 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x387): inject_vec
    <743>   DW_AT_decl_file   : 18
    <744>   DW_AT_decl_line   : 286
    <746>   DW_AT_decl_column : 22
    <747>   DW_AT_type        : <0x9c9>
    <74b>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x7f6): stime
    <754>   DW_AT_decl_file   : 18
    <755>   DW_AT_decl_line   : 287
    <757>   DW_AT_decl_column : 18
    <758>   DW_AT_type        : <0x13f>
    <75c>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><760>: Abbrev Number: 23 (DW_TAG_member)
    <761>   DW_AT_name        : (indirect string, offset: 0x39b): ltime
    <765>   DW_AT_decl_file   : 18
    <766>   DW_AT_decl_line   : 288
    <768>   DW_AT_decl_column : 18
    <769>   DW_AT_type        : <0x13f>
    <76d>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><771>: Abbrev Number: 23 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0xff8): atime
    <776>   DW_AT_decl_file   : 18
    <777>   DW_AT_decl_line   : 289
    <779>   DW_AT_decl_column : 18
    <77a>   DW_AT_type        : <0x13f>
    <77e>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><782>: Abbrev Number: 23 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4f2): etime
    <787>   DW_AT_decl_file   : 18
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x13f>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><793>: Abbrev Number: 23 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd22): delay_expiration_time
    <798>   DW_AT_decl_file   : 18
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x13f>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a4>: Abbrev Number: 23 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x2b): pid_ns
    <7a9>   DW_AT_decl_file   : 18
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b5>: Abbrev Number: 23 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xf38): last_dirfd
    <7ba>   DW_AT_decl_file   : 18
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c6>: Abbrev Number: 23 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf5e): mmap_cache
    <7cb>   DW_AT_decl_file   : 18
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9e5>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7d7>: Abbrev Number: 23 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb38): wait_data_idx
    <7dc>   DW_AT_decl_file   : 18
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x12e>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7e8>: Abbrev Number: 23 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa7a): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 18
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0x9f1>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f9>: Abbrev Number: 23 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xaea): wait_list
    <7fe>   DW_AT_decl_file   : 18
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x568>
    <806>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><80a>: Abbrev Number: 23 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6eb): vcpu_info_list
    <80f>   DW_AT_decl_file   : 18
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0x9fd>
    <817>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81b>: Abbrev Number: 23 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xc89): unwind_ctx
    <820>   DW_AT_decl_file   : 18
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xc6>
    <828>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82c>: Abbrev Number: 23 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x4d0): unwind_queue
    <831>   DW_AT_decl_file   : 18
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0xa09>
    <839>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><83d>: Abbrev Number: 23 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <842>   DW_AT_decl_file   : 18
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0xa0f>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><84e>: Abbrev Number: 23 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x223): start_prc
    <853>   DW_AT_decl_file   : 18
    <854>   DW_AT_decl_line   : 329
    <856>   DW_AT_decl_column : 16
    <857>   DW_AT_type        : <0x37>
    <85b>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><85f>: Abbrev Number: 0
 <1><860>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <861>   DW_AT_byte_size   : 4
    <862>   DW_AT_type        : <0x5f3>
 <1><866>: Abbrev Number: 4 (DW_TAG_typedef)
    <867>   DW_AT_name        : (indirect string, offset: 0x5c4): struct_sysent
    <86b>   DW_AT_decl_file   : 17
    <86c>   DW_AT_decl_line   : 19
    <86d>   DW_AT_decl_column : 3
    <86e>   DW_AT_type        : <0x59a>
 <1><872>: Abbrev Number: 3 (DW_TAG_const_type)
    <873>   DW_AT_type        : <0x866>
 <1><877>: Abbrev Number: 12 (DW_TAG_variable)
    <878>   DW_AT_name        : (indirect string, offset: 0xd0e): current_personality
    <87c>   DW_AT_decl_file   : 18
    <87d>   DW_AT_decl_line   : 158
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x2b>
    <883>   DW_AT_external    : 1
    <884>   DW_AT_declaration : 1
 <1><885>: Abbrev Number: 12 (DW_TAG_variable)
    <886>   DW_AT_name        : (indirect string, offset: 0x827): current_wordsize
    <88a>   DW_AT_decl_file   : 18
    <88b>   DW_AT_decl_line   : 171
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x2b>
    <891>   DW_AT_external    : 1
    <892>   DW_AT_declaration : 1
 <1><893>: Abbrev Number: 12 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0xa51): current_klongsize
    <898>   DW_AT_decl_file   : 18
    <899>   DW_AT_decl_line   : 176
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x2b>
    <89f>   DW_AT_external    : 1
    <8a0>   DW_AT_declaration : 1
 <1><8a1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xc60): ioctlent
    <8a6>   DW_AT_byte_size   : 8
    <8a7>   DW_AT_decl_file   : 18
    <8a8>   DW_AT_decl_line   : 217
    <8a9>   DW_AT_decl_column : 16
    <8aa>   DW_AT_sibling     : <0x8cd>
 <2><8ae>: Abbrev Number: 9 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0xf24): symbol
    <8b3>   DW_AT_decl_file   : 18
    <8b4>   DW_AT_decl_line   : 218
    <8b5>   DW_AT_decl_column : 14
    <8b6>   DW_AT_type        : <0x1db>
    <8ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8bd>: Abbrev Number: 9 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0xcd7): code
    <8c2>   DW_AT_decl_file   : 18
    <8c3>   DW_AT_decl_line   : 219
    <8c4>   DW_AT_decl_column : 15
    <8c5>   DW_AT_type        : <0x2b>
    <8c9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8cc>: Abbrev Number: 0
 <1><8cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ce>   DW_AT_name        : (indirect string, offset: 0xc21): struct_ioctlent
    <8d2>   DW_AT_decl_file   : 18
    <8d3>   DW_AT_decl_line   : 220
    <8d4>   DW_AT_decl_column : 3
    <8d5>   DW_AT_type        : <0x8a1>
 <1><8d9>: Abbrev Number: 3 (DW_TAG_const_type)
    <8da>   DW_AT_type        : <0x8cd>
 <1><8de>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8df>   DW_AT_name        : (indirect string, offset: 0x81b): inject_data
    <8e3>   DW_AT_byte_size   : 10
    <8e4>   DW_AT_decl_file   : 18
    <8e5>   DW_AT_decl_line   : 241
    <8e6>   DW_AT_decl_column : 8
    <8e7>   DW_AT_sibling     : <0x946>
 <2><8eb>: Abbrev Number: 9 (DW_TAG_member)
    <8ec>   DW_AT_name        : (indirect string, offset: 0x4f8): flags
    <8f0>   DW_AT_decl_file   : 18
    <8f1>   DW_AT_decl_line   : 242
    <8f2>   DW_AT_decl_column : 10
    <8f3>   DW_AT_type        : <0xf7>
    <8f7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8fa>: Abbrev Number: 9 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x936): signo
    <8ff>   DW_AT_decl_file   : 18
    <900>   DW_AT_decl_line   : 243
    <901>   DW_AT_decl_column : 10
    <902>   DW_AT_type        : <0xf7>
    <906>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><909>: Abbrev Number: 9 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <90e>   DW_AT_decl_file   : 18
    <90f>   DW_AT_decl_line   : 244
    <910>   DW_AT_decl_column : 11
    <911>   DW_AT_type        : <0x103>
    <915>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><918>: Abbrev Number: 9 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0xcb4): delay_idx
    <91d>   DW_AT_decl_file   : 18
    <91e>   DW_AT_decl_line   : 245
    <91f>   DW_AT_decl_column : 11
    <920>   DW_AT_type        : <0x103>
    <924>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><927>: Abbrev Number: 9 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x619): poke_idx
    <92c>   DW_AT_decl_file   : 18
    <92d>   DW_AT_decl_line   : 246
    <92e>   DW_AT_decl_column : 11
    <92f>   DW_AT_type        : <0x103>
    <933>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><936>: Abbrev Number: 9 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x19d): scno
    <93b>   DW_AT_decl_file   : 18
    <93c>   DW_AT_decl_line   : 247
    <93d>   DW_AT_decl_column : 11
    <93e>   DW_AT_type        : <0x103>
    <942>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><945>: Abbrev Number: 0
 <1><946>: Abbrev Number: 8 (DW_TAG_structure_type)
    <947>   DW_AT_name        : (indirect string, offset: 0xe6): inject_opts
    <94b>   DW_AT_byte_size   : 16
    <94c>   DW_AT_decl_file   : 18
    <94d>   DW_AT_decl_line   : 250
    <94e>   DW_AT_decl_column : 8
    <94f>   DW_AT_sibling     : <0x990>
 <2><953>: Abbrev Number: 9 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0xa26): first
    <958>   DW_AT_decl_file   : 18
    <959>   DW_AT_decl_line   : 251
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0x103>
    <95f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><962>: Abbrev Number: 9 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0x1101): last
    <967>   DW_AT_decl_file   : 18
    <968>   DW_AT_decl_line   : 252
    <969>   DW_AT_decl_column : 11
    <96a>   DW_AT_type        : <0x103>
    <96e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><971>: Abbrev Number: 9 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x3a1): step
    <976>   DW_AT_decl_file   : 18
    <977>   DW_AT_decl_line   : 253
    <978>   DW_AT_decl_column : 11
    <979>   DW_AT_type        : <0x103>
    <97d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><980>: Abbrev Number: 9 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x10d3): data
    <985>   DW_AT_decl_file   : 18
    <986>   DW_AT_decl_line   : 254
    <987>   DW_AT_decl_column : 21
    <988>   DW_AT_type        : <0x8de>
    <98c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><98f>: Abbrev Number: 0
 <1><990>: Abbrev Number: 16 (DW_TAG_array_type)
    <991>   DW_AT_type        : <0x557>
    <995>   DW_AT_sibling     : <0x9a0>
 <2><999>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <99a>   DW_AT_type        : <0x2b>
    <99e>   DW_AT_upper_bound : 5
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9a1>   DW_AT_name        : (indirect string, offset: 0xefc): staged_output_data
    <9a5>   DW_AT_declaration : 1
 <1><9a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x9a0>
 <1><9ac>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9ad>   DW_AT_prototyped  : 1
    <9ae>   DW_AT_sibling     : <0x9b8>
 <2><9b2>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9b3>   DW_AT_type        : <0xc6>
 <2><9b7>: Abbrev Number: 0
 <1><9b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x9ac>
 <1><9be>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bf>   DW_AT_byte_size   : 4
    <9c0>   DW_AT_type        : <0x872>
 <1><9c4>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c5>   DW_AT_type        : <0x9be>
 <1><9c9>: Abbrev Number: 16 (DW_TAG_array_type)
    <9ca>   DW_AT_type        : <0x9d9>
    <9ce>   DW_AT_sibling     : <0x9d9>
 <2><9d2>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9d3>   DW_AT_type        : <0x2b>
    <9d7>   DW_AT_upper_bound : 2
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9da>   DW_AT_byte_size   : 4
    <9db>   DW_AT_type        : <0x946>
 <1><9df>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xb2): mmap_cache_t
    <9e4>   DW_AT_declaration : 1
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x9df>
 <1><9eb>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x3bc): tcb_wait_data
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0xee0): unwind_queue_t
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 16 (DW_TAG_array_type)
    <a10>   DW_AT_type        : <0xdf>
    <a14>   DW_AT_sibling     : <0xa1f>
 <2><a18>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a19>   DW_AT_type        : <0x2b>
    <a1d>   DW_AT_upper_bound : 15
 <2><a1e>: Abbrev Number: 0
 <1><a1f>: Abbrev Number: 11 (DW_TAG_variable)
    <a20>   DW_AT_name        : (indirect string, offset: 0xb75): stub_sysent
    <a24>   DW_AT_decl_file   : 18
    <a25>   DW_AT_decl_line   : 403
    <a27>   DW_AT_decl_column : 28
    <a28>   DW_AT_type        : <0x872>
    <a2c>   DW_AT_external    : 1
    <a2d>   DW_AT_declaration : 1
 <1><a2e>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x10b6): xlat_type
    <a33>   DW_AT_encoding    : 7	(unsigned)
    <a34>   DW_AT_byte_size   : 4
    <a35>   DW_AT_type        : <0x2b>
    <a39>   DW_AT_decl_file   : 19
    <a3a>   DW_AT_decl_line   : 13
    <a3b>   DW_AT_decl_column : 6
    <a3c>   DW_AT_sibling     : <0xa53>
 <2><a40>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0x2d6): XT_NORMAL
    <a45>   DW_AT_const_value : 0
 <2><a46>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0xc38): XT_SORTED
    <a4b>   DW_AT_const_value : 1
 <2><a4c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0xdb4): XT_INDEXED
    <a51>   DW_AT_const_value : 2
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a54>   DW_AT_name        : (indirect string, offset: 0xba1): xlat_style
    <a58>   DW_AT_encoding    : 7	(unsigned)
    <a59>   DW_AT_byte_size   : 4
    <a5a>   DW_AT_type        : <0x2b>
    <a5e>   DW_AT_decl_file   : 19
    <a5f>   DW_AT_decl_line   : 19
    <a60>   DW_AT_decl_column : 6
    <a61>   DW_AT_sibling     : <0xa90>
 <2><a65>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0xf2): XLAT_STYLE_DEFAULT
    <a6a>   DW_AT_const_value : 0
 <2><a6b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xbd4): XLAT_STYLE_RAW
    <a70>   DW_AT_const_value : 1
 <2><a71>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x1081): XLAT_STYLE_ABBREV
    <a76>   DW_AT_const_value : 2
 <2><a77>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x2f3): XLAT_STYLE_VERBOSE
    <a7c>   DW_AT_const_value : 3
 <2><a7d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x260): XLAT_STYLE_FMT_X
    <a82>   DW_AT_const_value : 0
 <2><a83>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a88>   DW_AT_const_value : 4
 <2><a89>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x10f0): XLAT_STYLE_FMT_D
    <a8e>   DW_AT_const_value : 8
 <2><a8f>: Abbrev Number: 0
 <1><a90>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a91>   DW_AT_name        : (indirect string, offset: 0x324): xlat_data
    <a95>   DW_AT_byte_size   : 16
    <a96>   DW_AT_decl_file   : 19
    <a97>   DW_AT_decl_line   : 51
    <a98>   DW_AT_decl_column : 8
    <a99>   DW_AT_sibling     : <0xabc>
 <2><a9d>: Abbrev Number: 19 (DW_TAG_member)
    <a9e>   DW_AT_name        : val
    <aa2>   DW_AT_decl_file   : 19
    <aa3>   DW_AT_decl_line   : 52
    <aa4>   DW_AT_decl_column : 11
    <aa5>   DW_AT_type        : <0x11b>
    <aa9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aac>: Abbrev Number: 19 (DW_TAG_member)
    <aad>   DW_AT_name        : str
    <ab1>   DW_AT_decl_file   : 19
    <ab2>   DW_AT_decl_line   : 53
    <ab3>   DW_AT_decl_column : 14
    <ab4>   DW_AT_type        : <0x1db>
    <ab8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><abb>: Abbrev Number: 0
 <1><abc>: Abbrev Number: 3 (DW_TAG_const_type)
    <abd>   DW_AT_type        : <0xa90>
 <1><ac1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x1b): xlat
    <ac6>   DW_AT_byte_size   : 24
    <ac7>   DW_AT_decl_file   : 19
    <ac8>   DW_AT_decl_line   : 56
    <ac9>   DW_AT_decl_column : 8
    <aca>   DW_AT_sibling     : <0xb1a>
 <2><ace>: Abbrev Number: 9 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0x10d3): data
    <ad3>   DW_AT_decl_file   : 19
    <ad4>   DW_AT_decl_line   : 57
    <ad5>   DW_AT_decl_column : 26
    <ad6>   DW_AT_type        : <0xb1f>
    <ada>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><add>: Abbrev Number: 9 (DW_TAG_member)
    <ade>   DW_AT_name        : (indirect string, offset: 0x879): flags_strsz
    <ae2>   DW_AT_decl_file   : 19
    <ae3>   DW_AT_decl_line   : 58
    <ae4>   DW_AT_decl_column : 9
    <ae5>   DW_AT_type        : <0x12e>
    <ae9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><aec>: Abbrev Number: 9 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0xb46): size
    <af1>   DW_AT_decl_file   : 19
    <af2>   DW_AT_decl_line   : 59
    <af3>   DW_AT_decl_column : 11
    <af4>   DW_AT_type        : <0x10f>
    <af8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><afb>: Abbrev Number: 9 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x1a2): type
    <b00>   DW_AT_decl_file   : 19
    <b01>   DW_AT_decl_line   : 60
    <b02>   DW_AT_decl_column : 17
    <b03>   DW_AT_type        : <0xa2e>
    <b07>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b0a>: Abbrev Number: 9 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x73f): flags_mask
    <b0f>   DW_AT_decl_file   : 19
    <b10>   DW_AT_decl_line   : 61
    <b11>   DW_AT_decl_column : 11
    <b12>   DW_AT_type        : <0x11b>
    <b16>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b19>: Abbrev Number: 0
 <1><b1a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1b>   DW_AT_type        : <0xac1>
 <1><b1f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b20>   DW_AT_byte_size   : 4
    <b21>   DW_AT_type        : <0xabc>
 <1><b25>: Abbrev Number: 16 (DW_TAG_array_type)
    <b26>   DW_AT_type        : <0xb1a>
    <b2a>   DW_AT_sibling     : <0xb30>
 <2><b2e>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b2f>: Abbrev Number: 0
 <1><b30>: Abbrev Number: 3 (DW_TAG_const_type)
    <b31>   DW_AT_type        : <0xb25>
 <1><b35>: Abbrev Number: 11 (DW_TAG_variable)
    <b36>   DW_AT_name        : (indirect string, offset: 0xe25): addrfams
    <b3a>   DW_AT_decl_file   : 18
    <b3b>   DW_AT_decl_line   : 409
    <b3d>   DW_AT_decl_column : 26
    <b3e>   DW_AT_type        : <0xb30>
    <b42>   DW_AT_external    : 1
    <b43>   DW_AT_declaration : 1
 <1><b44>: Abbrev Number: 11 (DW_TAG_variable)
    <b45>   DW_AT_name        : (indirect string, offset: 0xce7): arp_hardware_types
    <b49>   DW_AT_decl_file   : 18
    <b4a>   DW_AT_decl_line   : 410
    <b4c>   DW_AT_decl_column : 26
    <b4d>   DW_AT_type        : <0xb30>
    <b51>   DW_AT_external    : 1
    <b52>   DW_AT_declaration : 1
 <1><b53>: Abbrev Number: 11 (DW_TAG_variable)
    <b54>   DW_AT_name        : (indirect string, offset: 0xffe): at_flags
    <b58>   DW_AT_decl_file   : 18
    <b59>   DW_AT_decl_line   : 411
    <b5b>   DW_AT_decl_column : 26
    <b5c>   DW_AT_type        : <0xb30>
    <b60>   DW_AT_external    : 1
    <b61>   DW_AT_declaration : 1
 <1><b62>: Abbrev Number: 11 (DW_TAG_variable)
    <b63>   DW_AT_name        : (indirect string, offset: 0x490): clocknames
    <b67>   DW_AT_decl_file   : 18
    <b68>   DW_AT_decl_line   : 412
    <b6a>   DW_AT_decl_column : 26
    <b6b>   DW_AT_type        : <0xb30>
    <b6f>   DW_AT_external    : 1
    <b70>   DW_AT_declaration : 1
 <1><b71>: Abbrev Number: 11 (DW_TAG_variable)
    <b72>   DW_AT_name        : (indirect string, offset: 0xfac): dirent_types
    <b76>   DW_AT_decl_file   : 18
    <b77>   DW_AT_decl_line   : 413
    <b79>   DW_AT_decl_column : 26
    <b7a>   DW_AT_type        : <0xb30>
    <b7e>   DW_AT_external    : 1
    <b7f>   DW_AT_declaration : 1
 <1><b80>: Abbrev Number: 11 (DW_TAG_variable)
    <b81>   DW_AT_name        : (indirect string, offset: 0x8ca): ethernet_protocols
    <b85>   DW_AT_decl_file   : 18
    <b86>   DW_AT_decl_line   : 414
    <b88>   DW_AT_decl_column : 26
    <b89>   DW_AT_type        : <0xb30>
    <b8d>   DW_AT_external    : 1
    <b8e>   DW_AT_declaration : 1
 <1><b8f>: Abbrev Number: 11 (DW_TAG_variable)
    <b90>   DW_AT_name        : (indirect string, offset: 0x66c): inet_protocols
    <b94>   DW_AT_decl_file   : 18
    <b95>   DW_AT_decl_line   : 415
    <b97>   DW_AT_decl_column : 26
    <b98>   DW_AT_type        : <0xb30>
    <b9c>   DW_AT_external    : 1
    <b9d>   DW_AT_declaration : 1
 <1><b9e>: Abbrev Number: 11 (DW_TAG_variable)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x2c3): evdev_abs
    <ba3>   DW_AT_decl_file   : 18
    <ba4>   DW_AT_decl_line   : 416
    <ba6>   DW_AT_decl_column : 26
    <ba7>   DW_AT_type        : <0xb30>
    <bab>   DW_AT_external    : 1
    <bac>   DW_AT_declaration : 1
 <1><bad>: Abbrev Number: 11 (DW_TAG_variable)
    <bae>   DW_AT_name        : (indirect string, offset: 0x734): audit_arch
    <bb2>   DW_AT_decl_file   : 18
    <bb3>   DW_AT_decl_line   : 417
    <bb5>   DW_AT_decl_column : 26
    <bb6>   DW_AT_type        : <0xb30>
    <bba>   DW_AT_external    : 1
    <bbb>   DW_AT_declaration : 1
 <1><bbc>: Abbrev Number: 11 (DW_TAG_variable)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x9e): evdev_ev
    <bc1>   DW_AT_decl_file   : 18
    <bc2>   DW_AT_decl_line   : 418
    <bc4>   DW_AT_decl_column : 26
    <bc5>   DW_AT_type        : <0xb30>
    <bc9>   DW_AT_external    : 1
    <bca>   DW_AT_declaration : 1
 <1><bcb>: Abbrev Number: 11 (DW_TAG_variable)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x471): iffflags
    <bd0>   DW_AT_decl_file   : 18
    <bd1>   DW_AT_decl_line   : 419
    <bd3>   DW_AT_decl_column : 26
    <bd4>   DW_AT_type        : <0xb30>
    <bd8>   DW_AT_external    : 1
    <bd9>   DW_AT_declaration : 1
 <1><bda>: Abbrev Number: 11 (DW_TAG_variable)
    <bdb>   DW_AT_name        : (indirect string, offset: 0xbe3): ip_type_of_services
    <bdf>   DW_AT_decl_file   : 18
    <be0>   DW_AT_decl_line   : 420
    <be2>   DW_AT_decl_column : 26
    <be3>   DW_AT_type        : <0xb30>
    <be7>   DW_AT_external    : 1
    <be8>   DW_AT_declaration : 1
 <1><be9>: Abbrev Number: 11 (DW_TAG_variable)
    <bea>   DW_AT_name        : (indirect string, offset: 0x6c7): ipc_private
    <bee>   DW_AT_decl_file   : 18
    <bef>   DW_AT_decl_line   : 421
    <bf1>   DW_AT_decl_column : 26
    <bf2>   DW_AT_type        : <0xb30>
    <bf6>   DW_AT_external    : 1
    <bf7>   DW_AT_declaration : 1
 <1><bf8>: Abbrev Number: 11 (DW_TAG_variable)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x31a): msg_flags
    <bfd>   DW_AT_decl_file   : 18
    <bfe>   DW_AT_decl_line   : 422
    <c00>   DW_AT_decl_column : 26
    <c01>   DW_AT_type        : <0xb30>
    <c05>   DW_AT_external    : 1
    <c06>   DW_AT_declaration : 1
 <1><c07>: Abbrev Number: 11 (DW_TAG_variable)
    <c08>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c0c>   DW_AT_decl_file   : 18
    <c0d>   DW_AT_decl_line   : 423
    <c0f>   DW_AT_decl_column : 26
    <c10>   DW_AT_type        : <0xb30>
    <c14>   DW_AT_external    : 1
    <c15>   DW_AT_declaration : 1
 <1><c16>: Abbrev Number: 11 (DW_TAG_variable)
    <c17>   DW_AT_name        : (indirect string, offset: 0xf0f): nl_bridge_vlan_flags
    <c1b>   DW_AT_decl_file   : 18
    <c1c>   DW_AT_decl_line   : 424
    <c1e>   DW_AT_decl_column : 26
    <c1f>   DW_AT_type        : <0xb30>
    <c23>   DW_AT_external    : 1
    <c24>   DW_AT_declaration : 1
 <1><c25>: Abbrev Number: 11 (DW_TAG_variable)
    <c26>   DW_AT_name        : (indirect string, offset: 0xd9d): nl_netfilter_msg_types
    <c2a>   DW_AT_decl_file   : 18
    <c2b>   DW_AT_decl_line   : 425
    <c2d>   DW_AT_decl_column : 26
    <c2e>   DW_AT_type        : <0xb30>
    <c32>   DW_AT_external    : 1
    <c33>   DW_AT_declaration : 1
 <1><c34>: Abbrev Number: 11 (DW_TAG_variable)
    <c35>   DW_AT_name        : (indirect string, offset: 0x453): nl_route_types
    <c39>   DW_AT_decl_file   : 18
    <c3a>   DW_AT_decl_line   : 426
    <c3c>   DW_AT_decl_column : 26
    <c3d>   DW_AT_type        : <0xb30>
    <c41>   DW_AT_external    : 1
    <c42>   DW_AT_declaration : 1
 <1><c43>: Abbrev Number: 11 (DW_TAG_variable)
    <c44>   DW_AT_name        : (indirect string, offset: 0xe5c): open_access_modes
    <c48>   DW_AT_decl_file   : 18
    <c49>   DW_AT_decl_line   : 427
    <c4b>   DW_AT_decl_column : 26
    <c4c>   DW_AT_type        : <0xb30>
    <c50>   DW_AT_external    : 1
    <c51>   DW_AT_declaration : 1
 <1><c52>: Abbrev Number: 11 (DW_TAG_variable)
    <c53>   DW_AT_name        : (indirect string, offset: 0x8e): open_mode_flags
    <c57>   DW_AT_decl_file   : 18
    <c58>   DW_AT_decl_line   : 428
    <c5a>   DW_AT_decl_column : 26
    <c5b>   DW_AT_type        : <0xb30>
    <c5f>   DW_AT_external    : 1
    <c60>   DW_AT_declaration : 1
 <1><c61>: Abbrev Number: 11 (DW_TAG_variable)
    <c62>   DW_AT_name        : (indirect string, offset: 0xc14): perf_type_id
    <c66>   DW_AT_decl_file   : 18
    <c67>   DW_AT_decl_line   : 429
    <c69>   DW_AT_decl_column : 26
    <c6a>   DW_AT_type        : <0xb30>
    <c6e>   DW_AT_external    : 1
    <c6f>   DW_AT_declaration : 1
 <1><c70>: Abbrev Number: 11 (DW_TAG_variable)
    <c71>   DW_AT_name        : (indirect string, offset: 0xe2e): pollflags
    <c75>   DW_AT_decl_file   : 18
    <c76>   DW_AT_decl_line   : 430
    <c78>   DW_AT_decl_column : 26
    <c79>   DW_AT_type        : <0xb30>
    <c7d>   DW_AT_external    : 1
    <c7e>   DW_AT_declaration : 1
 <1><c7f>: Abbrev Number: 11 (DW_TAG_variable)
    <c80>   DW_AT_name        : (indirect string, offset: 0x60d): ptrace_cmds
    <c84>   DW_AT_decl_file   : 18
    <c85>   DW_AT_decl_line   : 431
    <c87>   DW_AT_decl_column : 26
    <c88>   DW_AT_type        : <0xb30>
    <c8c>   DW_AT_external    : 1
    <c8d>   DW_AT_declaration : 1
 <1><c8e>: Abbrev Number: 11 (DW_TAG_variable)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x80c): resource_flags
    <c93>   DW_AT_decl_file   : 18
    <c94>   DW_AT_decl_line   : 432
    <c96>   DW_AT_decl_column : 26
    <c97>   DW_AT_type        : <0xb30>
    <c9b>   DW_AT_external    : 1
    <c9c>   DW_AT_declaration : 1
 <1><c9d>: Abbrev Number: 11 (DW_TAG_variable)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x299): route_nexthop_flags
    <ca2>   DW_AT_decl_file   : 18
    <ca3>   DW_AT_decl_line   : 433
    <ca5>   DW_AT_decl_column : 26
    <ca6>   DW_AT_type        : <0xb30>
    <caa>   DW_AT_external    : 1
    <cab>   DW_AT_declaration : 1
 <1><cac>: Abbrev Number: 11 (DW_TAG_variable)
    <cad>   DW_AT_name        : (indirect string, offset: 0xe9a): routing_protocols
    <cb1>   DW_AT_decl_file   : 18
    <cb2>   DW_AT_decl_line   : 434
    <cb4>   DW_AT_decl_column : 26
    <cb5>   DW_AT_type        : <0xb30>
    <cb9>   DW_AT_external    : 1
    <cba>   DW_AT_declaration : 1
 <1><cbb>: Abbrev Number: 11 (DW_TAG_variable)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x462): routing_scopes
    <cc0>   DW_AT_decl_file   : 18
    <cc1>   DW_AT_decl_line   : 435
    <cc3>   DW_AT_decl_column : 26
    <cc4>   DW_AT_type        : <0xb30>
    <cc8>   DW_AT_external    : 1
    <cc9>   DW_AT_declaration : 1
 <1><cca>: Abbrev Number: 11 (DW_TAG_variable)
    <ccb>   DW_AT_name        : (indirect string, offset: 0xd8b): routing_table_ids
    <ccf>   DW_AT_decl_file   : 18
    <cd0>   DW_AT_decl_line   : 436
    <cd2>   DW_AT_decl_column : 26
    <cd3>   DW_AT_type        : <0xb30>
    <cd7>   DW_AT_external    : 1
    <cd8>   DW_AT_declaration : 1
 <1><cd9>: Abbrev Number: 11 (DW_TAG_variable)
    <cda>   DW_AT_name        : (indirect string, offset: 0x6a4): routing_types
    <cde>   DW_AT_decl_file   : 18
    <cdf>   DW_AT_decl_line   : 437
    <ce1>   DW_AT_decl_column : 26
    <ce2>   DW_AT_type        : <0xb30>
    <ce6>   DW_AT_external    : 1
    <ce7>   DW_AT_declaration : 1
 <1><ce8>: Abbrev Number: 11 (DW_TAG_variable)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x1c6): rwf_flags
    <ced>   DW_AT_decl_file   : 18
    <cee>   DW_AT_decl_line   : 438
    <cf0>   DW_AT_decl_column : 26
    <cf1>   DW_AT_type        : <0xb30>
    <cf5>   DW_AT_external    : 1
    <cf6>   DW_AT_declaration : 1
 <1><cf7>: Abbrev Number: 11 (DW_TAG_variable)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x844): seccomp_filter_flags
    <cfc>   DW_AT_decl_file   : 18
    <cfd>   DW_AT_decl_line   : 439
    <cff>   DW_AT_decl_column : 26
    <d00>   DW_AT_type        : <0xb30>
    <d04>   DW_AT_external    : 1
    <d05>   DW_AT_declaration : 1
 <1><d06>: Abbrev Number: 11 (DW_TAG_variable)
    <d07>   DW_AT_name        : (indirect string, offset: 0x2e0): seccomp_ret_action
    <d0b>   DW_AT_decl_file   : 18
    <d0c>   DW_AT_decl_line   : 440
    <d0e>   DW_AT_decl_column : 26
    <d0f>   DW_AT_type        : <0xb30>
    <d13>   DW_AT_external    : 1
    <d14>   DW_AT_declaration : 1
 <1><d15>: Abbrev Number: 11 (DW_TAG_variable)
    <d16>   DW_AT_name        : (indirect string, offset: 0x42e): setns_types
    <d1a>   DW_AT_decl_file   : 18
    <d1b>   DW_AT_decl_line   : 441
    <d1d>   DW_AT_decl_column : 26
    <d1e>   DW_AT_type        : <0xb30>
    <d22>   DW_AT_external    : 1
    <d23>   DW_AT_declaration : 1
 <1><d24>: Abbrev Number: 11 (DW_TAG_variable)
    <d25>   DW_AT_name        : (indirect string, offset: 0xe1a): sg_io_info
    <d29>   DW_AT_decl_file   : 18
    <d2a>   DW_AT_decl_line   : 442
    <d2c>   DW_AT_decl_column : 26
    <d2d>   DW_AT_type        : <0xb30>
    <d31>   DW_AT_external    : 1
    <d32>   DW_AT_declaration : 1
 <1><d33>: Abbrev Number: 11 (DW_TAG_variable)
    <d34>   DW_AT_name        : (indirect string, offset: 0xb89): socketlayers
    <d38>   DW_AT_decl_file   : 18
    <d39>   DW_AT_decl_line   : 443
    <d3b>   DW_AT_decl_column : 26
    <d3c>   DW_AT_type        : <0xb30>
    <d40>   DW_AT_external    : 1
    <d41>   DW_AT_declaration : 1
 <1><d42>: Abbrev Number: 11 (DW_TAG_variable)
    <d43>   DW_AT_name        : (indirect string, offset: 0xd5b): socktypes
    <d47>   DW_AT_decl_file   : 18
    <d48>   DW_AT_decl_line   : 444
    <d4a>   DW_AT_decl_column : 26
    <d4b>   DW_AT_type        : <0xb30>
    <d4f>   DW_AT_external    : 1
    <d50>   DW_AT_declaration : 1
 <1><d51>: Abbrev Number: 11 (DW_TAG_variable)
    <d52>   DW_AT_name        : (indirect string, offset: 0xa63): tcp_state_flags
    <d56>   DW_AT_decl_file   : 18
    <d57>   DW_AT_decl_line   : 445
    <d59>   DW_AT_decl_column : 26
    <d5a>   DW_AT_type        : <0xb30>
    <d5e>   DW_AT_external    : 1
    <d5f>   DW_AT_declaration : 1
 <1><d60>: Abbrev Number: 11 (DW_TAG_variable)
    <d61>   DW_AT_name        : (indirect string, offset: 0x769): tcp_states
    <d65>   DW_AT_decl_file   : 18
    <d66>   DW_AT_decl_line   : 446
    <d68>   DW_AT_decl_column : 26
    <d69>   DW_AT_type        : <0xb30>
    <d6d>   DW_AT_external    : 1
    <d6e>   DW_AT_declaration : 1
 <1><d6f>: Abbrev Number: 11 (DW_TAG_variable)
    <d70>   DW_AT_name        : (indirect string, offset: 0x1064): whence_codes
    <d74>   DW_AT_decl_file   : 18
    <d75>   DW_AT_decl_line   : 447
    <d77>   DW_AT_decl_column : 26
    <d78>   DW_AT_type        : <0xb30>
    <d7c>   DW_AT_external    : 1
    <d7d>   DW_AT_declaration : 1
 <1><d7e>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d7f>   DW_AT_encoding    : 7	(unsigned)
    <d80>   DW_AT_byte_size   : 4
    <d81>   DW_AT_type        : <0x2b>
    <d85>   DW_AT_decl_file   : 18
    <d86>   DW_AT_decl_line   : 508
    <d88>   DW_AT_decl_column : 14
    <d89>   DW_AT_sibling     : <0xda0>
 <2><d8d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x9a0): CFLAG_NONE
    <d92>   DW_AT_const_value : 0
 <2><d93>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0x8dd): CFLAG_ONLY_STATS
    <d98>   DW_AT_const_value : 1
 <2><d99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xb96): CFLAG_BOTH
    <d9e>   DW_AT_const_value : 2
 <2><d9f>: Abbrev Number: 0
 <1><da0>: Abbrev Number: 10 (DW_TAG_typedef)
    <da1>   DW_AT_name        : (indirect string, offset: 0x1106): cflag_t
    <da5>   DW_AT_decl_file   : 18
    <da6>   DW_AT_decl_line   : 512
    <da8>   DW_AT_decl_column : 3
    <da9>   DW_AT_type        : <0xd7e>
 <1><dad>: Abbrev Number: 11 (DW_TAG_variable)
    <dae>   DW_AT_name        : (indirect string, offset: 0xcae): cflag
    <db2>   DW_AT_decl_file   : 18
    <db3>   DW_AT_decl_line   : 513
    <db5>   DW_AT_decl_column : 16
    <db6>   DW_AT_type        : <0xda0>
    <dba>   DW_AT_external    : 1
    <dbb>   DW_AT_declaration : 1
 <1><dbc>: Abbrev Number: 11 (DW_TAG_variable)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dc1>   DW_AT_decl_file   : 18
    <dc2>   DW_AT_decl_line   : 514
    <dc4>   DW_AT_decl_column : 13
    <dc5>   DW_AT_type        : <0x527>
    <dc9>   DW_AT_external    : 1
    <dca>   DW_AT_declaration : 1
 <1><dcb>: Abbrev Number: 11 (DW_TAG_variable)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x7bf): Tflag_scale
    <dd0>   DW_AT_decl_file   : 18
    <dd1>   DW_AT_decl_line   : 515
    <dd3>   DW_AT_decl_column : 12
    <dd4>   DW_AT_type        : <0x64>
    <dd8>   DW_AT_external    : 1
    <dd9>   DW_AT_declaration : 1
 <1><dda>: Abbrev Number: 11 (DW_TAG_variable)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x859): Tflag_width
    <ddf>   DW_AT_decl_file   : 18
    <de0>   DW_AT_decl_line   : 516
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0x64>
    <de7>   DW_AT_external    : 1
    <de8>   DW_AT_declaration : 1
 <1><de9>: Abbrev Number: 11 (DW_TAG_variable)
    <dea>   DW_AT_name        : (indirect string, offset: 0xe0c): iflag
    <dee>   DW_AT_decl_file   : 18
    <def>   DW_AT_decl_line   : 517
    <df1>   DW_AT_decl_column : 13
    <df2>   DW_AT_type        : <0x527>
    <df6>   DW_AT_external    : 1
    <df7>   DW_AT_declaration : 1
 <1><df8>: Abbrev Number: 11 (DW_TAG_variable)
    <df9>   DW_AT_name        : (indirect string, offset: 0x64d): count_wallclock
    <dfd>   DW_AT_decl_file   : 18
    <dfe>   DW_AT_decl_line   : 518
    <e00>   DW_AT_decl_column : 13
    <e01>   DW_AT_type        : <0x527>
    <e05>   DW_AT_external    : 1
    <e06>   DW_AT_declaration : 1
 <1><e07>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e08>   DW_AT_name        : (indirect string, offset: 0x53): path_set_item
    <e0c>   DW_AT_byte_size   : 4
    <e0d>   DW_AT_decl_file   : 18
    <e0e>   DW_AT_decl_line   : 520
    <e10>   DW_AT_decl_column : 8
    <e11>   DW_AT_sibling     : <0xe26>
 <2><e15>: Abbrev Number: 23 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0xcc): path
    <e1a>   DW_AT_decl_file   : 18
    <e1b>   DW_AT_decl_line   : 521
    <e1d>   DW_AT_decl_column : 14
    <e1e>   DW_AT_type        : <0x1db>
    <e22>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e25>: Abbrev Number: 0
 <1><e26>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e27>   DW_AT_name        : (indirect string, offset: 0x774): path_set
    <e2b>   DW_AT_byte_size   : 12
    <e2c>   DW_AT_decl_file   : 18
    <e2d>   DW_AT_decl_line   : 525
    <e2f>   DW_AT_decl_column : 15
    <e30>   DW_AT_sibling     : <0xe65>
 <2><e34>: Abbrev Number: 23 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x702): paths_selected
    <e39>   DW_AT_decl_file   : 18
    <e3a>   DW_AT_decl_line   : 526
    <e3c>   DW_AT_decl_column : 24
    <e3d>   DW_AT_type        : <0xe65>
    <e41>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e44>: Abbrev Number: 23 (DW_TAG_member)
    <e45>   DW_AT_name        : (indirect string, offset: 0x1057): num_selected
    <e49>   DW_AT_decl_file   : 18
    <e4a>   DW_AT_decl_line   : 527
    <e4c>   DW_AT_decl_column : 9
    <e4d>   DW_AT_type        : <0x12e>
    <e51>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e54>: Abbrev Number: 23 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0xb46): size
    <e59>   DW_AT_decl_file   : 18
    <e5a>   DW_AT_decl_line   : 528
    <e5c>   DW_AT_decl_column : 9
    <e5d>   DW_AT_type        : <0x12e>
    <e61>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e64>: Abbrev Number: 0
 <1><e65>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e66>   DW_AT_byte_size   : 4
    <e67>   DW_AT_type        : <0xe07>
 <1><e6b>: Abbrev Number: 11 (DW_TAG_variable)
    <e6c>   DW_AT_name        : (indirect string, offset: 0x10a6): global_path_set
    <e70>   DW_AT_decl_file   : 18
    <e71>   DW_AT_decl_line   : 529
    <e73>   DW_AT_decl_column : 3
    <e74>   DW_AT_type        : <0xe26>
    <e78>   DW_AT_external    : 1
    <e79>   DW_AT_declaration : 1
 <1><e7a>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7b>   DW_AT_name        : (indirect string, offset: 0xf87): xflag_opts
    <e7f>   DW_AT_encoding    : 7	(unsigned)
    <e80>   DW_AT_byte_size   : 4
    <e81>   DW_AT_type        : <0x2b>
    <e85>   DW_AT_decl_file   : 18
    <e86>   DW_AT_decl_line   : 531
    <e88>   DW_AT_decl_column : 6
    <e89>   DW_AT_sibling     : <0xeac>
 <2><e8d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xa1a): HEXSTR_NONE
    <e92>   DW_AT_const_value : 0
 <2><e93>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0xfe0): HEXSTR_NON_ASCII
    <e98>   DW_AT_const_value : 1
 <2><e99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x921): HEXSTR_ALL
    <e9e>   DW_AT_const_value : 2
 <2><e9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x68d): HEXSTR_NON_ASCII_CHARS
    <ea4>   DW_AT_const_value : 3
 <2><ea5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x1071): NUM_HEXSTR_OPTS
    <eaa>   DW_AT_const_value : 4
 <2><eab>: Abbrev Number: 0
 <1><eac>: Abbrev Number: 11 (DW_TAG_variable)
    <ead>   DW_AT_name        : (indirect string, offset: 0xde6): xflag
    <eb1>   DW_AT_decl_file   : 18
    <eb2>   DW_AT_decl_line   : 544
    <eb4>   DW_AT_decl_column : 17
    <eb5>   DW_AT_type        : <0x2b>
    <eb9>   DW_AT_external    : 1
    <eba>   DW_AT_declaration : 1
 <1><ebb>: Abbrev Number: 11 (DW_TAG_variable)
    <ebc>   DW_AT_name        : (indirect string, offset: 0xc69): followfork
    <ec0>   DW_AT_decl_file   : 18
    <ec1>   DW_AT_decl_line   : 545
    <ec3>   DW_AT_decl_column : 13
    <ec4>   DW_AT_type        : <0x527>
    <ec8>   DW_AT_external    : 1
    <ec9>   DW_AT_declaration : 1
 <1><eca>: Abbrev Number: 11 (DW_TAG_variable)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x32e): output_separately
    <ecf>   DW_AT_decl_file   : 18
    <ed0>   DW_AT_decl_line   : 546
    <ed2>   DW_AT_decl_column : 13
    <ed3>   DW_AT_type        : <0x527>
    <ed7>   DW_AT_external    : 1
    <ed8>   DW_AT_declaration : 1
 <1><ed9>: Abbrev Number: 11 (DW_TAG_variable)
    <eda>   DW_AT_name        : (indirect string, offset: 0x22d): stack_trace_enabled
    <ede>   DW_AT_decl_file   : 18
    <edf>   DW_AT_decl_line   : 549
    <ee1>   DW_AT_decl_column : 13
    <ee2>   DW_AT_type        : <0x527>
    <ee6>   DW_AT_external    : 1
    <ee7>   DW_AT_declaration : 1
 <1><ee8>: Abbrev Number: 11 (DW_TAG_variable)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x67b): ptrace_setoptions
    <eed>   DW_AT_decl_file   : 18
    <eee>   DW_AT_decl_line   : 553
    <ef0>   DW_AT_decl_column : 17
    <ef1>   DW_AT_type        : <0x2b>
    <ef5>   DW_AT_external    : 1
    <ef6>   DW_AT_declaration : 1
 <1><ef7>: Abbrev Number: 11 (DW_TAG_variable)
    <ef8>   DW_AT_name        : (indirect string, offset: 0xa0f): max_strlen
    <efc>   DW_AT_decl_file   : 18
    <efd>   DW_AT_decl_line   : 554
    <eff>   DW_AT_decl_column : 17
    <f00>   DW_AT_type        : <0x2b>
    <f04>   DW_AT_external    : 1
    <f05>   DW_AT_declaration : 1
 <1><f06>: Abbrev Number: 11 (DW_TAG_variable)
    <f07>   DW_AT_name        : (indirect string, offset: 0xa3d): os_release
    <f0b>   DW_AT_decl_file   : 18
    <f0c>   DW_AT_decl_line   : 555
    <f0e>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0x2b>
    <f13>   DW_AT_external    : 1
    <f14>   DW_AT_declaration : 1
 <1><f15>: Abbrev Number: 11 (DW_TAG_variable)
    <f16>   DW_AT_name        : (indirect string, offset: 0x711): xlat_verbosity
    <f1a>   DW_AT_decl_file   : 18
    <f1b>   DW_AT_decl_line   : 917
    <f1d>   DW_AT_decl_column : 24
    <f1e>   DW_AT_type        : <0xa53>
    <f22>   DW_AT_external    : 1
    <f23>   DW_AT_declaration : 1
 <1><f24>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f25>   DW_AT_name        : (indirect string, offset: 0x630): xlat_style_private_flag_bits
    <f29>   DW_AT_encoding    : 7	(unsigned)
    <f2a>   DW_AT_byte_size   : 4
    <f2b>   DW_AT_type        : <0x2b>
    <f2f>   DW_AT_decl_file   : 18
    <f30>   DW_AT_decl_line   : 937
    <f32>   DW_AT_decl_column : 6
    <f33>   DW_AT_sibling     : <0xf50>
 <2><f37>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0x2ad): PAF_PRINT_INDICES_BIT
    <f3c>   DW_AT_const_value : 5
 <2><f3d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0xafd): PAF_ARRAY_TRUNCATED_BIT
    <f42>   DW_AT_const_value : 6
 <2><f43>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x3ee): PXF_DEFAULT_STR_BIT
    <f48>   DW_AT_const_value : 7
 <2><f49>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xc4b): SPFF_AUXSTR_MODE_BIT
    <f4e>   DW_AT_const_value : 8
 <2><f4f>: Abbrev Number: 0
 <1><f50>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f51>   DW_AT_name        : (indirect string, offset: 0xcfa): find_xlat_flag_bits
    <f55>   DW_AT_encoding    : 7	(unsigned)
    <f56>   DW_AT_byte_size   : 4
    <f57>   DW_AT_type        : <0x2b>
    <f5b>   DW_AT_decl_file   : 18
    <f5c>   DW_AT_decl_line   : 1441
    <f5e>   DW_AT_decl_column : 6
    <f5f>   DW_AT_sibling     : <0xf6a>
 <2><f63>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f64>   DW_AT_name        : (indirect string, offset: 0x95e): FXL_CASE_SENSITIVE_BIT
    <f68>   DW_AT_const_value : 0
 <2><f69>: Abbrev Number: 0
 <1><f6a>: Abbrev Number: 11 (DW_TAG_variable)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x9eb): printing_tcp
    <f6f>   DW_AT_decl_file   : 18
    <f70>   DW_AT_decl_line   : 1687
    <f72>   DW_AT_decl_column : 20
    <f73>   DW_AT_type        : <0x603>
    <f77>   DW_AT_external    : 1
    <f78>   DW_AT_declaration : 1
 <1><f79>: Abbrev Number: 11 (DW_TAG_variable)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x5e4): errnoent
    <f7e>   DW_AT_decl_file   : 18
    <f7f>   DW_AT_decl_line   : 1885
    <f81>   DW_AT_decl_column : 26
    <f82>   DW_AT_type        : <0x45b>
    <f86>   DW_AT_external    : 1
    <f87>   DW_AT_declaration : 1
 <1><f88>: Abbrev Number: 11 (DW_TAG_variable)
    <f89>   DW_AT_name        : (indirect string, offset: 0x865): signalent
    <f8d>   DW_AT_decl_file   : 18
    <f8e>   DW_AT_decl_line   : 1886
    <f90>   DW_AT_decl_column : 26
    <f91>   DW_AT_type        : <0x45b>
    <f95>   DW_AT_external    : 1
    <f96>   DW_AT_declaration : 1
 <1><f97>: Abbrev Number: 11 (DW_TAG_variable)
    <f98>   DW_AT_name        : (indirect string, offset: 0xe54): nerrnos
    <f9c>   DW_AT_decl_file   : 18
    <f9d>   DW_AT_decl_line   : 1887
    <f9f>   DW_AT_decl_column : 27
    <fa0>   DW_AT_type        : <0x32>
    <fa4>   DW_AT_external    : 1
    <fa5>   DW_AT_declaration : 1
 <1><fa6>: Abbrev Number: 11 (DW_TAG_variable)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x1040): nsignals
    <fab>   DW_AT_decl_file   : 18
    <fac>   DW_AT_decl_line   : 1888
    <fae>   DW_AT_decl_column : 27
    <faf>   DW_AT_type        : <0x32>
    <fb3>   DW_AT_external    : 1
    <fb4>   DW_AT_declaration : 1
 <1><fb5>: Abbrev Number: 16 (DW_TAG_array_type)
    <fb6>   DW_AT_type        : <0x872>
    <fba>   DW_AT_sibling     : <0xfc0>
 <2><fbe>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fbf>: Abbrev Number: 0
 <1><fc0>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc1>   DW_AT_type        : <0xfb5>
 <1><fc5>: Abbrev Number: 11 (DW_TAG_variable)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xcc5): sysent0
    <fca>   DW_AT_decl_file   : 18
    <fcb>   DW_AT_decl_line   : 1890
    <fcd>   DW_AT_decl_column : 28
    <fce>   DW_AT_type        : <0xfc0>
    <fd2>   DW_AT_external    : 1
    <fd3>   DW_AT_declaration : 1
 <1><fd4>: Abbrev Number: 16 (DW_TAG_array_type)
    <fd5>   DW_AT_type        : <0x8d9>
    <fd9>   DW_AT_sibling     : <0xfdf>
 <2><fdd>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fde>: Abbrev Number: 0
 <1><fdf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe0>   DW_AT_type        : <0xfd4>
 <1><fe4>: Abbrev Number: 11 (DW_TAG_variable)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x109c): ioctlent0
    <fe9>   DW_AT_decl_file   : 18
    <fea>   DW_AT_decl_line   : 1891
    <fec>   DW_AT_decl_column : 30
    <fed>   DW_AT_type        : <0xfdf>
    <ff1>   DW_AT_external    : 1
    <ff2>   DW_AT_declaration : 1
 <1><ff3>: Abbrev Number: 11 (DW_TAG_variable)
    <ff4>   DW_AT_name        : (indirect string, offset: 0xf92): personality_names
    <ff8>   DW_AT_decl_file   : 18
    <ff9>   DW_AT_decl_line   : 1893
    <ffb>   DW_AT_decl_column : 26
    <ffc>   DW_AT_type        : <0x45b>
    <1000>   DW_AT_external    : 1
    <1001>   DW_AT_declaration : 1
 <1><1002>: Abbrev Number: 11 (DW_TAG_variable)
    <1003>   DW_AT_name        : (indirect string, offset: 0x885): sysent
    <1007>   DW_AT_decl_file   : 18
    <1008>   DW_AT_decl_line   : 1896
    <100a>   DW_AT_decl_column : 29
    <100b>   DW_AT_type        : <0x9be>
    <100f>   DW_AT_external    : 1
    <1010>   DW_AT_declaration : 1
 <1><1011>: Abbrev Number: 11 (DW_TAG_variable)
    <1012>   DW_AT_name        : (indirect string, offset: 0xc60): ioctlent
    <1016>   DW_AT_decl_file   : 18
    <1017>   DW_AT_decl_line   : 1897
    <1019>   DW_AT_decl_column : 31
    <101a>   DW_AT_type        : <0x1020>
    <101e>   DW_AT_external    : 1
    <101f>   DW_AT_declaration : 1
 <1><1020>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1021>   DW_AT_byte_size   : 4
    <1022>   DW_AT_type        : <0x8d9>
 <1><1026>: Abbrev Number: 11 (DW_TAG_variable)
    <1027>   DW_AT_name        : (indirect string, offset: 0x86f): nsyscalls
    <102b>   DW_AT_decl_file   : 18
    <102c>   DW_AT_decl_line   : 1903
    <102e>   DW_AT_decl_column : 17
    <102f>   DW_AT_type        : <0x2b>
    <1033>   DW_AT_external    : 1
    <1034>   DW_AT_declaration : 1
 <1><1035>: Abbrev Number: 11 (DW_TAG_variable)
    <1036>   DW_AT_name        : (indirect string, offset: 0xe7a): nioctlents
    <103a>   DW_AT_decl_file   : 18
    <103b>   DW_AT_decl_line   : 1904
    <103d>   DW_AT_decl_column : 17
    <103e>   DW_AT_type        : <0x2b>
    <1042>   DW_AT_external    : 1
    <1043>   DW_AT_declaration : 1
 <1><1044>: Abbrev Number: 16 (DW_TAG_array_type)
    <1045>   DW_AT_type        : <0x32>
    <1049>   DW_AT_sibling     : <0x1054>
 <2><104d>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <104e>   DW_AT_type        : <0x2b>
    <1052>   DW_AT_upper_bound : 2
 <2><1053>: Abbrev Number: 0
 <1><1054>: Abbrev Number: 3 (DW_TAG_const_type)
    <1055>   DW_AT_type        : <0x1044>
 <1><1059>: Abbrev Number: 11 (DW_TAG_variable)
    <105a>   DW_AT_name        : (indirect string, offset: 0xeef): nsyscall_vec
    <105e>   DW_AT_decl_file   : 18
    <105f>   DW_AT_decl_line   : 1906
    <1061>   DW_AT_decl_column : 27
    <1062>   DW_AT_type        : <0x1054>
    <1066>   DW_AT_external    : 1
    <1067>   DW_AT_declaration : 1
 <1><1068>: Abbrev Number: 16 (DW_TAG_array_type)
    <1069>   DW_AT_type        : <0x9c4>
    <106d>   DW_AT_sibling     : <0x1078>
 <2><1071>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1072>   DW_AT_type        : <0x2b>
    <1076>   DW_AT_upper_bound : 2
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 3 (DW_TAG_const_type)
    <1079>   DW_AT_type        : <0x1068>
 <1><107d>: Abbrev Number: 11 (DW_TAG_variable)
    <107e>   DW_AT_name        : (indirect string, offset: 0x7ac): sysent_vec
    <1082>   DW_AT_decl_file   : 18
    <1083>   DW_AT_decl_line   : 1907
    <1085>   DW_AT_decl_column : 35
    <1086>   DW_AT_type        : <0x1078>
    <108a>   DW_AT_external    : 1
    <108b>   DW_AT_declaration : 1
 <1><108c>: Abbrev Number: 11 (DW_TAG_variable)
    <108d>   DW_AT_name        : (indirect string, offset: 0x387): inject_vec
    <1091>   DW_AT_decl_file   : 18
    <1092>   DW_AT_decl_line   : 1908
    <1094>   DW_AT_decl_column : 28
    <1095>   DW_AT_type        : <0x9c9>
    <1099>   DW_AT_external    : 1
    <109a>   DW_AT_declaration : 1
 <1><109b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <109c>   DW_AT_name        : (indirect string, offset: 0xd4e): audit_arch_t
    <10a0>   DW_AT_byte_size   : 8
    <10a1>   DW_AT_decl_file   : 18
    <10a2>   DW_AT_decl_line   : 1910
    <10a4>   DW_AT_decl_column : 8
    <10a5>   DW_AT_sibling     : <0x10ca>
 <2><10a9>: Abbrev Number: 23 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x622): arch
    <10ae>   DW_AT_decl_file   : 18
    <10af>   DW_AT_decl_line   : 1911
    <10b1>   DW_AT_decl_column : 15
    <10b2>   DW_AT_type        : <0x2b>
    <10b6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b9>: Abbrev Number: 23 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x9d1): flag
    <10be>   DW_AT_decl_file   : 18
    <10bf>   DW_AT_decl_line   : 1912
    <10c1>   DW_AT_decl_column : 15
    <10c2>   DW_AT_type        : <0x2b>
    <10c6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c9>: Abbrev Number: 0
 <1><10ca>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cb>   DW_AT_type        : <0x109b>
 <1><10cf>: Abbrev Number: 16 (DW_TAG_array_type)
    <10d0>   DW_AT_type        : <0x10ca>
    <10d4>   DW_AT_sibling     : <0x10df>
 <2><10d8>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <10d9>   DW_AT_type        : <0x2b>
    <10dd>   DW_AT_upper_bound : 2
 <2><10de>: Abbrev Number: 0
 <1><10df>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e0>   DW_AT_type        : <0x10cf>
 <1><10e4>: Abbrev Number: 11 (DW_TAG_variable)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x94f): audit_arch_vec
    <10e9>   DW_AT_decl_file   : 18
    <10ea>   DW_AT_decl_line   : 1915
    <10ec>   DW_AT_decl_column : 34
    <10ed>   DW_AT_type        : <0x10df>
    <10f1>   DW_AT_external    : 1
    <10f2>   DW_AT_declaration : 1
 <1><10f3>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f4>   DW_AT_byte_size   : 180
    <10f5>   DW_AT_decl_file   : 20
    <10f6>   DW_AT_decl_line   : 2
    <10f7>   DW_AT_decl_column : 9
    <10f8>   DW_AT_sibling     : <0x13ad>
 <2><10fc>: Abbrev Number: 9 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0x1de): block_ioctl
    <1101>   DW_AT_decl_file   : 20
    <1102>   DW_AT_decl_line   : 3
    <1103>   DW_AT_decl_column : 8
    <1104>   DW_AT_type        : <0x13c7>
    <1108>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110b>: Abbrev Number: 9 (DW_TAG_member)
    <110c>   DW_AT_name        : (indirect string, offset: 0xa9c): btrfs_ioctl
    <1110>   DW_AT_decl_file   : 20
    <1111>   DW_AT_decl_line   : 6
    <1112>   DW_AT_decl_column : 8
    <1113>   DW_AT_type        : <0x13c7>
    <1117>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111a>: Abbrev Number: 9 (DW_TAG_member)
    <111b>   DW_AT_name        : (indirect string, offset: 0x74a): evdev_write_ioctl_mpers
    <111f>   DW_AT_decl_file   : 20
    <1120>   DW_AT_decl_line   : 9
    <1121>   DW_AT_decl_column : 8
    <1122>   DW_AT_type        : <0x13c7>
    <1126>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1129>: Abbrev Number: 9 (DW_TAG_member)
    <112a>   DW_AT_name        : (indirect string, offset: 0x720): get_sock_fprog_size
    <112e>   DW_AT_decl_file   : 20
    <112f>   DW_AT_decl_line   : 12
    <1130>   DW_AT_decl_column : 17
    <1131>   DW_AT_type        : <0x13d3>
    <1135>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1138>: Abbrev Number: 9 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0x1ad): fetch_bpf_fprog
    <113d>   DW_AT_decl_file   : 20
    <113e>   DW_AT_decl_line   : 15
    <113f>   DW_AT_decl_column : 10
    <1140>   DW_AT_type        : <0x13f3>
    <1144>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1147>: Abbrev Number: 9 (DW_TAG_member)
    <1148>   DW_AT_name        : (indirect string, offset: 0x93c): fetch_struct_flock
    <114c>   DW_AT_decl_file   : 20
    <114d>   DW_AT_decl_line   : 18
    <114e>   DW_AT_decl_column : 10
    <114f>   DW_AT_type        : <0x13f3>
    <1153>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1156>: Abbrev Number: 9 (DW_TAG_member)
    <1157>   DW_AT_name        : (indirect string, offset: 0xc74): fetch_struct_flock64
    <115b>   DW_AT_decl_file   : 20
    <115c>   DW_AT_decl_line   : 21
    <115d>   DW_AT_decl_column : 10
