Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1749 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x50c): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x114): mpers-mx32/struct_statfs64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa46): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3da): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x101b): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x99d): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe03): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4a9): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8a3): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xeec): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8d3): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7ae): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb8d): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbc3): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd0f): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 6 (DW_TAG_array_type)
    <bb>   DW_AT_type        : <0x64>
    <bf>   DW_AT_sibling     : <0xca>
 <2><c3>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c4>   DW_AT_type        : <0x2b>
    <c8>   DW_AT_upper_bound : 1
 <2><c9>: Abbrev Number: 0
 <1><ca>: Abbrev Number: 4 (DW_TAG_typedef)
    <cb>   DW_AT_name        : (indirect string, offset: 0xc84): __time_t
    <cf>   DW_AT_decl_file   : 1
    <d0>   DW_AT_decl_line   : 160
    <d1>   DW_AT_decl_column : 26
    <d2>   DW_AT_type        : <0x7c>
 <1><d6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d7>   DW_AT_byte_size   : 4
 <1><d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <d9>   DW_AT_type        : <0xd6>
 <1><dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <de>   DW_AT_name        : (indirect string, offset: 0x426): __syscall_slong_t
    <e2>   DW_AT_decl_file   : 1
    <e3>   DW_AT_decl_line   : 196
    <e4>   DW_AT_decl_column : 33
    <e5>   DW_AT_type        : <0x7c>
 <1><e9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ea>   DW_AT_byte_size   : 4
    <eb>   DW_AT_type        : <0xef>
 <1><ef>: Abbrev Number: 2 (DW_TAG_base_type)
    <f0>   DW_AT_byte_size   : 1
    <f1>   DW_AT_encoding    : 6	(signed char)
    <f2>   DW_AT_name        : (indirect string, offset: 0x472): char
 <1><f6>: Abbrev Number: 3 (DW_TAG_const_type)
    <f7>   DW_AT_type        : <0xef>
 <1><fb>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc>   DW_AT_name        : (indirect string, offset: 0x383): uint8_t
    <100>   DW_AT_decl_file   : 2
    <101>   DW_AT_decl_line   : 24
    <102>   DW_AT_decl_column : 19
    <103>   DW_AT_type        : <0x45>
 <1><107>: Abbrev Number: 4 (DW_TAG_typedef)
    <108>   DW_AT_name        : (indirect string, offset: 0xbae): uint16_t
    <10c>   DW_AT_decl_file   : 2
    <10d>   DW_AT_decl_line   : 25
    <10e>   DW_AT_decl_column : 20
    <10f>   DW_AT_type        : <0x58>
 <1><113>: Abbrev Number: 4 (DW_TAG_typedef)
    <114>   DW_AT_name        : (indirect string, offset: 0xf94): uint32_t
    <118>   DW_AT_decl_file   : 2
    <119>   DW_AT_decl_line   : 26
    <11a>   DW_AT_decl_column : 20
    <11b>   DW_AT_type        : <0x70>
 <1><11f>: Abbrev Number: 4 (DW_TAG_typedef)
    <120>   DW_AT_name        : (indirect string, offset: 0xe13): uint64_t
    <124>   DW_AT_decl_file   : 2
    <125>   DW_AT_decl_line   : 27
    <126>   DW_AT_decl_column : 20
    <127>   DW_AT_type        : <0x8f>
 <1><12b>: Abbrev Number: 2 (DW_TAG_base_type)
    <12c>   DW_AT_byte_size   : 4
    <12d>   DW_AT_encoding    : 5	(signed)
    <12e>   DW_AT_name        : (indirect string, offset: 0x2f3): long int
 <1><132>: Abbrev Number: 4 (DW_TAG_typedef)
    <133>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <137>   DW_AT_decl_file   : 3
    <138>   DW_AT_decl_line   : 209
    <139>   DW_AT_decl_column : 23
    <13a>   DW_AT_type        : <0x2b>
 <1><13e>: Abbrev Number: 3 (DW_TAG_const_type)
    <13f>   DW_AT_type        : <0x132>
 <1><143>: Abbrev Number: 10 (DW_TAG_structure_type)
    <144>   DW_AT_name        : (indirect string, offset: 0xb24): timespec
    <148>   DW_AT_byte_size   : 16
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 10
    <14b>   DW_AT_decl_column : 8
    <14c>   DW_AT_sibling     : <0x16f>
 <2><150>: Abbrev Number: 11 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x10e8): tv_sec
    <155>   DW_AT_decl_file   : 4
    <156>   DW_AT_decl_line   : 12
    <157>   DW_AT_decl_column : 12
    <158>   DW_AT_type        : <0xca>
    <15c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15f>: Abbrev Number: 11 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xe39): tv_nsec
    <164>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 16
    <166>   DW_AT_decl_column : 21
    <167>   DW_AT_type        : <0xdd>
    <16b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 16
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xae6): long double
 <1><176>: Abbrev Number: 12 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x2aa): __environ
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 543
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x185>
    <183>   DW_AT_external    : 1
    <184>   DW_AT_declaration : 1
 <1><185>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 4
    <187>   DW_AT_type        : <0xe9>
 <1><18b>: Abbrev Number: 12 (DW_TAG_variable)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3d2): environ
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 545
    <193>   DW_AT_decl_column : 15
    <194>   DW_AT_type        : <0x185>
    <198>   DW_AT_external    : 1
    <199>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 13 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0xff4): optarg
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 36
    <1a1>   DW_AT_decl_column : 14
    <1a2>   DW_AT_type        : <0xe9>
    <1a6>   DW_AT_external    : 1
    <1a7>   DW_AT_declaration : 1
 <1><1a8>: Abbrev Number: 13 (DW_TAG_variable)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x781): optind
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 50
    <1af>   DW_AT_decl_column : 12
    <1b0>   DW_AT_type        : <0x64>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 13 (DW_TAG_variable)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xc73): opterr
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 55
    <1bd>   DW_AT_decl_column : 12
    <1be>   DW_AT_type        : <0x64>
    <1c2>   DW_AT_external    : 1
    <1c3>   DW_AT_declaration : 1
 <1><1c4>: Abbrev Number: 13 (DW_TAG_variable)
    <1c5>   DW_AT_name        : (indirect string, offset: 0xb73): optopt
    <1c9>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 59
    <1cb>   DW_AT_decl_column : 12
    <1cc>   DW_AT_type        : <0x64>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1d3>   DW_AT_byte_size   : 4
    <1d4>   DW_AT_type        : <0xf6>
 <1><1d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d9>   DW_AT_type        : <0x1d2>
 <1><1dd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1e4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x38b): _IO_FILE
    <1e9>   DW_AT_byte_size   : 152
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 49
    <1ec>   DW_AT_decl_column : 8
    <1ed>   DW_AT_sibling     : <0x3a5>
 <2><1f1>: Abbrev Number: 11 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0xa22): _flags
    <1f6>   DW_AT_decl_file   : 7
    <1f7>   DW_AT_decl_line   : 51
    <1f8>   DW_AT_decl_column : 7
    <1f9>   DW_AT_type        : <0x64>
    <1fd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><200>: Abbrev Number: 11 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x4ff): _IO_read_ptr
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 54
    <207>   DW_AT_decl_column : 9
    <208>   DW_AT_type        : <0xe9>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20f>: Abbrev Number: 11 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0xf41): _IO_read_end
    <214>   DW_AT_decl_file   : 7
    <215>   DW_AT_decl_line   : 55
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xe9>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21e>: Abbrev Number: 11 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x7ea): _IO_read_base
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xe9>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><22d>: Abbrev Number: 11 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x148): _IO_write_base
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 57
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xe9>
    <239>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23c>: Abbrev Number: 11 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x1054): _IO_write_ptr
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 58
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xe9>
    <248>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24b>: Abbrev Number: 11 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x915): _IO_write_end
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 59
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xe9>
    <257>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25a>: Abbrev Number: 11 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x986): _IO_buf_base
    <25f>   DW_AT_decl_file   : 7
    <260>   DW_AT_decl_line   : 60
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xe9>
    <266>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><269>: Abbrev Number: 11 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xda7): _IO_buf_end
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 61
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xe9>
    <275>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><278>: Abbrev Number: 11 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x1f3): _IO_save_base
    <27d>   DW_AT_decl_file   : 7
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xe9>
    <284>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><287>: Abbrev Number: 11 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xcd6): _IO_backup_base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 65
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xe9>
    <293>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><296>: Abbrev Number: 11 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 66
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xe9>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a5>: Abbrev Number: 11 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x62d): _markers
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 68
    <2ac>   DW_AT_decl_column : 22
    <2ad>   DW_AT_type        : <0x3bf>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b4>: Abbrev Number: 11 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x236): _chain
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 70
    <2bb>   DW_AT_decl_column : 20
    <2bc>   DW_AT_type        : <0x3c5>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c3>: Abbrev Number: 11 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0xfba): _fileno
    <2c8>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 72
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x64>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d2>: Abbrev Number: 11 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x7d6): _flags2
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 73
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e1>: Abbrev Number: 11 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x84f): _old_offset
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 74
    <2e8>   DW_AT_decl_column : 11
    <2e9>   DW_AT_type        : <0xa2>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f0>: Abbrev Number: 11 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x264): _cur_column
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 77
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x24>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ff>: Abbrev Number: 11 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xe5f): _vtable_offset
    <304>   DW_AT_decl_file   : 7
    <305>   DW_AT_decl_line   : 78
    <306>   DW_AT_decl_column : 15
    <307>   DW_AT_type        : <0x3e>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30e>: Abbrev Number: 11 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xce6): _shortbuf
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 79
    <315>   DW_AT_decl_column : 8
    <316>   DW_AT_type        : <0x3cb>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><31d>: Abbrev Number: 11 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x19b): _lock
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 81
    <324>   DW_AT_decl_column : 15
    <325>   DW_AT_type        : <0x3db>
    <329>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><32c>: Abbrev Number: 11 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x719): _offset
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 89
    <333>   DW_AT_decl_column : 13
    <334>   DW_AT_type        : <0xae>
    <338>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><33b>: Abbrev Number: 11 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xa78): _codecvt
    <340>   DW_AT_decl_file   : 7
    <341>   DW_AT_decl_line   : 91
    <342>   DW_AT_decl_column : 23
    <343>   DW_AT_type        : <0x3e7>
    <347>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><34a>: Abbrev Number: 11 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xfd8): _wide_data
    <34f>   DW_AT_decl_file   : 7
    <350>   DW_AT_decl_line   : 92
    <351>   DW_AT_decl_column : 25
    <352>   DW_AT_type        : <0x3f3>
    <356>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><359>: Abbrev Number: 11 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x3f6): _freeres_list
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 93
    <360>   DW_AT_decl_column : 20
    <361>   DW_AT_type        : <0x3c5>
    <365>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><368>: Abbrev Number: 11 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xc49): _freeres_buf
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 94
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_type        : <0xd6>
    <374>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><377>: Abbrev Number: 11 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x9db): __pad5
    <37c>   DW_AT_decl_file   : 7
    <37d>   DW_AT_decl_line   : 95
    <37e>   DW_AT_decl_column : 10
    <37f>   DW_AT_type        : <0x132>
    <383>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><386>: Abbrev Number: 11 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x291): _mode
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 96
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x64>
    <392>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><395>: Abbrev Number: 11 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x804): _unused2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 98
    <39c>   DW_AT_decl_column : 8
    <39d>   DW_AT_type        : <0x3f9>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xb06): FILE
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 7
    <3ac>   DW_AT_decl_column : 25
    <3ad>   DW_AT_type        : <0x1e4>
 <1><3b1>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x49e): _IO_lock_t
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 43
    <3b8>   DW_AT_decl_column : 14
 <1><3b9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x335): _IO_marker
    <3be>   DW_AT_declaration : 1
 <1><3bf>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c1>   DW_AT_type        : <0x3b9>
 <1><3c5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c6>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x1e4>
 <1><3cb>: Abbrev Number: 6 (DW_TAG_array_type)
    <3cc>   DW_AT_type        : <0xef>
    <3d0>   DW_AT_sibling     : <0x3db>
 <2><3d4>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3d5>   DW_AT_type        : <0x2b>
    <3d9>   DW_AT_upper_bound : 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3b1>
 <1><3e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3e6>   DW_AT_declaration : 1
 <1><3e7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3e8>   DW_AT_byte_size   : 4
    <3e9>   DW_AT_type        : <0x3e1>
 <1><3ed>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x39f): _IO_wide_data
    <3f2>   DW_AT_declaration : 1
 <1><3f3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3f4>   DW_AT_byte_size   : 4
    <3f5>   DW_AT_type        : <0x3ed>
 <1><3f9>: Abbrev Number: 6 (DW_TAG_array_type)
    <3fa>   DW_AT_type        : <0xef>
    <3fe>   DW_AT_sibling     : <0x409>
 <2><402>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <403>   DW_AT_type        : <0x2b>
    <407>   DW_AT_upper_bound : 39
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 13 (DW_TAG_variable)
    <40a>   DW_AT_name        : (indirect string, offset: 0x5e4): stdin
    <40e>   DW_AT_decl_file   : 9
    <40f>   DW_AT_decl_line   : 137
    <410>   DW_AT_decl_column : 14
    <411>   DW_AT_type        : <0x417>
    <415>   DW_AT_external    : 1
    <416>   DW_AT_declaration : 1
 <1><417>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <418>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3a5>
 <1><41d>: Abbrev Number: 13 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x102e): stdout
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 138
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x417>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 13 (DW_TAG_variable)
    <42c>   DW_AT_name        : (indirect string, offset: 0xdfc): stderr
    <430>   DW_AT_decl_file   : 9
    <431>   DW_AT_decl_line   : 139
    <432>   DW_AT_decl_column : 14
    <433>   DW_AT_type        : <0x417>
    <437>   DW_AT_external    : 1
    <438>   DW_AT_declaration : 1
 <1><439>: Abbrev Number: 13 (DW_TAG_variable)
    <43a>   DW_AT_name        : (indirect string, offset: 0x276): sys_nerr
    <43e>   DW_AT_decl_file   : 10
    <43f>   DW_AT_decl_line   : 26
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0x64>
    <445>   DW_AT_external    : 1
    <446>   DW_AT_declaration : 1
 <1><447>: Abbrev Number: 6 (DW_TAG_array_type)
    <448>   DW_AT_type        : <0x1d8>
    <44c>   DW_AT_sibling     : <0x452>
 <2><450>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 3 (DW_TAG_const_type)
    <453>   DW_AT_type        : <0x447>
 <1><457>: Abbrev Number: 13 (DW_TAG_variable)
    <458>   DW_AT_name        : (indirect string, offset: 0x5f3): sys_errlist
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 27
    <45e>   DW_AT_decl_column : 26
    <45f>   DW_AT_type        : <0x452>
    <463>   DW_AT_external    : 1
    <464>   DW_AT_declaration : 1
 <1><465>: Abbrev Number: 13 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x297): _sys_nerr
    <46a>   DW_AT_decl_file   : 10
    <46b>   DW_AT_decl_line   : 30
    <46c>   DW_AT_decl_column : 12
    <46d>   DW_AT_type        : <0x64>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 13 (DW_TAG_variable)
    <474>   DW_AT_name        : (indirect string, offset: 0xe7e): _sys_errlist
    <478>   DW_AT_decl_file   : 10
    <479>   DW_AT_decl_line   : 31
    <47a>   DW_AT_decl_column : 26
    <47b>   DW_AT_type        : <0x452>
    <47f>   DW_AT_external    : 1
    <480>   DW_AT_declaration : 1
 <1><481>: Abbrev Number: 13 (DW_TAG_variable)
    <482>   DW_AT_name        : (indirect string, offset: 0x6f2): program_invocation_name
    <486>   DW_AT_decl_file   : 11
    <487>   DW_AT_decl_line   : 45
    <488>   DW_AT_decl_column : 14
    <489>   DW_AT_type        : <0xe9>
    <48d>   DW_AT_external    : 1
    <48e>   DW_AT_declaration : 1
 <1><48f>: Abbrev Number: 13 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0xbee): program_invocation_short_name
    <494>   DW_AT_decl_file   : 11
    <495>   DW_AT_decl_line   : 46
    <496>   DW_AT_decl_column : 14
    <497>   DW_AT_type        : <0xe9>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 6 (DW_TAG_array_type)
    <49e>   DW_AT_type        : <0xe9>
    <4a2>   DW_AT_sibling     : <0x4ad>
 <2><4a6>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4a7>   DW_AT_type        : <0x2b>
    <4ab>   DW_AT_upper_bound : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 13 (DW_TAG_variable)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1e0): __tzname
    <4b2>   DW_AT_decl_file   : 12
    <4b3>   DW_AT_decl_line   : 159
    <4b4>   DW_AT_decl_column : 14
    <4b5>   DW_AT_type        : <0x49d>
    <4b9>   DW_AT_external    : 1
    <4ba>   DW_AT_declaration : 1
 <1><4bb>: Abbrev Number: 13 (DW_TAG_variable)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xed3): __daylight
    <4c0>   DW_AT_decl_file   : 12
    <4c1>   DW_AT_decl_line   : 160
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x64>
    <4c7>   DW_AT_external    : 1
    <4c8>   DW_AT_declaration : 1
 <1><4c9>: Abbrev Number: 13 (DW_TAG_variable)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x394): __timezone
    <4ce>   DW_AT_decl_file   : 12
    <4cf>   DW_AT_decl_line   : 161
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x12b>
    <4d5>   DW_AT_external    : 1
    <4d6>   DW_AT_declaration : 1
 <1><4d7>: Abbrev Number: 13 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0x9d4): tzname
    <4dc>   DW_AT_decl_file   : 12
    <4dd>   DW_AT_decl_line   : 166
    <4de>   DW_AT_decl_column : 14
    <4df>   DW_AT_type        : <0x49d>
    <4e3>   DW_AT_external    : 1
    <4e4>   DW_AT_declaration : 1
 <1><4e5>: Abbrev Number: 13 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x109e): daylight
    <4ea>   DW_AT_decl_file   : 12
    <4eb>   DW_AT_decl_line   : 174
    <4ec>   DW_AT_decl_column : 12
    <4ed>   DW_AT_type        : <0x64>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 13 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x4e3): timezone
    <4f8>   DW_AT_decl_file   : 12
    <4f9>   DW_AT_decl_line   : 175
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x12b>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 12 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0xf68): getdate_err
    <506>   DW_AT_decl_file   : 12
    <507>   DW_AT_decl_line   : 274
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0x64>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 13 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0x9e7): debug_flag
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 20
    <517>   DW_AT_decl_column : 13
    <518>   DW_AT_type        : <0x51e>
    <51c>   DW_AT_external    : 1
    <51d>   DW_AT_declaration : 1
 <1><51e>: Abbrev Number: 2 (DW_TAG_base_type)
    <51f>   DW_AT_byte_size   : 1
    <520>   DW_AT_encoding    : 2	(boolean)
    <521>   DW_AT_name        : (indirect string, offset: 0x438): _Bool
 <1><525>: Abbrev Number: 3 (DW_TAG_const_type)
    <526>   DW_AT_type        : <0x51e>
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0xabc): __kernel_long_t
    <52f>   DW_AT_decl_file   : 14
    <530>   DW_AT_decl_line   : 14
    <531>   DW_AT_decl_column : 19
    <532>   DW_AT_type        : <0x88>
 <1><536>: Abbrev Number: 4 (DW_TAG_typedef)
    <537>   DW_AT_name        : (indirect string, offset: 0x5d3): __kernel_ulong_t
    <53b>   DW_AT_decl_file   : 14
    <53c>   DW_AT_decl_line   : 15
    <53d>   DW_AT_decl_column : 28
    <53e>   DW_AT_type        : <0x9b>
 <1><542>: Abbrev Number: 18 (DW_TAG_structure_type)
    <543>   DW_AT_byte_size   : 8
    <544>   DW_AT_decl_file   : 15
    <545>   DW_AT_decl_line   : 79
    <546>   DW_AT_decl_column : 9
    <547>   DW_AT_sibling     : <0x55b>
 <2><54b>: Abbrev Number: 19 (DW_TAG_member)
    <54c>   DW_AT_name        : val
    <550>   DW_AT_decl_file   : 15
    <551>   DW_AT_decl_line   : 80
    <552>   DW_AT_decl_column : 6
    <553>   DW_AT_type        : <0xba>
    <557>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><55a>: Abbrev Number: 0
 <1><55b>: Abbrev Number: 4 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xe6e): __kernel_fsid_t
    <560>   DW_AT_decl_file   : 15
    <561>   DW_AT_decl_line   : 81
    <562>   DW_AT_decl_column : 3
    <563>   DW_AT_type        : <0x542>
 <1><567>: Abbrev Number: 4 (DW_TAG_typedef)
    <568>   DW_AT_name        : (indirect string, offset: 0x404): kernel_long_t
    <56c>   DW_AT_decl_file   : 16
    <56d>   DW_AT_decl_line   : 16
    <56e>   DW_AT_decl_column : 25
    <56f>   DW_AT_type        : <0x52a>
 <1><573>: Abbrev Number: 4 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x8c4): kernel_ulong_t
    <578>   DW_AT_decl_file   : 16
    <579>   DW_AT_decl_line   : 17
    <57a>   DW_AT_decl_column : 26
    <57b>   DW_AT_type        : <0x536>
 <1><57f>: Abbrev Number: 3 (DW_TAG_const_type)
    <580>   DW_AT_type        : <0x573>
 <1><584>: Abbrev Number: 10 (DW_TAG_structure_type)
    <585>   DW_AT_name        : (indirect string, offset: 0xc0c): list_item
    <589>   DW_AT_byte_size   : 8
    <58a>   DW_AT_decl_file   : 17
    <58b>   DW_AT_decl_line   : 92
    <58c>   DW_AT_decl_column : 8
    <58d>   DW_AT_sibling     : <0x5b0>
 <2><591>: Abbrev Number: 11 (DW_TAG_member)
    <592>   DW_AT_name        : (indirect string, offset: 0x10e3): prev
    <596>   DW_AT_decl_file   : 17
    <597>   DW_AT_decl_line   : 93
    <598>   DW_AT_decl_column : 20
    <599>   DW_AT_type        : <0x5b0>
    <59d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a0>: Abbrev Number: 11 (DW_TAG_member)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x10d9): next
    <5a5>   DW_AT_decl_file   : 17
    <5a6>   DW_AT_decl_line   : 94
    <5a7>   DW_AT_decl_column : 20
    <5a8>   DW_AT_type        : <0x5b0>
    <5ac>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5af>: Abbrev Number: 0
 <1><5b0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5b1>   DW_AT_byte_size   : 4
    <5b2>   DW_AT_type        : <0x584>
 <1><5b6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x89c): sysent
    <5bb>   DW_AT_byte_size   : 20
    <5bc>   DW_AT_decl_file   : 18
    <5bd>   DW_AT_decl_line   : 13
    <5be>   DW_AT_decl_column : 16
    <5bf>   DW_AT_sibling     : <0x60f>
 <2><5c3>: Abbrev Number: 11 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x1045): nargs
    <5c8>   DW_AT_decl_file   : 18
    <5c9>   DW_AT_decl_line   : 14
    <5ca>   DW_AT_decl_column : 11
    <5cb>   DW_AT_type        : <0x2b>
    <5cf>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d2>: Abbrev Number: 11 (DW_TAG_member)
    <5d3>   DW_AT_name        : (indirect string, offset: 0x993): sys_flags
    <5d7>   DW_AT_decl_file   : 18
    <5d8>   DW_AT_decl_line   : 15
    <5d9>   DW_AT_decl_column : 6
    <5da>   DW_AT_type        : <0x64>
    <5de>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e1>: Abbrev Number: 19 (DW_TAG_member)
    <5e2>   DW_AT_name        : sen
    <5e6>   DW_AT_decl_file   : 18
    <5e7>   DW_AT_decl_line   : 16
    <5e8>   DW_AT_decl_column : 6
    <5e9>   DW_AT_type        : <0x64>
    <5ed>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f0>: Abbrev Number: 11 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x32c): sys_func
    <5f5>   DW_AT_decl_file   : 18
    <5f6>   DW_AT_decl_line   : 17
    <5f7>   DW_AT_decl_column : 8
    <5f8>   DW_AT_type        : <0x88d>
    <5fc>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ff>: Abbrev Number: 11 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0x2a1): sys_name
    <604>   DW_AT_decl_file   : 18
    <605>   DW_AT_decl_line   : 18
    <606>   DW_AT_decl_column : 14
    <607>   DW_AT_type        : <0x1d2>
    <60b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><60e>: Abbrev Number: 0
 <1><60f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <610>   DW_AT_prototyped  : 1
    <611>   DW_AT_type        : <0x64>
    <615>   DW_AT_sibling     : <0x61f>
 <2><619>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <61a>   DW_AT_type        : <0x61f>
 <2><61e>: Abbrev Number: 0
 <1><61f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <620>   DW_AT_byte_size   : 4
    <621>   DW_AT_type        : <0x62a>
 <1><625>: Abbrev Number: 3 (DW_TAG_const_type)
    <626>   DW_AT_type        : <0x61f>
 <1><62a>: Abbrev Number: 22 (DW_TAG_structure_type)
    <62b>   DW_AT_name        : tcb
    <62f>   DW_AT_byte_size   : 304
    <631>   DW_AT_decl_file   : 19
    <632>   DW_AT_decl_line   : 262
    <634>   DW_AT_decl_column : 8
    <635>   DW_AT_sibling     : <0x88d>
 <2><639>: Abbrev Number: 23 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0x4f9): flags
    <63e>   DW_AT_decl_file   : 19
    <63f>   DW_AT_decl_line   : 263
    <641>   DW_AT_decl_column : 6
    <642>   DW_AT_type        : <0x64>
    <646>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><649>: Abbrev Number: 24 (DW_TAG_member)
    <64a>   DW_AT_name        : pid
    <64e>   DW_AT_decl_file   : 19
    <64f>   DW_AT_decl_line   : 264
    <651>   DW_AT_decl_column : 6
    <652>   DW_AT_type        : <0x64>
    <656>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><659>: Abbrev Number: 23 (DW_TAG_member)
    <65a>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <65e>   DW_AT_decl_file   : 19
    <65f>   DW_AT_decl_line   : 265
    <661>   DW_AT_decl_column : 6
    <662>   DW_AT_type        : <0x64>
    <666>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><669>: Abbrev Number: 23 (DW_TAG_member)
    <66a>   DW_AT_name        : (indirect string, offset: 0x3be): currpers
    <66e>   DW_AT_decl_file   : 19
    <66f>   DW_AT_decl_line   : 267
    <671>   DW_AT_decl_column : 15
    <672>   DW_AT_type        : <0x2b>
    <676>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><679>: Abbrev Number: 23 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0xb61): u_error
    <67e>   DW_AT_decl_file   : 19
    <67f>   DW_AT_decl_line   : 269
    <681>   DW_AT_decl_column : 16
    <682>   DW_AT_type        : <0x37>
    <686>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><689>: Abbrev Number: 23 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x1b8): scno
    <68e>   DW_AT_decl_file   : 19
    <68f>   DW_AT_decl_line   : 270
    <691>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0x573>
    <696>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><699>: Abbrev Number: 23 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0xba4): true_scno
    <69e>   DW_AT_decl_file   : 19
    <69f>   DW_AT_decl_line   : 271
    <6a1>   DW_AT_decl_column : 17
    <6a2>   DW_AT_type        : <0x573>
    <6a6>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6a9>: Abbrev Number: 23 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x1c2): u_arg
    <6ae>   DW_AT_decl_file   : 19
    <6af>   DW_AT_decl_line   : 272
    <6b1>   DW_AT_decl_column : 17
    <6b2>   DW_AT_type        : <0x9bd>
    <6b6>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6b9>: Abbrev Number: 23 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9aa): u_rval
    <6be>   DW_AT_decl_file   : 19
    <6bf>   DW_AT_decl_line   : 273
    <6c1>   DW_AT_decl_column : 16
    <6c2>   DW_AT_type        : <0x567>
    <6c6>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6c9>: Abbrev Number: 23 (DW_TAG_member)
    <6ca>   DW_AT_name        : (indirect string, offset: 0xad8): sys_func_rval
    <6ce>   DW_AT_decl_file   : 19
    <6cf>   DW_AT_decl_line   : 274
    <6d1>   DW_AT_decl_column : 6
    <6d2>   DW_AT_type        : <0x64>
    <6d6>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6d9>: Abbrev Number: 23 (DW_TAG_member)
    <6da>   DW_AT_name        : (indirect string, offset: 0xd00): curcol
    <6de>   DW_AT_decl_file   : 19
    <6df>   DW_AT_decl_line   : 275
    <6e1>   DW_AT_decl_column : 6
    <6e2>   DW_AT_type        : <0x64>
    <6e6>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6e9>: Abbrev Number: 23 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x9bc): outf
    <6ee>   DW_AT_decl_file   : 19
    <6ef>   DW_AT_decl_line   : 276
    <6f1>   DW_AT_decl_column : 8
    <6f2>   DW_AT_type        : <0x417>
    <6f6>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6f9>: Abbrev Number: 23 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xf12): staged_output_data
    <6fe>   DW_AT_decl_file   : 19
    <6ff>   DW_AT_decl_line   : 277
    <701>   DW_AT_decl_column : 29
    <702>   DW_AT_type        : <0x9d3>
    <706>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><709>: Abbrev Number: 23 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0xaa3): auxstr
    <70e>   DW_AT_decl_file   : 19
    <70f>   DW_AT_decl_line   : 279
    <711>   DW_AT_decl_column : 14
    <712>   DW_AT_type        : <0x1d2>
    <716>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><719>: Abbrev Number: 23 (DW_TAG_member)
    <71a>   DW_AT_name        : (indirect string, offset: 0x1a1): _priv_data
    <71e>   DW_AT_decl_file   : 19
    <71f>   DW_AT_decl_line   : 280
    <721>   DW_AT_decl_column : 8
    <722>   DW_AT_type        : <0xd6>
    <726>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><729>: Abbrev Number: 23 (DW_TAG_member)
    <72a>   DW_AT_name        : (indirect string, offset: 0xc39): _free_priv_data
    <72e>   DW_AT_decl_file   : 19
    <72f>   DW_AT_decl_line   : 281
    <731>   DW_AT_decl_column : 9
    <732>   DW_AT_type        : <0x9e5>
    <736>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><739>: Abbrev Number: 23 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0x1b2): s_ent
    <73e>   DW_AT_decl_file   : 19
    <73f>   DW_AT_decl_line   : 282
    <741>   DW_AT_decl_column : 23
    <742>   DW_AT_type        : <0x9eb>
    <746>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><749>: Abbrev Number: 23 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <74e>   DW_AT_decl_file   : 19
    <74f>   DW_AT_decl_line   : 285
    <751>   DW_AT_decl_column : 23
    <752>   DW_AT_type        : <0x9eb>
    <756>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><75a>: Abbrev Number: 23 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x3b3): inject_vec
    <75f>   DW_AT_decl_file   : 19
    <760>   DW_AT_decl_line   : 286
    <762>   DW_AT_decl_column : 22
    <763>   DW_AT_type        : <0x9f6>
    <767>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><76b>: Abbrev Number: 23 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x80d): stime
    <770>   DW_AT_decl_file   : 19
    <771>   DW_AT_decl_line   : 287
    <773>   DW_AT_decl_column : 18
    <774>   DW_AT_type        : <0x143>
    <778>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><77c>: Abbrev Number: 23 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x3c7): ltime
    <781>   DW_AT_decl_file   : 19
    <782>   DW_AT_decl_line   : 288
    <784>   DW_AT_decl_column : 18
    <785>   DW_AT_type        : <0x143>
    <789>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><78d>: Abbrev Number: 23 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x100c): atime
    <792>   DW_AT_decl_file   : 19
    <793>   DW_AT_decl_line   : 289
    <795>   DW_AT_decl_column : 18
    <796>   DW_AT_type        : <0x143>
    <79a>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><79e>: Abbrev Number: 23 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0x4f3): etime
    <7a3>   DW_AT_decl_file   : 19
    <7a4>   DW_AT_decl_line   : 290
    <7a6>   DW_AT_decl_column : 18
    <7a7>   DW_AT_type        : <0x143>
    <7ab>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7af>: Abbrev Number: 23 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xd64): delay_expiration_time
    <7b4>   DW_AT_decl_file   : 19
    <7b5>   DW_AT_decl_line   : 291
    <7b7>   DW_AT_decl_column : 18
    <7b8>   DW_AT_type        : <0x143>
    <7bc>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7c0>: Abbrev Number: 23 (DW_TAG_member)
    <7c1>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7c5>   DW_AT_decl_file   : 19
    <7c6>   DW_AT_decl_line   : 298
    <7c8>   DW_AT_decl_column : 15
    <7c9>   DW_AT_type        : <0x2b>
    <7cd>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7d1>: Abbrev Number: 23 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0xf4e): last_dirfd
    <7d6>   DW_AT_decl_file   : 19
    <7d7>   DW_AT_decl_line   : 301
    <7d9>   DW_AT_decl_column : 6
    <7da>   DW_AT_type        : <0x64>
    <7de>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7e2>: Abbrev Number: 23 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xf74): mmap_cache
    <7e7>   DW_AT_decl_file   : 19
    <7e8>   DW_AT_decl_line   : 304
    <7ea>   DW_AT_decl_column : 23
    <7eb>   DW_AT_type        : <0xa12>
    <7ef>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7f3>: Abbrev Number: 23 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0xb7a): wait_data_idx
    <7f8>   DW_AT_decl_file   : 19
    <7f9>   DW_AT_decl_line   : 311
    <7fb>   DW_AT_decl_column : 9
    <7fc>   DW_AT_type        : <0x132>
    <800>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><804>: Abbrev Number: 23 (DW_TAG_member)
    <805>   DW_AT_name        : (indirect string, offset: 0xaaa): delayed_wait_data
    <809>   DW_AT_decl_file   : 19
    <80a>   DW_AT_decl_line   : 313
    <80c>   DW_AT_decl_column : 24
    <80d>   DW_AT_type        : <0xa1e>
    <811>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><815>: Abbrev Number: 23 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0xb1a): wait_list
    <81a>   DW_AT_decl_file   : 19
    <81b>   DW_AT_decl_line   : 314
    <81d>   DW_AT_decl_column : 19
    <81e>   DW_AT_type        : <0x584>
    <822>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><826>: Abbrev Number: 23 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0x70a): vcpu_info_list
    <82b>   DW_AT_decl_file   : 19
    <82c>   DW_AT_decl_line   : 318
    <82e>   DW_AT_decl_column : 20
    <82f>   DW_AT_type        : <0xa2a>
    <833>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><837>: Abbrev Number: 23 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0xccb): unwind_ctx
    <83c>   DW_AT_decl_file   : 19
    <83d>   DW_AT_decl_line   : 322
    <83f>   DW_AT_decl_column : 8
    <840>   DW_AT_type        : <0xd6>
    <844>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><848>: Abbrev Number: 23 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x4d6): unwind_queue
    <84d>   DW_AT_decl_file   : 19
    <84e>   DW_AT_decl_line   : 323
    <850>   DW_AT_decl_column : 25
    <851>   DW_AT_type        : <0xa36>
    <855>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><859>: Abbrev Number: 23 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x196): comm
    <85e>   DW_AT_decl_file   : 19
    <85f>   DW_AT_decl_line   : 327
    <861>   DW_AT_decl_column : 7
    <862>   DW_AT_type        : <0xa3c>
    <866>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><86a>: Abbrev Number: 23 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x246): start_prc
    <86f>   DW_AT_decl_file   : 19
    <870>   DW_AT_decl_line   : 329
    <872>   DW_AT_decl_column : 16
    <873>   DW_AT_type        : <0x37>
    <877>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><87b>: Abbrev Number: 23 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0xfcf): pre_comm
    <880>   DW_AT_decl_file   : 19
    <881>   DW_AT_decl_line   : 330
    <883>   DW_AT_decl_column : 7
    <884>   DW_AT_type        : <0xa3c>
    <888>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><88c>: Abbrev Number: 0
 <1><88d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <88e>   DW_AT_byte_size   : 4
    <88f>   DW_AT_type        : <0x60f>
 <1><893>: Abbrev Number: 4 (DW_TAG_typedef)
    <894>   DW_AT_name        : (indirect string, offset: 0x5c5): struct_sysent
    <898>   DW_AT_decl_file   : 18
    <899>   DW_AT_decl_line   : 19
    <89a>   DW_AT_decl_column : 3
    <89b>   DW_AT_type        : <0x5b6>
 <1><89f>: Abbrev Number: 3 (DW_TAG_const_type)
    <8a0>   DW_AT_type        : <0x893>
 <1><8a4>: Abbrev Number: 13 (DW_TAG_variable)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xd50): current_personality
    <8a9>   DW_AT_decl_file   : 19
    <8aa>   DW_AT_decl_line   : 158
    <8ab>   DW_AT_decl_column : 17
    <8ac>   DW_AT_type        : <0x2b>
    <8b0>   DW_AT_external    : 1
    <8b1>   DW_AT_declaration : 1
 <1><8b2>: Abbrev Number: 13 (DW_TAG_variable)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x83e): current_wordsize
    <8b7>   DW_AT_decl_file   : 19
    <8b8>   DW_AT_decl_line   : 171
    <8b9>   DW_AT_decl_column : 17
    <8ba>   DW_AT_type        : <0x2b>
    <8be>   DW_AT_external    : 1
    <8bf>   DW_AT_declaration : 1
 <1><8c0>: Abbrev Number: 13 (DW_TAG_variable)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xa81): current_klongsize
    <8c5>   DW_AT_decl_file   : 19
    <8c6>   DW_AT_decl_line   : 176
    <8c7>   DW_AT_decl_column : 17
    <8c8>   DW_AT_type        : <0x2b>
    <8cc>   DW_AT_external    : 1
    <8cd>   DW_AT_declaration : 1
 <1><8ce>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8cf>   DW_AT_name        : (indirect string, offset: 0xca2): ioctlent
    <8d3>   DW_AT_byte_size   : 8
    <8d4>   DW_AT_decl_file   : 19
    <8d5>   DW_AT_decl_line   : 217
    <8d6>   DW_AT_decl_column : 16
    <8d7>   DW_AT_sibling     : <0x8fa>
 <2><8db>: Abbrev Number: 11 (DW_TAG_member)
    <8dc>   DW_AT_name        : (indirect string, offset: 0xf3a): symbol
    <8e0>   DW_AT_decl_file   : 19
    <8e1>   DW_AT_decl_line   : 218
    <8e2>   DW_AT_decl_column : 14
    <8e3>   DW_AT_type        : <0x1d2>
    <8e7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ea>: Abbrev Number: 11 (DW_TAG_member)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xd19): code
    <8ef>   DW_AT_decl_file   : 19
    <8f0>   DW_AT_decl_line   : 219
    <8f1>   DW_AT_decl_column : 15
    <8f2>   DW_AT_type        : <0x2b>
    <8f6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8f9>: Abbrev Number: 0
 <1><8fa>: Abbrev Number: 4 (DW_TAG_typedef)
    <8fb>   DW_AT_name        : (indirect string, offset: 0xc63): struct_ioctlent
    <8ff>   DW_AT_decl_file   : 19
    <900>   DW_AT_decl_line   : 220
    <901>   DW_AT_decl_column : 3
    <902>   DW_AT_type        : <0x8ce>
 <1><906>: Abbrev Number: 3 (DW_TAG_const_type)
    <907>   DW_AT_type        : <0x8fa>
 <1><90b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <90c>   DW_AT_name        : (indirect string, offset: 0x832): inject_data
    <910>   DW_AT_byte_size   : 10
    <911>   DW_AT_decl_file   : 19
    <912>   DW_AT_decl_line   : 241
    <913>   DW_AT_decl_column : 8
    <914>   DW_AT_sibling     : <0x973>
 <2><918>: Abbrev Number: 11 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0x4f9): flags
    <91d>   DW_AT_decl_file   : 19
    <91e>   DW_AT_decl_line   : 242
    <91f>   DW_AT_decl_column : 10
    <920>   DW_AT_type        : <0xfb>
    <924>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><927>: Abbrev Number: 11 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x947): signo
    <92c>   DW_AT_decl_file   : 19
    <92d>   DW_AT_decl_line   : 243
    <92e>   DW_AT_decl_column : 10
    <92f>   DW_AT_type        : <0xfb>
    <933>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><936>: Abbrev Number: 11 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x10b): rval_idx
    <93b>   DW_AT_decl_file   : 19
    <93c>   DW_AT_decl_line   : 244
    <93d>   DW_AT_decl_column : 11
    <93e>   DW_AT_type        : <0x107>
    <942>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><945>: Abbrev Number: 11 (DW_TAG_member)
    <946>   DW_AT_name        : (indirect string, offset: 0xcf6): delay_idx
    <94a>   DW_AT_decl_file   : 19
    <94b>   DW_AT_decl_line   : 245
    <94c>   DW_AT_decl_column : 11
    <94d>   DW_AT_type        : <0x107>
    <951>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><954>: Abbrev Number: 11 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x61f): poke_idx
    <959>   DW_AT_decl_file   : 19
    <95a>   DW_AT_decl_line   : 246
    <95b>   DW_AT_decl_column : 11
    <95c>   DW_AT_type        : <0x107>
    <960>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><963>: Abbrev Number: 11 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x1b8): scno
    <968>   DW_AT_decl_file   : 19
    <969>   DW_AT_decl_line   : 247
    <96a>   DW_AT_decl_column : 11
    <96b>   DW_AT_type        : <0x107>
    <96f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><972>: Abbrev Number: 0
 <1><973>: Abbrev Number: 10 (DW_TAG_structure_type)
    <974>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <978>   DW_AT_byte_size   : 16
    <979>   DW_AT_decl_file   : 19
    <97a>   DW_AT_decl_line   : 250
    <97b>   DW_AT_decl_column : 8
    <97c>   DW_AT_sibling     : <0x9bd>
 <2><980>: Abbrev Number: 11 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0xa40): first
    <985>   DW_AT_decl_file   : 19
    <986>   DW_AT_decl_line   : 251
    <987>   DW_AT_decl_column : 11
    <988>   DW_AT_type        : <0x107>
    <98c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><98f>: Abbrev Number: 11 (DW_TAG_member)
    <990>   DW_AT_name        : (indirect string, offset: 0x110c): last
    <994>   DW_AT_decl_file   : 19
    <995>   DW_AT_decl_line   : 252
    <996>   DW_AT_decl_column : 11
    <997>   DW_AT_type        : <0x107>
    <99b>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><99e>: Abbrev Number: 11 (DW_TAG_member)
    <99f>   DW_AT_name        : (indirect string, offset: 0x3cd): step
    <9a3>   DW_AT_decl_file   : 19
    <9a4>   DW_AT_decl_line   : 253
    <9a5>   DW_AT_decl_column : 11
    <9a6>   DW_AT_type        : <0x107>
    <9aa>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9ad>: Abbrev Number: 11 (DW_TAG_member)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x10de): data
    <9b2>   DW_AT_decl_file   : 19
    <9b3>   DW_AT_decl_line   : 254
    <9b4>   DW_AT_decl_column : 21
    <9b5>   DW_AT_type        : <0x90b>
    <9b9>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9bc>: Abbrev Number: 0
 <1><9bd>: Abbrev Number: 6 (DW_TAG_array_type)
    <9be>   DW_AT_type        : <0x573>
    <9c2>   DW_AT_sibling     : <0x9cd>
 <2><9c6>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9c7>   DW_AT_type        : <0x2b>
    <9cb>   DW_AT_upper_bound : 5
 <2><9cc>: Abbrev Number: 0
 <1><9cd>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9ce>   DW_AT_name        : (indirect string, offset: 0xf12): staged_output_data
    <9d2>   DW_AT_declaration : 1
 <1><9d3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9d4>   DW_AT_byte_size   : 4
    <9d5>   DW_AT_type        : <0x9cd>
 <1><9d9>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9da>   DW_AT_prototyped  : 1
    <9db>   DW_AT_sibling     : <0x9e5>
 <2><9df>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9e0>   DW_AT_type        : <0xd6>
 <2><9e4>: Abbrev Number: 0
 <1><9e5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x9d9>
 <1><9eb>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9ec>   DW_AT_byte_size   : 4
    <9ed>   DW_AT_type        : <0x89f>
 <1><9f1>: Abbrev Number: 3 (DW_TAG_const_type)
    <9f2>   DW_AT_type        : <0x9eb>
 <1><9f6>: Abbrev Number: 6 (DW_TAG_array_type)
    <9f7>   DW_AT_type        : <0xa06>
    <9fb>   DW_AT_sibling     : <0xa06>
 <2><9ff>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a00>   DW_AT_type        : <0x2b>
    <a04>   DW_AT_upper_bound : 2
 <2><a05>: Abbrev Number: 0
 <1><a06>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a07>   DW_AT_byte_size   : 4
    <a08>   DW_AT_type        : <0x973>
 <1><a0c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a0d>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <a11>   DW_AT_declaration : 1
 <1><a12>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a13>   DW_AT_byte_size   : 4
    <a14>   DW_AT_type        : <0xa0c>
 <1><a18>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a19>   DW_AT_name        : (indirect string, offset: 0x3e8): tcb_wait_data
    <a1d>   DW_AT_declaration : 1
 <1><a1e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a1f>   DW_AT_byte_size   : 4
    <a20>   DW_AT_type        : <0xa18>
 <1><a24>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a25>   DW_AT_name        : (indirect string, offset: 0x18c): vcpu_info
    <a29>   DW_AT_declaration : 1
 <1><a2a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a2b>   DW_AT_byte_size   : 4
    <a2c>   DW_AT_type        : <0xa24>
 <1><a30>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a31>   DW_AT_name        : (indirect string, offset: 0xef6): unwind_queue_t
    <a35>   DW_AT_declaration : 1
 <1><a36>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a37>   DW_AT_byte_size   : 4
    <a38>   DW_AT_type        : <0xa30>
 <1><a3c>: Abbrev Number: 6 (DW_TAG_array_type)
    <a3d>   DW_AT_type        : <0xef>
    <a41>   DW_AT_sibling     : <0xa4c>
 <2><a45>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a46>   DW_AT_type        : <0x2b>
    <a4a>   DW_AT_upper_bound : 15
 <2><a4b>: Abbrev Number: 0
 <1><a4c>: Abbrev Number: 12 (DW_TAG_variable)
    <a4d>   DW_AT_name        : (indirect string, offset: 0xbb7): stub_sysent
    <a51>   DW_AT_decl_file   : 19
    <a52>   DW_AT_decl_line   : 405
    <a54>   DW_AT_decl_column : 28
    <a55>   DW_AT_type        : <0x89f>
    <a59>   DW_AT_external    : 1
    <a5a>   DW_AT_declaration : 1
 <1><a5b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x10c1): xlat_type
    <a60>   DW_AT_encoding    : 7	(unsigned)
    <a61>   DW_AT_byte_size   : 4
    <a62>   DW_AT_type        : <0x2b>
    <a66>   DW_AT_decl_file   : 20
    <a67>   DW_AT_decl_line   : 13
    <a68>   DW_AT_decl_column : 6
    <a69>   DW_AT_sibling     : <0xa80>
 <2><a6d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x2fc): XT_NORMAL
    <a72>   DW_AT_const_value : 0
 <2><a73>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a74>   DW_AT_name        : (indirect string, offset: 0xc7a): XT_SORTED
    <a78>   DW_AT_const_value : 1
 <2><a79>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xddc): XT_INDEXED
    <a7e>   DW_AT_const_value : 2
 <2><a7f>: Abbrev Number: 0
 <1><a80>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a81>   DW_AT_name        : (indirect string, offset: 0xbe3): xlat_style
    <a85>   DW_AT_encoding    : 7	(unsigned)
    <a86>   DW_AT_byte_size   : 4
    <a87>   DW_AT_type        : <0x2b>
    <a8b>   DW_AT_decl_file   : 20
    <a8c>   DW_AT_decl_line   : 19
    <a8d>   DW_AT_decl_column : 6
    <a8e>   DW_AT_sibling     : <0xabd>
 <2><a92>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a93>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a97>   DW_AT_const_value : 0
 <2><a98>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a99>   DW_AT_name        : (indirect string, offset: 0xc16): XLAT_STYLE_RAW
    <a9d>   DW_AT_const_value : 1
 <2><a9e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x108c): XLAT_STYLE_ABBREV
    <aa3>   DW_AT_const_value : 2
 <2><aa4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x319): XLAT_STYLE_VERBOSE
    <aa9>   DW_AT_const_value : 3
 <2><aaa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aab>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <aaf>   DW_AT_const_value : 0
 <2><ab0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ab5>   DW_AT_const_value : 4
 <2><ab6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x10fb): XLAT_STYLE_FMT_D
    <abb>   DW_AT_const_value : 8
 <2><abc>: Abbrev Number: 0
 <1><abd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <abe>   DW_AT_name        : (indirect string, offset: 0x34a): xlat_data
    <ac2>   DW_AT_byte_size   : 16
    <ac3>   DW_AT_decl_file   : 20
    <ac4>   DW_AT_decl_line   : 51
    <ac5>   DW_AT_decl_column : 8
    <ac6>   DW_AT_sibling     : <0xae9>
 <2><aca>: Abbrev Number: 19 (DW_TAG_member)
    <acb>   DW_AT_name        : val
    <acf>   DW_AT_decl_file   : 20
    <ad0>   DW_AT_decl_line   : 52
    <ad1>   DW_AT_decl_column : 11
    <ad2>   DW_AT_type        : <0x11f>
    <ad6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad9>: Abbrev Number: 19 (DW_TAG_member)
    <ada>   DW_AT_name        : str
    <ade>   DW_AT_decl_file   : 20
    <adf>   DW_AT_decl_line   : 53
    <ae0>   DW_AT_decl_column : 14
    <ae1>   DW_AT_type        : <0x1d2>
    <ae5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ae8>: Abbrev Number: 0
 <1><ae9>: Abbrev Number: 3 (DW_TAG_const_type)
    <aea>   DW_AT_type        : <0xabd>
 <1><aee>: Abbrev Number: 10 (DW_TAG_structure_type)
    <aef>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <af3>   DW_AT_byte_size   : 24
    <af4>   DW_AT_decl_file   : 20
    <af5>   DW_AT_decl_line   : 56
    <af6>   DW_AT_decl_column : 8
    <af7>   DW_AT_sibling     : <0xb47>
 <2><afb>: Abbrev Number: 11 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x10de): data
    <b00>   DW_AT_decl_file   : 20
    <b01>   DW_AT_decl_line   : 57
    <b02>   DW_AT_decl_column : 26
    <b03>   DW_AT_type        : <0xb4c>
    <b07>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b0a>: Abbrev Number: 11 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x890): flags_strsz
    <b0f>   DW_AT_decl_file   : 20
    <b10>   DW_AT_decl_line   : 58
    <b11>   DW_AT_decl_column : 9
    <b12>   DW_AT_type        : <0x132>
    <b16>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b19>: Abbrev Number: 11 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0xb88): size
    <b1e>   DW_AT_decl_file   : 20
    <b1f>   DW_AT_decl_line   : 59
    <b20>   DW_AT_decl_column : 11
    <b21>   DW_AT_type        : <0x113>
    <b25>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b28>: Abbrev Number: 11 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0x1bd): type
    <b2d>   DW_AT_decl_file   : 20
    <b2e>   DW_AT_decl_line   : 60
    <b2f>   DW_AT_decl_column : 17
    <b30>   DW_AT_type        : <0xa5b>
    <b34>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b37>: Abbrev Number: 11 (DW_TAG_member)
    <b38>   DW_AT_name        : (indirect string, offset: 0x75e): flags_mask
    <b3c>   DW_AT_decl_file   : 20
    <b3d>   DW_AT_decl_line   : 61
    <b3e>   DW_AT_decl_column : 11
    <b3f>   DW_AT_type        : <0x11f>
    <b43>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b46>: Abbrev Number: 0
 <1><b47>: Abbrev Number: 3 (DW_TAG_const_type)
    <b48>   DW_AT_type        : <0xaee>
 <1><b4c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b4d>   DW_AT_byte_size   : 4
    <b4e>   DW_AT_type        : <0xae9>
 <1><b52>: Abbrev Number: 6 (DW_TAG_array_type)
    <b53>   DW_AT_type        : <0xb47>
    <b57>   DW_AT_sibling     : <0xb5d>
 <2><b5b>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b5c>: Abbrev Number: 0
 <1><b5d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b5e>   DW_AT_type        : <0xb52>
 <1><b62>: Abbrev Number: 12 (DW_TAG_variable)
    <b63>   DW_AT_name        : (indirect string, offset: 0xe4c): addrfams
    <b67>   DW_AT_decl_file   : 19
    <b68>   DW_AT_decl_line   : 411
    <b6a>   DW_AT_decl_column : 26
    <b6b>   DW_AT_type        : <0xb5d>
    <b6f>   DW_AT_external    : 1
    <b70>   DW_AT_declaration : 1
 <1><b71>: Abbrev Number: 12 (DW_TAG_variable)
    <b72>   DW_AT_name        : (indirect string, offset: 0xd29): arp_hardware_types
    <b76>   DW_AT_decl_file   : 19
    <b77>   DW_AT_decl_line   : 412
    <b79>   DW_AT_decl_column : 26
    <b7a>   DW_AT_type        : <0xb5d>
    <b7e>   DW_AT_external    : 1
    <b7f>   DW_AT_declaration : 1
 <1><b80>: Abbrev Number: 12 (DW_TAG_variable)
    <b81>   DW_AT_name        : (indirect string, offset: 0x1012): at_flags
    <b85>   DW_AT_decl_file   : 19
    <b86>   DW_AT_decl_line   : 413
    <b88>   DW_AT_decl_column : 26
    <b89>   DW_AT_type        : <0xb5d>
    <b8d>   DW_AT_external    : 1
    <b8e>   DW_AT_declaration : 1
 <1><b8f>: Abbrev Number: 12 (DW_TAG_variable)
    <b90>   DW_AT_name        : (indirect string, offset: 0x4b4): clocknames
    <b94>   DW_AT_decl_file   : 19
    <b95>   DW_AT_decl_line   : 414
    <b97>   DW_AT_decl_column : 26
    <b98>   DW_AT_type        : <0xb5d>
    <b9c>   DW_AT_external    : 1
    <b9d>   DW_AT_declaration : 1
 <1><b9e>: Abbrev Number: 12 (DW_TAG_variable)
    <b9f>   DW_AT_name        : (indirect string, offset: 0xfc2): dirent_types
    <ba3>   DW_AT_decl_file   : 19
    <ba4>   DW_AT_decl_line   : 415
    <ba6>   DW_AT_decl_column : 26
    <ba7>   DW_AT_type        : <0xb5d>
    <bab>   DW_AT_external    : 1
    <bac>   DW_AT_declaration : 1
 <1><bad>: Abbrev Number: 12 (DW_TAG_variable)
    <bae>   DW_AT_name        : (indirect string, offset: 0x8e1): ethernet_protocols
    <bb2>   DW_AT_decl_file   : 19
    <bb3>   DW_AT_decl_line   : 416
    <bb5>   DW_AT_decl_column : 26
    <bb6>   DW_AT_type        : <0xb5d>
    <bba>   DW_AT_external    : 1
    <bbb>   DW_AT_declaration : 1
 <1><bbc>: Abbrev Number: 12 (DW_TAG_variable)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x672): inet_protocols
    <bc1>   DW_AT_decl_file   : 19
    <bc2>   DW_AT_decl_line   : 417
    <bc4>   DW_AT_decl_column : 26
    <bc5>   DW_AT_type        : <0xb5d>
    <bc9>   DW_AT_external    : 1
    <bca>   DW_AT_declaration : 1
 <1><bcb>: Abbrev Number: 12 (DW_TAG_variable)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x2e9): evdev_abs
    <bd0>   DW_AT_decl_file   : 19
    <bd1>   DW_AT_decl_line   : 418
    <bd3>   DW_AT_decl_column : 26
    <bd4>   DW_AT_type        : <0xb5d>
    <bd8>   DW_AT_external    : 1
    <bd9>   DW_AT_declaration : 1
 <1><bda>: Abbrev Number: 12 (DW_TAG_variable)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x753): audit_arch
    <bdf>   DW_AT_decl_file   : 19
    <be0>   DW_AT_decl_line   : 419
    <be2>   DW_AT_decl_column : 26
    <be3>   DW_AT_type        : <0xb5d>
    <be7>   DW_AT_external    : 1
    <be8>   DW_AT_declaration : 1
 <1><be9>: Abbrev Number: 12 (DW_TAG_variable)
    <bea>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bee>   DW_AT_decl_file   : 19
    <bef>   DW_AT_decl_line   : 420
    <bf1>   DW_AT_decl_column : 26
    <bf2>   DW_AT_type        : <0xb5d>
    <bf6>   DW_AT_external    : 1
    <bf7>   DW_AT_declaration : 1
 <1><bf8>: Abbrev Number: 12 (DW_TAG_variable)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x495): iffflags
    <bfd>   DW_AT_decl_file   : 19
    <bfe>   DW_AT_decl_line   : 421
    <c00>   DW_AT_decl_column : 26
    <c01>   DW_AT_type        : <0xb5d>
    <c05>   DW_AT_external    : 1
    <c06>   DW_AT_declaration : 1
 <1><c07>: Abbrev Number: 12 (DW_TAG_variable)
    <c08>   DW_AT_name        : (indirect string, offset: 0xc25): ip_type_of_services
    <c0c>   DW_AT_decl_file   : 19
    <c0d>   DW_AT_decl_line   : 422
    <c0f>   DW_AT_decl_column : 26
    <c10>   DW_AT_type        : <0xb5d>
    <c14>   DW_AT_external    : 1
    <c15>   DW_AT_declaration : 1
 <1><c16>: Abbrev Number: 12 (DW_TAG_variable)
    <c17>   DW_AT_name        : (indirect string, offset: 0x6e6): ipc_private
    <c1b>   DW_AT_decl_file   : 19
    <c1c>   DW_AT_decl_line   : 423
    <c1e>   DW_AT_decl_column : 26
    <c1f>   DW_AT_type        : <0xb5d>
    <c23>   DW_AT_external    : 1
    <c24>   DW_AT_declaration : 1
 <1><c25>: Abbrev Number: 12 (DW_TAG_variable)
    <c26>   DW_AT_name        : (indirect string, offset: 0x340): msg_flags
    <c2a>   DW_AT_decl_file   : 19
    <c2b>   DW_AT_decl_line   : 424
    <c2d>   DW_AT_decl_column : 26
    <c2e>   DW_AT_type        : <0xb5d>
    <c32>   DW_AT_external    : 1
    <c33>   DW_AT_declaration : 1
 <1><c34>: Abbrev Number: 12 (DW_TAG_variable)
    <c35>   DW_AT_name        : (indirect string, offset: 0x17a): netlink_protocols
    <c39>   DW_AT_decl_file   : 19
    <c3a>   DW_AT_decl_line   : 425
    <c3c>   DW_AT_decl_column : 26
    <c3d>   DW_AT_type        : <0xb5d>
    <c41>   DW_AT_external    : 1
    <c42>   DW_AT_declaration : 1
 <1><c43>: Abbrev Number: 12 (DW_TAG_variable)
    <c44>   DW_AT_name        : (indirect string, offset: 0xf25): nl_bridge_vlan_flags
    <c48>   DW_AT_decl_file   : 19
    <c49>   DW_AT_decl_line   : 426
    <c4b>   DW_AT_decl_column : 26
    <c4c>   DW_AT_type        : <0xb5d>
    <c50>   DW_AT_external    : 1
    <c51>   DW_AT_declaration : 1
 <1><c52>: Abbrev Number: 12 (DW_TAG_variable)
    <c53>   DW_AT_name        : (indirect string, offset: 0xdc5): nl_netfilter_msg_types
    <c57>   DW_AT_decl_file   : 19
    <c58>   DW_AT_decl_line   : 427
    <c5a>   DW_AT_decl_column : 26
    <c5b>   DW_AT_type        : <0xb5d>
    <c5f>   DW_AT_external    : 1
    <c60>   DW_AT_declaration : 1
 <1><c61>: Abbrev Number: 12 (DW_TAG_variable)
    <c62>   DW_AT_name        : (indirect string, offset: 0x477): nl_route_types
    <c66>   DW_AT_decl_file   : 19
    <c67>   DW_AT_decl_line   : 428
    <c69>   DW_AT_decl_column : 26
    <c6a>   DW_AT_type        : <0xb5d>
    <c6e>   DW_AT_external    : 1
    <c6f>   DW_AT_declaration : 1
 <1><c70>: Abbrev Number: 12 (DW_TAG_variable)
    <c71>   DW_AT_name        : (indirect string, offset: 0xe93): open_access_modes
    <c75>   DW_AT_decl_file   : 19
    <c76>   DW_AT_decl_line   : 429
    <c78>   DW_AT_decl_column : 26
    <c79>   DW_AT_type        : <0xb5d>
    <c7d>   DW_AT_external    : 1
    <c7e>   DW_AT_declaration : 1
 <1><c7f>: Abbrev Number: 12 (DW_TAG_variable)
    <c80>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c84>   DW_AT_decl_file   : 19
    <c85>   DW_AT_decl_line   : 430
    <c87>   DW_AT_decl_column : 26
    <c88>   DW_AT_type        : <0xb5d>
    <c8c>   DW_AT_external    : 1
    <c8d>   DW_AT_declaration : 1
 <1><c8e>: Abbrev Number: 12 (DW_TAG_variable)
    <c8f>   DW_AT_name        : (indirect string, offset: 0xc56): perf_type_id
    <c93>   DW_AT_decl_file   : 19
    <c94>   DW_AT_decl_line   : 431
    <c96>   DW_AT_decl_column : 26
    <c97>   DW_AT_type        : <0xb5d>
    <c9b>   DW_AT_external    : 1
    <c9c>   DW_AT_declaration : 1
 <1><c9d>: Abbrev Number: 12 (DW_TAG_variable)
    <c9e>   DW_AT_name        : (indirect string, offset: 0xe55): pollflags
    <ca2>   DW_AT_decl_file   : 19
    <ca3>   DW_AT_decl_line   : 432
    <ca5>   DW_AT_decl_column : 26
    <ca6>   DW_AT_type        : <0xb5d>
    <caa>   DW_AT_external    : 1
    <cab>   DW_AT_declaration : 1
 <1><cac>: Abbrev Number: 12 (DW_TAG_variable)
    <cad>   DW_AT_name        : (indirect string, offset: 0x613): ptrace_cmds
    <cb1>   DW_AT_decl_file   : 19
    <cb2>   DW_AT_decl_line   : 433
    <cb4>   DW_AT_decl_column : 26
    <cb5>   DW_AT_type        : <0xb5d>
    <cb9>   DW_AT_external    : 1
    <cba>   DW_AT_declaration : 1
 <1><cbb>: Abbrev Number: 12 (DW_TAG_variable)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x823): resource_flags
    <cc0>   DW_AT_decl_file   : 19
    <cc1>   DW_AT_decl_line   : 434
    <cc3>   DW_AT_decl_column : 26
    <cc4>   DW_AT_type        : <0xb5d>
    <cc8>   DW_AT_external    : 1
    <cc9>   DW_AT_declaration : 1
 <1><cca>: Abbrev Number: 12 (DW_TAG_variable)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x2bf): route_nexthop_flags
    <ccf>   DW_AT_decl_file   : 19
    <cd0>   DW_AT_decl_line   : 435
    <cd2>   DW_AT_decl_column : 26
    <cd3>   DW_AT_type        : <0xb5d>
    <cd7>   DW_AT_external    : 1
    <cd8>   DW_AT_declaration : 1
 <1><cd9>: Abbrev Number: 12 (DW_TAG_variable)
    <cda>   DW_AT_name        : (indirect string, offset: 0xeb0): routing_protocols
    <cde>   DW_AT_decl_file   : 19
    <cdf>   DW_AT_decl_line   : 436
    <ce1>   DW_AT_decl_column : 26
    <ce2>   DW_AT_type        : <0xb5d>
    <ce6>   DW_AT_external    : 1
    <ce7>   DW_AT_declaration : 1
 <1><ce8>: Abbrev Number: 12 (DW_TAG_variable)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x486): routing_scopes
    <ced>   DW_AT_decl_file   : 19
    <cee>   DW_AT_decl_line   : 437
    <cf0>   DW_AT_decl_column : 26
    <cf1>   DW_AT_type        : <0xb5d>
    <cf5>   DW_AT_external    : 1
    <cf6>   DW_AT_declaration : 1
 <1><cf7>: Abbrev Number: 12 (DW_TAG_variable)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xdb3): routing_table_ids
    <cfc>   DW_AT_decl_file   : 19
    <cfd>   DW_AT_decl_line   : 438
    <cff>   DW_AT_decl_column : 26
    <d00>   DW_AT_type        : <0xb5d>
    <d04>   DW_AT_external    : 1
    <d05>   DW_AT_declaration : 1
 <1><d06>: Abbrev Number: 12 (DW_TAG_variable)
    <d07>   DW_AT_name        : (indirect string, offset: 0x6c3): routing_types
    <d0b>   DW_AT_decl_file   : 19
    <d0c>   DW_AT_decl_line   : 439
    <d0e>   DW_AT_decl_column : 26
    <d0f>   DW_AT_type        : <0xb5d>
    <d13>   DW_AT_external    : 1
    <d14>   DW_AT_declaration : 1
 <1><d15>: Abbrev Number: 12 (DW_TAG_variable)
    <d16>   DW_AT_name        : (indirect string, offset: 0x1e9): rwf_flags
    <d1a>   DW_AT_decl_file   : 19
    <d1b>   DW_AT_decl_line   : 440
    <d1d>   DW_AT_decl_column : 26
    <d1e>   DW_AT_type        : <0xb5d>
    <d22>   DW_AT_external    : 1
    <d23>   DW_AT_declaration : 1
 <1><d24>: Abbrev Number: 12 (DW_TAG_variable)
    <d25>   DW_AT_name        : (indirect string, offset: 0x85b): seccomp_filter_flags
    <d29>   DW_AT_decl_file   : 19
    <d2a>   DW_AT_decl_line   : 441
    <d2c>   DW_AT_decl_column : 26
    <d2d>   DW_AT_type        : <0xb5d>
    <d31>   DW_AT_external    : 1
    <d32>   DW_AT_declaration : 1
 <1><d33>: Abbrev Number: 12 (DW_TAG_variable)
    <d34>   DW_AT_name        : (indirect string, offset: 0x306): seccomp_ret_action
    <d38>   DW_AT_decl_file   : 19
    <d39>   DW_AT_decl_line   : 442
    <d3b>   DW_AT_decl_column : 26
    <d3c>   DW_AT_type        : <0xb5d>
    <d40>   DW_AT_external    : 1
    <d41>   DW_AT_declaration : 1
 <1><d42>: Abbrev Number: 12 (DW_TAG_variable)
    <d43>   DW_AT_name        : (indirect string, offset: 0x452): setns_types
    <d47>   DW_AT_decl_file   : 19
    <d48>   DW_AT_decl_line   : 443
    <d4a>   DW_AT_decl_column : 26
    <d4b>   DW_AT_type        : <0xb5d>
    <d4f>   DW_AT_external    : 1
    <d50>   DW_AT_declaration : 1
 <1><d51>: Abbrev Number: 12 (DW_TAG_variable)
    <d52>   DW_AT_name        : (indirect string, offset: 0xe41): sg_io_info
    <d56>   DW_AT_decl_file   : 19
    <d57>   DW_AT_decl_line   : 444
    <d59>   DW_AT_decl_column : 26
    <d5a>   DW_AT_type        : <0xb5d>
    <d5e>   DW_AT_external    : 1
    <d5f>   DW_AT_declaration : 1
 <1><d60>: Abbrev Number: 12 (DW_TAG_variable)
    <d61>   DW_AT_name        : (indirect string, offset: 0xbcb): socketlayers
    <d65>   DW_AT_decl_file   : 19
    <d66>   DW_AT_decl_line   : 445
    <d68>   DW_AT_decl_column : 26
    <d69>   DW_AT_type        : <0xb5d>
    <d6d>   DW_AT_external    : 1
    <d6e>   DW_AT_declaration : 1
 <1><d6f>: Abbrev Number: 12 (DW_TAG_variable)
    <d70>   DW_AT_name        : (indirect string, offset: 0xd9d): socktypes
    <d74>   DW_AT_decl_file   : 19
    <d75>   DW_AT_decl_line   : 446
    <d77>   DW_AT_decl_column : 26
    <d78>   DW_AT_type        : <0xb5d>
    <d7c>   DW_AT_external    : 1
    <d7d>   DW_AT_declaration : 1
 <1><d7e>: Abbrev Number: 12 (DW_TAG_variable)
    <d7f>   DW_AT_name        : (indirect string, offset: 0xa93): tcp_state_flags
    <d83>   DW_AT_decl_file   : 19
    <d84>   DW_AT_decl_line   : 447
    <d86>   DW_AT_decl_column : 26
    <d87>   DW_AT_type        : <0xb5d>
    <d8b>   DW_AT_external    : 1
    <d8c>   DW_AT_declaration : 1
 <1><d8d>: Abbrev Number: 12 (DW_TAG_variable)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x788): tcp_states
    <d92>   DW_AT_decl_file   : 19
    <d93>   DW_AT_decl_line   : 448
    <d95>   DW_AT_decl_column : 26
    <d96>   DW_AT_type        : <0xb5d>
    <d9a>   DW_AT_external    : 1
    <d9b>   DW_AT_declaration : 1
 <1><d9c>: Abbrev Number: 12 (DW_TAG_variable)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x106f): whence_codes
    <da1>   DW_AT_decl_file   : 19
    <da2>   DW_AT_decl_line   : 449
    <da4>   DW_AT_decl_column : 26
    <da5>   DW_AT_type        : <0xb5d>
    <da9>   DW_AT_external    : 1
    <daa>   DW_AT_declaration : 1
 <1><dab>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <dac>   DW_AT_encoding    : 7	(unsigned)
    <dad>   DW_AT_byte_size   : 4
    <dae>   DW_AT_type        : <0x2b>
    <db2>   DW_AT_decl_file   : 19
    <db3>   DW_AT_decl_line   : 510
    <db5>   DW_AT_decl_column : 14
    <db6>   DW_AT_sibling     : <0xdcd>
 <2><dba>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x9b1): CFLAG_NONE
    <dbf>   DW_AT_const_value : 0
 <2><dc0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x8f4): CFLAG_ONLY_STATS
    <dc5>   DW_AT_const_value : 1
 <2><dc6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc7>   DW_AT_name        : (indirect string, offset: 0xbd8): CFLAG_BOTH
    <dcb>   DW_AT_const_value : 2
 <2><dcc>: Abbrev Number: 0
 <1><dcd>: Abbrev Number: 29 (DW_TAG_typedef)
    <dce>   DW_AT_name        : (indirect string, offset: 0x1111): cflag_t
    <dd2>   DW_AT_decl_file   : 19
    <dd3>   DW_AT_decl_line   : 514
    <dd5>   DW_AT_decl_column : 3
    <dd6>   DW_AT_type        : <0xdab>
 <1><dda>: Abbrev Number: 12 (DW_TAG_variable)
    <ddb>   DW_AT_name        : (indirect string, offset: 0xcf0): cflag
    <ddf>   DW_AT_decl_file   : 19
    <de0>   DW_AT_decl_line   : 515
    <de2>   DW_AT_decl_column : 16
    <de3>   DW_AT_type        : <0xdcd>
    <de7>   DW_AT_external    : 1
    <de8>   DW_AT_declaration : 1
 <1><de9>: Abbrev Number: 12 (DW_TAG_variable)
    <dea>   DW_AT_name        : (indirect string, offset: 0x1ac): Tflag
    <dee>   DW_AT_decl_file   : 19
    <def>   DW_AT_decl_line   : 516
    <df1>   DW_AT_decl_column : 13
    <df2>   DW_AT_type        : <0x51e>
    <df6>   DW_AT_external    : 1
    <df7>   DW_AT_declaration : 1
 <1><df8>: Abbrev Number: 12 (DW_TAG_variable)
    <df9>   DW_AT_name        : (indirect string, offset: 0x7de): Tflag_scale
    <dfd>   DW_AT_decl_file   : 19
    <dfe>   DW_AT_decl_line   : 517
    <e00>   DW_AT_decl_column : 12
    <e01>   DW_AT_type        : <0x64>
    <e05>   DW_AT_external    : 1
    <e06>   DW_AT_declaration : 1
 <1><e07>: Abbrev Number: 12 (DW_TAG_variable)
    <e08>   DW_AT_name        : (indirect string, offset: 0x870): Tflag_width
    <e0c>   DW_AT_decl_file   : 19
    <e0d>   DW_AT_decl_line   : 518
    <e0f>   DW_AT_decl_column : 12
    <e10>   DW_AT_type        : <0x64>
    <e14>   DW_AT_external    : 1
    <e15>   DW_AT_declaration : 1
 <1><e16>: Abbrev Number: 12 (DW_TAG_variable)
    <e17>   DW_AT_name        : (indirect string, offset: 0xe33): iflag
    <e1b>   DW_AT_decl_file   : 19
    <e1c>   DW_AT_decl_line   : 519
    <e1e>   DW_AT_decl_column : 13
    <e1f>   DW_AT_type        : <0x51e>
    <e23>   DW_AT_external    : 1
    <e24>   DW_AT_declaration : 1
 <1><e25>: Abbrev Number: 12 (DW_TAG_variable)
    <e26>   DW_AT_name        : (indirect string, offset: 0x653): count_wallclock
    <e2a>   DW_AT_decl_file   : 19
    <e2b>   DW_AT_decl_line   : 520
    <e2d>   DW_AT_decl_column : 13
    <e2e>   DW_AT_type        : <0x51e>
    <e32>   DW_AT_external    : 1
    <e33>   DW_AT_declaration : 1
 <1><e34>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e35>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e39>   DW_AT_byte_size   : 4
    <e3a>   DW_AT_decl_file   : 19
    <e3b>   DW_AT_decl_line   : 522
    <e3d>   DW_AT_decl_column : 8
    <e3e>   DW_AT_sibling     : <0xe53>
 <2><e42>: Abbrev Number: 23 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e47>   DW_AT_decl_file   : 19
    <e48>   DW_AT_decl_line   : 523
    <e4a>   DW_AT_decl_column : 14
    <e4b>   DW_AT_type        : <0x1d2>
    <e4f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e52>: Abbrev Number: 0
 <1><e53>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e54>   DW_AT_name        : (indirect string, offset: 0x793): path_set
    <e58>   DW_AT_byte_size   : 12
    <e59>   DW_AT_decl_file   : 19
    <e5a>   DW_AT_decl_line   : 527
    <e5c>   DW_AT_decl_column : 15
    <e5d>   DW_AT_sibling     : <0xe92>
 <2><e61>: Abbrev Number: 23 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x721): paths_selected
    <e66>   DW_AT_decl_file   : 19
    <e67>   DW_AT_decl_line   : 528
    <e69>   DW_AT_decl_column : 24
    <e6a>   DW_AT_type        : <0xe92>
    <e6e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e71>: Abbrev Number: 23 (DW_TAG_member)
    <e72>   DW_AT_name        : (indirect string, offset: 0x1062): num_selected
    <e76>   DW_AT_decl_file   : 19
    <e77>   DW_AT_decl_line   : 529
    <e79>   DW_AT_decl_column : 9
    <e7a>   DW_AT_type        : <0x132>
    <e7e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e81>: Abbrev Number: 23 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0xb88): size
    <e86>   DW_AT_decl_file   : 19
    <e87>   DW_AT_decl_line   : 530
    <e89>   DW_AT_decl_column : 9
    <e8a>   DW_AT_type        : <0x132>
    <e8e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e91>: Abbrev Number: 0
 <1><e92>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e93>   DW_AT_byte_size   : 4
    <e94>   DW_AT_type        : <0xe34>
 <1><e98>: Abbrev Number: 12 (DW_TAG_variable)
    <e99>   DW_AT_name        : (indirect string, offset: 0x10b1): global_path_set
    <e9d>   DW_AT_decl_file   : 19
    <e9e>   DW_AT_decl_line   : 531
    <ea0>   DW_AT_decl_column : 3
    <ea1>   DW_AT_type        : <0xe53>
    <ea5>   DW_AT_external    : 1
    <ea6>   DW_AT_declaration : 1
 <1><ea7>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xf9d): xflag_opts
    <eac>   DW_AT_encoding    : 7	(unsigned)
    <ead>   DW_AT_byte_size   : 4
    <eae>   DW_AT_type        : <0x2b>
    <eb2>   DW_AT_decl_file   : 19
    <eb3>   DW_AT_decl_line   : 533
    <eb5>   DW_AT_decl_column : 6
    <eb6>   DW_AT_sibling     : <0xed9>
 <2><eba>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebb>   DW_AT_name        : (indirect string, offset: 0xa34): HEXSTR_NONE
    <ebf>   DW_AT_const_value : 0
 <2><ec0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec1>   DW_AT_name        : (indirect string, offset: 0xfe3): HEXSTR_NON_ASCII
    <ec5>   DW_AT_const_value : 1
 <2><ec6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x932): HEXSTR_ALL
    <ecb>   DW_AT_const_value : 2
 <2><ecc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x6a3): HEXSTR_NON_ASCII_CHARS
    <ed1>   DW_AT_const_value : 3
 <2><ed2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x107c): NUM_HEXSTR_OPTS
    <ed7>   DW_AT_const_value : 4
 <2><ed8>: Abbrev Number: 0
 <1><ed9>: Abbrev Number: 12 (DW_TAG_variable)
    <eda>   DW_AT_name        : (indirect string, offset: 0xe0d): xflag
    <ede>   DW_AT_decl_file   : 19
    <edf>   DW_AT_decl_line   : 546
    <ee1>   DW_AT_decl_column : 17
    <ee2>   DW_AT_type        : <0x2b>
    <ee6>   DW_AT_external    : 1
    <ee7>   DW_AT_declaration : 1
 <1><ee8>: Abbrev Number: 12 (DW_TAG_variable)
    <ee9>   DW_AT_name        : (indirect string, offset: 0xcab): followfork
    <eed>   DW_AT_decl_file   : 19
    <eee>   DW_AT_decl_line   : 547
    <ef0>   DW_AT_decl_column : 13
    <ef1>   DW_AT_type        : <0x51e>
    <ef5>   DW_AT_external    : 1
    <ef6>   DW_AT_declaration : 1
 <1><ef7>: Abbrev Number: 12 (DW_TAG_variable)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x354): output_separately
    <efc>   DW_AT_decl_file   : 19
    <efd>   DW_AT_decl_line   : 548
    <eff>   DW_AT_decl_column : 13
    <f00>   DW_AT_type        : <0x51e>
    <f04>   DW_AT_external    : 1
    <f05>   DW_AT_declaration : 1
 <1><f06>: Abbrev Number: 12 (DW_TAG_variable)
    <f07>   DW_AT_name        : (indirect string, offset: 0x250): stack_trace_enabled
    <f0b>   DW_AT_decl_file   : 19
    <f0c>   DW_AT_decl_line   : 551
    <f0e>   DW_AT_decl_column : 13
    <f0f>   DW_AT_type        : <0x51e>
    <f13>   DW_AT_external    : 1
    <f14>   DW_AT_declaration : 1
 <1><f15>: Abbrev Number: 12 (DW_TAG_variable)
    <f16>   DW_AT_name        : (indirect string, offset: 0x681): ptrace_setoptions
    <f1a>   DW_AT_decl_file   : 19
    <f1b>   DW_AT_decl_line   : 555
    <f1d>   DW_AT_decl_column : 17
    <f1e>   DW_AT_type        : <0x2b>
    <f22>   DW_AT_external    : 1
    <f23>   DW_AT_declaration : 1
 <1><f24>: Abbrev Number: 12 (DW_TAG_variable)
    <f25>   DW_AT_name        : (indirect string, offset: 0xa29): max_strlen
    <f29>   DW_AT_decl_file   : 19
    <f2a>   DW_AT_decl_line   : 556
    <f2c>   DW_AT_decl_column : 17
    <f2d>   DW_AT_type        : <0x2b>
    <f31>   DW_AT_external    : 1
    <f32>   DW_AT_declaration : 1
 <1><f33>: Abbrev Number: 12 (DW_TAG_variable)
    <f34>   DW_AT_name        : (indirect string, offset: 0xa6d): os_release
    <f38>   DW_AT_decl_file   : 19
    <f39>   DW_AT_decl_line   : 557
    <f3b>   DW_AT_decl_column : 17
    <f3c>   DW_AT_type        : <0x2b>
    <f40>   DW_AT_external    : 1
    <f41>   DW_AT_declaration : 1
 <1><f42>: Abbrev Number: 12 (DW_TAG_variable)
    <f43>   DW_AT_name        : (indirect string, offset: 0x730): xlat_verbosity
    <f47>   DW_AT_decl_file   : 19
    <f48>   DW_AT_decl_line   : 919
    <f4a>   DW_AT_decl_column : 24
    <f4b>   DW_AT_type        : <0xa80>
    <f4f>   DW_AT_external    : 1
    <f50>   DW_AT_declaration : 1
 <1><f51>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f52>   DW_AT_name        : (indirect string, offset: 0x636): xlat_style_private_flag_bits
    <f56>   DW_AT_encoding    : 7	(unsigned)
    <f57>   DW_AT_byte_size   : 4
    <f58>   DW_AT_type        : <0x2b>
    <f5c>   DW_AT_decl_file   : 19
    <f5d>   DW_AT_decl_line   : 939
    <f5f>   DW_AT_decl_column : 6
    <f60>   DW_AT_sibling     : <0xf7d>
 <2><f64>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f65>   DW_AT_name        : (indirect string, offset: 0x2d3): PAF_PRINT_INDICES_BIT
    <f69>   DW_AT_const_value : 5
 <2><f6a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f6b>   DW_AT_name        : (indirect string, offset: 0xb35): PAF_ARRAY_TRUNCATED_BIT
    <f6f>   DW_AT_const_value : 6
 <2><f70>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f71>   DW_AT_name        : (indirect string, offset: 0x412): PXF_DEFAULT_STR_BIT
    <f75>   DW_AT_const_value : 7
 <2><f76>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f77>   DW_AT_name        : (indirect string, offset: 0xc8d): SPFF_AUXSTR_MODE_BIT
    <f7b>   DW_AT_const_value : 8
 <2><f7c>: Abbrev Number: 0
 <1><f7d>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f7e>   DW_AT_name        : (indirect string, offset: 0xd3c): find_xlat_flag_bits
    <f82>   DW_AT_encoding    : 7	(unsigned)
    <f83>   DW_AT_byte_size   : 4
    <f84>   DW_AT_type        : <0x2b>
    <f88>   DW_AT_decl_file   : 19
    <f89>   DW_AT_decl_line   : 1443
    <f8b>   DW_AT_decl_column : 6
    <f8c>   DW_AT_sibling     : <0xf97>
 <2><f90>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f91>   DW_AT_name        : (indirect string, offset: 0x96f): FXL_CASE_SENSITIVE_BIT
    <f95>   DW_AT_const_value : 0
 <2><f96>: Abbrev Number: 0
 <1><f97>: Abbrev Number: 12 (DW_TAG_variable)
    <f98>   DW_AT_name        : (indirect string, offset: 0x9fc): printing_tcp
    <f9c>   DW_AT_decl_file   : 19
    <f9d>   DW_AT_decl_line   : 1689
    <f9f>   DW_AT_decl_column : 20
    <fa0>   DW_AT_type        : <0x61f>
    <fa4>   DW_AT_external    : 1
    <fa5>   DW_AT_declaration : 1
 <1><fa6>: Abbrev Number: 12 (DW_TAG_variable)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x5ea): errnoent
    <fab>   DW_AT_decl_file   : 19
    <fac>   DW_AT_decl_line   : 1887
    <fae>   DW_AT_decl_column : 26
    <faf>   DW_AT_type        : <0x452>
    <fb3>   DW_AT_external    : 1
    <fb4>   DW_AT_declaration : 1
 <1><fb5>: Abbrev Number: 12 (DW_TAG_variable)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x87c): signalent
    <fba>   DW_AT_decl_file   : 19
    <fbb>   DW_AT_decl_line   : 1888
    <fbd>   DW_AT_decl_column : 26
    <fbe>   DW_AT_type        : <0x452>
    <fc2>   DW_AT_external    : 1
    <fc3>   DW_AT_declaration : 1
 <1><fc4>: Abbrev Number: 12 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0xe8b): nerrnos
    <fc9>   DW_AT_decl_file   : 19
    <fca>   DW_AT_decl_line   : 1889
    <fcc>   DW_AT_decl_column : 27
    <fcd>   DW_AT_type        : <0x32>
    <fd1>   DW_AT_external    : 1
    <fd2>   DW_AT_declaration : 1
 <1><fd3>: Abbrev Number: 12 (DW_TAG_variable)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x104b): nsignals
    <fd8>   DW_AT_decl_file   : 19
    <fd9>   DW_AT_decl_line   : 1890
    <fdb>   DW_AT_decl_column : 27
    <fdc>   DW_AT_type        : <0x32>
    <fe0>   DW_AT_external    : 1
    <fe1>   DW_AT_declaration : 1
 <1><fe2>: Abbrev Number: 6 (DW_TAG_array_type)
    <fe3>   DW_AT_type        : <0x89f>
    <fe7>   DW_AT_sibling     : <0xfed>
 <2><feb>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fec>: Abbrev Number: 0
 <1><fed>: Abbrev Number: 3 (DW_TAG_const_type)
    <fee>   DW_AT_type        : <0xfe2>
 <1><ff2>: Abbrev Number: 12 (DW_TAG_variable)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xd07): sysent0
    <ff7>   DW_AT_decl_file   : 19
    <ff8>   DW_AT_decl_line   : 1892
    <ffa>   DW_AT_decl_column : 28
    <ffb>   DW_AT_type        : <0xfed>
    <fff>   DW_AT_external    : 1
    <1000>   DW_AT_declaration : 1
 <1><1001>: Abbrev Number: 6 (DW_TAG_array_type)
    <1002>   DW_AT_type        : <0x906>
    <1006>   DW_AT_sibling     : <0x100c>
 <2><100a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><100b>: Abbrev Number: 0
 <1><100c>: Abbrev Number: 3 (DW_TAG_const_type)
    <100d>   DW_AT_type        : <0x1001>
 <1><1011>: Abbrev Number: 12 (DW_TAG_variable)
    <1012>   DW_AT_name        : (indirect string, offset: 0x10a7): ioctlent0
    <1016>   DW_AT_decl_file   : 19
    <1017>   DW_AT_decl_line   : 1893
    <1019>   DW_AT_decl_column : 30
    <101a>   DW_AT_type        : <0x100c>
    <101e>   DW_AT_external    : 1
    <101f>   DW_AT_declaration : 1
 <1><1020>: Abbrev Number: 12 (DW_TAG_variable)
    <1021>   DW_AT_name        : (indirect string, offset: 0xfa8): personality_names
    <1025>   DW_AT_decl_file   : 19
    <1026>   DW_AT_decl_line   : 1895
    <1028>   DW_AT_decl_column : 26
    <1029>   DW_AT_type        : <0x452>
    <102d>   DW_AT_external    : 1
    <102e>   DW_AT_declaration : 1
 <1><102f>: Abbrev Number: 12 (DW_TAG_variable)
    <1030>   DW_AT_name        : (indirect string, offset: 0x89c): sysent
    <1034>   DW_AT_decl_file   : 19
    <1035>   DW_AT_decl_line   : 1898
    <1037>   DW_AT_decl_column : 29
    <1038>   DW_AT_type        : <0x9eb>
    <103c>   DW_AT_external    : 1
    <103d>   DW_AT_declaration : 1
 <1><103e>: Abbrev Number: 12 (DW_TAG_variable)
    <103f>   DW_AT_name        : (indirect string, offset: 0xca2): ioctlent
    <1043>   DW_AT_decl_file   : 19
    <1044>   DW_AT_decl_line   : 1899
    <1046>   DW_AT_decl_column : 31
    <1047>   DW_AT_type        : <0x104d>
    <104b>   DW_AT_external    : 1
    <104c>   DW_AT_declaration : 1
 <1><104d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <104e>   DW_AT_byte_size   : 4
    <104f>   DW_AT_type        : <0x906>
 <1><1053>: Abbrev Number: 12 (DW_TAG_variable)
    <1054>   DW_AT_name        : (indirect string, offset: 0x886): nsyscalls
    <1058>   DW_AT_decl_file   : 19
    <1059>   DW_AT_decl_line   : 1905
    <105b>   DW_AT_decl_column : 17
    <105c>   DW_AT_type        : <0x2b>
    <1060>   DW_AT_external    : 1
    <1061>   DW_AT_declaration : 1
 <1><1062>: Abbrev Number: 12 (DW_TAG_variable)
    <1063>   DW_AT_name        : (indirect string, offset: 0xea5): nioctlents
    <1067>   DW_AT_decl_file   : 19
    <1068>   DW_AT_decl_line   : 1906
    <106a>   DW_AT_decl_column : 17
    <106b>   DW_AT_type        : <0x2b>
    <106f>   DW_AT_external    : 1
    <1070>   DW_AT_declaration : 1
 <1><1071>: Abbrev Number: 6 (DW_TAG_array_type)
    <1072>   DW_AT_type        : <0x32>
    <1076>   DW_AT_sibling     : <0x1081>
 <2><107a>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <107b>   DW_AT_type        : <0x2b>
    <107f>   DW_AT_upper_bound : 2
 <2><1080>: Abbrev Number: 0
 <1><1081>: Abbrev Number: 3 (DW_TAG_const_type)
    <1082>   DW_AT_type        : <0x1071>
 <1><1086>: Abbrev Number: 12 (DW_TAG_variable)
    <1087>   DW_AT_name        : (indirect string, offset: 0xf05): nsyscall_vec
    <108b>   DW_AT_decl_file   : 19
    <108c>   DW_AT_decl_line   : 1908
    <108e>   DW_AT_decl_column : 27
    <108f>   DW_AT_type        : <0x1081>
    <1093>   DW_AT_external    : 1
    <1094>   DW_AT_declaration : 1
 <1><1095>: Abbrev Number: 6 (DW_TAG_array_type)
    <1096>   DW_AT_type        : <0x9f1>
    <109a>   DW_AT_sibling     : <0x10a5>
 <2><109e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <109f>   DW_AT_type        : <0x2b>
    <10a3>   DW_AT_upper_bound : 2
 <2><10a4>: Abbrev Number: 0
 <1><10a5>: Abbrev Number: 3 (DW_TAG_const_type)
    <10a6>   DW_AT_type        : <0x1095>
 <1><10aa>: Abbrev Number: 12 (DW_TAG_variable)
    <10ab>   DW_AT_name        : (indirect string, offset: 0x7cb): sysent_vec
    <10af>   DW_AT_decl_file   : 19
    <10b0>   DW_AT_decl_line   : 1909
    <10b2>   DW_AT_decl_column : 35
    <10b3>   DW_AT_type        : <0x10a5>
    <10b7>   DW_AT_external    : 1
    <10b8>   DW_AT_declaration : 1
 <1><10b9>: Abbrev Number: 12 (DW_TAG_variable)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x3b3): inject_vec
    <10be>   DW_AT_decl_file   : 19
    <10bf>   DW_AT_decl_line   : 1910
    <10c1>   DW_AT_decl_column : 28
    <10c2>   DW_AT_type        : <0x9f6>
    <10c6>   DW_AT_external    : 1
    <10c7>   DW_AT_declaration : 1
 <1><10c8>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10c9>   DW_AT_name        : (indirect string, offset: 0xd90): audit_arch_t
    <10cd>   DW_AT_byte_size   : 8
    <10ce>   DW_AT_decl_file   : 19
    <10cf>   DW_AT_decl_line   : 1912
    <10d1>   DW_AT_decl_column : 8
    <10d2>   DW_AT_sibling     : <0x10f7>
 <2><10d6>: Abbrev Number: 23 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x628): arch
    <10db>   DW_AT_decl_file   : 19
    <10dc>   DW_AT_decl_line   : 1913
    <10de>   DW_AT_decl_column : 15
    <10df>   DW_AT_type        : <0x2b>
    <10e3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10e6>: Abbrev Number: 23 (DW_TAG_member)
    <10e7>   DW_AT_name        : (indirect string, offset: 0x9e2): flag
    <10eb>   DW_AT_decl_file   : 19
    <10ec>   DW_AT_decl_line   : 1914
    <10ee>   DW_AT_decl_column : 15
    <10ef>   DW_AT_type        : <0x2b>
    <10f3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10f6>: Abbrev Number: 0
 <1><10f7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f8>   DW_AT_type        : <0x10c8>
 <1><10fc>: Abbrev Number: 6 (DW_TAG_array_type)
    <10fd>   DW_AT_type        : <0x10f7>
    <1101>   DW_AT_sibling     : <0x110c>
 <2><1105>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1106>   DW_AT_type        : <0x2b>
    <110a>   DW_AT_upper_bound : 2
 <2><110b>: Abbrev Number: 0
 <1><110c>: Abbrev Number: 3 (DW_TAG_const_type)
    <110d>   DW_AT_type        : <0x10fc>
 <1><1111>: Abbrev Number: 12 (DW_TAG_variable)
    <1112>   DW_AT_name        : (indirect string, offset: 0x960): audit_arch_vec
    <1116>   DW_AT_decl_file   : 19
    <1117>   DW_AT_decl_line   : 1917
    <1119>   DW_AT_decl_column : 34
    <111a>   DW_AT_type        : <0x110c>
    <111e>   DW_AT_external    : 1
    <111f>   DW_AT_declaration : 1
 <1><1120>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1121>   DW_AT_byte_size   : 180
    <1122>   DW_AT_decl_file   : 21
    <1123>   DW_AT_decl_line   : 2
    <1124>   DW_AT_decl_column : 9
    <1125>   DW_AT_sibling     : <0x13da>
 <2><1129>: Abbrev Number: 11 (DW_TAG_member)
    <112a>   DW_AT_name        : (indirect string, offset: 0x201): block_ioctl
    <112e>   DW_AT_decl_file   : 21
    <112f>   DW_AT_decl_line   : 3
    <1130>   DW_AT_decl_column : 8
    <1131>   DW_AT_type        : <0x13f4>
    <1135>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1138>: Abbrev Number: 11 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0xacc): btrfs_ioctl
    <113d>   DW_AT_decl_file   : 21
    <113e>   DW_AT_decl_line   : 6
    <113f>   DW_AT_decl_column : 8
    <1140>   DW_AT_type        : <0x13f4>
    <1144>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1147>: Abbrev Number: 11 (DW_TAG_member)
    <1148>   DW_AT_name        : (indirect string, offset: 0x769): evdev_write_ioctl_mpers
    <114c>   DW_AT_decl_file   : 21
    <114d>   DW_AT_decl_line   : 9
    <114e>   DW_AT_decl_column : 8
    <114f>   DW_AT_type        : <0x13f4>
    <1153>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1156>: Abbrev Number: 11 (DW_TAG_member)
    <1157>   DW_AT_name        : (indirect string, offset: 0x73f): get_sock_fprog_size
    <115b>   DW_AT_decl_file   : 21
    <115c>   DW_AT_decl_line   : 12
    <115d>   DW_AT_decl_column : 17
    <115e>   DW_AT_type        : <0x1400>
