Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x16d2 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x507): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x212): mpers-mx32/struct_msghdr.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe8f): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfe3): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x988): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xde6): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x498): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x888): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xee0): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8b8): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x78b): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb55): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb8b): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xcd7): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc4c): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x412): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x45e): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x5ce): __socklen_t
    <f0>   DW_AT_decl_file   : 1
    <f1>   DW_AT_decl_line   : 209
    <f2>   DW_AT_decl_column : 23
    <f3>   DW_AT_type        : <0x2b>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x375): uint8_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 24
    <fe>   DW_AT_decl_column : 19
    <ff>   DW_AT_type        : <0x45>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xb76): uint16_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 25
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x58>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xf88): uint32_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 26
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x70>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xdf6): uint64_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 27
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x8f>
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 4
    <129>   DW_AT_encoding    : 5	(signed)
    <12a>   DW_AT_name        : (indirect string, offset: 0x2e5): long int
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x32): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xafe): timespec
    <144>   DW_AT_byte_size   : 16
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x10b9): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xba>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe1c): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xcd>
    <167>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xac0): long double
 <1><172>: Abbrev Number: 10 (DW_TAG_typedef)
    <173>   DW_AT_name        : (indirect string, offset: 0x11): socklen_t
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 274
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xeb>
 <1><17f>: Abbrev Number: 11 (DW_TAG_variable)
    <180>   DW_AT_name        : (indirect string, offset: 0x29c): __environ
    <184>   DW_AT_decl_file   : 5
    <185>   DW_AT_decl_line   : 543
    <187>   DW_AT_decl_column : 15
    <188>   DW_AT_type        : <0x18e>
    <18c>   DW_AT_external    : 1
    <18d>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18f>   DW_AT_byte_size   : 4
    <190>   DW_AT_type        : <0xd9>
 <1><194>: Abbrev Number: 11 (DW_TAG_variable)
    <195>   DW_AT_name        : (indirect string, offset: 0x3be): environ
    <199>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 545
    <19c>   DW_AT_decl_column : 15
    <19d>   DW_AT_type        : <0x18e>
    <1a1>   DW_AT_external    : 1
    <1a2>   DW_AT_declaration : 1
 <1><1a3>: Abbrev Number: 12 (DW_TAG_variable)
    <1a4>   DW_AT_name        : (indirect string, offset: 0xfcd): optarg
    <1a8>   DW_AT_decl_file   : 6
    <1a9>   DW_AT_decl_line   : 36
    <1aa>   DW_AT_decl_column : 14
    <1ab>   DW_AT_type        : <0xd9>
    <1af>   DW_AT_external    : 1
    <1b0>   DW_AT_declaration : 1
 <1><1b1>: Abbrev Number: 12 (DW_TAG_variable)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x75e): optind
    <1b6>   DW_AT_decl_file   : 6
    <1b7>   DW_AT_decl_line   : 50
    <1b8>   DW_AT_decl_column : 12
    <1b9>   DW_AT_type        : <0x64>
    <1bd>   DW_AT_external    : 1
    <1be>   DW_AT_declaration : 1
 <1><1bf>: Abbrev Number: 12 (DW_TAG_variable)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xc3b): opterr
    <1c4>   DW_AT_decl_file   : 6
    <1c5>   DW_AT_decl_line   : 55
    <1c6>   DW_AT_decl_column : 12
    <1c7>   DW_AT_type        : <0x64>
    <1cb>   DW_AT_external    : 1
    <1cc>   DW_AT_declaration : 1
 <1><1cd>: Abbrev Number: 12 (DW_TAG_variable)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xb3b): optopt
    <1d2>   DW_AT_decl_file   : 6
    <1d3>   DW_AT_decl_line   : 59
    <1d4>   DW_AT_decl_column : 12
    <1d5>   DW_AT_type        : <0x64>
    <1d9>   DW_AT_external    : 1
    <1da>   DW_AT_declaration : 1
 <1><1db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1dc>   DW_AT_byte_size   : 4
    <1dd>   DW_AT_type        : <0xe6>
 <1><1e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e2>   DW_AT_type        : <0x1db>
 <1><1e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e7>   DW_AT_byte_size   : 4
    <1e8>   DW_AT_type        : <0x1ec>
 <1><1ec>: Abbrev Number: 13 (DW_TAG_const_type)
 <1><1ed>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x37d): _IO_FILE
    <1f2>   DW_AT_byte_size   : 152
    <1f3>   DW_AT_decl_file   : 7
    <1f4>   DW_AT_decl_line   : 49
    <1f5>   DW_AT_decl_column : 8
    <1f6>   DW_AT_sibling     : <0x3ae>
 <2><1fa>: Abbrev Number: 9 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0xa12): _flags
    <1ff>   DW_AT_decl_file   : 7
    <200>   DW_AT_decl_line   : 51
    <201>   DW_AT_decl_column : 7
    <202>   DW_AT_type        : <0x64>
    <206>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><209>: Abbrev Number: 9 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x4fa): _IO_read_ptr
    <20e>   DW_AT_decl_file   : 7
    <20f>   DW_AT_decl_line   : 54
    <210>   DW_AT_decl_column : 9
    <211>   DW_AT_type        : <0xd9>
    <215>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><218>: Abbrev Number: 9 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0xf35): _IO_read_end
    <21d>   DW_AT_decl_file   : 7
    <21e>   DW_AT_decl_line   : 55
    <21f>   DW_AT_decl_column : 9
    <220>   DW_AT_type        : <0xd9>
    <224>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><227>: Abbrev Number: 9 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x7c7): _IO_read_base
    <22c>   DW_AT_decl_file   : 7
    <22d>   DW_AT_decl_line   : 56
    <22e>   DW_AT_decl_column : 9
    <22f>   DW_AT_type        : <0xd9>
    <233>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><236>: Abbrev Number: 9 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <23b>   DW_AT_decl_file   : 7
    <23c>   DW_AT_decl_line   : 57
    <23d>   DW_AT_decl_column : 9
    <23e>   DW_AT_type        : <0xd9>
    <242>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><245>: Abbrev Number: 9 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x1025): _IO_write_ptr
    <24a>   DW_AT_decl_file   : 7
    <24b>   DW_AT_decl_line   : 58
    <24c>   DW_AT_decl_column : 9
    <24d>   DW_AT_type        : <0xd9>
    <251>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><254>: Abbrev Number: 9 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x900): _IO_write_end
    <259>   DW_AT_decl_file   : 7
    <25a>   DW_AT_decl_line   : 59
    <25b>   DW_AT_decl_column : 9
    <25c>   DW_AT_type        : <0xd9>
    <260>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><263>: Abbrev Number: 9 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x971): _IO_buf_base
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 60
    <26a>   DW_AT_decl_column : 9
    <26b>   DW_AT_type        : <0xd9>
    <26f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><272>: Abbrev Number: 9 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0xd7e): _IO_buf_end
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 61
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0xd9>
    <27e>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><281>: Abbrev Number: 9 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x1c8): _IO_save_base
    <286>   DW_AT_decl_file   : 7
    <287>   DW_AT_decl_line   : 64
    <288>   DW_AT_decl_column : 9
    <289>   DW_AT_type        : <0xd9>
    <28d>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><290>: Abbrev Number: 9 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xc9e): _IO_backup_base
    <295>   DW_AT_decl_file   : 7
    <296>   DW_AT_decl_line   : 65
    <297>   DW_AT_decl_column : 9
    <298>   DW_AT_type        : <0xd9>
    <29c>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29f>: Abbrev Number: 9 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0xbf): _IO_save_end
    <2a4>   DW_AT_decl_file   : 7
    <2a5>   DW_AT_decl_line   : 66
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_type        : <0xd9>
    <2ab>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ae>: Abbrev Number: 9 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x623): _markers
    <2b3>   DW_AT_decl_file   : 7
    <2b4>   DW_AT_decl_line   : 68
    <2b5>   DW_AT_decl_column : 22
    <2b6>   DW_AT_type        : <0x3c8>
    <2ba>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bd>: Abbrev Number: 9 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2c2>   DW_AT_decl_file   : 7
    <2c3>   DW_AT_decl_line   : 70
    <2c4>   DW_AT_decl_column : 20
    <2c5>   DW_AT_type        : <0x3ce>
    <2c9>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2cc>: Abbrev Number: 9 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xf9c): _fileno
    <2d1>   DW_AT_decl_file   : 7
    <2d2>   DW_AT_decl_line   : 72
    <2d3>   DW_AT_decl_column : 7
    <2d4>   DW_AT_type        : <0x64>
    <2d8>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2db>: Abbrev Number: 9 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x7b3): _flags2
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 73
    <2e2>   DW_AT_decl_column : 7
    <2e3>   DW_AT_type        : <0x64>
    <2e7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2ea>: Abbrev Number: 9 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x834): _old_offset
    <2ef>   DW_AT_decl_file   : 7
    <2f0>   DW_AT_decl_line   : 74
    <2f1>   DW_AT_decl_column : 11
    <2f2>   DW_AT_type        : <0xa2>
    <2f6>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f9>: Abbrev Number: 9 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x259): _cur_column
    <2fe>   DW_AT_decl_file   : 7
    <2ff>   DW_AT_decl_line   : 77
    <300>   DW_AT_decl_column : 18
    <301>   DW_AT_type        : <0x24>
    <305>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><308>: Abbrev Number: 9 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0xe42): _vtable_offset
    <30d>   DW_AT_decl_file   : 7
    <30e>   DW_AT_decl_line   : 78
    <30f>   DW_AT_decl_column : 15
    <310>   DW_AT_type        : <0x3e>
    <314>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><317>: Abbrev Number: 9 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0xcae): _shortbuf
    <31c>   DW_AT_decl_file   : 7
    <31d>   DW_AT_decl_line   : 79
    <31e>   DW_AT_decl_column : 8
    <31f>   DW_AT_type        : <0x3d4>
    <323>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><326>: Abbrev Number: 9 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <32b>   DW_AT_decl_file   : 7
    <32c>   DW_AT_decl_line   : 81
    <32d>   DW_AT_decl_column : 15
    <32e>   DW_AT_type        : <0x3e4>
    <332>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><335>: Abbrev Number: 9 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x6f6): _offset
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 89
    <33c>   DW_AT_decl_column : 13
    <33d>   DW_AT_type        : <0xae>
    <341>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><344>: Abbrev Number: 9 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xa52): _codecvt
    <349>   DW_AT_decl_file   : 7
    <34a>   DW_AT_decl_line   : 91
    <34b>   DW_AT_decl_column : 23
    <34c>   DW_AT_type        : <0x3f0>
    <350>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><353>: Abbrev Number: 9 (DW_TAG_member)
    <354>   DW_AT_name        : (indirect string, offset: 0xfb1): _wide_data
    <358>   DW_AT_decl_file   : 7
    <359>   DW_AT_decl_line   : 92
    <35a>   DW_AT_decl_column : 25
    <35b>   DW_AT_type        : <0x3fc>
    <35f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><362>: Abbrev Number: 9 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x3e2): _freeres_list
    <367>   DW_AT_decl_file   : 7
    <368>   DW_AT_decl_line   : 93
    <369>   DW_AT_decl_column : 20
    <36a>   DW_AT_type        : <0x3ce>
    <36e>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><371>: Abbrev Number: 9 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0xc11): _freeres_buf
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 94
    <378>   DW_AT_decl_column : 9
    <379>   DW_AT_type        : <0xc6>
    <37d>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><380>: Abbrev Number: 9 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x9c6): __pad5
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 95
    <387>   DW_AT_decl_column : 10
    <388>   DW_AT_type        : <0x12e>
    <38c>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38f>: Abbrev Number: 9 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0xa36): _mode
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 96
    <396>   DW_AT_decl_column : 7
    <397>   DW_AT_type        : <0x64>
    <39b>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39e>: Abbrev Number: 9 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x7e1): _unused2
    <3a3>   DW_AT_decl_file   : 7
    <3a4>   DW_AT_decl_line   : 98
    <3a5>   DW_AT_decl_column : 8
    <3a6>   DW_AT_type        : <0x402>
    <3aa>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3ad>: Abbrev Number: 0
 <1><3ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <3af>   DW_AT_name        : (indirect string, offset: 0xae0): FILE
    <3b3>   DW_AT_decl_file   : 8
    <3b4>   DW_AT_decl_line   : 7
    <3b5>   DW_AT_decl_column : 25
    <3b6>   DW_AT_type        : <0x1ed>
 <1><3ba>: Abbrev Number: 14 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x48d): _IO_lock_t
    <3bf>   DW_AT_decl_file   : 7
    <3c0>   DW_AT_decl_line   : 43
    <3c1>   DW_AT_decl_column : 14
 <1><3c2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x327): _IO_marker
    <3c7>   DW_AT_declaration : 1
 <1><3c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c9>   DW_AT_byte_size   : 4
    <3ca>   DW_AT_type        : <0x3c2>
 <1><3ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 4
    <3d0>   DW_AT_type        : <0x1ed>
 <1><3d4>: Abbrev Number: 16 (DW_TAG_array_type)
    <3d5>   DW_AT_type        : <0xdf>
    <3d9>   DW_AT_sibling     : <0x3e4>
 <2><3dd>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <3de>   DW_AT_type        : <0x2b>
    <3e2>   DW_AT_upper_bound : 0
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e5>   DW_AT_byte_size   : 4
    <3e6>   DW_AT_type        : <0x3ba>
 <1><3ea>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x82): _IO_codecvt
    <3ef>   DW_AT_declaration : 1
 <1><3f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x3ea>
 <1><3f6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x391): _IO_wide_data
    <3fb>   DW_AT_declaration : 1
 <1><3fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fd>   DW_AT_byte_size   : 4
    <3fe>   DW_AT_type        : <0x3f6>
 <1><402>: Abbrev Number: 16 (DW_TAG_array_type)
    <403>   DW_AT_type        : <0xdf>
    <407>   DW_AT_sibling     : <0x412>
 <2><40b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <40c>   DW_AT_type        : <0x2b>
    <410>   DW_AT_upper_bound : 39
 <2><411>: Abbrev Number: 0
 <1><412>: Abbrev Number: 12 (DW_TAG_variable)
    <413>   DW_AT_name        : (indirect string, offset: 0x5da): stdin
    <417>   DW_AT_decl_file   : 9
    <418>   DW_AT_decl_line   : 137
    <419>   DW_AT_decl_column : 14
    <41a>   DW_AT_type        : <0x420>
    <41e>   DW_AT_external    : 1
    <41f>   DW_AT_declaration : 1
 <1><420>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <421>   DW_AT_byte_size   : 4
    <422>   DW_AT_type        : <0x3ae>
 <1><426>: Abbrev Number: 12 (DW_TAG_variable)
    <427>   DW_AT_name        : (indirect string, offset: 0xff6): stdout
    <42b>   DW_AT_decl_file   : 9
    <42c>   DW_AT_decl_line   : 138
    <42d>   DW_AT_decl_column : 14
    <42e>   DW_AT_type        : <0x420>
    <432>   DW_AT_external    : 1
    <433>   DW_AT_declaration : 1
 <1><434>: Abbrev Number: 12 (DW_TAG_variable)
    <435>   DW_AT_name        : (indirect string, offset: 0xddf): stderr
    <439>   DW_AT_decl_file   : 9
    <43a>   DW_AT_decl_line   : 139
    <43b>   DW_AT_decl_column : 14
    <43c>   DW_AT_type        : <0x420>
    <440>   DW_AT_external    : 1
    <441>   DW_AT_declaration : 1
 <1><442>: Abbrev Number: 12 (DW_TAG_variable)
    <443>   DW_AT_name        : (indirect string, offset: 0x265): sys_nerr
    <447>   DW_AT_decl_file   : 10
    <448>   DW_AT_decl_line   : 26
    <449>   DW_AT_decl_column : 12
    <44a>   DW_AT_type        : <0x64>
    <44e>   DW_AT_external    : 1
    <44f>   DW_AT_declaration : 1
 <1><450>: Abbrev Number: 16 (DW_TAG_array_type)
    <451>   DW_AT_type        : <0x1e1>
    <455>   DW_AT_sibling     : <0x45b>
 <2><459>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><45a>: Abbrev Number: 0
 <1><45b>: Abbrev Number: 3 (DW_TAG_const_type)
    <45c>   DW_AT_type        : <0x450>
 <1><460>: Abbrev Number: 12 (DW_TAG_variable)
    <461>   DW_AT_name        : (indirect string, offset: 0x5e9): sys_errlist
    <465>   DW_AT_decl_file   : 10
    <466>   DW_AT_decl_line   : 27
    <467>   DW_AT_decl_column : 26
    <468>   DW_AT_type        : <0x45b>
    <46c>   DW_AT_external    : 1
    <46d>   DW_AT_declaration : 1
 <1><46e>: Abbrev Number: 12 (DW_TAG_variable)
    <46f>   DW_AT_name        : (indirect string, offset: 0x289): _sys_nerr
    <473>   DW_AT_decl_file   : 10
    <474>   DW_AT_decl_line   : 30
    <475>   DW_AT_decl_column : 12
    <476>   DW_AT_type        : <0x64>
    <47a>   DW_AT_external    : 1
    <47b>   DW_AT_declaration : 1
 <1><47c>: Abbrev Number: 12 (DW_TAG_variable)
    <47d>   DW_AT_name        : (indirect string, offset: 0xe51): _sys_errlist
    <481>   DW_AT_decl_file   : 10
    <482>   DW_AT_decl_line   : 31
    <483>   DW_AT_decl_column : 26
    <484>   DW_AT_type        : <0x45b>
    <488>   DW_AT_external    : 1
    <489>   DW_AT_declaration : 1
 <1><48a>: Abbrev Number: 12 (DW_TAG_variable)
    <48b>   DW_AT_name        : (indirect string, offset: 0x6cf): program_invocation_name
    <48f>   DW_AT_decl_file   : 11
    <490>   DW_AT_decl_line   : 45
    <491>   DW_AT_decl_column : 14
    <492>   DW_AT_type        : <0xd9>
    <496>   DW_AT_external    : 1
    <497>   DW_AT_declaration : 1
 <1><498>: Abbrev Number: 12 (DW_TAG_variable)
    <499>   DW_AT_name        : (indirect string, offset: 0xbb6): program_invocation_short_name
    <49d>   DW_AT_decl_file   : 11
    <49e>   DW_AT_decl_line   : 46
    <49f>   DW_AT_decl_column : 14
    <4a0>   DW_AT_type        : <0xd9>
    <4a4>   DW_AT_external    : 1
    <4a5>   DW_AT_declaration : 1
 <1><4a6>: Abbrev Number: 16 (DW_TAG_array_type)
    <4a7>   DW_AT_type        : <0xd9>
    <4ab>   DW_AT_sibling     : <0x4b6>
 <2><4af>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <4b0>   DW_AT_type        : <0x2b>
    <4b4>   DW_AT_upper_bound : 1
 <2><4b5>: Abbrev Number: 0
 <1><4b6>: Abbrev Number: 12 (DW_TAG_variable)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x1b5): __tzname
    <4bb>   DW_AT_decl_file   : 12
    <4bc>   DW_AT_decl_line   : 159
    <4bd>   DW_AT_decl_column : 14
    <4be>   DW_AT_type        : <0x4a6>
    <4c2>   DW_AT_external    : 1
    <4c3>   DW_AT_declaration : 1
 <1><4c4>: Abbrev Number: 12 (DW_TAG_variable)
    <4c5>   DW_AT_name        : (indirect string, offset: 0xec7): __daylight
    <4c9>   DW_AT_decl_file   : 12
    <4ca>   DW_AT_decl_line   : 160
    <4cb>   DW_AT_decl_column : 12
    <4cc>   DW_AT_type        : <0x64>
    <4d0>   DW_AT_external    : 1
    <4d1>   DW_AT_declaration : 1
 <1><4d2>: Abbrev Number: 12 (DW_TAG_variable)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x386): __timezone
    <4d7>   DW_AT_decl_file   : 12
    <4d8>   DW_AT_decl_line   : 161
    <4d9>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0x127>
    <4de>   DW_AT_external    : 1
    <4df>   DW_AT_declaration : 1
 <1><4e0>: Abbrev Number: 12 (DW_TAG_variable)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x9bf): tzname
    <4e5>   DW_AT_decl_file   : 12
    <4e6>   DW_AT_decl_line   : 166
    <4e7>   DW_AT_decl_column : 14
    <4e8>   DW_AT_type        : <0x4a6>
    <4ec>   DW_AT_external    : 1
    <4ed>   DW_AT_declaration : 1
 <1><4ee>: Abbrev Number: 12 (DW_TAG_variable)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x106f): daylight
    <4f3>   DW_AT_decl_file   : 12
    <4f4>   DW_AT_decl_line   : 174
    <4f5>   DW_AT_decl_column : 12
    <4f6>   DW_AT_type        : <0x64>
    <4fa>   DW_AT_external    : 1
    <4fb>   DW_AT_declaration : 1
 <1><4fc>: Abbrev Number: 12 (DW_TAG_variable)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x4d9): timezone
    <501>   DW_AT_decl_file   : 12
    <502>   DW_AT_decl_line   : 175
    <503>   DW_AT_decl_column : 17
    <504>   DW_AT_type        : <0x127>
    <508>   DW_AT_external    : 1
    <509>   DW_AT_declaration : 1
 <1><50a>: Abbrev Number: 11 (DW_TAG_variable)
    <50b>   DW_AT_name        : (indirect string, offset: 0xf5c): getdate_err
    <50f>   DW_AT_decl_file   : 12
    <510>   DW_AT_decl_line   : 274
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0x64>
    <517>   DW_AT_external    : 1
    <518>   DW_AT_declaration : 1
 <1><519>: Abbrev Number: 12 (DW_TAG_variable)
    <51a>   DW_AT_name        : (indirect string, offset: 0x9d2): debug_flag
    <51e>   DW_AT_decl_file   : 13
    <51f>   DW_AT_decl_line   : 20
    <520>   DW_AT_decl_column : 13
    <521>   DW_AT_type        : <0x527>
    <525>   DW_AT_external    : 1
    <526>   DW_AT_declaration : 1
 <1><527>: Abbrev Number: 2 (DW_TAG_base_type)
    <528>   DW_AT_byte_size   : 1
    <529>   DW_AT_encoding    : 2	(boolean)
    <52a>   DW_AT_name        : (indirect string, offset: 0x424): _Bool
 <1><52e>: Abbrev Number: 3 (DW_TAG_const_type)
    <52f>   DW_AT_type        : <0x527>
 <1><533>: Abbrev Number: 4 (DW_TAG_typedef)
    <534>   DW_AT_name        : (indirect string, offset: 0xa96): __kernel_long_t
    <538>   DW_AT_decl_file   : 14
    <539>   DW_AT_decl_line   : 14
    <53a>   DW_AT_decl_column : 19
    <53b>   DW_AT_type        : <0x88>
 <1><53f>: Abbrev Number: 4 (DW_TAG_typedef)
    <540>   DW_AT_name        : (indirect string, offset: 0x42): __kernel_ulong_t
    <544>   DW_AT_decl_file   : 14
    <545>   DW_AT_decl_line   : 15
    <546>   DW_AT_decl_column : 28
    <547>   DW_AT_type        : <0x9b>
 <1><54b>: Abbrev Number: 4 (DW_TAG_typedef)
    <54c>   DW_AT_name        : (indirect string, offset: 0x3f0): kernel_long_t
    <550>   DW_AT_decl_file   : 15
    <551>   DW_AT_decl_line   : 16
    <552>   DW_AT_decl_column : 25
    <553>   DW_AT_type        : <0x533>
 <1><557>: Abbrev Number: 4 (DW_TAG_typedef)
    <558>   DW_AT_name        : (indirect string, offset: 0x8a9): kernel_ulong_t
    <55c>   DW_AT_decl_file   : 15
    <55d>   DW_AT_decl_line   : 17
    <55e>   DW_AT_decl_column : 26
    <55f>   DW_AT_type        : <0x53f>
 <1><563>: Abbrev Number: 3 (DW_TAG_const_type)
    <564>   DW_AT_type        : <0x557>
 <1><568>: Abbrev Number: 8 (DW_TAG_structure_type)
    <569>   DW_AT_name        : (indirect string, offset: 0xbd4): list_item
    <56d>   DW_AT_byte_size   : 8
    <56e>   DW_AT_decl_file   : 16
    <56f>   DW_AT_decl_line   : 92
    <570>   DW_AT_decl_column : 8
    <571>   DW_AT_sibling     : <0x594>
 <2><575>: Abbrev Number: 9 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0x10b4): prev
    <57a>   DW_AT_decl_file   : 16
    <57b>   DW_AT_decl_line   : 93
    <57c>   DW_AT_decl_column : 20
    <57d>   DW_AT_type        : <0x594>
    <581>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><584>: Abbrev Number: 9 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x10aa): next
    <589>   DW_AT_decl_file   : 16
    <58a>   DW_AT_decl_line   : 94
    <58b>   DW_AT_decl_column : 20
    <58c>   DW_AT_type        : <0x594>
    <590>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><593>: Abbrev Number: 0
 <1><594>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <595>   DW_AT_byte_size   : 4
    <596>   DW_AT_type        : <0x568>
 <1><59a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59b>   DW_AT_name        : (indirect string, offset: 0x881): sysent
    <59f>   DW_AT_byte_size   : 20
    <5a0>   DW_AT_decl_file   : 17
    <5a1>   DW_AT_decl_line   : 13
    <5a2>   DW_AT_decl_column : 16
    <5a3>   DW_AT_sibling     : <0x5f3>
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x100d): nargs
    <5ac>   DW_AT_decl_file   : 17
    <5ad>   DW_AT_decl_line   : 14
    <5ae>   DW_AT_decl_column : 11
    <5af>   DW_AT_type        : <0x2b>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b6>: Abbrev Number: 9 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x97e): sys_flags
    <5bb>   DW_AT_decl_file   : 17
    <5bc>   DW_AT_decl_line   : 15
    <5bd>   DW_AT_decl_column : 6
    <5be>   DW_AT_type        : <0x64>
    <5c2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c5>: Abbrev Number: 19 (DW_TAG_member)
    <5c6>   DW_AT_name        : sen
    <5ca>   DW_AT_decl_file   : 17
    <5cb>   DW_AT_decl_line   : 16
    <5cc>   DW_AT_decl_column : 6
    <5cd>   DW_AT_type        : <0x64>
    <5d1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d4>: Abbrev Number: 9 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x31e): sys_func
    <5d9>   DW_AT_decl_file   : 17
    <5da>   DW_AT_decl_line   : 17
    <5db>   DW_AT_decl_column : 8
    <5dc>   DW_AT_type        : <0x84f>
    <5e0>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e3>: Abbrev Number: 9 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x293): sys_name
    <5e8>   DW_AT_decl_file   : 17
    <5e9>   DW_AT_decl_line   : 18
    <5ea>   DW_AT_decl_column : 14
    <5eb>   DW_AT_type        : <0x1db>
    <5ef>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5f4>   DW_AT_prototyped  : 1
    <5f5>   DW_AT_type        : <0x64>
    <5f9>   DW_AT_sibling     : <0x603>
 <2><5fd>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5fe>   DW_AT_type        : <0x603>
 <2><602>: Abbrev Number: 0
 <1><603>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <604>   DW_AT_byte_size   : 4
    <605>   DW_AT_type        : <0x60e>
 <1><609>: Abbrev Number: 3 (DW_TAG_const_type)
    <60a>   DW_AT_type        : <0x603>
 <1><60e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <60f>   DW_AT_name        : tcb
    <613>   DW_AT_byte_size   : 280
    <615>   DW_AT_decl_file   : 18
    <616>   DW_AT_decl_line   : 262
    <618>   DW_AT_decl_column : 8
    <619>   DW_AT_sibling     : <0x84f>
 <2><61d>: Abbrev Number: 23 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x4f4): flags
    <622>   DW_AT_decl_file   : 18
    <623>   DW_AT_decl_line   : 263
    <625>   DW_AT_decl_column : 6
    <626>   DW_AT_type        : <0x64>
    <62a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><62d>: Abbrev Number: 24 (DW_TAG_member)
    <62e>   DW_AT_name        : pid
    <632>   DW_AT_decl_file   : 18
    <633>   DW_AT_decl_line   : 264
    <635>   DW_AT_decl_column : 6
    <636>   DW_AT_type        : <0x64>
    <63a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><63d>: Abbrev Number: 23 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x61): qual_flg
    <642>   DW_AT_decl_file   : 18
    <643>   DW_AT_decl_line   : 265
    <645>   DW_AT_decl_column : 6
    <646>   DW_AT_type        : <0x64>
    <64a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><64d>: Abbrev Number: 23 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x3aa): currpers
    <652>   DW_AT_decl_file   : 18
    <653>   DW_AT_decl_line   : 267
    <655>   DW_AT_decl_column : 15
    <656>   DW_AT_type        : <0x2b>
    <65a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><65d>: Abbrev Number: 23 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0xb33): u_error
    <662>   DW_AT_decl_file   : 18
    <663>   DW_AT_decl_line   : 269
    <665>   DW_AT_decl_column : 16
    <666>   DW_AT_type        : <0x37>
    <66a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><66d>: Abbrev Number: 23 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <672>   DW_AT_decl_file   : 18
    <673>   DW_AT_decl_line   : 270
    <675>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0x557>
    <67a>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67d>: Abbrev Number: 23 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0xb6c): true_scno
    <682>   DW_AT_decl_file   : 18
    <683>   DW_AT_decl_line   : 271
    <685>   DW_AT_decl_column : 17
    <686>   DW_AT_type        : <0x557>
    <68a>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><68d>: Abbrev Number: 23 (DW_TAG_member)
    <68e>   DW_AT_name        : (indirect string, offset: 0x19f): u_arg
    <692>   DW_AT_decl_file   : 18
    <693>   DW_AT_decl_line   : 272
    <695>   DW_AT_decl_column : 17
    <696>   DW_AT_type        : <0x97f>
    <69a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><69d>: Abbrev Number: 23 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x995): u_rval
    <6a2>   DW_AT_decl_file   : 18
    <6a3>   DW_AT_decl_line   : 273
    <6a5>   DW_AT_decl_column : 16
    <6a6>   DW_AT_type        : <0x54b>
    <6aa>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6ad>: Abbrev Number: 23 (DW_TAG_member)
    <6ae>   DW_AT_name        : (indirect string, offset: 0xab2): sys_func_rval
    <6b2>   DW_AT_decl_file   : 18
    <6b3>   DW_AT_decl_line   : 274
    <6b5>   DW_AT_decl_column : 6
    <6b6>   DW_AT_type        : <0x64>
    <6ba>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6bd>: Abbrev Number: 23 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0xcc8): curcol
    <6c2>   DW_AT_decl_file   : 18
    <6c3>   DW_AT_decl_line   : 275
    <6c5>   DW_AT_decl_column : 6
    <6c6>   DW_AT_type        : <0x64>
    <6ca>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6cd>: Abbrev Number: 23 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x9a7): outf
    <6d2>   DW_AT_decl_file   : 18
    <6d3>   DW_AT_decl_line   : 276
    <6d5>   DW_AT_decl_column : 8
    <6d6>   DW_AT_type        : <0x420>
    <6da>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6dd>: Abbrev Number: 23 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0xf06): staged_output_data
    <6e2>   DW_AT_decl_file   : 18
    <6e3>   DW_AT_decl_line   : 277
    <6e5>   DW_AT_decl_column : 29
    <6e6>   DW_AT_type        : <0x995>
    <6ea>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6ed>: Abbrev Number: 23 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xa7d): auxstr
    <6f2>   DW_AT_decl_file   : 18
    <6f3>   DW_AT_decl_line   : 279
    <6f5>   DW_AT_decl_column : 14
    <6f6>   DW_AT_type        : <0x1db>
    <6fa>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6fd>: Abbrev Number: 23 (DW_TAG_member)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <702>   DW_AT_decl_file   : 18
    <703>   DW_AT_decl_line   : 280
    <705>   DW_AT_decl_column : 8
    <706>   DW_AT_type        : <0xc6>
    <70a>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><70d>: Abbrev Number: 23 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0xc01): _free_priv_data
    <712>   DW_AT_decl_file   : 18
    <713>   DW_AT_decl_line   : 281
    <715>   DW_AT_decl_column : 9
    <716>   DW_AT_type        : <0x9a7>
    <71a>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><71d>: Abbrev Number: 23 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <722>   DW_AT_decl_file   : 18
    <723>   DW_AT_decl_line   : 282
    <725>   DW_AT_decl_column : 23
    <726>   DW_AT_type        : <0x9ad>
    <72a>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><72d>: Abbrev Number: 23 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0x20): s_prev_ent
    <732>   DW_AT_decl_file   : 18
    <733>   DW_AT_decl_line   : 285
    <735>   DW_AT_decl_column : 23
    <736>   DW_AT_type        : <0x9ad>
    <73a>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><73e>: Abbrev Number: 23 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x39f): inject_vec
    <743>   DW_AT_decl_file   : 18
    <744>   DW_AT_decl_line   : 286
    <746>   DW_AT_decl_column : 22
    <747>   DW_AT_type        : <0x9b8>
    <74b>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x7f2): stime
    <754>   DW_AT_decl_file   : 18
    <755>   DW_AT_decl_line   : 287
    <757>   DW_AT_decl_column : 18
    <758>   DW_AT_type        : <0x13f>
    <75c>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><760>: Abbrev Number: 23 (DW_TAG_member)
    <761>   DW_AT_name        : (indirect string, offset: 0x3b3): ltime
    <765>   DW_AT_decl_file   : 18
    <766>   DW_AT_decl_line   : 288
    <768>   DW_AT_decl_column : 18
    <769>   DW_AT_type        : <0x13f>
    <76d>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><771>: Abbrev Number: 23 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0xfd4): atime
    <776>   DW_AT_decl_file   : 18
    <777>   DW_AT_decl_line   : 289
    <779>   DW_AT_decl_column : 18
    <77a>   DW_AT_type        : <0x13f>
    <77e>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><782>: Abbrev Number: 23 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4ee): etime
    <787>   DW_AT_decl_file   : 18
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x13f>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><793>: Abbrev Number: 23 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd2c): delay_expiration_time
    <798>   DW_AT_decl_file   : 18
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x13f>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a4>: Abbrev Number: 23 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x2b): pid_ns
    <7a9>   DW_AT_decl_file   : 18
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b5>: Abbrev Number: 23 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xf42): last_dirfd
    <7ba>   DW_AT_decl_file   : 18
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c6>: Abbrev Number: 23 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf68): mmap_cache
    <7cb>   DW_AT_decl_file   : 18
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9d4>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7d7>: Abbrev Number: 23 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb42): wait_data_idx
    <7dc>   DW_AT_decl_file   : 18
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x12e>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7e8>: Abbrev Number: 23 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa84): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 18
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0x9e0>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f9>: Abbrev Number: 23 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xaf4): wait_list
    <7fe>   DW_AT_decl_file   : 18
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x568>
    <806>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><80a>: Abbrev Number: 23 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6e7): vcpu_info_list
    <80f>   DW_AT_decl_file   : 18
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0x9ec>
    <817>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81b>: Abbrev Number: 23 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xc93): unwind_ctx
    <820>   DW_AT_decl_file   : 18
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xc6>
    <828>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82c>: Abbrev Number: 23 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x4cc): unwind_queue
    <831>   DW_AT_decl_file   : 18
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0x9f8>
    <839>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><83d>: Abbrev Number: 23 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <842>   DW_AT_decl_file   : 18
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0x9fe>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><84e>: Abbrev Number: 0
 <1><84f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <850>   DW_AT_byte_size   : 4
    <851>   DW_AT_type        : <0x5f3>
 <1><855>: Abbrev Number: 4 (DW_TAG_typedef)
    <856>   DW_AT_name        : (indirect string, offset: 0x5c0): struct_sysent
    <85a>   DW_AT_decl_file   : 17
    <85b>   DW_AT_decl_line   : 19
    <85c>   DW_AT_decl_column : 3
    <85d>   DW_AT_type        : <0x59a>
 <1><861>: Abbrev Number: 3 (DW_TAG_const_type)
    <862>   DW_AT_type        : <0x855>
 <1><866>: Abbrev Number: 12 (DW_TAG_variable)
    <867>   DW_AT_name        : (indirect string, offset: 0xd18): current_personality
    <86b>   DW_AT_decl_file   : 18
    <86c>   DW_AT_decl_line   : 158
    <86d>   DW_AT_decl_column : 17
    <86e>   DW_AT_type        : <0x2b>
    <872>   DW_AT_external    : 1
    <873>   DW_AT_declaration : 1
 <1><874>: Abbrev Number: 12 (DW_TAG_variable)
    <875>   DW_AT_name        : (indirect string, offset: 0x823): current_wordsize
    <879>   DW_AT_decl_file   : 18
    <87a>   DW_AT_decl_line   : 171
    <87b>   DW_AT_decl_column : 17
    <87c>   DW_AT_type        : <0x2b>
    <880>   DW_AT_external    : 1
    <881>   DW_AT_declaration : 1
 <1><882>: Abbrev Number: 12 (DW_TAG_variable)
    <883>   DW_AT_name        : (indirect string, offset: 0xa5b): current_klongsize
    <887>   DW_AT_decl_file   : 18
    <888>   DW_AT_decl_line   : 176
    <889>   DW_AT_decl_column : 17
    <88a>   DW_AT_type        : <0x2b>
    <88e>   DW_AT_external    : 1
    <88f>   DW_AT_declaration : 1
 <1><890>: Abbrev Number: 8 (DW_TAG_structure_type)
    <891>   DW_AT_name        : (indirect string, offset: 0xc6a): ioctlent
    <895>   DW_AT_byte_size   : 8
    <896>   DW_AT_decl_file   : 18
    <897>   DW_AT_decl_line   : 217
    <898>   DW_AT_decl_column : 16
    <899>   DW_AT_sibling     : <0x8bc>
 <2><89d>: Abbrev Number: 9 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0xf2e): symbol
    <8a2>   DW_AT_decl_file   : 18
    <8a3>   DW_AT_decl_line   : 218
    <8a4>   DW_AT_decl_column : 14
    <8a5>   DW_AT_type        : <0x1db>
    <8a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ac>: Abbrev Number: 9 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0xce1): code
    <8b1>   DW_AT_decl_file   : 18
    <8b2>   DW_AT_decl_line   : 219
    <8b3>   DW_AT_decl_column : 15
    <8b4>   DW_AT_type        : <0x2b>
    <8b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8bb>: Abbrev Number: 0
 <1><8bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <8bd>   DW_AT_name        : (indirect string, offset: 0xc2b): struct_ioctlent
    <8c1>   DW_AT_decl_file   : 18
    <8c2>   DW_AT_decl_line   : 220
    <8c3>   DW_AT_decl_column : 3
    <8c4>   DW_AT_type        : <0x890>
 <1><8c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c9>   DW_AT_type        : <0x8bc>
 <1><8cd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x817): inject_data
    <8d2>   DW_AT_byte_size   : 10
    <8d3>   DW_AT_decl_file   : 18
    <8d4>   DW_AT_decl_line   : 241
    <8d5>   DW_AT_decl_column : 8
    <8d6>   DW_AT_sibling     : <0x935>
 <2><8da>: Abbrev Number: 9 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x4f4): flags
    <8df>   DW_AT_decl_file   : 18
    <8e0>   DW_AT_decl_line   : 242
    <8e1>   DW_AT_decl_column : 10
    <8e2>   DW_AT_type        : <0xf7>
    <8e6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e9>: Abbrev Number: 9 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x932): signo
    <8ee>   DW_AT_decl_file   : 18
    <8ef>   DW_AT_decl_line   : 243
    <8f0>   DW_AT_decl_column : 10
    <8f1>   DW_AT_type        : <0xf7>
    <8f5>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8f8>: Abbrev Number: 9 (DW_TAG_member)
    <8f9>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <8fd>   DW_AT_decl_file   : 18
    <8fe>   DW_AT_decl_line   : 244
    <8ff>   DW_AT_decl_column : 11
    <900>   DW_AT_type        : <0x103>
    <904>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><907>: Abbrev Number: 9 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0xcbe): delay_idx
    <90c>   DW_AT_decl_file   : 18
    <90d>   DW_AT_decl_line   : 245
    <90e>   DW_AT_decl_column : 11
    <90f>   DW_AT_type        : <0x103>
    <913>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><916>: Abbrev Number: 9 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0x615): poke_idx
    <91b>   DW_AT_decl_file   : 18
    <91c>   DW_AT_decl_line   : 246
    <91d>   DW_AT_decl_column : 11
    <91e>   DW_AT_type        : <0x103>
    <922>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><925>: Abbrev Number: 9 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <92a>   DW_AT_decl_file   : 18
    <92b>   DW_AT_decl_line   : 247
    <92c>   DW_AT_decl_column : 11
    <92d>   DW_AT_type        : <0x103>
    <931>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><934>: Abbrev Number: 0
 <1><935>: Abbrev Number: 8 (DW_TAG_structure_type)
    <936>   DW_AT_name        : (indirect string, offset: 0xe6): inject_opts
    <93a>   DW_AT_byte_size   : 16
    <93b>   DW_AT_decl_file   : 18
    <93c>   DW_AT_decl_line   : 250
    <93d>   DW_AT_decl_column : 8
    <93e>   DW_AT_sibling     : <0x97f>
 <2><942>: Abbrev Number: 9 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0xa30): first
    <947>   DW_AT_decl_file   : 18
    <948>   DW_AT_decl_line   : 251
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0x103>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><951>: Abbrev Number: 9 (DW_TAG_member)
    <952>   DW_AT_name        : (indirect string, offset: 0x10dd): last
    <956>   DW_AT_decl_file   : 18
    <957>   DW_AT_decl_line   : 252
    <958>   DW_AT_decl_column : 11
    <959>   DW_AT_type        : <0x103>
    <95d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><960>: Abbrev Number: 9 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x3b9): step
    <965>   DW_AT_decl_file   : 18
    <966>   DW_AT_decl_line   : 253
    <967>   DW_AT_decl_column : 11
    <968>   DW_AT_type        : <0x103>
    <96c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><96f>: Abbrev Number: 9 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x10af): data
    <974>   DW_AT_decl_file   : 18
    <975>   DW_AT_decl_line   : 254
    <976>   DW_AT_decl_column : 21
    <977>   DW_AT_type        : <0x8cd>
    <97b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><97e>: Abbrev Number: 0
 <1><97f>: Abbrev Number: 16 (DW_TAG_array_type)
    <980>   DW_AT_type        : <0x557>
    <984>   DW_AT_sibling     : <0x98f>
 <2><988>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <989>   DW_AT_type        : <0x2b>
    <98d>   DW_AT_upper_bound : 5
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <990>   DW_AT_name        : (indirect string, offset: 0xf06): staged_output_data
    <994>   DW_AT_declaration : 1
 <1><995>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <996>   DW_AT_byte_size   : 4
    <997>   DW_AT_type        : <0x98f>
 <1><99b>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <99c>   DW_AT_prototyped  : 1
    <99d>   DW_AT_sibling     : <0x9a7>
 <2><9a1>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9a2>   DW_AT_type        : <0xc6>
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a8>   DW_AT_byte_size   : 4
    <9a9>   DW_AT_type        : <0x99b>
 <1><9ad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ae>   DW_AT_byte_size   : 4
    <9af>   DW_AT_type        : <0x861>
 <1><9b3>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b4>   DW_AT_type        : <0x9ad>
 <1><9b8>: Abbrev Number: 16 (DW_TAG_array_type)
    <9b9>   DW_AT_type        : <0x9c8>
    <9bd>   DW_AT_sibling     : <0x9c8>
 <2><9c1>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9c2>   DW_AT_type        : <0x2b>
    <9c6>   DW_AT_upper_bound : 2
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4
    <9ca>   DW_AT_type        : <0x935>
 <1><9ce>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9cf>   DW_AT_name        : (indirect string, offset: 0xb2): mmap_cache_t
    <9d3>   DW_AT_declaration : 1
 <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9ce>
 <1><9da>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0x3d4): tcb_wait_data
    <9df>   DW_AT_declaration : 1
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9da>
 <1><9e6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <9eb>   DW_AT_declaration : 1
 <1><9ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9e6>
 <1><9f2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xeea): unwind_queue_t
    <9f7>   DW_AT_declaration : 1
 <1><9f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
    <9fa>   DW_AT_type        : <0x9f2>
 <1><9fe>: Abbrev Number: 16 (DW_TAG_array_type)
    <9ff>   DW_AT_type        : <0xdf>
    <a03>   DW_AT_sibling     : <0xa0e>
 <2><a07>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a08>   DW_AT_type        : <0x2b>
    <a0c>   DW_AT_upper_bound : 15
 <2><a0d>: Abbrev Number: 0
 <1><a0e>: Abbrev Number: 11 (DW_TAG_variable)
    <a0f>   DW_AT_name        : (indirect string, offset: 0xb7f): stub_sysent
    <a13>   DW_AT_decl_file   : 18
    <a14>   DW_AT_decl_line   : 400
    <a16>   DW_AT_decl_column : 28
    <a17>   DW_AT_type        : <0x861>
    <a1b>   DW_AT_external    : 1
    <a1c>   DW_AT_declaration : 1
 <1><a1d>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x1092): xlat_type
    <a22>   DW_AT_encoding    : 7	(unsigned)
    <a23>   DW_AT_byte_size   : 4
    <a24>   DW_AT_type        : <0x2b>
    <a28>   DW_AT_decl_file   : 19
    <a29>   DW_AT_decl_line   : 13
    <a2a>   DW_AT_decl_column : 6
    <a2b>   DW_AT_sibling     : <0xa42>
 <2><a2f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0x2ee): XT_NORMAL
    <a34>   DW_AT_const_value : 0
 <2><a35>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xc42): XT_SORTED
    <a3a>   DW_AT_const_value : 1
 <2><a3b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xdbe): XT_INDEXED
    <a40>   DW_AT_const_value : 2
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a43>   DW_AT_name        : (indirect string, offset: 0xbab): xlat_style
    <a47>   DW_AT_encoding    : 7	(unsigned)
    <a48>   DW_AT_byte_size   : 4
    <a49>   DW_AT_type        : <0x2b>
    <a4d>   DW_AT_decl_file   : 19
    <a4e>   DW_AT_decl_line   : 19
    <a4f>   DW_AT_decl_column : 6
    <a50>   DW_AT_sibling     : <0xa7f>
 <2><a54>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0xf2): XLAT_STYLE_DEFAULT
    <a59>   DW_AT_const_value : 0
 <2><a5a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xbde): XLAT_STYLE_RAW
    <a5f>   DW_AT_const_value : 1
 <2><a60>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x105d): XLAT_STYLE_ABBREV
    <a65>   DW_AT_const_value : 2
 <2><a66>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0x30b): XLAT_STYLE_VERBOSE
    <a6b>   DW_AT_const_value : 3
 <2><a6c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x278): XLAT_STYLE_FMT_X
    <a71>   DW_AT_const_value : 0
 <2><a72>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a77>   DW_AT_const_value : 4
 <2><a78>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x10cc): XLAT_STYLE_FMT_D
    <a7d>   DW_AT_const_value : 8
 <2><a7e>: Abbrev Number: 0
 <1><a7f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a80>   DW_AT_name        : (indirect string, offset: 0x33c): xlat_data
    <a84>   DW_AT_byte_size   : 16
    <a85>   DW_AT_decl_file   : 19
    <a86>   DW_AT_decl_line   : 51
    <a87>   DW_AT_decl_column : 8
    <a88>   DW_AT_sibling     : <0xaab>
 <2><a8c>: Abbrev Number: 19 (DW_TAG_member)
    <a8d>   DW_AT_name        : val
    <a91>   DW_AT_decl_file   : 19
    <a92>   DW_AT_decl_line   : 52
    <a93>   DW_AT_decl_column : 11
    <a94>   DW_AT_type        : <0x11b>
    <a98>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a9b>: Abbrev Number: 19 (DW_TAG_member)
    <a9c>   DW_AT_name        : str
    <aa0>   DW_AT_decl_file   : 19
    <aa1>   DW_AT_decl_line   : 53
    <aa2>   DW_AT_decl_column : 14
    <aa3>   DW_AT_type        : <0x1db>
    <aa7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aaa>: Abbrev Number: 0
 <1><aab>: Abbrev Number: 3 (DW_TAG_const_type)
    <aac>   DW_AT_type        : <0xa7f>
 <1><ab0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x1b): xlat
    <ab5>   DW_AT_byte_size   : 24
    <ab6>   DW_AT_decl_file   : 19
    <ab7>   DW_AT_decl_line   : 56
    <ab8>   DW_AT_decl_column : 8
    <ab9>   DW_AT_sibling     : <0xb09>
 <2><abd>: Abbrev Number: 9 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0x10af): data
    <ac2>   DW_AT_decl_file   : 19
    <ac3>   DW_AT_decl_line   : 57
    <ac4>   DW_AT_decl_column : 26
    <ac5>   DW_AT_type        : <0xb0e>
    <ac9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><acc>: Abbrev Number: 9 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0x875): flags_strsz
    <ad1>   DW_AT_decl_file   : 19
    <ad2>   DW_AT_decl_line   : 58
    <ad3>   DW_AT_decl_column : 9
    <ad4>   DW_AT_type        : <0x12e>
    <ad8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><adb>: Abbrev Number: 9 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xb50): size
    <ae0>   DW_AT_decl_file   : 19
    <ae1>   DW_AT_decl_line   : 59
    <ae2>   DW_AT_decl_column : 11
    <ae3>   DW_AT_type        : <0x10f>
    <ae7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aea>: Abbrev Number: 9 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x19a): type
    <aef>   DW_AT_decl_file   : 19
    <af0>   DW_AT_decl_line   : 60
    <af1>   DW_AT_decl_column : 17
    <af2>   DW_AT_type        : <0xa1d>
    <af6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><af9>: Abbrev Number: 9 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x73b): flags_mask
    <afe>   DW_AT_decl_file   : 19
    <aff>   DW_AT_decl_line   : 61
    <b00>   DW_AT_decl_column : 11
    <b01>   DW_AT_type        : <0x11b>
    <b05>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0a>   DW_AT_type        : <0xab0>
 <1><b0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b0f>   DW_AT_byte_size   : 4
    <b10>   DW_AT_type        : <0xaab>
 <1><b14>: Abbrev Number: 16 (DW_TAG_array_type)
    <b15>   DW_AT_type        : <0xb09>
    <b19>   DW_AT_sibling     : <0xb1f>
 <2><b1d>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b1e>: Abbrev Number: 0
 <1><b1f>: Abbrev Number: 3 (DW_TAG_const_type)
    <b20>   DW_AT_type        : <0xb14>
 <1><b24>: Abbrev Number: 11 (DW_TAG_variable)
    <b25>   DW_AT_name        : (indirect string, offset: 0xe2f): addrfams
    <b29>   DW_AT_decl_file   : 18
    <b2a>   DW_AT_decl_line   : 406
    <b2c>   DW_AT_decl_column : 26
    <b2d>   DW_AT_type        : <0xb1f>
    <b31>   DW_AT_external    : 1
    <b32>   DW_AT_declaration : 1
 <1><b33>: Abbrev Number: 11 (DW_TAG_variable)
    <b34>   DW_AT_name        : (indirect string, offset: 0xcf1): arp_hardware_types
    <b38>   DW_AT_decl_file   : 18
    <b39>   DW_AT_decl_line   : 407
    <b3b>   DW_AT_decl_column : 26
    <b3c>   DW_AT_type        : <0xb1f>
    <b40>   DW_AT_external    : 1
    <b41>   DW_AT_declaration : 1
 <1><b42>: Abbrev Number: 11 (DW_TAG_variable)
    <b43>   DW_AT_name        : (indirect string, offset: 0xfda): at_flags
    <b47>   DW_AT_decl_file   : 18
    <b48>   DW_AT_decl_line   : 408
    <b4a>   DW_AT_decl_column : 26
    <b4b>   DW_AT_type        : <0xb1f>
    <b4f>   DW_AT_external    : 1
    <b50>   DW_AT_declaration : 1
 <1><b51>: Abbrev Number: 11 (DW_TAG_variable)
    <b52>   DW_AT_name        : (indirect string, offset: 0x4a3): clocknames
    <b56>   DW_AT_decl_file   : 18
    <b57>   DW_AT_decl_line   : 409
    <b59>   DW_AT_decl_column : 26
    <b5a>   DW_AT_type        : <0xb1f>
    <b5e>   DW_AT_external    : 1
    <b5f>   DW_AT_declaration : 1
 <1><b60>: Abbrev Number: 11 (DW_TAG_variable)
    <b61>   DW_AT_name        : (indirect string, offset: 0xfa4): dirent_types
    <b65>   DW_AT_decl_file   : 18
    <b66>   DW_AT_decl_line   : 410
    <b68>   DW_AT_decl_column : 26
    <b69>   DW_AT_type        : <0xb1f>
    <b6d>   DW_AT_external    : 1
    <b6e>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 11 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0x8c6): ethernet_protocols
    <b74>   DW_AT_decl_file   : 18
    <b75>   DW_AT_decl_line   : 411
    <b77>   DW_AT_decl_column : 26
    <b78>   DW_AT_type        : <0xb1f>
    <b7c>   DW_AT_external    : 1
    <b7d>   DW_AT_declaration : 1
 <1><b7e>: Abbrev Number: 11 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x668): inet_protocols
    <b83>   DW_AT_decl_file   : 18
    <b84>   DW_AT_decl_line   : 412
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb1f>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 11 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x2db): evdev_abs
    <b92>   DW_AT_decl_file   : 18
    <b93>   DW_AT_decl_line   : 413
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb1f>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 11 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x730): audit_arch
    <ba1>   DW_AT_decl_file   : 18
    <ba2>   DW_AT_decl_line   : 414
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb1f>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 11 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x9e): evdev_ev
    <bb0>   DW_AT_decl_file   : 18
    <bb1>   DW_AT_decl_line   : 415
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb1f>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 11 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x484): iffflags
    <bbf>   DW_AT_decl_file   : 18
    <bc0>   DW_AT_decl_line   : 416
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb1f>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 11 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0xbed): ip_type_of_services
    <bce>   DW_AT_decl_file   : 18
    <bcf>   DW_AT_decl_line   : 417
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb1f>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 11 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x6c3): ipc_private
    <bdd>   DW_AT_decl_file   : 18
    <bde>   DW_AT_decl_line   : 418
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb1f>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 11 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x332): msg_flags
    <bec>   DW_AT_decl_file   : 18
    <bed>   DW_AT_decl_line   : 419
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb1f>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 11 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <bfb>   DW_AT_decl_file   : 18
    <bfc>   DW_AT_decl_line   : 420
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb1f>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 11 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0xf19): nl_bridge_vlan_flags
    <c0a>   DW_AT_decl_file   : 18
    <c0b>   DW_AT_decl_line   : 421
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb1f>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 11 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0xda7): nl_netfilter_msg_types
    <c19>   DW_AT_decl_file   : 18
    <c1a>   DW_AT_decl_line   : 422
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb1f>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 11 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0x236): nl_route_types
    <c28>   DW_AT_decl_file   : 18
    <c29>   DW_AT_decl_line   : 423
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb1f>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 11 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0xe66): open_access_modes
    <c37>   DW_AT_decl_file   : 18
    <c38>   DW_AT_decl_line   : 424
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb1f>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 11 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0x8e): open_mode_flags
    <c46>   DW_AT_decl_file   : 18
    <c47>   DW_AT_decl_line   : 425
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb1f>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 11 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0xc1e): perf_type_id
    <c55>   DW_AT_decl_file   : 18
    <c56>   DW_AT_decl_line   : 426
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb1f>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 11 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xe38): pollflags
    <c64>   DW_AT_decl_file   : 18
    <c65>   DW_AT_decl_line   : 427
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb1f>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 11 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x609): ptrace_cmds
    <c73>   DW_AT_decl_file   : 18
    <c74>   DW_AT_decl_line   : 428
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb1f>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 11 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x808): resource_flags
    <c82>   DW_AT_decl_file   : 18
    <c83>   DW_AT_decl_line   : 429
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb1f>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 11 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x2b1): route_nexthop_flags
    <c91>   DW_AT_decl_file   : 18
    <c92>   DW_AT_decl_line   : 430
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb1f>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 11 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xea4): routing_protocols
    <ca0>   DW_AT_decl_file   : 18
    <ca1>   DW_AT_decl_line   : 431
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb1f>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 11 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0x475): routing_scopes
    <caf>   DW_AT_decl_file   : 18
    <cb0>   DW_AT_decl_line   : 432
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb1f>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 11 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0xd95): routing_table_ids
    <cbe>   DW_AT_decl_file   : 18
    <cbf>   DW_AT_decl_line   : 433
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb1f>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 11 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x6a0): routing_types
    <ccd>   DW_AT_decl_file   : 18
    <cce>   DW_AT_decl_line   : 434
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb1f>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 11 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x1be): rwf_flags
    <cdc>   DW_AT_decl_file   : 18
    <cdd>   DW_AT_decl_line   : 435
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb1f>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 11 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x840): seccomp_filter_flags
    <ceb>   DW_AT_decl_file   : 18
    <cec>   DW_AT_decl_line   : 436
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb1f>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 11 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x2f8): seccomp_ret_action
    <cfa>   DW_AT_decl_file   : 18
    <cfb>   DW_AT_decl_line   : 437
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb1f>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 11 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x43e): setns_types
    <d09>   DW_AT_decl_file   : 18
    <d0a>   DW_AT_decl_line   : 438
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb1f>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 11 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0xe24): sg_io_info
    <d18>   DW_AT_decl_file   : 18
    <d19>   DW_AT_decl_line   : 439
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb1f>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 11 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0xb93): socketlayers
    <d27>   DW_AT_decl_file   : 18
    <d28>   DW_AT_decl_line   : 440
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb1f>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 11 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0xd65): socktypes
    <d36>   DW_AT_decl_file   : 18
    <d37>   DW_AT_decl_line   : 441
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb1f>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 11 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0xa6d): tcp_state_flags
    <d45>   DW_AT_decl_file   : 18
    <d46>   DW_AT_decl_line   : 442
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb1f>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 11 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0x765): tcp_states
    <d54>   DW_AT_decl_file   : 18
    <d55>   DW_AT_decl_line   : 443
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb1f>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 11 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x1040): whence_codes
    <d63>   DW_AT_decl_file   : 18
    <d64>   DW_AT_decl_line   : 444
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb1f>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d6e>   DW_AT_encoding    : 7	(unsigned)
    <d6f>   DW_AT_byte_size   : 4
    <d70>   DW_AT_type        : <0x2b>
    <d74>   DW_AT_decl_file   : 18
    <d75>   DW_AT_decl_line   : 505
    <d77>   DW_AT_decl_column : 14
    <d78>   DW_AT_sibling     : <0xd8f>
 <2><d7c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x99c): CFLAG_NONE
    <d81>   DW_AT_const_value : 0
 <2><d82>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d83>   DW_AT_name        : (indirect string, offset: 0x8d9): CFLAG_ONLY_STATS
    <d87>   DW_AT_const_value : 1
 <2><d88>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d89>   DW_AT_name        : (indirect string, offset: 0xba0): CFLAG_BOTH
    <d8d>   DW_AT_const_value : 2
 <2><d8e>: Abbrev Number: 0
 <1><d8f>: Abbrev Number: 10 (DW_TAG_typedef)
    <d90>   DW_AT_name        : (indirect string, offset: 0x10e2): cflag_t
    <d94>   DW_AT_decl_file   : 18
    <d95>   DW_AT_decl_line   : 509
    <d97>   DW_AT_decl_column : 3
    <d98>   DW_AT_type        : <0xd6d>
 <1><d9c>: Abbrev Number: 11 (DW_TAG_variable)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xcb8): cflag
    <da1>   DW_AT_decl_file   : 18
    <da2>   DW_AT_decl_line   : 510
    <da4>   DW_AT_decl_column : 16
    <da5>   DW_AT_type        : <0xd8f>
    <da9>   DW_AT_external    : 1
    <daa>   DW_AT_declaration : 1
 <1><dab>: Abbrev Number: 11 (DW_TAG_variable)
    <dac>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <db0>   DW_AT_decl_file   : 18
    <db1>   DW_AT_decl_line   : 511
    <db3>   DW_AT_decl_column : 13
    <db4>   DW_AT_type        : <0x527>
    <db8>   DW_AT_external    : 1
    <db9>   DW_AT_declaration : 1
 <1><dba>: Abbrev Number: 11 (DW_TAG_variable)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x7bb): Tflag_scale
    <dbf>   DW_AT_decl_file   : 18
    <dc0>   DW_AT_decl_line   : 512
    <dc2>   DW_AT_decl_column : 12
    <dc3>   DW_AT_type        : <0x64>
    <dc7>   DW_AT_external    : 1
    <dc8>   DW_AT_declaration : 1
 <1><dc9>: Abbrev Number: 11 (DW_TAG_variable)
    <dca>   DW_AT_name        : (indirect string, offset: 0x855): Tflag_width
    <dce>   DW_AT_decl_file   : 18
    <dcf>   DW_AT_decl_line   : 513
    <dd1>   DW_AT_decl_column : 12
    <dd2>   DW_AT_type        : <0x64>
    <dd6>   DW_AT_external    : 1
    <dd7>   DW_AT_declaration : 1
 <1><dd8>: Abbrev Number: 11 (DW_TAG_variable)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xe16): iflag
    <ddd>   DW_AT_decl_file   : 18
    <dde>   DW_AT_decl_line   : 514
    <de0>   DW_AT_decl_column : 13
    <de1>   DW_AT_type        : <0x527>
    <de5>   DW_AT_external    : 1
    <de6>   DW_AT_declaration : 1
 <1><de7>: Abbrev Number: 11 (DW_TAG_variable)
    <de8>   DW_AT_name        : (indirect string, offset: 0x649): count_wallclock
    <dec>   DW_AT_decl_file   : 18
    <ded>   DW_AT_decl_line   : 515
    <def>   DW_AT_decl_column : 13
    <df0>   DW_AT_type        : <0x527>
    <df4>   DW_AT_external    : 1
    <df5>   DW_AT_declaration : 1
 <1><df6>: Abbrev Number: 29 (DW_TAG_structure_type)
    <df7>   DW_AT_name        : (indirect string, offset: 0x53): path_set_item
    <dfb>   DW_AT_byte_size   : 4
    <dfc>   DW_AT_decl_file   : 18
    <dfd>   DW_AT_decl_line   : 517
    <dff>   DW_AT_decl_column : 8
    <e00>   DW_AT_sibling     : <0xe15>
 <2><e04>: Abbrev Number: 23 (DW_TAG_member)
    <e05>   DW_AT_name        : (indirect string, offset: 0xcc): path
    <e09>   DW_AT_decl_file   : 18
    <e0a>   DW_AT_decl_line   : 518
    <e0c>   DW_AT_decl_column : 14
    <e0d>   DW_AT_type        : <0x1db>
    <e11>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e14>: Abbrev Number: 0
 <1><e15>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e16>   DW_AT_name        : (indirect string, offset: 0x770): path_set
    <e1a>   DW_AT_byte_size   : 12
    <e1b>   DW_AT_decl_file   : 18
    <e1c>   DW_AT_decl_line   : 522
    <e1e>   DW_AT_decl_column : 15
    <e1f>   DW_AT_sibling     : <0xe54>
 <2><e23>: Abbrev Number: 23 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0x6fe): paths_selected
    <e28>   DW_AT_decl_file   : 18
    <e29>   DW_AT_decl_line   : 523
    <e2b>   DW_AT_decl_column : 24
    <e2c>   DW_AT_type        : <0xe54>
    <e30>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e33>: Abbrev Number: 23 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0x1033): num_selected
    <e38>   DW_AT_decl_file   : 18
    <e39>   DW_AT_decl_line   : 524
    <e3b>   DW_AT_decl_column : 9
    <e3c>   DW_AT_type        : <0x12e>
    <e40>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e43>: Abbrev Number: 23 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0xb50): size
    <e48>   DW_AT_decl_file   : 18
    <e49>   DW_AT_decl_line   : 525
    <e4b>   DW_AT_decl_column : 9
    <e4c>   DW_AT_type        : <0x12e>
    <e50>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e55>   DW_AT_byte_size   : 4
    <e56>   DW_AT_type        : <0xdf6>
 <1><e5a>: Abbrev Number: 11 (DW_TAG_variable)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x1082): global_path_set
    <e5f>   DW_AT_decl_file   : 18
    <e60>   DW_AT_decl_line   : 526
    <e62>   DW_AT_decl_column : 3
    <e63>   DW_AT_type        : <0xe15>
    <e67>   DW_AT_external    : 1
    <e68>   DW_AT_declaration : 1
 <1><e69>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xf91): xflag_opts
    <e6e>   DW_AT_encoding    : 7	(unsigned)
    <e6f>   DW_AT_byte_size   : 4
    <e70>   DW_AT_type        : <0x2b>
    <e74>   DW_AT_decl_file   : 18
    <e75>   DW_AT_decl_line   : 528
    <e77>   DW_AT_decl_column : 6
    <e78>   DW_AT_sibling     : <0xe9b>
 <2><e7c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0xa24): HEXSTR_NONE
    <e81>   DW_AT_const_value : 0
 <2><e82>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e83>   DW_AT_name        : (indirect string, offset: 0xfbc): HEXSTR_NON_ASCII
    <e87>   DW_AT_const_value : 1
 <2><e88>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e89>   DW_AT_name        : (indirect string, offset: 0x91d): HEXSTR_ALL
    <e8d>   DW_AT_const_value : 2
 <2><e8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x689): HEXSTR_NON_ASCII_CHARS
    <e93>   DW_AT_const_value : 3
 <2><e94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x104d): NUM_HEXSTR_OPTS
    <e99>   DW_AT_const_value : 4
 <2><e9a>: Abbrev Number: 0
 <1><e9b>: Abbrev Number: 11 (DW_TAG_variable)
    <e9c>   DW_AT_name        : (indirect string, offset: 0xdf0): xflag
    <ea0>   DW_AT_decl_file   : 18
    <ea1>   DW_AT_decl_line   : 541
    <ea3>   DW_AT_decl_column : 17
    <ea4>   DW_AT_type        : <0x2b>
    <ea8>   DW_AT_external    : 1
    <ea9>   DW_AT_declaration : 1
 <1><eaa>: Abbrev Number: 11 (DW_TAG_variable)
    <eab>   DW_AT_name        : (indirect string, offset: 0xc73): followfork
    <eaf>   DW_AT_decl_file   : 18
    <eb0>   DW_AT_decl_line   : 542
    <eb2>   DW_AT_decl_column : 13
    <eb3>   DW_AT_type        : <0x527>
    <eb7>   DW_AT_external    : 1
    <eb8>   DW_AT_declaration : 1
 <1><eb9>: Abbrev Number: 11 (DW_TAG_variable)
    <eba>   DW_AT_name        : (indirect string, offset: 0x346): output_separately
    <ebe>   DW_AT_decl_file   : 18
    <ebf>   DW_AT_decl_line   : 543
    <ec1>   DW_AT_decl_column : 13
    <ec2>   DW_AT_type        : <0x527>
    <ec6>   DW_AT_external    : 1
    <ec7>   DW_AT_declaration : 1
 <1><ec8>: Abbrev Number: 11 (DW_TAG_variable)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x245): stack_trace_enabled
    <ecd>   DW_AT_decl_file   : 18
    <ece>   DW_AT_decl_line   : 546
    <ed0>   DW_AT_decl_column : 13
    <ed1>   DW_AT_type        : <0x527>
    <ed5>   DW_AT_external    : 1
    <ed6>   DW_AT_declaration : 1
 <1><ed7>: Abbrev Number: 11 (DW_TAG_variable)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x677): ptrace_setoptions
    <edc>   DW_AT_decl_file   : 18
    <edd>   DW_AT_decl_line   : 550
    <edf>   DW_AT_decl_column : 17
    <ee0>   DW_AT_type        : <0x2b>
    <ee4>   DW_AT_external    : 1
    <ee5>   DW_AT_declaration : 1
 <1><ee6>: Abbrev Number: 11 (DW_TAG_variable)
    <ee7>   DW_AT_name        : (indirect string, offset: 0xa19): max_strlen
    <eeb>   DW_AT_decl_file   : 18
    <eec>   DW_AT_decl_line   : 551
    <eee>   DW_AT_decl_column : 17
    <eef>   DW_AT_type        : <0x2b>
    <ef3>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef5>: Abbrev Number: 11 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xa47): os_release
    <efa>   DW_AT_decl_file   : 18
    <efb>   DW_AT_decl_line   : 552
    <efd>   DW_AT_decl_column : 17
    <efe>   DW_AT_type        : <0x2b>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 11 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0x70d): xlat_verbosity
    <f09>   DW_AT_decl_file   : 18
    <f0a>   DW_AT_decl_line   : 914
    <f0c>   DW_AT_decl_column : 24
    <f0d>   DW_AT_type        : <0xa42>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f14>   DW_AT_name        : (indirect string, offset: 0x62c): xlat_style_private_flag_bits
    <f18>   DW_AT_encoding    : 7	(unsigned)
    <f19>   DW_AT_byte_size   : 4
    <f1a>   DW_AT_type        : <0x2b>
    <f1e>   DW_AT_decl_file   : 18
    <f1f>   DW_AT_decl_line   : 934
    <f21>   DW_AT_decl_column : 6
    <f22>   DW_AT_sibling     : <0xf3f>
 <2><f26>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f27>   DW_AT_name        : (indirect string, offset: 0x2c5): PAF_PRINT_INDICES_BIT
    <f2b>   DW_AT_const_value : 5
 <2><f2c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f2d>   DW_AT_name        : (indirect string, offset: 0xb07): PAF_ARRAY_TRUNCATED_BIT
    <f31>   DW_AT_const_value : 6
 <2><f32>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x3fe): PXF_DEFAULT_STR_BIT
    <f37>   DW_AT_const_value : 7
 <2><f38>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0xc55): SPFF_AUXSTR_MODE_BIT
    <f3d>   DW_AT_const_value : 8
 <2><f3e>: Abbrev Number: 0
 <1><f3f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f40>   DW_AT_name        : (indirect string, offset: 0xd04): find_xlat_flag_bits
    <f44>   DW_AT_encoding    : 7	(unsigned)
    <f45>   DW_AT_byte_size   : 4
    <f46>   DW_AT_type        : <0x2b>
    <f4a>   DW_AT_decl_file   : 18
    <f4b>   DW_AT_decl_line   : 1438
    <f4d>   DW_AT_decl_column : 6
    <f4e>   DW_AT_sibling     : <0xf59>
 <2><f52>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f53>   DW_AT_name        : (indirect string, offset: 0x95a): FXL_CASE_SENSITIVE_BIT
    <f57>   DW_AT_const_value : 0
 <2><f58>: Abbrev Number: 0
 <1><f59>: Abbrev Number: 11 (DW_TAG_variable)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x9e7): printing_tcp
    <f5e>   DW_AT_decl_file   : 18
    <f5f>   DW_AT_decl_line   : 1684
    <f61>   DW_AT_decl_column : 20
    <f62>   DW_AT_type        : <0x603>
    <f66>   DW_AT_external    : 1
    <f67>   DW_AT_declaration : 1
 <1><f68>: Abbrev Number: 11 (DW_TAG_variable)
    <f69>   DW_AT_name        : (indirect string, offset: 0x5e0): errnoent
    <f6d>   DW_AT_decl_file   : 18
    <f6e>   DW_AT_decl_line   : 1882
    <f70>   DW_AT_decl_column : 26
    <f71>   DW_AT_type        : <0x45b>
    <f75>   DW_AT_external    : 1
    <f76>   DW_AT_declaration : 1
 <1><f77>: Abbrev Number: 11 (DW_TAG_variable)
    <f78>   DW_AT_name        : (indirect string, offset: 0x861): signalent
    <f7c>   DW_AT_decl_file   : 18
    <f7d>   DW_AT_decl_line   : 1883
    <f7f>   DW_AT_decl_column : 26
    <f80>   DW_AT_type        : <0x45b>
    <f84>   DW_AT_external    : 1
    <f85>   DW_AT_declaration : 1
 <1><f86>: Abbrev Number: 11 (DW_TAG_variable)
    <f87>   DW_AT_name        : (indirect string, offset: 0xe5e): nerrnos
    <f8b>   DW_AT_decl_file   : 18
    <f8c>   DW_AT_decl_line   : 1884
    <f8e>   DW_AT_decl_column : 27
    <f8f>   DW_AT_type        : <0x32>
    <f93>   DW_AT_external    : 1
    <f94>   DW_AT_declaration : 1
 <1><f95>: Abbrev Number: 11 (DW_TAG_variable)
    <f96>   DW_AT_name        : (indirect string, offset: 0x101c): nsignals
    <f9a>   DW_AT_decl_file   : 18
    <f9b>   DW_AT_decl_line   : 1885
    <f9d>   DW_AT_decl_column : 27
    <f9e>   DW_AT_type        : <0x32>
    <fa2>   DW_AT_external    : 1
    <fa3>   DW_AT_declaration : 1
 <1><fa4>: Abbrev Number: 16 (DW_TAG_array_type)
    <fa5>   DW_AT_type        : <0x861>
    <fa9>   DW_AT_sibling     : <0xfaf>
 <2><fad>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fae>: Abbrev Number: 0
 <1><faf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb0>   DW_AT_type        : <0xfa4>
 <1><fb4>: Abbrev Number: 11 (DW_TAG_variable)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xccf): sysent0
    <fb9>   DW_AT_decl_file   : 18
    <fba>   DW_AT_decl_line   : 1887
    <fbc>   DW_AT_decl_column : 28
    <fbd>   DW_AT_type        : <0xfaf>
    <fc1>   DW_AT_external    : 1
    <fc2>   DW_AT_declaration : 1
 <1><fc3>: Abbrev Number: 16 (DW_TAG_array_type)
    <fc4>   DW_AT_type        : <0x8c8>
    <fc8>   DW_AT_sibling     : <0xfce>
 <2><fcc>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fcd>: Abbrev Number: 0
 <1><fce>: Abbrev Number: 3 (DW_TAG_const_type)
    <fcf>   DW_AT_type        : <0xfc3>
 <1><fd3>: Abbrev Number: 11 (DW_TAG_variable)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x1078): ioctlent0
    <fd8>   DW_AT_decl_file   : 18
    <fd9>   DW_AT_decl_line   : 1888
    <fdb>   DW_AT_decl_column : 30
    <fdc>   DW_AT_type        : <0xfce>
    <fe0>   DW_AT_external    : 1
    <fe1>   DW_AT_declaration : 1
 <1><fe2>: Abbrev Number: 11 (DW_TAG_variable)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x463): personality_names
    <fe7>   DW_AT_decl_file   : 18
    <fe8>   DW_AT_decl_line   : 1890
    <fea>   DW_AT_decl_column : 26
    <feb>   DW_AT_type        : <0x45b>
    <fef>   DW_AT_external    : 1
    <ff0>   DW_AT_declaration : 1
 <1><ff1>: Abbrev Number: 11 (DW_TAG_variable)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x881): sysent
    <ff6>   DW_AT_decl_file   : 18
    <ff7>   DW_AT_decl_line   : 1893
    <ff9>   DW_AT_decl_column : 29
    <ffa>   DW_AT_type        : <0x9ad>
    <ffe>   DW_AT_external    : 1
    <fff>   DW_AT_declaration : 1
 <1><1000>: Abbrev Number: 11 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0xc6a): ioctlent
    <1005>   DW_AT_decl_file   : 18
    <1006>   DW_AT_decl_line   : 1894
    <1008>   DW_AT_decl_column : 31
    <1009>   DW_AT_type        : <0x100f>
    <100d>   DW_AT_external    : 1
    <100e>   DW_AT_declaration : 1
 <1><100f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1010>   DW_AT_byte_size   : 4
    <1011>   DW_AT_type        : <0x8c8>
 <1><1015>: Abbrev Number: 11 (DW_TAG_variable)
    <1016>   DW_AT_name        : (indirect string, offset: 0x86b): nsyscalls
    <101a>   DW_AT_decl_file   : 18
    <101b>   DW_AT_decl_line   : 1900
    <101d>   DW_AT_decl_column : 17
    <101e>   DW_AT_type        : <0x2b>
    <1022>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1024>: Abbrev Number: 11 (DW_TAG_variable)
    <1025>   DW_AT_name        : (indirect string, offset: 0xe84): nioctlents
    <1029>   DW_AT_decl_file   : 18
    <102a>   DW_AT_decl_line   : 1901
    <102c>   DW_AT_decl_column : 17
    <102d>   DW_AT_type        : <0x2b>
    <1031>   DW_AT_external    : 1
    <1032>   DW_AT_declaration : 1
 <1><1033>: Abbrev Number: 16 (DW_TAG_array_type)
    <1034>   DW_AT_type        : <0x32>
    <1038>   DW_AT_sibling     : <0x1043>
 <2><103c>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <103d>   DW_AT_type        : <0x2b>
    <1041>   DW_AT_upper_bound : 2
 <2><1042>: Abbrev Number: 0
 <1><1043>: Abbrev Number: 3 (DW_TAG_const_type)
    <1044>   DW_AT_type        : <0x1033>
 <1><1048>: Abbrev Number: 11 (DW_TAG_variable)
    <1049>   DW_AT_name        : (indirect string, offset: 0xef9): nsyscall_vec
    <104d>   DW_AT_decl_file   : 18
    <104e>   DW_AT_decl_line   : 1903
    <1050>   DW_AT_decl_column : 27
    <1051>   DW_AT_type        : <0x1043>
    <1055>   DW_AT_external    : 1
    <1056>   DW_AT_declaration : 1
 <1><1057>: Abbrev Number: 16 (DW_TAG_array_type)
    <1058>   DW_AT_type        : <0x9b3>
    <105c>   DW_AT_sibling     : <0x1067>
 <2><1060>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1061>   DW_AT_type        : <0x2b>
    <1065>   DW_AT_upper_bound : 2
 <2><1066>: Abbrev Number: 0
 <1><1067>: Abbrev Number: 3 (DW_TAG_const_type)
    <1068>   DW_AT_type        : <0x1057>
 <1><106c>: Abbrev Number: 11 (DW_TAG_variable)
    <106d>   DW_AT_name        : (indirect string, offset: 0x7a8): sysent_vec
    <1071>   DW_AT_decl_file   : 18
    <1072>   DW_AT_decl_line   : 1904
    <1074>   DW_AT_decl_column : 35
    <1075>   DW_AT_type        : <0x1067>
    <1079>   DW_AT_external    : 1
    <107a>   DW_AT_declaration : 1
 <1><107b>: Abbrev Number: 11 (DW_TAG_variable)
    <107c>   DW_AT_name        : (indirect string, offset: 0x39f): inject_vec
    <1080>   DW_AT_decl_file   : 18
    <1081>   DW_AT_decl_line   : 1905
    <1083>   DW_AT_decl_column : 28
    <1084>   DW_AT_type        : <0x9b8>
    <1088>   DW_AT_external    : 1
    <1089>   DW_AT_declaration : 1
 <1><108a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <108b>   DW_AT_name        : (indirect string, offset: 0xd58): audit_arch_t
    <108f>   DW_AT_byte_size   : 8
    <1090>   DW_AT_decl_file   : 18
    <1091>   DW_AT_decl_line   : 1907
    <1093>   DW_AT_decl_column : 8
    <1094>   DW_AT_sibling     : <0x10b9>
 <2><1098>: Abbrev Number: 23 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0x61e): arch
    <109d>   DW_AT_decl_file   : 18
    <109e>   DW_AT_decl_line   : 1908
    <10a0>   DW_AT_decl_column : 15
    <10a1>   DW_AT_type        : <0x2b>
    <10a5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10a8>: Abbrev Number: 23 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x9cd): flag
    <10ad>   DW_AT_decl_file   : 18
    <10ae>   DW_AT_decl_line   : 1909
    <10b0>   DW_AT_decl_column : 15
    <10b1>   DW_AT_type        : <0x2b>
    <10b5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10b8>: Abbrev Number: 0
 <1><10b9>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ba>   DW_AT_type        : <0x108a>
 <1><10be>: Abbrev Number: 16 (DW_TAG_array_type)
    <10bf>   DW_AT_type        : <0x10b9>
    <10c3>   DW_AT_sibling     : <0x10ce>
 <2><10c7>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <10c8>   DW_AT_type        : <0x2b>
    <10cc>   DW_AT_upper_bound : 2
 <2><10cd>: Abbrev Number: 0
 <1><10ce>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cf>   DW_AT_type        : <0x10be>
 <1><10d3>: Abbrev Number: 11 (DW_TAG_variable)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x94b): audit_arch_vec
    <10d8>   DW_AT_decl_file   : 18
    <10d9>   DW_AT_decl_line   : 1912
    <10db>   DW_AT_decl_column : 34
    <10dc>   DW_AT_type        : <0x10ce>
    <10e0>   DW_AT_external    : 1
    <10e1>   DW_AT_declaration : 1
 <1><10e2>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e3>   DW_AT_byte_size   : 180
    <10e4>   DW_AT_decl_file   : 20
    <10e5>   DW_AT_decl_line   : 2
    <10e6>   DW_AT_decl_column : 9
    <10e7>   DW_AT_sibling     : <0x139c>
 <2><10eb>: Abbrev Number: 9 (DW_TAG_member)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x1d6): block_ioctl
    <10f0>   DW_AT_decl_file   : 20
    <10f1>   DW_AT_decl_line   : 3
    <10f2>   DW_AT_decl_column : 8
    <10f3>   DW_AT_type        : <0x13b6>
    <10f7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10fa>: Abbrev Number: 9 (DW_TAG_member)
    <10fb>   DW_AT_name        : (indirect string, offset: 0xaa6): btrfs_ioctl
    <10ff>   DW_AT_decl_file   : 20
    <1100>   DW_AT_decl_line   : 6
    <1101>   DW_AT_decl_column : 8
    <1102>   DW_AT_type        : <0x13b6>
    <1106>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1109>: Abbrev Number: 9 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0x746): evdev_write_ioctl_mpers
    <110e>   DW_AT_decl_file   : 20
    <110f>   DW_AT_decl_line   : 9
    <1110>   DW_AT_decl_column : 8
    <1111>   DW_AT_type        : <0x13b6>
    <1115>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1118>: Abbrev Number: 9 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0x71c): get_sock_fprog_size
    <111d>   DW_AT_decl_file   : 20
    <111e>   DW_AT_decl_line   : 12
    <111f>   DW_AT_decl_column : 17
    <1120>   DW_AT_type        : <0x13c2>
    <1124>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1127>: Abbrev Number: 9 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0x1a5): fetch_bpf_fprog
    <112c>   DW_AT_decl_file   : 20
    <112d>   DW_AT_decl_line   : 15
    <112e>   DW_AT_decl_column : 10
    <112f>   DW_AT_type        : <0x13e2>
    <1133>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1136>: Abbrev Number: 9 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0x938): fetch_struct_flock
    <113b>   DW_AT_decl_file   : 20
    <113c>   DW_AT_decl_line   : 18
    <113d>   DW_AT_decl_column : 10
    <113e>   DW_AT_type        : <0x13e2>
    <1142>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1145>: Abbrev Number: 9 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0xc7e): fetch_struct_flock64
    <114a>   DW_AT_decl_file   : 20
    <114b>   DW_AT_decl_line   : 21
    <114c>   DW_AT_decl_column : 10
    <114d>   DW_AT_type        : <0x13e2>
    <1151>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><1154>: Abbrev Number: 9 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0x156): fetch_struct_iovec
    <1159>   DW_AT_decl_file   : 20
    <115a>   DW_AT_decl_line   : 24
    <115b>   DW_AT_decl_column : 10
