Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x169b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4c9): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x901): mpers-mx32/struct_flock64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa15): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x39e): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfdc): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x96d): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x341): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x24a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdd0): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x46d): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x857): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xea9): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x887): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x762): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb59): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb8f): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xce3): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc50): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x3ea): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x436): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x34d): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xb7a): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xf60): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xde0): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2b6): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xaf3): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10a9): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe06): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xab5): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x26d): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0x396): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0xfc0): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x735): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xc3f): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xb3f): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x355): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x9f1): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x4bc): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0xf07): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x79e): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x1015): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x8c9): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x956): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0xd7b): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x1b5): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0xcaa): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x5ea): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x1f8): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0xf86): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x78a): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x803): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x226): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xe2c): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xcba): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x6bd): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xa47): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0xfa4): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x3ba): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xc15): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x9ab): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x254): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x7b8): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0xad5): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x462): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x2ff): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x369): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5a1): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0xfef): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0xdc9): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x232): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x5b0): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x25a): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xe3b): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x696): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0xbba): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x1a2): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xe90): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x35e): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x9a4): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x105f): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x4a7): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0xf34): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0x9bf): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x3fc): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0xa8b): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x590): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x23b): __kernel_pid_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 28
    <539>   DW_AT_decl_column : 14
    <53a>   DW_AT_type        : <0x64>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x725): __kernel_loff_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 88
    <545>   DW_AT_decl_column : 19
    <546>   DW_AT_type        : <0x88>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x3c8): kernel_long_t
    <54f>   DW_AT_decl_file   : 16
    <550>   DW_AT_decl_line   : 16
    <551>   DW_AT_decl_column : 25
    <552>   DW_AT_type        : <0x51a>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x878): kernel_ulong_t
    <55b>   DW_AT_decl_file   : 16
    <55c>   DW_AT_decl_line   : 17
    <55d>   DW_AT_decl_column : 26
    <55e>   DW_AT_type        : <0x526>
 <1><562>: Abbrev Number: 3 (DW_TAG_const_type)
    <563>   DW_AT_type        : <0x556>
 <1><567>: Abbrev Number: 8 (DW_TAG_structure_type)
    <568>   DW_AT_name        : (indirect string, offset: 0xbd8): list_item
    <56c>   DW_AT_byte_size   : 8
    <56d>   DW_AT_decl_file   : 17
    <56e>   DW_AT_decl_line   : 92
    <56f>   DW_AT_decl_column : 8
    <570>   DW_AT_sibling     : <0x593>
 <2><574>: Abbrev Number: 9 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0x10a4): prev
    <579>   DW_AT_decl_file   : 17
    <57a>   DW_AT_decl_line   : 93
    <57b>   DW_AT_decl_column : 20
    <57c>   DW_AT_type        : <0x593>
    <580>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><583>: Abbrev Number: 9 (DW_TAG_member)
    <584>   DW_AT_name        : (indirect string, offset: 0x109a): next
    <588>   DW_AT_decl_file   : 17
    <589>   DW_AT_decl_line   : 94
    <58a>   DW_AT_decl_column : 20
    <58b>   DW_AT_type        : <0x593>
    <58f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><592>: Abbrev Number: 0
 <1><593>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <594>   DW_AT_byte_size   : 4
    <595>   DW_AT_type        : <0x567>
 <1><599>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59a>   DW_AT_name        : (indirect string, offset: 0x850): sysent
    <59e>   DW_AT_byte_size   : 20
    <59f>   DW_AT_decl_file   : 18
    <5a0>   DW_AT_decl_line   : 13
    <5a1>   DW_AT_decl_column : 16
    <5a2>   DW_AT_sibling     : <0x5f2>
 <2><5a6>: Abbrev Number: 9 (DW_TAG_member)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x1006): nargs
    <5ab>   DW_AT_decl_file   : 18
    <5ac>   DW_AT_decl_line   : 14
    <5ad>   DW_AT_decl_column : 11
    <5ae>   DW_AT_type        : <0x2b>
    <5b2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b5>: Abbrev Number: 9 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x963): sys_flags
    <5ba>   DW_AT_decl_file   : 18
    <5bb>   DW_AT_decl_line   : 15
    <5bc>   DW_AT_decl_column : 6
    <5bd>   DW_AT_type        : <0x64>
    <5c1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c4>: Abbrev Number: 18 (DW_TAG_member)
    <5c5>   DW_AT_name        : sen
    <5c9>   DW_AT_decl_file   : 18
    <5ca>   DW_AT_decl_line   : 16
    <5cb>   DW_AT_decl_column : 6
    <5cc>   DW_AT_type        : <0x64>
    <5d0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d3>: Abbrev Number: 9 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x2f6): sys_func
    <5d8>   DW_AT_decl_file   : 18
    <5d9>   DW_AT_decl_line   : 17
    <5da>   DW_AT_decl_column : 8
    <5db>   DW_AT_type        : <0x870>
    <5df>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e2>: Abbrev Number: 9 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x264): sys_name
    <5e7>   DW_AT_decl_file   : 18
    <5e8>   DW_AT_decl_line   : 18
    <5e9>   DW_AT_decl_column : 14
    <5ea>   DW_AT_type        : <0x1c2>
    <5ee>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f1>: Abbrev Number: 0
 <1><5f2>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5f3>   DW_AT_prototyped  : 1
    <5f4>   DW_AT_type        : <0x64>
    <5f8>   DW_AT_sibling     : <0x602>
 <2><5fc>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5fd>   DW_AT_type        : <0x602>
 <2><601>: Abbrev Number: 0
 <1><602>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <603>   DW_AT_byte_size   : 4
    <604>   DW_AT_type        : <0x60d>
 <1><608>: Abbrev Number: 3 (DW_TAG_const_type)
    <609>   DW_AT_type        : <0x602>
 <1><60d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <60e>   DW_AT_name        : tcb
    <612>   DW_AT_byte_size   : 304
    <614>   DW_AT_decl_file   : 19
    <615>   DW_AT_decl_line   : 262
    <617>   DW_AT_decl_column : 8
    <618>   DW_AT_sibling     : <0x870>
 <2><61c>: Abbrev Number: 22 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x4b6): flags
    <621>   DW_AT_decl_file   : 19
    <622>   DW_AT_decl_line   : 263
    <624>   DW_AT_decl_column : 6
    <625>   DW_AT_type        : <0x64>
    <629>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><62c>: Abbrev Number: 23 (DW_TAG_member)
    <62d>   DW_AT_name        : pid
    <631>   DW_AT_decl_file   : 19
    <632>   DW_AT_decl_line   : 264
    <634>   DW_AT_decl_column : 6
    <635>   DW_AT_type        : <0x64>
    <639>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><63c>: Abbrev Number: 22 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <641>   DW_AT_decl_file   : 19
    <642>   DW_AT_decl_line   : 265
    <644>   DW_AT_decl_column : 6
    <645>   DW_AT_type        : <0x64>
    <649>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><64c>: Abbrev Number: 22 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0x382): currpers
    <651>   DW_AT_decl_file   : 19
    <652>   DW_AT_decl_line   : 267
    <654>   DW_AT_decl_column : 15
    <655>   DW_AT_type        : <0x2b>
    <659>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><65c>: Abbrev Number: 22 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0xb37): u_error
    <661>   DW_AT_decl_file   : 19
    <662>   DW_AT_decl_line   : 269
    <664>   DW_AT_decl_column : 16
    <665>   DW_AT_type        : <0x37>
    <669>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><66c>: Abbrev Number: 22 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <671>   DW_AT_decl_file   : 19
    <672>   DW_AT_decl_line   : 270
    <674>   DW_AT_decl_column : 17
    <675>   DW_AT_type        : <0x556>
    <679>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67c>: Abbrev Number: 22 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0xb70): true_scno
    <681>   DW_AT_decl_file   : 19
    <682>   DW_AT_decl_line   : 271
    <684>   DW_AT_decl_column : 17
    <685>   DW_AT_type        : <0x556>
    <689>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><68c>: Abbrev Number: 22 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x18c): u_arg
    <691>   DW_AT_decl_file   : 19
    <692>   DW_AT_decl_line   : 272
    <694>   DW_AT_decl_column : 17
    <695>   DW_AT_type        : <0x9a0>
    <699>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><69c>: Abbrev Number: 22 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x97a): u_rval
    <6a1>   DW_AT_decl_file   : 19
    <6a2>   DW_AT_decl_line   : 273
    <6a4>   DW_AT_decl_column : 16
    <6a5>   DW_AT_type        : <0x54a>
    <6a9>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6ac>: Abbrev Number: 22 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0xaa7): sys_func_rval
    <6b1>   DW_AT_decl_file   : 19
    <6b2>   DW_AT_decl_line   : 274
    <6b4>   DW_AT_decl_column : 6
    <6b5>   DW_AT_type        : <0x64>
    <6b9>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6bc>: Abbrev Number: 22 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0xcd4): curcol
    <6c1>   DW_AT_decl_file   : 19
    <6c2>   DW_AT_decl_line   : 275
    <6c4>   DW_AT_decl_column : 6
    <6c5>   DW_AT_type        : <0x64>
    <6c9>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6cc>: Abbrev Number: 22 (DW_TAG_member)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x98c): outf
    <6d1>   DW_AT_decl_file   : 19
    <6d2>   DW_AT_decl_line   : 276
    <6d4>   DW_AT_decl_column : 8
    <6d5>   DW_AT_type        : <0x407>
    <6d9>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6dc>: Abbrev Number: 22 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0xecf): staged_output_data
    <6e1>   DW_AT_decl_file   : 19
    <6e2>   DW_AT_decl_line   : 277
    <6e4>   DW_AT_decl_column : 29
    <6e5>   DW_AT_type        : <0x9b6>
    <6e9>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6ec>: Abbrev Number: 22 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xa72): auxstr
    <6f1>   DW_AT_decl_file   : 19
    <6f2>   DW_AT_decl_line   : 279
    <6f4>   DW_AT_decl_column : 14
    <6f5>   DW_AT_type        : <0x1c2>
    <6f9>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6fc>: Abbrev Number: 22 (DW_TAG_member)
    <6fd>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <701>   DW_AT_decl_file   : 19
    <702>   DW_AT_decl_line   : 280
    <704>   DW_AT_decl_column : 8
    <705>   DW_AT_type        : <0xc6>
    <709>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><70c>: Abbrev Number: 22 (DW_TAG_member)
    <70d>   DW_AT_name        : (indirect string, offset: 0xc05): _free_priv_data
    <711>   DW_AT_decl_file   : 19
    <712>   DW_AT_decl_line   : 281
    <714>   DW_AT_decl_column : 9
    <715>   DW_AT_type        : <0x9c8>
    <719>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><71c>: Abbrev Number: 22 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x17c): s_ent
    <721>   DW_AT_decl_file   : 19
    <722>   DW_AT_decl_line   : 282
    <724>   DW_AT_decl_column : 23
    <725>   DW_AT_type        : <0x9ce>
    <729>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><72c>: Abbrev Number: 22 (DW_TAG_member)
    <72d>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <731>   DW_AT_decl_file   : 19
    <732>   DW_AT_decl_line   : 285
    <734>   DW_AT_decl_column : 23
    <735>   DW_AT_type        : <0x9ce>
    <739>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><73d>: Abbrev Number: 22 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0x377): inject_vec
    <742>   DW_AT_decl_file   : 19
    <743>   DW_AT_decl_line   : 286
    <745>   DW_AT_decl_column : 22
    <746>   DW_AT_type        : <0x9d9>
    <74a>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><74e>: Abbrev Number: 22 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x7c1): stime
    <753>   DW_AT_decl_file   : 19
    <754>   DW_AT_decl_line   : 287
    <756>   DW_AT_decl_column : 18
    <757>   DW_AT_type        : <0x133>
    <75b>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><75f>: Abbrev Number: 22 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x38b): ltime
    <764>   DW_AT_decl_file   : 19
    <765>   DW_AT_decl_line   : 288
    <767>   DW_AT_decl_column : 18
    <768>   DW_AT_type        : <0x133>
    <76c>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><770>: Abbrev Number: 22 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0xfc7): atime
    <775>   DW_AT_decl_file   : 19
    <776>   DW_AT_decl_line   : 289
    <778>   DW_AT_decl_column : 18
    <779>   DW_AT_type        : <0x133>
    <77d>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><781>: Abbrev Number: 22 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x4b0): etime
    <786>   DW_AT_decl_file   : 19
    <787>   DW_AT_decl_line   : 290
    <789>   DW_AT_decl_column : 18
    <78a>   DW_AT_type        : <0x133>
    <78e>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><792>: Abbrev Number: 22 (DW_TAG_member)
    <793>   DW_AT_name        : (indirect string, offset: 0xd38): delay_expiration_time
    <797>   DW_AT_decl_file   : 19
    <798>   DW_AT_decl_line   : 291
    <79a>   DW_AT_decl_column : 18
    <79b>   DW_AT_type        : <0x133>
    <79f>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a3>: Abbrev Number: 22 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a8>   DW_AT_decl_file   : 19
    <7a9>   DW_AT_decl_line   : 298
    <7ab>   DW_AT_decl_column : 15
    <7ac>   DW_AT_type        : <0x2b>
    <7b0>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b4>: Abbrev Number: 22 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xf1a): last_dirfd
    <7b9>   DW_AT_decl_file   : 19
    <7ba>   DW_AT_decl_line   : 301
    <7bc>   DW_AT_decl_column : 6
    <7bd>   DW_AT_type        : <0x64>
    <7c1>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c5>: Abbrev Number: 22 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0xf40): mmap_cache
    <7ca>   DW_AT_decl_file   : 19
    <7cb>   DW_AT_decl_line   : 304
    <7cd>   DW_AT_decl_column : 23
    <7ce>   DW_AT_type        : <0x9f5>
    <7d2>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7d6>: Abbrev Number: 22 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xb46): wait_data_idx
    <7db>   DW_AT_decl_file   : 19
    <7dc>   DW_AT_decl_line   : 311
    <7de>   DW_AT_decl_column : 9
    <7df>   DW_AT_type        : <0x122>
    <7e3>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7e7>: Abbrev Number: 22 (DW_TAG_member)
    <7e8>   DW_AT_name        : (indirect string, offset: 0xa79): delayed_wait_data
    <7ec>   DW_AT_decl_file   : 19
    <7ed>   DW_AT_decl_line   : 313
    <7ef>   DW_AT_decl_column : 24
    <7f0>   DW_AT_type        : <0xa01>
    <7f4>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f8>: Abbrev Number: 22 (DW_TAG_member)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xae9): wait_list
    <7fd>   DW_AT_decl_file   : 19
    <7fe>   DW_AT_decl_line   : 314
    <800>   DW_AT_decl_column : 19
    <801>   DW_AT_type        : <0x567>
    <805>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><809>: Abbrev Number: 22 (DW_TAG_member)
    <80a>   DW_AT_name        : (indirect string, offset: 0x6ae): vcpu_info_list
    <80e>   DW_AT_decl_file   : 19
    <80f>   DW_AT_decl_line   : 318
    <811>   DW_AT_decl_column : 20
    <812>   DW_AT_type        : <0xa0d>
    <816>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81a>: Abbrev Number: 22 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0xc9f): unwind_ctx
    <81f>   DW_AT_decl_file   : 19
    <820>   DW_AT_decl_line   : 322
    <822>   DW_AT_decl_column : 8
    <823>   DW_AT_type        : <0xc6>
    <827>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82b>: Abbrev Number: 22 (DW_TAG_member)
    <82c>   DW_AT_name        : (indirect string, offset: 0x49a): unwind_queue
    <830>   DW_AT_decl_file   : 19
    <831>   DW_AT_decl_line   : 323
    <833>   DW_AT_decl_column : 25
    <834>   DW_AT_type        : <0xa19>
    <838>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><83c>: Abbrev Number: 22 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <841>   DW_AT_decl_file   : 19
    <842>   DW_AT_decl_line   : 327
    <844>   DW_AT_decl_column : 7
    <845>   DW_AT_type        : <0xa1f>
    <849>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><84d>: Abbrev Number: 22 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x208): start_prc
    <852>   DW_AT_decl_file   : 19
    <853>   DW_AT_decl_line   : 329
    <855>   DW_AT_decl_column : 16
    <856>   DW_AT_type        : <0x37>
    <85a>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><85e>: Abbrev Number: 22 (DW_TAG_member)
    <85f>   DW_AT_name        : (indirect string, offset: 0xf9b): pre_comm
    <863>   DW_AT_decl_file   : 19
    <864>   DW_AT_decl_line   : 330
    <866>   DW_AT_decl_column : 7
    <867>   DW_AT_type        : <0xa1f>
    <86b>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><86f>: Abbrev Number: 0
 <1><870>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <871>   DW_AT_byte_size   : 4
    <872>   DW_AT_type        : <0x5f2>
 <1><876>: Abbrev Number: 4 (DW_TAG_typedef)
    <877>   DW_AT_name        : (indirect string, offset: 0x582): struct_sysent
    <87b>   DW_AT_decl_file   : 18
    <87c>   DW_AT_decl_line   : 19
    <87d>   DW_AT_decl_column : 3
    <87e>   DW_AT_type        : <0x599>
 <1><882>: Abbrev Number: 3 (DW_TAG_const_type)
    <883>   DW_AT_type        : <0x876>
 <1><887>: Abbrev Number: 11 (DW_TAG_variable)
    <888>   DW_AT_name        : (indirect string, offset: 0xd24): current_personality
    <88c>   DW_AT_decl_file   : 19
    <88d>   DW_AT_decl_line   : 158
    <88e>   DW_AT_decl_column : 17
    <88f>   DW_AT_type        : <0x2b>
    <893>   DW_AT_external    : 1
    <894>   DW_AT_declaration : 1
 <1><895>: Abbrev Number: 11 (DW_TAG_variable)
    <896>   DW_AT_name        : (indirect string, offset: 0x7f2): current_wordsize
    <89a>   DW_AT_decl_file   : 19
    <89b>   DW_AT_decl_line   : 171
    <89c>   DW_AT_decl_column : 17
    <89d>   DW_AT_type        : <0x2b>
    <8a1>   DW_AT_external    : 1
    <8a2>   DW_AT_declaration : 1
 <1><8a3>: Abbrev Number: 11 (DW_TAG_variable)
    <8a4>   DW_AT_name        : (indirect string, offset: 0xa50): current_klongsize
    <8a8>   DW_AT_decl_file   : 19
    <8a9>   DW_AT_decl_line   : 176
    <8aa>   DW_AT_decl_column : 17
    <8ab>   DW_AT_type        : <0x2b>
    <8af>   DW_AT_external    : 1
    <8b0>   DW_AT_declaration : 1
 <1><8b1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b2>   DW_AT_name        : (indirect string, offset: 0xc76): ioctlent
    <8b6>   DW_AT_byte_size   : 8
    <8b7>   DW_AT_decl_file   : 19
    <8b8>   DW_AT_decl_line   : 217
    <8b9>   DW_AT_decl_column : 16
    <8ba>   DW_AT_sibling     : <0x8dd>
 <2><8be>: Abbrev Number: 9 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xf00): symbol
    <8c3>   DW_AT_decl_file   : 19
    <8c4>   DW_AT_decl_line   : 218
    <8c5>   DW_AT_decl_column : 14
    <8c6>   DW_AT_type        : <0x1c2>
    <8ca>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8cd>: Abbrev Number: 9 (DW_TAG_member)
    <8ce>   DW_AT_name        : (indirect string, offset: 0xced): code
    <8d2>   DW_AT_decl_file   : 19
    <8d3>   DW_AT_decl_line   : 219
    <8d4>   DW_AT_decl_column : 15
    <8d5>   DW_AT_type        : <0x2b>
    <8d9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8dc>: Abbrev Number: 0
 <1><8dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <8de>   DW_AT_name        : (indirect string, offset: 0xc2f): struct_ioctlent
    <8e2>   DW_AT_decl_file   : 19
    <8e3>   DW_AT_decl_line   : 220
    <8e4>   DW_AT_decl_column : 3
    <8e5>   DW_AT_type        : <0x8b1>
 <1><8e9>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ea>   DW_AT_type        : <0x8dd>
 <1><8ee>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x7e6): inject_data
    <8f3>   DW_AT_byte_size   : 10
    <8f4>   DW_AT_decl_file   : 19
    <8f5>   DW_AT_decl_line   : 241
    <8f6>   DW_AT_decl_column : 8
    <8f7>   DW_AT_sibling     : <0x956>
 <2><8fb>: Abbrev Number: 9 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x4b6): flags
    <900>   DW_AT_decl_file   : 19
    <901>   DW_AT_decl_line   : 242
    <902>   DW_AT_decl_column : 10
    <903>   DW_AT_type        : <0xeb>
    <907>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90a>: Abbrev Number: 9 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0x8fb): signo
    <90f>   DW_AT_decl_file   : 19
    <910>   DW_AT_decl_line   : 243
    <911>   DW_AT_decl_column : 10
    <912>   DW_AT_type        : <0xeb>
    <916>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><919>: Abbrev Number: 9 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <91e>   DW_AT_decl_file   : 19
    <91f>   DW_AT_decl_line   : 244
    <920>   DW_AT_decl_column : 11
    <921>   DW_AT_type        : <0xf7>
    <925>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><928>: Abbrev Number: 9 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0xcca): delay_idx
    <92d>   DW_AT_decl_file   : 19
    <92e>   DW_AT_decl_line   : 245
    <92f>   DW_AT_decl_column : 11
    <930>   DW_AT_type        : <0xf7>
    <934>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><937>: Abbrev Number: 9 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0x5dc): poke_idx
    <93c>   DW_AT_decl_file   : 19
    <93d>   DW_AT_decl_line   : 246
    <93e>   DW_AT_decl_column : 11
    <93f>   DW_AT_type        : <0xf7>
    <943>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><946>: Abbrev Number: 9 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <94b>   DW_AT_decl_file   : 19
    <94c>   DW_AT_decl_line   : 247
    <94d>   DW_AT_decl_column : 11
    <94e>   DW_AT_type        : <0xf7>
    <952>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><955>: Abbrev Number: 0
 <1><956>: Abbrev Number: 8 (DW_TAG_structure_type)
    <957>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <95b>   DW_AT_byte_size   : 16
    <95c>   DW_AT_decl_file   : 19
    <95d>   DW_AT_decl_line   : 250
    <95e>   DW_AT_decl_column : 8
    <95f>   DW_AT_sibling     : <0x9a0>
 <2><963>: Abbrev Number: 9 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0xa0f): first
    <968>   DW_AT_decl_file   : 19
    <969>   DW_AT_decl_line   : 251
    <96a>   DW_AT_decl_column : 11
    <96b>   DW_AT_type        : <0xf7>
    <96f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><972>: Abbrev Number: 9 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x10cd): last
    <977>   DW_AT_decl_file   : 19
    <978>   DW_AT_decl_line   : 252
    <979>   DW_AT_decl_column : 11
    <97a>   DW_AT_type        : <0xf7>
    <97e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><981>: Abbrev Number: 9 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x391): step
    <986>   DW_AT_decl_file   : 19
    <987>   DW_AT_decl_line   : 253
    <988>   DW_AT_decl_column : 11
    <989>   DW_AT_type        : <0xf7>
    <98d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><990>: Abbrev Number: 9 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x109f): data
    <995>   DW_AT_decl_file   : 19
    <996>   DW_AT_decl_line   : 254
    <997>   DW_AT_decl_column : 21
    <998>   DW_AT_type        : <0x8ee>
    <99c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 15 (DW_TAG_array_type)
    <9a1>   DW_AT_type        : <0x556>
    <9a5>   DW_AT_sibling     : <0x9b0>
 <2><9a9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9aa>   DW_AT_type        : <0x2b>
    <9ae>   DW_AT_upper_bound : 5
 <2><9af>: Abbrev Number: 0
 <1><9b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9b1>   DW_AT_name        : (indirect string, offset: 0xecf): staged_output_data
    <9b5>   DW_AT_declaration : 1
 <1><9b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b7>   DW_AT_byte_size   : 4
    <9b8>   DW_AT_type        : <0x9b0>
 <1><9bc>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9bd>   DW_AT_prototyped  : 1
    <9be>   DW_AT_sibling     : <0x9c8>
 <2><9c2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9c3>   DW_AT_type        : <0xc6>
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4
    <9ca>   DW_AT_type        : <0x9bc>
 <1><9ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cf>   DW_AT_byte_size   : 4
    <9d0>   DW_AT_type        : <0x882>
 <1><9d4>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d5>   DW_AT_type        : <0x9ce>
 <1><9d9>: Abbrev Number: 15 (DW_TAG_array_type)
    <9da>   DW_AT_type        : <0x9e9>
    <9de>   DW_AT_sibling     : <0x9e9>
 <2><9e2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9e3>   DW_AT_type        : <0x2b>
    <9e7>   DW_AT_upper_bound : 2
 <2><9e8>: Abbrev Number: 0
 <1><9e9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ea>   DW_AT_byte_size   : 4
    <9eb>   DW_AT_type        : <0x956>
 <1><9ef>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9f4>   DW_AT_declaration : 1
 <1><9f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f6>   DW_AT_byte_size   : 4
    <9f7>   DW_AT_type        : <0x9ef>
 <1><9fb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x3ac): tcb_wait_data
    <a00>   DW_AT_declaration : 1
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9fb>
 <1><a07>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a08>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <a0c>   DW_AT_declaration : 1
 <1><a0d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0xa07>
 <1><a13>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a14>   DW_AT_name        : (indirect string, offset: 0xeb3): unwind_queue_t
    <a18>   DW_AT_declaration : 1
 <1><a19>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1a>   DW_AT_byte_size   : 4
    <a1b>   DW_AT_type        : <0xa13>
 <1><a1f>: Abbrev Number: 15 (DW_TAG_array_type)
    <a20>   DW_AT_type        : <0xdf>
    <a24>   DW_AT_sibling     : <0xa2f>
 <2><a28>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a29>   DW_AT_type        : <0x2b>
    <a2d>   DW_AT_upper_bound : 15
 <2><a2e>: Abbrev Number: 0
 <1><a2f>: Abbrev Number: 10 (DW_TAG_variable)
    <a30>   DW_AT_name        : (indirect string, offset: 0xb83): stub_sysent
    <a34>   DW_AT_decl_file   : 19
    <a35>   DW_AT_decl_line   : 405
    <a37>   DW_AT_decl_column : 28
    <a38>   DW_AT_type        : <0x882>
    <a3c>   DW_AT_external    : 1
    <a3d>   DW_AT_declaration : 1
 <1><a3e>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x1082): xlat_type
    <a43>   DW_AT_encoding    : 7	(unsigned)
    <a44>   DW_AT_byte_size   : 4
    <a45>   DW_AT_type        : <0x2b>
    <a49>   DW_AT_decl_file   : 20
    <a4a>   DW_AT_decl_line   : 13
    <a4b>   DW_AT_decl_column : 6
    <a4c>   DW_AT_sibling     : <0xa63>
 <2><a50>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a51>   DW_AT_name        : (indirect string, offset: 0x2bf): XT_NORMAL
    <a55>   DW_AT_const_value : 0
 <2><a56>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a57>   DW_AT_name        : (indirect string, offset: 0xc46): XT_SORTED
    <a5b>   DW_AT_const_value : 1
 <2><a5c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xdb0): XT_INDEXED
    <a61>   DW_AT_const_value : 2
 <2><a62>: Abbrev Number: 0
 <1><a63>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a64>   DW_AT_name        : (indirect string, offset: 0xbaf): xlat_style
    <a68>   DW_AT_encoding    : 7	(unsigned)
    <a69>   DW_AT_byte_size   : 4
    <a6a>   DW_AT_type        : <0x2b>
    <a6e>   DW_AT_decl_file   : 20
    <a6f>   DW_AT_decl_line   : 19
    <a70>   DW_AT_decl_column : 6
    <a71>   DW_AT_sibling     : <0xaa0>
 <2><a75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a7a>   DW_AT_const_value : 0
 <2><a7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xbe2): XLAT_STYLE_RAW
    <a80>   DW_AT_const_value : 1
 <2><a81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x104d): XLAT_STYLE_ABBREV
    <a86>   DW_AT_const_value : 2
 <2><a87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0x2e3): XLAT_STYLE_VERBOSE
    <a8c>   DW_AT_const_value : 3
 <2><a8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a92>   DW_AT_const_value : 0
 <2><a93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a98>   DW_AT_const_value : 4
 <2><a99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x10bc): XLAT_STYLE_FMT_D
    <a9e>   DW_AT_const_value : 8
 <2><a9f>: Abbrev Number: 0
 <1><aa0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x314): xlat_data
    <aa5>   DW_AT_byte_size   : 16
    <aa6>   DW_AT_decl_file   : 20
    <aa7>   DW_AT_decl_line   : 51
    <aa8>   DW_AT_decl_column : 8
    <aa9>   DW_AT_sibling     : <0xacc>
 <2><aad>: Abbrev Number: 18 (DW_TAG_member)
    <aae>   DW_AT_name        : val
    <ab2>   DW_AT_decl_file   : 20
    <ab3>   DW_AT_decl_line   : 52
    <ab4>   DW_AT_decl_column : 11
    <ab5>   DW_AT_type        : <0x10f>
    <ab9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><abc>: Abbrev Number: 18 (DW_TAG_member)
    <abd>   DW_AT_name        : str
    <ac1>   DW_AT_decl_file   : 20
    <ac2>   DW_AT_decl_line   : 53
    <ac3>   DW_AT_decl_column : 14
    <ac4>   DW_AT_type        : <0x1c2>
    <ac8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><acb>: Abbrev Number: 0
 <1><acc>: Abbrev Number: 3 (DW_TAG_const_type)
    <acd>   DW_AT_type        : <0xaa0>
 <1><ad1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ad6>   DW_AT_byte_size   : 24
    <ad7>   DW_AT_decl_file   : 20
    <ad8>   DW_AT_decl_line   : 56
    <ad9>   DW_AT_decl_column : 8
    <ada>   DW_AT_sibling     : <0xb2a>
 <2><ade>: Abbrev Number: 9 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x109f): data
    <ae3>   DW_AT_decl_file   : 20
    <ae4>   DW_AT_decl_line   : 57
    <ae5>   DW_AT_decl_column : 26
    <ae6>   DW_AT_type        : <0xb2f>
    <aea>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aed>: Abbrev Number: 9 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x844): flags_strsz
    <af2>   DW_AT_decl_file   : 20
    <af3>   DW_AT_decl_line   : 58
    <af4>   DW_AT_decl_column : 9
    <af5>   DW_AT_type        : <0x122>
    <af9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><afc>: Abbrev Number: 9 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0xb54): size
    <b01>   DW_AT_decl_file   : 20
    <b02>   DW_AT_decl_line   : 59
    <b03>   DW_AT_decl_column : 11
    <b04>   DW_AT_type        : <0x103>
    <b08>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b0b>: Abbrev Number: 9 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x187): type
    <b10>   DW_AT_decl_file   : 20
    <b11>   DW_AT_decl_line   : 60
    <b12>   DW_AT_decl_column : 17
    <b13>   DW_AT_type        : <0xa3e>
    <b17>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b1a>: Abbrev Number: 9 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x702): flags_mask
    <b1f>   DW_AT_decl_file   : 20
    <b20>   DW_AT_decl_line   : 61
    <b21>   DW_AT_decl_column : 11
    <b22>   DW_AT_type        : <0x10f>
    <b26>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b29>: Abbrev Number: 0
 <1><b2a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2b>   DW_AT_type        : <0xad1>
 <1><b2f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b30>   DW_AT_byte_size   : 4
    <b31>   DW_AT_type        : <0xacc>
 <1><b35>: Abbrev Number: 15 (DW_TAG_array_type)
    <b36>   DW_AT_type        : <0xb2a>
    <b3a>   DW_AT_sibling     : <0xb40>
 <2><b3e>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b3f>: Abbrev Number: 0
 <1><b40>: Abbrev Number: 3 (DW_TAG_const_type)
    <b41>   DW_AT_type        : <0xb35>
 <1><b45>: Abbrev Number: 10 (DW_TAG_variable)
    <b46>   DW_AT_name        : (indirect string, offset: 0xe19): addrfams
    <b4a>   DW_AT_decl_file   : 19
    <b4b>   DW_AT_decl_line   : 411
    <b4d>   DW_AT_decl_column : 26
    <b4e>   DW_AT_type        : <0xb40>
    <b52>   DW_AT_external    : 1
    <b53>   DW_AT_declaration : 1
 <1><b54>: Abbrev Number: 10 (DW_TAG_variable)
    <b55>   DW_AT_name        : (indirect string, offset: 0xcfd): arp_hardware_types
    <b59>   DW_AT_decl_file   : 19
    <b5a>   DW_AT_decl_line   : 412
    <b5c>   DW_AT_decl_column : 26
    <b5d>   DW_AT_type        : <0xb40>
    <b61>   DW_AT_external    : 1
    <b62>   DW_AT_declaration : 1
 <1><b63>: Abbrev Number: 10 (DW_TAG_variable)
    <b64>   DW_AT_name        : (indirect string, offset: 0xfcd): at_flags
    <b68>   DW_AT_decl_file   : 19
    <b69>   DW_AT_decl_line   : 413
    <b6b>   DW_AT_decl_column : 26
    <b6c>   DW_AT_type        : <0xb40>
    <b70>   DW_AT_external    : 1
    <b71>   DW_AT_declaration : 1
 <1><b72>: Abbrev Number: 10 (DW_TAG_variable)
    <b73>   DW_AT_name        : (indirect string, offset: 0x478): clocknames
    <b77>   DW_AT_decl_file   : 19
    <b78>   DW_AT_decl_line   : 414
    <b7a>   DW_AT_decl_column : 26
    <b7b>   DW_AT_type        : <0xb40>
    <b7f>   DW_AT_external    : 1
    <b80>   DW_AT_declaration : 1
 <1><b81>: Abbrev Number: 10 (DW_TAG_variable)
    <b82>   DW_AT_name        : (indirect string, offset: 0xf8e): dirent_types
    <b86>   DW_AT_decl_file   : 19
    <b87>   DW_AT_decl_line   : 415
    <b89>   DW_AT_decl_column : 26
    <b8a>   DW_AT_type        : <0xb40>
    <b8e>   DW_AT_external    : 1
    <b8f>   DW_AT_declaration : 1
 <1><b90>: Abbrev Number: 10 (DW_TAG_variable)
    <b91>   DW_AT_name        : (indirect string, offset: 0x895): ethernet_protocols
    <b95>   DW_AT_decl_file   : 19
    <b96>   DW_AT_decl_line   : 416
    <b98>   DW_AT_decl_column : 26
    <b99>   DW_AT_type        : <0xb40>
    <b9d>   DW_AT_external    : 1
    <b9e>   DW_AT_declaration : 1
 <1><b9f>: Abbrev Number: 10 (DW_TAG_variable)
    <ba0>   DW_AT_name        : (indirect string, offset: 0x62f): inet_protocols
    <ba4>   DW_AT_decl_file   : 19
    <ba5>   DW_AT_decl_line   : 417
    <ba7>   DW_AT_decl_column : 26
    <ba8>   DW_AT_type        : <0xb40>
    <bac>   DW_AT_external    : 1
    <bad>   DW_AT_declaration : 1
 <1><bae>: Abbrev Number: 10 (DW_TAG_variable)
    <baf>   DW_AT_name        : (indirect string, offset: 0x2ac): evdev_abs
    <bb3>   DW_AT_decl_file   : 19
    <bb4>   DW_AT_decl_line   : 418
    <bb6>   DW_AT_decl_column : 26
    <bb7>   DW_AT_type        : <0xb40>
    <bbb>   DW_AT_external    : 1
    <bbc>   DW_AT_declaration : 1
 <1><bbd>: Abbrev Number: 10 (DW_TAG_variable)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x6f7): audit_arch
    <bc2>   DW_AT_decl_file   : 19
    <bc3>   DW_AT_decl_line   : 419
    <bc5>   DW_AT_decl_column : 26
    <bc6>   DW_AT_type        : <0xb40>
    <bca>   DW_AT_external    : 1
    <bcb>   DW_AT_declaration : 1
 <1><bcc>: Abbrev Number: 10 (DW_TAG_variable)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bd1>   DW_AT_decl_file   : 19
    <bd2>   DW_AT_decl_line   : 420
    <bd4>   DW_AT_decl_column : 26
    <bd5>   DW_AT_type        : <0xb40>
    <bd9>   DW_AT_external    : 1
    <bda>   DW_AT_declaration : 1
 <1><bdb>: Abbrev Number: 10 (DW_TAG_variable)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x459): iffflags
    <be0>   DW_AT_decl_file   : 19
    <be1>   DW_AT_decl_line   : 421
    <be3>   DW_AT_decl_column : 26
    <be4>   DW_AT_type        : <0xb40>
    <be8>   DW_AT_external    : 1
    <be9>   DW_AT_declaration : 1
 <1><bea>: Abbrev Number: 10 (DW_TAG_variable)
    <beb>   DW_AT_name        : (indirect string, offset: 0xbf1): ip_type_of_services
    <bef>   DW_AT_decl_file   : 19
    <bf0>   DW_AT_decl_line   : 422
    <bf2>   DW_AT_decl_column : 26
    <bf3>   DW_AT_type        : <0xb40>
    <bf7>   DW_AT_external    : 1
    <bf8>   DW_AT_declaration : 1
 <1><bf9>: Abbrev Number: 10 (DW_TAG_variable)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x68a): ipc_private
    <bfe>   DW_AT_decl_file   : 19
    <bff>   DW_AT_decl_line   : 423
    <c01>   DW_AT_decl_column : 26
    <c02>   DW_AT_type        : <0xb40>
    <c06>   DW_AT_external    : 1
    <c07>   DW_AT_declaration : 1
 <1><c08>: Abbrev Number: 10 (DW_TAG_variable)
    <c09>   DW_AT_name        : (indirect string, offset: 0x30a): msg_flags
    <c0d>   DW_AT_decl_file   : 19
    <c0e>   DW_AT_decl_line   : 424
    <c10>   DW_AT_decl_column : 26
    <c11>   DW_AT_type        : <0xb40>
    <c15>   DW_AT_external    : 1
    <c16>   DW_AT_declaration : 1
 <1><c17>: Abbrev Number: 10 (DW_TAG_variable)
    <c18>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c1c>   DW_AT_decl_file   : 19
    <c1d>   DW_AT_decl_line   : 425
    <c1f>   DW_AT_decl_column : 26
    <c20>   DW_AT_type        : <0xb40>
    <c24>   DW_AT_external    : 1
    <c25>   DW_AT_declaration : 1
 <1><c26>: Abbrev Number: 10 (DW_TAG_variable)
    <c27>   DW_AT_name        : (indirect string, offset: 0xee2): nl_bridge_vlan_flags
    <c2b>   DW_AT_decl_file   : 19
    <c2c>   DW_AT_decl_line   : 426
    <c2e>   DW_AT_decl_column : 26
    <c2f>   DW_AT_type        : <0xb40>
    <c33>   DW_AT_external    : 1
    <c34>   DW_AT_declaration : 1
 <1><c35>: Abbrev Number: 10 (DW_TAG_variable)
    <c36>   DW_AT_name        : (indirect string, offset: 0xd99): nl_netfilter_msg_types
    <c3a>   DW_AT_decl_file   : 19
    <c3b>   DW_AT_decl_line   : 427
    <c3d>   DW_AT_decl_column : 26
    <c3e>   DW_AT_type        : <0xb40>
    <c42>   DW_AT_external    : 1
    <c43>   DW_AT_declaration : 1
 <1><c44>: Abbrev Number: 10 (DW_TAG_variable)
    <c45>   DW_AT_name        : (indirect string, offset: 0x43b): nl_route_types
    <c49>   DW_AT_decl_file   : 19
    <c4a>   DW_AT_decl_line   : 428
    <c4c>   DW_AT_decl_column : 26
    <c4d>   DW_AT_type        : <0xb40>
    <c51>   DW_AT_external    : 1
    <c52>   DW_AT_declaration : 1
 <1><c53>: Abbrev Number: 10 (DW_TAG_variable)
    <c54>   DW_AT_name        : (indirect string, offset: 0xe50): open_access_modes
    <c58>   DW_AT_decl_file   : 19
    <c59>   DW_AT_decl_line   : 429
    <c5b>   DW_AT_decl_column : 26
    <c5c>   DW_AT_type        : <0xb40>
    <c60>   DW_AT_external    : 1
    <c61>   DW_AT_declaration : 1
 <1><c62>: Abbrev Number: 10 (DW_TAG_variable)
    <c63>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c67>   DW_AT_decl_file   : 19
    <c68>   DW_AT_decl_line   : 430
    <c6a>   DW_AT_decl_column : 26
    <c6b>   DW_AT_type        : <0xb40>
    <c6f>   DW_AT_external    : 1
    <c70>   DW_AT_declaration : 1
 <1><c71>: Abbrev Number: 10 (DW_TAG_variable)
    <c72>   DW_AT_name        : (indirect string, offset: 0xc22): perf_type_id
    <c76>   DW_AT_decl_file   : 19
    <c77>   DW_AT_decl_line   : 431
    <c79>   DW_AT_decl_column : 26
    <c7a>   DW_AT_type        : <0xb40>
    <c7e>   DW_AT_external    : 1
    <c7f>   DW_AT_declaration : 1
 <1><c80>: Abbrev Number: 10 (DW_TAG_variable)
    <c81>   DW_AT_name        : (indirect string, offset: 0xe22): pollflags
    <c85>   DW_AT_decl_file   : 19
    <c86>   DW_AT_decl_line   : 432
    <c88>   DW_AT_decl_column : 26
    <c89>   DW_AT_type        : <0xb40>
    <c8d>   DW_AT_external    : 1
    <c8e>   DW_AT_declaration : 1
 <1><c8f>: Abbrev Number: 10 (DW_TAG_variable)
    <c90>   DW_AT_name        : (indirect string, offset: 0x5d0): ptrace_cmds
    <c94>   DW_AT_decl_file   : 19
    <c95>   DW_AT_decl_line   : 433
    <c97>   DW_AT_decl_column : 26
    <c98>   DW_AT_type        : <0xb40>
    <c9c>   DW_AT_external    : 1
    <c9d>   DW_AT_declaration : 1
 <1><c9e>: Abbrev Number: 10 (DW_TAG_variable)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x7d7): resource_flags
    <ca3>   DW_AT_decl_file   : 19
    <ca4>   DW_AT_decl_line   : 434
    <ca6>   DW_AT_decl_column : 26
    <ca7>   DW_AT_type        : <0xb40>
    <cab>   DW_AT_external    : 1
    <cac>   DW_AT_declaration : 1
 <1><cad>: Abbrev Number: 10 (DW_TAG_variable)
    <cae>   DW_AT_name        : (indirect string, offset: 0x282): route_nexthop_flags
    <cb2>   DW_AT_decl_file   : 19
    <cb3>   DW_AT_decl_line   : 435
    <cb5>   DW_AT_decl_column : 26
    <cb6>   DW_AT_type        : <0xb40>
    <cba>   DW_AT_external    : 1
    <cbb>   DW_AT_declaration : 1
 <1><cbc>: Abbrev Number: 10 (DW_TAG_variable)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xe6d): routing_protocols
    <cc1>   DW_AT_decl_file   : 19
    <cc2>   DW_AT_decl_line   : 436
    <cc4>   DW_AT_decl_column : 26
    <cc5>   DW_AT_type        : <0xb40>
    <cc9>   DW_AT_external    : 1
    <cca>   DW_AT_declaration : 1
 <1><ccb>: Abbrev Number: 10 (DW_TAG_variable)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x44a): routing_scopes
    <cd0>   DW_AT_decl_file   : 19
    <cd1>   DW_AT_decl_line   : 437
    <cd3>   DW_AT_decl_column : 26
    <cd4>   DW_AT_type        : <0xb40>
    <cd8>   DW_AT_external    : 1
    <cd9>   DW_AT_declaration : 1
 <1><cda>: Abbrev Number: 10 (DW_TAG_variable)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xd87): routing_table_ids
    <cdf>   DW_AT_decl_file   : 19
    <ce0>   DW_AT_decl_line   : 438
    <ce2>   DW_AT_decl_column : 26
    <ce3>   DW_AT_type        : <0xb40>
    <ce7>   DW_AT_external    : 1
    <ce8>   DW_AT_declaration : 1
 <1><ce9>: Abbrev Number: 10 (DW_TAG_variable)
    <cea>   DW_AT_name        : (indirect string, offset: 0x667): routing_types
    <cee>   DW_AT_decl_file   : 19
    <cef>   DW_AT_decl_line   : 439
    <cf1>   DW_AT_decl_column : 26
    <cf2>   DW_AT_type        : <0xb40>
    <cf6>   DW_AT_external    : 1
    <cf7>   DW_AT_declaration : 1
 <1><cf8>: Abbrev Number: 10 (DW_TAG_variable)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x1ab): rwf_flags
    <cfd>   DW_AT_decl_file   : 19
    <cfe>   DW_AT_decl_line   : 440
    <d00>   DW_AT_decl_column : 26
    <d01>   DW_AT_type        : <0xb40>
    <d05>   DW_AT_external    : 1
    <d06>   DW_AT_declaration : 1
 <1><d07>: Abbrev Number: 10 (DW_TAG_variable)
    <d08>   DW_AT_name        : (indirect string, offset: 0x80f): seccomp_filter_flags
    <d0c>   DW_AT_decl_file   : 19
    <d0d>   DW_AT_decl_line   : 441
    <d0f>   DW_AT_decl_column : 26
    <d10>   DW_AT_type        : <0xb40>
    <d14>   DW_AT_external    : 1
    <d15>   DW_AT_declaration : 1
 <1><d16>: Abbrev Number: 10 (DW_TAG_variable)
    <d17>   DW_AT_name        : (indirect string, offset: 0x2c9): seccomp_ret_action
    <d1b>   DW_AT_decl_file   : 19
    <d1c>   DW_AT_decl_line   : 442
    <d1e>   DW_AT_decl_column : 26
    <d1f>   DW_AT_type        : <0xb40>
    <d23>   DW_AT_external    : 1
    <d24>   DW_AT_declaration : 1
 <1><d25>: Abbrev Number: 10 (DW_TAG_variable)
    <d26>   DW_AT_name        : (indirect string, offset: 0x416): setns_types
    <d2a>   DW_AT_decl_file   : 19
    <d2b>   DW_AT_decl_line   : 443
    <d2d>   DW_AT_decl_column : 26
    <d2e>   DW_AT_type        : <0xb40>
    <d32>   DW_AT_external    : 1
    <d33>   DW_AT_declaration : 1
 <1><d34>: Abbrev Number: 10 (DW_TAG_variable)
    <d35>   DW_AT_name        : (indirect string, offset: 0xe0e): sg_io_info
    <d39>   DW_AT_decl_file   : 19
    <d3a>   DW_AT_decl_line   : 444
    <d3c>   DW_AT_decl_column : 26
    <d3d>   DW_AT_type        : <0xb40>
    <d41>   DW_AT_external    : 1
    <d42>   DW_AT_declaration : 1
 <1><d43>: Abbrev Number: 10 (DW_TAG_variable)
    <d44>   DW_AT_name        : (indirect string, offset: 0xb97): socketlayers
    <d48>   DW_AT_decl_file   : 19
    <d49>   DW_AT_decl_line   : 445
    <d4b>   DW_AT_decl_column : 26
    <d4c>   DW_AT_type        : <0xb40>
    <d50>   DW_AT_external    : 1
    <d51>   DW_AT_declaration : 1
 <1><d52>: Abbrev Number: 10 (DW_TAG_variable)
    <d53>   DW_AT_name        : (indirect string, offset: 0xd71): socktypes
    <d57>   DW_AT_decl_file   : 19
    <d58>   DW_AT_decl_line   : 446
    <d5a>   DW_AT_decl_column : 26
    <d5b>   DW_AT_type        : <0xb40>
    <d5f>   DW_AT_external    : 1
    <d60>   DW_AT_declaration : 1
 <1><d61>: Abbrev Number: 10 (DW_TAG_variable)
    <d62>   DW_AT_name        : (indirect string, offset: 0xa62): tcp_state_flags
    <d66>   DW_AT_decl_file   : 19
    <d67>   DW_AT_decl_line   : 447
    <d69>   DW_AT_decl_column : 26
    <d6a>   DW_AT_type        : <0xb40>
    <d6e>   DW_AT_external    : 1
    <d6f>   DW_AT_declaration : 1
 <1><d70>: Abbrev Number: 10 (DW_TAG_variable)
    <d71>   DW_AT_name        : (indirect string, offset: 0x73c): tcp_states
    <d75>   DW_AT_decl_file   : 19
    <d76>   DW_AT_decl_line   : 448
    <d78>   DW_AT_decl_column : 26
    <d79>   DW_AT_type        : <0xb40>
    <d7d>   DW_AT_external    : 1
    <d7e>   DW_AT_declaration : 1
 <1><d7f>: Abbrev Number: 10 (DW_TAG_variable)
    <d80>   DW_AT_name        : (indirect string, offset: 0x1030): whence_codes
    <d84>   DW_AT_decl_file   : 19
    <d85>   DW_AT_decl_line   : 449
    <d87>   DW_AT_decl_column : 26
    <d88>   DW_AT_type        : <0xb40>
    <d8c>   DW_AT_external    : 1
    <d8d>   DW_AT_declaration : 1
 <1><d8e>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d8f>   DW_AT_encoding    : 7	(unsigned)
    <d90>   DW_AT_byte_size   : 4
    <d91>   DW_AT_type        : <0x2b>
    <d95>   DW_AT_decl_file   : 19
    <d96>   DW_AT_decl_line   : 510
    <d98>   DW_AT_decl_column : 14
    <d99>   DW_AT_sibling     : <0xdb0>
 <2><d9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x981): CFLAG_NONE
    <da2>   DW_AT_const_value : 0
 <2><da3>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da4>   DW_AT_name        : (indirect string, offset: 0x8a8): CFLAG_ONLY_STATS
    <da8>   DW_AT_const_value : 1
 <2><da9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0xba4): CFLAG_BOTH
    <dae>   DW_AT_const_value : 2
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 28 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0x10d2): cflag_t
    <db5>   DW_AT_decl_file   : 19
    <db6>   DW_AT_decl_line   : 514
    <db8>   DW_AT_decl_column : 3
    <db9>   DW_AT_type        : <0xd8e>
 <1><dbd>: Abbrev Number: 10 (DW_TAG_variable)
    <dbe>   DW_AT_name        : (indirect string, offset: 0xcc4): cflag
    <dc2>   DW_AT_decl_file   : 19
    <dc3>   DW_AT_decl_line   : 515
    <dc5>   DW_AT_decl_column : 16
    <dc6>   DW_AT_type        : <0xdb0>
    <dca>   DW_AT_external    : 1
    <dcb>   DW_AT_declaration : 1
 <1><dcc>: Abbrev Number: 10 (DW_TAG_variable)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <dd1>   DW_AT_decl_file   : 19
    <dd2>   DW_AT_decl_line   : 516
    <dd4>   DW_AT_decl_column : 13
    <dd5>   DW_AT_type        : <0x50e>
    <dd9>   DW_AT_external    : 1
    <dda>   DW_AT_declaration : 1
 <1><ddb>: Abbrev Number: 10 (DW_TAG_variable)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x792): Tflag_scale
    <de0>   DW_AT_decl_file   : 19
    <de1>   DW_AT_decl_line   : 517
    <de3>   DW_AT_decl_column : 12
    <de4>   DW_AT_type        : <0x64>
    <de8>   DW_AT_external    : 1
    <de9>   DW_AT_declaration : 1
 <1><dea>: Abbrev Number: 10 (DW_TAG_variable)
    <deb>   DW_AT_name        : (indirect string, offset: 0x824): Tflag_width
    <def>   DW_AT_decl_file   : 19
    <df0>   DW_AT_decl_line   : 518
    <df2>   DW_AT_decl_column : 12
    <df3>   DW_AT_type        : <0x64>
    <df7>   DW_AT_external    : 1
    <df8>   DW_AT_declaration : 1
 <1><df9>: Abbrev Number: 10 (DW_TAG_variable)
    <dfa>   DW_AT_name        : (indirect string, offset: 0xe00): iflag
    <dfe>   DW_AT_decl_file   : 19
    <dff>   DW_AT_decl_line   : 519
    <e01>   DW_AT_decl_column : 13
    <e02>   DW_AT_type        : <0x50e>
    <e06>   DW_AT_external    : 1
    <e07>   DW_AT_declaration : 1
 <1><e08>: Abbrev Number: 10 (DW_TAG_variable)
    <e09>   DW_AT_name        : (indirect string, offset: 0x610): count_wallclock
    <e0d>   DW_AT_decl_file   : 19
    <e0e>   DW_AT_decl_line   : 520
    <e10>   DW_AT_decl_column : 13
    <e11>   DW_AT_type        : <0x50e>
    <e15>   DW_AT_external    : 1
    <e16>   DW_AT_declaration : 1
 <1><e17>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e18>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e1c>   DW_AT_byte_size   : 4
    <e1d>   DW_AT_decl_file   : 19
    <e1e>   DW_AT_decl_line   : 522
    <e20>   DW_AT_decl_column : 8
    <e21>   DW_AT_sibling     : <0xe36>
 <2><e25>: Abbrev Number: 22 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e2a>   DW_AT_decl_file   : 19
    <e2b>   DW_AT_decl_line   : 523
    <e2d>   DW_AT_decl_column : 14
    <e2e>   DW_AT_type        : <0x1c2>
    <e32>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e35>: Abbrev Number: 0
 <1><e36>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e37>   DW_AT_name        : (indirect string, offset: 0x747): path_set
    <e3b>   DW_AT_byte_size   : 12
    <e3c>   DW_AT_decl_file   : 19
    <e3d>   DW_AT_decl_line   : 527
    <e3f>   DW_AT_decl_column : 15
    <e40>   DW_AT_sibling     : <0xe75>
 <2><e44>: Abbrev Number: 22 (DW_TAG_member)
    <e45>   DW_AT_name        : (indirect string, offset: 0x6c5): paths_selected
    <e49>   DW_AT_decl_file   : 19
    <e4a>   DW_AT_decl_line   : 528
    <e4c>   DW_AT_decl_column : 24
    <e4d>   DW_AT_type        : <0xe75>
    <e51>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e54>: Abbrev Number: 22 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x1023): num_selected
    <e59>   DW_AT_decl_file   : 19
    <e5a>   DW_AT_decl_line   : 529
    <e5c>   DW_AT_decl_column : 9
    <e5d>   DW_AT_type        : <0x122>
    <e61>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e64>: Abbrev Number: 22 (DW_TAG_member)
    <e65>   DW_AT_name        : (indirect string, offset: 0xb54): size
    <e69>   DW_AT_decl_file   : 19
    <e6a>   DW_AT_decl_line   : 530
    <e6c>   DW_AT_decl_column : 9
    <e6d>   DW_AT_type        : <0x122>
    <e71>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e74>: Abbrev Number: 0
 <1><e75>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e76>   DW_AT_byte_size   : 4
    <e77>   DW_AT_type        : <0xe17>
 <1><e7b>: Abbrev Number: 10 (DW_TAG_variable)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x1072): global_path_set
    <e80>   DW_AT_decl_file   : 19
    <e81>   DW_AT_decl_line   : 531
    <e83>   DW_AT_decl_column : 3
    <e84>   DW_AT_type        : <0xe36>
    <e88>   DW_AT_external    : 1
    <e89>   DW_AT_declaration : 1
 <1><e8a>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e8b>   DW_AT_name        : (indirect string, offset: 0xf69): xflag_opts
    <e8f>   DW_AT_encoding    : 7	(unsigned)
    <e90>   DW_AT_byte_size   : 4
    <e91>   DW_AT_type        : <0x2b>
    <e95>   DW_AT_decl_file   : 19
    <e96>   DW_AT_decl_line   : 533
    <e98>   DW_AT_decl_column : 6
    <e99>   DW_AT_sibling     : <0xebc>
 <2><e9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9e>   DW_AT_name        : (indirect string, offset: 0xa03): HEXSTR_NONE
    <ea2>   DW_AT_const_value : 0
 <2><ea3>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea4>   DW_AT_name        : (indirect string, offset: 0xfaf): HEXSTR_NON_ASCII
    <ea8>   DW_AT_const_value : 1
 <2><ea9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x8e6): HEXSTR_ALL
    <eae>   DW_AT_const_value : 2
 <2><eaf>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x650): HEXSTR_NON_ASCII_CHARS
    <eb4>   DW_AT_const_value : 3
 <2><eb5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x103d): NUM_HEXSTR_OPTS
    <eba>   DW_AT_const_value : 4
 <2><ebb>: Abbrev Number: 0
 <1><ebc>: Abbrev Number: 10 (DW_TAG_variable)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xdda): xflag
    <ec1>   DW_AT_decl_file   : 19
    <ec2>   DW_AT_decl_line   : 546
    <ec4>   DW_AT_decl_column : 17
    <ec5>   DW_AT_type        : <0x2b>
    <ec9>   DW_AT_external    : 1
    <eca>   DW_AT_declaration : 1
 <1><ecb>: Abbrev Number: 10 (DW_TAG_variable)
    <ecc>   DW_AT_name        : (indirect string, offset: 0xc7f): followfork
    <ed0>   DW_AT_decl_file   : 19
    <ed1>   DW_AT_decl_line   : 547
    <ed3>   DW_AT_decl_column : 13
    <ed4>   DW_AT_type        : <0x50e>
    <ed8>   DW_AT_external    : 1
    <ed9>   DW_AT_declaration : 1
 <1><eda>: Abbrev Number: 10 (DW_TAG_variable)
    <edb>   DW_AT_name        : (indirect string, offset: 0x31e): output_separately
    <edf>   DW_AT_decl_file   : 19
    <ee0>   DW_AT_decl_line   : 548
    <ee2>   DW_AT_decl_column : 13
    <ee3>   DW_AT_type        : <0x50e>
    <ee7>   DW_AT_external    : 1
    <ee8>   DW_AT_declaration : 1
 <1><ee9>: Abbrev Number: 10 (DW_TAG_variable)
    <eea>   DW_AT_name        : (indirect string, offset: 0x212): stack_trace_enabled
    <eee>   DW_AT_decl_file   : 19
    <eef>   DW_AT_decl_line   : 551
    <ef1>   DW_AT_decl_column : 13
    <ef2>   DW_AT_type        : <0x50e>
    <ef6>   DW_AT_external    : 1
    <ef7>   DW_AT_declaration : 1
 <1><ef8>: Abbrev Number: 10 (DW_TAG_variable)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x63e): ptrace_setoptions
    <efd>   DW_AT_decl_file   : 19
    <efe>   DW_AT_decl_line   : 555
    <f00>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0x2b>
    <f05>   DW_AT_external    : 1
    <f06>   DW_AT_declaration : 1
 <1><f07>: Abbrev Number: 10 (DW_TAG_variable)
    <f08>   DW_AT_name        : (indirect string, offset: 0x9f8): max_strlen
    <f0c>   DW_AT_decl_file   : 19
    <f0d>   DW_AT_decl_line   : 556
    <f0f>   DW_AT_decl_column : 17
    <f10>   DW_AT_type        : <0x2b>
    <f14>   DW_AT_external    : 1
    <f15>   DW_AT_declaration : 1
 <1><f16>: Abbrev Number: 10 (DW_TAG_variable)
    <f17>   DW_AT_name        : (indirect string, offset: 0xa3c): os_release
    <f1b>   DW_AT_decl_file   : 19
    <f1c>   DW_AT_decl_line   : 557
    <f1e>   DW_AT_decl_column : 17
    <f1f>   DW_AT_type        : <0x2b>
    <f23>   DW_AT_external    : 1
    <f24>   DW_AT_declaration : 1
 <1><f25>: Abbrev Number: 10 (DW_TAG_variable)
    <f26>   DW_AT_name        : (indirect string, offset: 0x6d4): xlat_verbosity
    <f2a>   DW_AT_decl_file   : 19
    <f2b>   DW_AT_decl_line   : 919
    <f2d>   DW_AT_decl_column : 24
    <f2e>   DW_AT_type        : <0xa63>
    <f32>   DW_AT_external    : 1
    <f33>   DW_AT_declaration : 1
 <1><f34>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f35>   DW_AT_name        : (indirect string, offset: 0x5f3): xlat_style_private_flag_bits
    <f39>   DW_AT_encoding    : 7	(unsigned)
    <f3a>   DW_AT_byte_size   : 4
    <f3b>   DW_AT_type        : <0x2b>
    <f3f>   DW_AT_decl_file   : 19
    <f40>   DW_AT_decl_line   : 939
    <f42>   DW_AT_decl_column : 6
    <f43>   DW_AT_sibling     : <0xf60>
 <2><f47>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0x296): PAF_PRINT_INDICES_BIT
    <f4c>   DW_AT_const_value : 5
 <2><f4d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xb0b): PAF_ARRAY_TRUNCATED_BIT
    <f52>   DW_AT_const_value : 6
 <2><f53>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0x3d6): PXF_DEFAULT_STR_BIT
    <f58>   DW_AT_const_value : 7
 <2><f59>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xc59): SPFF_AUXSTR_MODE_BIT
    <f5e>   DW_AT_const_value : 8
 <2><f5f>: Abbrev Number: 0
 <1><f60>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f61>   DW_AT_name        : (indirect string, offset: 0xd10): find_xlat_flag_bits
    <f65>   DW_AT_encoding    : 7	(unsigned)
    <f66>   DW_AT_byte_size   : 4
    <f67>   DW_AT_type        : <0x2b>
    <f6b>   DW_AT_decl_file   : 19
    <f6c>   DW_AT_decl_line   : 1443
    <f6e>   DW_AT_decl_column : 6
    <f6f>   DW_AT_sibling     : <0xf7a>
 <2><f73>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f74>   DW_AT_name        : (indirect string, offset: 0x93f): FXL_CASE_SENSITIVE_BIT
    <f78>   DW_AT_const_value : 0
 <2><f79>: Abbrev Number: 0
 <1><f7a>: Abbrev Number: 10 (DW_TAG_variable)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x9d4): printing_tcp
    <f7f>   DW_AT_decl_file   : 19
    <f80>   DW_AT_decl_line   : 1689
    <f82>   DW_AT_decl_column : 20
    <f83>   DW_AT_type        : <0x602>
    <f87>   DW_AT_external    : 1
    <f88>   DW_AT_declaration : 1
 <1><f89>: Abbrev Number: 10 (DW_TAG_variable)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x5a7): errnoent
    <f8e>   DW_AT_decl_file   : 19
    <f8f>   DW_AT_decl_line   : 1887
    <f91>   DW_AT_decl_column : 26
    <f92>   DW_AT_type        : <0x442>
    <f96>   DW_AT_external    : 1
    <f97>   DW_AT_declaration : 1
 <1><f98>: Abbrev Number: 10 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0x830): signalent
    <f9d>   DW_AT_decl_file   : 19
    <f9e>   DW_AT_decl_line   : 1888
    <fa0>   DW_AT_decl_column : 26
    <fa1>   DW_AT_type        : <0x442>
    <fa5>   DW_AT_external    : 1
    <fa6>   DW_AT_declaration : 1
 <1><fa7>: Abbrev Number: 10 (DW_TAG_variable)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xe48): nerrnos
    <fac>   DW_AT_decl_file   : 19
    <fad>   DW_AT_decl_line   : 1889
    <faf>   DW_AT_decl_column : 27
    <fb0>   DW_AT_type        : <0x32>
    <fb4>   DW_AT_external    : 1
    <fb5>   DW_AT_declaration : 1
 <1><fb6>: Abbrev Number: 10 (DW_TAG_variable)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x100c): nsignals
    <fbb>   DW_AT_decl_file   : 19
    <fbc>   DW_AT_decl_line   : 1890
    <fbe>   DW_AT_decl_column : 27
    <fbf>   DW_AT_type        : <0x32>
    <fc3>   DW_AT_external    : 1
    <fc4>   DW_AT_declaration : 1
 <1><fc5>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc6>   DW_AT_type        : <0x882>
    <fca>   DW_AT_sibling     : <0xfd0>
 <2><fce>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fcf>: Abbrev Number: 0
 <1><fd0>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd1>   DW_AT_type        : <0xfc5>
 <1><fd5>: Abbrev Number: 10 (DW_TAG_variable)
    <fd6>   DW_AT_name        : (indirect string, offset: 0xcdb): sysent0
    <fda>   DW_AT_decl_file   : 19
    <fdb>   DW_AT_decl_line   : 1892
    <fdd>   DW_AT_decl_column : 28
    <fde>   DW_AT_type        : <0xfd0>
    <fe2>   DW_AT_external    : 1
    <fe3>   DW_AT_declaration : 1
 <1><fe4>: Abbrev Number: 15 (DW_TAG_array_type)
    <fe5>   DW_AT_type        : <0x8e9>
    <fe9>   DW_AT_sibling     : <0xfef>
 <2><fed>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fee>: Abbrev Number: 0
 <1><fef>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff0>   DW_AT_type        : <0xfe4>
 <1><ff4>: Abbrev Number: 10 (DW_TAG_variable)
    <ff5>   DW_AT_name        : (indirect string, offset: 0x1068): ioctlent0
    <ff9>   DW_AT_decl_file   : 19
    <ffa>   DW_AT_decl_line   : 1893
    <ffc>   DW_AT_decl_column : 30
    <ffd>   DW_AT_type        : <0xfef>
    <1001>   DW_AT_external    : 1
    <1002>   DW_AT_declaration : 1
 <1><1003>: Abbrev Number: 10 (DW_TAG_variable)
    <1004>   DW_AT_name        : (indirect string, offset: 0xf74): personality_names
    <1008>   DW_AT_decl_file   : 19
    <1009>   DW_AT_decl_line   : 1895
    <100b>   DW_AT_decl_column : 26
    <100c>   DW_AT_type        : <0x442>
    <1010>   DW_AT_external    : 1
    <1011>   DW_AT_declaration : 1
 <1><1012>: Abbrev Number: 10 (DW_TAG_variable)
    <1013>   DW_AT_name        : (indirect string, offset: 0x850): sysent
    <1017>   DW_AT_decl_file   : 19
    <1018>   DW_AT_decl_line   : 1898
    <101a>   DW_AT_decl_column : 29
    <101b>   DW_AT_type        : <0x9ce>
    <101f>   DW_AT_external    : 1
    <1020>   DW_AT_declaration : 1
 <1><1021>: Abbrev Number: 10 (DW_TAG_variable)
    <1022>   DW_AT_name        : (indirect string, offset: 0xc76): ioctlent
    <1026>   DW_AT_decl_file   : 19
    <1027>   DW_AT_decl_line   : 1899
    <1029>   DW_AT_decl_column : 31
    <102a>   DW_AT_type        : <0x1030>
    <102e>   DW_AT_external    : 1
    <102f>   DW_AT_declaration : 1
 <1><1030>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1031>   DW_AT_byte_size   : 4
    <1032>   DW_AT_type        : <0x8e9>
 <1><1036>: Abbrev Number: 10 (DW_TAG_variable)
    <1037>   DW_AT_name        : (indirect string, offset: 0x83a): nsyscalls
    <103b>   DW_AT_decl_file   : 19
    <103c>   DW_AT_decl_line   : 1905
    <103e>   DW_AT_decl_column : 17
    <103f>   DW_AT_type        : <0x2b>
    <1043>   DW_AT_external    : 1
    <1044>   DW_AT_declaration : 1
 <1><1045>: Abbrev Number: 10 (DW_TAG_variable)
    <1046>   DW_AT_name        : (indirect string, offset: 0xe62): nioctlents
    <104a>   DW_AT_decl_file   : 19
    <104b>   DW_AT_decl_line   : 1906
    <104d>   DW_AT_decl_column : 17
    <104e>   DW_AT_type        : <0x2b>
    <1052>   DW_AT_external    : 1
    <1053>   DW_AT_declaration : 1
 <1><1054>: Abbrev Number: 15 (DW_TAG_array_type)
    <1055>   DW_AT_type        : <0x32>
    <1059>   DW_AT_sibling     : <0x1064>
 <2><105d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <105e>   DW_AT_type        : <0x2b>
    <1062>   DW_AT_upper_bound : 2
 <2><1063>: Abbrev Number: 0
 <1><1064>: Abbrev Number: 3 (DW_TAG_const_type)
    <1065>   DW_AT_type        : <0x1054>
 <1><1069>: Abbrev Number: 10 (DW_TAG_variable)
    <106a>   DW_AT_name        : (indirect string, offset: 0xec2): nsyscall_vec
    <106e>   DW_AT_decl_file   : 19
    <106f>   DW_AT_decl_line   : 1908
    <1071>   DW_AT_decl_column : 27
    <1072>   DW_AT_type        : <0x1064>
    <1076>   DW_AT_external    : 1
    <1077>   DW_AT_declaration : 1
 <1><1078>: Abbrev Number: 15 (DW_TAG_array_type)
    <1079>   DW_AT_type        : <0x9d4>
    <107d>   DW_AT_sibling     : <0x1088>
 <2><1081>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1082>   DW_AT_type        : <0x2b>
    <1086>   DW_AT_upper_bound : 2
 <2><1087>: Abbrev Number: 0
 <1><1088>: Abbrev Number: 3 (DW_TAG_const_type)
    <1089>   DW_AT_type        : <0x1078>
 <1><108d>: Abbrev Number: 10 (DW_TAG_variable)
    <108e>   DW_AT_name        : (indirect string, offset: 0x77f): sysent_vec
    <1092>   DW_AT_decl_file   : 19
    <1093>   DW_AT_decl_line   : 1909
    <1095>   DW_AT_decl_column : 35
    <1096>   DW_AT_type        : <0x1088>
    <109a>   DW_AT_external    : 1
    <109b>   DW_AT_declaration : 1
 <1><109c>: Abbrev Number: 10 (DW_TAG_variable)
    <109d>   DW_AT_name        : (indirect string, offset: 0x377): inject_vec
    <10a1>   DW_AT_decl_file   : 19
    <10a2>   DW_AT_decl_line   : 1910
    <10a4>   DW_AT_decl_column : 28
    <10a5>   DW_AT_type        : <0x9d9>
    <10a9>   DW_AT_external    : 1
    <10aa>   DW_AT_declaration : 1
 <1><10ab>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10ac>   DW_AT_name        : (indirect string, offset: 0xd64): audit_arch_t
    <10b0>   DW_AT_byte_size   : 8
    <10b1>   DW_AT_decl_file   : 19
    <10b2>   DW_AT_decl_line   : 1912
    <10b4>   DW_AT_decl_column : 8
    <10b5>   DW_AT_sibling     : <0x10da>
 <2><10b9>: Abbrev Number: 22 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x5e5): arch
    <10be>   DW_AT_decl_file   : 19
    <10bf>   DW_AT_decl_line   : 1913
    <10c1>   DW_AT_decl_column : 15
    <10c2>   DW_AT_type        : <0x2b>
    <10c6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c9>: Abbrev Number: 22 (DW_TAG_member)
    <10ca>   DW_AT_name        : (indirect string, offset: 0x9ba): flag
    <10ce>   DW_AT_decl_file   : 19
    <10cf>   DW_AT_decl_line   : 1914
    <10d1>   DW_AT_decl_column : 15
    <10d2>   DW_AT_type        : <0x2b>
    <10d6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d9>: Abbrev Number: 0
 <1><10da>: Abbrev Number: 3 (DW_TAG_const_type)
    <10db>   DW_AT_type        : <0x10ab>
 <1><10df>: Abbrev Number: 15 (DW_TAG_array_type)
    <10e0>   DW_AT_type        : <0x10da>
    <10e4>   DW_AT_sibling     : <0x10ef>
 <2><10e8>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10e9>   DW_AT_type        : <0x2b>
    <10ed>   DW_AT_upper_bound : 2
 <2><10ee>: Abbrev Number: 0
 <1><10ef>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f0>   DW_AT_type        : <0x10df>
 <1><10f4>: Abbrev Number: 10 (DW_TAG_variable)
    <10f5>   DW_AT_name        : (indirect string, offset: 0x930): audit_arch_vec
    <10f9>   DW_AT_decl_file   : 19
    <10fa>   DW_AT_decl_line   : 1917
    <10fc>   DW_AT_decl_column : 34
    <10fd>   DW_AT_type        : <0x10ef>
    <1101>   DW_AT_external    : 1
    <1102>   DW_AT_declaration : 1
 <1><1103>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1104>   DW_AT_byte_size   : 180
    <1105>   DW_AT_decl_file   : 21
    <1106>   DW_AT_decl_line   : 2
    <1107>   DW_AT_decl_column : 9
    <1108>   DW_AT_sibling     : <0x13bd>
 <2><110c>: Abbrev Number: 9 (DW_TAG_member)
    <110d>   DW_AT_name        : (indirect string, offset: 0x1c3): block_ioctl
    <1111>   DW_AT_decl_file   : 21
    <1112>   DW_AT_decl_line   : 3
    <1113>   DW_AT_decl_column : 8
    <1114>   DW_AT_type        : <0x13d7>
    <1118>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><111b>: Abbrev Number: 9 (DW_TAG_member)
    <111c>   DW_AT_name        : (indirect string, offset: 0xa9b): btrfs_ioctl
    <1120>   DW_AT_decl_file   : 21
    <1121>   DW_AT_decl_line   : 6
    <1122>   DW_AT_decl_column : 8
    <1123>   DW_AT_type        : <0x13d7>
    <1127>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><112a>: Abbrev Number: 9 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0x70d): evdev_write_ioctl_mpers
    <112f>   DW_AT_decl_file   : 21
    <1130>   DW_AT_decl_line   : 9
    <1131>   DW_AT_decl_column : 8
    <1132>   DW_AT_type        : <0x13d7>
    <1136>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1139>: Abbrev Number: 9 (DW_TAG_member)
    <113a>   DW_AT_name        : (indirect string, offset: 0x6e3): get_sock_fprog_size
    <113e>   DW_AT_decl_file   : 21
    <113f>   DW_AT_decl_line   : 12
    <1140>   DW_AT_decl_column : 17
    <1141>   DW_AT_type        : <0x13e3>
    <1145>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1148>: Abbrev Number: 9 (DW_TAG_member)
    <1149>   DW_AT_name        : (indirect string, offset: 0x192): fetch_bpf_fprog
    <114d>   DW_AT_decl_file   : 21
    <114e>   DW_AT_decl_line   : 15
    <114f>   DW_AT_decl_column : 10
    <1150>   DW_AT_type        : <0x1403>
