Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x168a (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4ec): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x165): mpers-mx32/struct_flock.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe44): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c1): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfbf): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x964): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x364): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x264): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xda7): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x490): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x86a): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe95): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x89a): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x775): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb23): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb59): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xcba): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc27): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x40d): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x459): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x370): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xb44): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xf4c): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xdb7): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2ca): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xacc): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x108c): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xddd): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xa8e): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x281): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0x3b9): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0xfa3): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x748): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xc16): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xb09): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x378): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x9e0): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x4df): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0xef3): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x7b1): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0xff8): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x8dc): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x94d): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0xd52): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0xc81): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x60d): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x212): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0xf72): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x79d): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x816): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x240): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xe03): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xc91): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x17f): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x6e0): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xa20): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0xf87): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x3dd): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xbec): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x9a2): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0xa04): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x7cb): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0xaae): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x485): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x322): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x38c): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5c4): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0xfd2): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0xda0): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x24c): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x5d3): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x26e): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xe12): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x6b9): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0xb84): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x1bc): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xe7c): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x381): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x99b): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x1042): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x4ca): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0xf20): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0x9ae): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x41f): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0xa64): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x5b3): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x255): __kernel_pid_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 28
    <539>   DW_AT_decl_column : 14
    <53a>   DW_AT_type        : <0x64>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x30a): __kernel_off_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 87
    <545>   DW_AT_decl_column : 25
    <546>   DW_AT_type        : <0x51a>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x3eb): kernel_long_t
    <54f>   DW_AT_decl_file   : 16
    <550>   DW_AT_decl_line   : 16
    <551>   DW_AT_decl_column : 25
    <552>   DW_AT_type        : <0x51a>
 <1><556>: Abbrev Number: 4 (DW_TAG_typedef)
    <557>   DW_AT_name        : (indirect string, offset: 0x88b): kernel_ulong_t
    <55b>   DW_AT_decl_file   : 16
    <55c>   DW_AT_decl_line   : 17
    <55d>   DW_AT_decl_column : 26
    <55e>   DW_AT_type        : <0x526>
 <1><562>: Abbrev Number: 3 (DW_TAG_const_type)
    <563>   DW_AT_type        : <0x556>
 <1><567>: Abbrev Number: 8 (DW_TAG_structure_type)
    <568>   DW_AT_name        : (indirect string, offset: 0xba2): list_item
    <56c>   DW_AT_byte_size   : 8
    <56d>   DW_AT_decl_file   : 17
    <56e>   DW_AT_decl_line   : 92
    <56f>   DW_AT_decl_column : 8
    <570>   DW_AT_sibling     : <0x593>
 <2><574>: Abbrev Number: 9 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0x1087): prev
    <579>   DW_AT_decl_file   : 17
    <57a>   DW_AT_decl_line   : 93
    <57b>   DW_AT_decl_column : 20
    <57c>   DW_AT_type        : <0x593>
    <580>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><583>: Abbrev Number: 9 (DW_TAG_member)
    <584>   DW_AT_name        : (indirect string, offset: 0x107d): next
    <588>   DW_AT_decl_file   : 17
    <589>   DW_AT_decl_line   : 94
    <58a>   DW_AT_decl_column : 20
    <58b>   DW_AT_type        : <0x593>
    <58f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><592>: Abbrev Number: 0
 <1><593>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <594>   DW_AT_byte_size   : 4
    <595>   DW_AT_type        : <0x567>
 <1><599>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59a>   DW_AT_name        : (indirect string, offset: 0x863): sysent
    <59e>   DW_AT_byte_size   : 20
    <59f>   DW_AT_decl_file   : 18
    <5a0>   DW_AT_decl_line   : 13
    <5a1>   DW_AT_decl_column : 16
    <5a2>   DW_AT_sibling     : <0x5f2>
 <2><5a6>: Abbrev Number: 9 (DW_TAG_member)
    <5a7>   DW_AT_name        : (indirect string, offset: 0xfe9): nargs
    <5ab>   DW_AT_decl_file   : 18
    <5ac>   DW_AT_decl_line   : 14
    <5ad>   DW_AT_decl_column : 11
    <5ae>   DW_AT_type        : <0x2b>
    <5b2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b5>: Abbrev Number: 9 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x95a): sys_flags
    <5ba>   DW_AT_decl_file   : 18
    <5bb>   DW_AT_decl_line   : 15
    <5bc>   DW_AT_decl_column : 6
    <5bd>   DW_AT_type        : <0x64>
    <5c1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c4>: Abbrev Number: 18 (DW_TAG_member)
    <5c5>   DW_AT_name        : sen
    <5c9>   DW_AT_decl_file   : 18
    <5ca>   DW_AT_decl_line   : 16
    <5cb>   DW_AT_decl_column : 6
    <5cc>   DW_AT_type        : <0x64>
    <5d0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d3>: Abbrev Number: 9 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x319): sys_func
    <5d8>   DW_AT_decl_file   : 18
    <5d9>   DW_AT_decl_line   : 17
    <5da>   DW_AT_decl_column : 8
    <5db>   DW_AT_type        : <0x85f>
    <5df>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e2>: Abbrev Number: 9 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x278): sys_name
    <5e7>   DW_AT_decl_file   : 18
    <5e8>   DW_AT_decl_line   : 18
    <5e9>   DW_AT_decl_column : 14
    <5ea>   DW_AT_type        : <0x1c2>
    <5ee>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f1>: Abbrev Number: 0
 <1><5f2>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5f3>   DW_AT_prototyped  : 1
    <5f4>   DW_AT_type        : <0x64>
    <5f8>   DW_AT_sibling     : <0x602>
 <2><5fc>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5fd>   DW_AT_type        : <0x602>
 <2><601>: Abbrev Number: 0
 <1><602>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <603>   DW_AT_byte_size   : 4
    <604>   DW_AT_type        : <0x60d>
 <1><608>: Abbrev Number: 3 (DW_TAG_const_type)
    <609>   DW_AT_type        : <0x602>
 <1><60d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <60e>   DW_AT_name        : tcb
    <612>   DW_AT_byte_size   : 288
    <614>   DW_AT_decl_file   : 19
    <615>   DW_AT_decl_line   : 262
    <617>   DW_AT_decl_column : 8
    <618>   DW_AT_sibling     : <0x85f>
 <2><61c>: Abbrev Number: 22 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x4d9): flags
    <621>   DW_AT_decl_file   : 19
    <622>   DW_AT_decl_line   : 263
    <624>   DW_AT_decl_column : 6
    <625>   DW_AT_type        : <0x64>
    <629>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><62c>: Abbrev Number: 23 (DW_TAG_member)
    <62d>   DW_AT_name        : pid
    <631>   DW_AT_decl_file   : 19
    <632>   DW_AT_decl_line   : 264
    <634>   DW_AT_decl_column : 6
    <635>   DW_AT_type        : <0x64>
    <639>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><63c>: Abbrev Number: 22 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <641>   DW_AT_decl_file   : 19
    <642>   DW_AT_decl_line   : 265
    <644>   DW_AT_decl_column : 6
    <645>   DW_AT_type        : <0x64>
    <649>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><64c>: Abbrev Number: 22 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0x3a5): currpers
    <651>   DW_AT_decl_file   : 19
    <652>   DW_AT_decl_line   : 267
    <654>   DW_AT_decl_column : 15
    <655>   DW_AT_type        : <0x2b>
    <659>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><65c>: Abbrev Number: 22 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0xb01): u_error
    <661>   DW_AT_decl_file   : 19
    <662>   DW_AT_decl_line   : 269
    <664>   DW_AT_decl_column : 16
    <665>   DW_AT_type        : <0x37>
    <669>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><66c>: Abbrev Number: 22 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <671>   DW_AT_decl_file   : 19
    <672>   DW_AT_decl_line   : 270
    <674>   DW_AT_decl_column : 17
    <675>   DW_AT_type        : <0x556>
    <679>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67c>: Abbrev Number: 22 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0xb3a): true_scno
    <681>   DW_AT_decl_file   : 19
    <682>   DW_AT_decl_line   : 271
    <684>   DW_AT_decl_column : 17
    <685>   DW_AT_type        : <0x556>
    <689>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><68c>: Abbrev Number: 22 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x1a6): u_arg
    <691>   DW_AT_decl_file   : 19
    <692>   DW_AT_decl_line   : 272
    <694>   DW_AT_decl_column : 17
    <695>   DW_AT_type        : <0x98f>
    <699>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><69c>: Abbrev Number: 22 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x971): u_rval
    <6a1>   DW_AT_decl_file   : 19
    <6a2>   DW_AT_decl_line   : 273
    <6a4>   DW_AT_decl_column : 16
    <6a5>   DW_AT_type        : <0x54a>
    <6a9>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6ac>: Abbrev Number: 22 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0xa80): sys_func_rval
    <6b1>   DW_AT_decl_file   : 19
    <6b2>   DW_AT_decl_line   : 274
    <6b4>   DW_AT_decl_column : 6
    <6b5>   DW_AT_type        : <0x64>
    <6b9>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6bc>: Abbrev Number: 22 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0xcab): curcol
    <6c1>   DW_AT_decl_file   : 19
    <6c2>   DW_AT_decl_line   : 275
    <6c4>   DW_AT_decl_column : 6
    <6c5>   DW_AT_type        : <0x64>
    <6c9>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6cc>: Abbrev Number: 22 (DW_TAG_member)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x983): outf
    <6d1>   DW_AT_decl_file   : 19
    <6d2>   DW_AT_decl_line   : 276
    <6d4>   DW_AT_decl_column : 8
    <6d5>   DW_AT_type        : <0x407>
    <6d9>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6dc>: Abbrev Number: 22 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0xebb): staged_output_data
    <6e1>   DW_AT_decl_file   : 19
    <6e2>   DW_AT_decl_line   : 277
    <6e4>   DW_AT_decl_column : 29
    <6e5>   DW_AT_type        : <0x9a5>
    <6e9>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6ec>: Abbrev Number: 22 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xa4b): auxstr
    <6f1>   DW_AT_decl_file   : 19
    <6f2>   DW_AT_decl_line   : 279
    <6f4>   DW_AT_decl_column : 14
    <6f5>   DW_AT_type        : <0x1c2>
    <6f9>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6fc>: Abbrev Number: 22 (DW_TAG_member)
    <6fd>   DW_AT_name        : (indirect string, offset: 0x185): _priv_data
    <701>   DW_AT_decl_file   : 19
    <702>   DW_AT_decl_line   : 280
    <704>   DW_AT_decl_column : 8
    <705>   DW_AT_type        : <0xc6>
    <709>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><70c>: Abbrev Number: 22 (DW_TAG_member)
    <70d>   DW_AT_name        : (indirect string, offset: 0xbcf): _free_priv_data
    <711>   DW_AT_decl_file   : 19
    <712>   DW_AT_decl_line   : 281
    <714>   DW_AT_decl_column : 9
    <715>   DW_AT_type        : <0x9b7>
    <719>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><71c>: Abbrev Number: 22 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x196): s_ent
    <721>   DW_AT_decl_file   : 19
    <722>   DW_AT_decl_line   : 282
    <724>   DW_AT_decl_column : 23
    <725>   DW_AT_type        : <0x9bd>
    <729>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><72c>: Abbrev Number: 22 (DW_TAG_member)
    <72d>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <731>   DW_AT_decl_file   : 19
    <732>   DW_AT_decl_line   : 285
    <734>   DW_AT_decl_column : 23
    <735>   DW_AT_type        : <0x9bd>
    <739>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><73d>: Abbrev Number: 22 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0x39a): inject_vec
    <742>   DW_AT_decl_file   : 19
    <743>   DW_AT_decl_line   : 286
    <745>   DW_AT_decl_column : 22
    <746>   DW_AT_type        : <0x9c8>
    <74a>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><74e>: Abbrev Number: 22 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x7d4): stime
    <753>   DW_AT_decl_file   : 19
    <754>   DW_AT_decl_line   : 287
    <756>   DW_AT_decl_column : 18
    <757>   DW_AT_type        : <0x133>
    <75b>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><75f>: Abbrev Number: 22 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x3ae): ltime
    <764>   DW_AT_decl_file   : 19
    <765>   DW_AT_decl_line   : 288
    <767>   DW_AT_decl_column : 18
    <768>   DW_AT_type        : <0x133>
    <76c>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><770>: Abbrev Number: 22 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0xfaa): atime
    <775>   DW_AT_decl_file   : 19
    <776>   DW_AT_decl_line   : 289
    <778>   DW_AT_decl_column : 18
    <779>   DW_AT_type        : <0x133>
    <77d>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><781>: Abbrev Number: 22 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x4d3): etime
    <786>   DW_AT_decl_file   : 19
    <787>   DW_AT_decl_line   : 290
    <789>   DW_AT_decl_column : 18
    <78a>   DW_AT_type        : <0x133>
    <78e>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><792>: Abbrev Number: 22 (DW_TAG_member)
    <793>   DW_AT_name        : (indirect string, offset: 0xd0f): delay_expiration_time
    <797>   DW_AT_decl_file   : 19
    <798>   DW_AT_decl_line   : 291
    <79a>   DW_AT_decl_column : 18
    <79b>   DW_AT_type        : <0x133>
    <79f>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a3>: Abbrev Number: 22 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a8>   DW_AT_decl_file   : 19
    <7a9>   DW_AT_decl_line   : 298
    <7ab>   DW_AT_decl_column : 15
    <7ac>   DW_AT_type        : <0x2b>
    <7b0>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b4>: Abbrev Number: 22 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xf06): last_dirfd
    <7b9>   DW_AT_decl_file   : 19
    <7ba>   DW_AT_decl_line   : 301
    <7bc>   DW_AT_decl_column : 6
    <7bd>   DW_AT_type        : <0x64>
    <7c1>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c5>: Abbrev Number: 22 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0xf2c): mmap_cache
    <7ca>   DW_AT_decl_file   : 19
    <7cb>   DW_AT_decl_line   : 304
    <7cd>   DW_AT_decl_column : 23
    <7ce>   DW_AT_type        : <0x9e4>
    <7d2>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7d6>: Abbrev Number: 22 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xb10): wait_data_idx
    <7db>   DW_AT_decl_file   : 19
    <7dc>   DW_AT_decl_line   : 311
    <7de>   DW_AT_decl_column : 9
    <7df>   DW_AT_type        : <0x122>
    <7e3>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7e7>: Abbrev Number: 22 (DW_TAG_member)
    <7e8>   DW_AT_name        : (indirect string, offset: 0xa52): delayed_wait_data
    <7ec>   DW_AT_decl_file   : 19
    <7ed>   DW_AT_decl_line   : 313
    <7ef>   DW_AT_decl_column : 24
    <7f0>   DW_AT_type        : <0x9f0>
    <7f4>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f8>: Abbrev Number: 22 (DW_TAG_member)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xac2): wait_list
    <7fd>   DW_AT_decl_file   : 19
    <7fe>   DW_AT_decl_line   : 314
    <800>   DW_AT_decl_column : 19
    <801>   DW_AT_type        : <0x567>
    <805>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><809>: Abbrev Number: 22 (DW_TAG_member)
    <80a>   DW_AT_name        : (indirect string, offset: 0x6d1): vcpu_info_list
    <80e>   DW_AT_decl_file   : 19
    <80f>   DW_AT_decl_line   : 318
    <811>   DW_AT_decl_column : 20
    <812>   DW_AT_type        : <0x9fc>
    <816>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81a>: Abbrev Number: 22 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0xc76): unwind_ctx
    <81f>   DW_AT_decl_file   : 19
    <820>   DW_AT_decl_line   : 322
    <822>   DW_AT_decl_column : 8
    <823>   DW_AT_type        : <0xc6>
    <827>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82b>: Abbrev Number: 22 (DW_TAG_member)
    <82c>   DW_AT_name        : (indirect string, offset: 0x4bd): unwind_queue
    <830>   DW_AT_decl_file   : 19
    <831>   DW_AT_decl_line   : 323
    <833>   DW_AT_decl_column : 25
    <834>   DW_AT_type        : <0xa08>
    <838>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><83c>: Abbrev Number: 22 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <841>   DW_AT_decl_file   : 19
    <842>   DW_AT_decl_line   : 327
    <844>   DW_AT_decl_column : 7
    <845>   DW_AT_type        : <0xa0e>
    <849>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><84d>: Abbrev Number: 22 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x222): start_prc
    <852>   DW_AT_decl_file   : 19
    <853>   DW_AT_decl_line   : 329
    <855>   DW_AT_decl_column : 16
    <856>   DW_AT_type        : <0x37>
    <85a>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><85e>: Abbrev Number: 0
 <1><85f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <860>   DW_AT_byte_size   : 4
    <861>   DW_AT_type        : <0x5f2>
 <1><865>: Abbrev Number: 4 (DW_TAG_typedef)
    <866>   DW_AT_name        : (indirect string, offset: 0x5a5): struct_sysent
    <86a>   DW_AT_decl_file   : 18
    <86b>   DW_AT_decl_line   : 19
    <86c>   DW_AT_decl_column : 3
    <86d>   DW_AT_type        : <0x599>
 <1><871>: Abbrev Number: 3 (DW_TAG_const_type)
    <872>   DW_AT_type        : <0x865>
 <1><876>: Abbrev Number: 11 (DW_TAG_variable)
    <877>   DW_AT_name        : (indirect string, offset: 0xcfb): current_personality
    <87b>   DW_AT_decl_file   : 19
    <87c>   DW_AT_decl_line   : 158
    <87d>   DW_AT_decl_column : 17
    <87e>   DW_AT_type        : <0x2b>
    <882>   DW_AT_external    : 1
    <883>   DW_AT_declaration : 1
 <1><884>: Abbrev Number: 11 (DW_TAG_variable)
    <885>   DW_AT_name        : (indirect string, offset: 0x805): current_wordsize
    <889>   DW_AT_decl_file   : 19
    <88a>   DW_AT_decl_line   : 171
    <88b>   DW_AT_decl_column : 17
    <88c>   DW_AT_type        : <0x2b>
    <890>   DW_AT_external    : 1
    <891>   DW_AT_declaration : 1
 <1><892>: Abbrev Number: 11 (DW_TAG_variable)
    <893>   DW_AT_name        : (indirect string, offset: 0xa29): current_klongsize
    <897>   DW_AT_decl_file   : 19
    <898>   DW_AT_decl_line   : 176
    <899>   DW_AT_decl_column : 17
    <89a>   DW_AT_type        : <0x2b>
    <89e>   DW_AT_external    : 1
    <89f>   DW_AT_declaration : 1
 <1><8a0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a1>   DW_AT_name        : (indirect string, offset: 0xc4d): ioctlent
    <8a5>   DW_AT_byte_size   : 8
    <8a6>   DW_AT_decl_file   : 19
    <8a7>   DW_AT_decl_line   : 217
    <8a8>   DW_AT_decl_column : 16
    <8a9>   DW_AT_sibling     : <0x8cc>
 <2><8ad>: Abbrev Number: 9 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xeec): symbol
    <8b2>   DW_AT_decl_file   : 19
    <8b3>   DW_AT_decl_line   : 218
    <8b4>   DW_AT_decl_column : 14
    <8b5>   DW_AT_type        : <0x1c2>
    <8b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8bc>: Abbrev Number: 9 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0xcc4): code
    <8c1>   DW_AT_decl_file   : 19
    <8c2>   DW_AT_decl_line   : 219
    <8c3>   DW_AT_decl_column : 15
    <8c4>   DW_AT_type        : <0x2b>
    <8c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8cb>: Abbrev Number: 0
 <1><8cc>: Abbrev Number: 4 (DW_TAG_typedef)
    <8cd>   DW_AT_name        : (indirect string, offset: 0xc06): struct_ioctlent
    <8d1>   DW_AT_decl_file   : 19
    <8d2>   DW_AT_decl_line   : 220
    <8d3>   DW_AT_decl_column : 3
    <8d4>   DW_AT_type        : <0x8a0>
 <1><8d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <8d9>   DW_AT_type        : <0x8cc>
 <1><8dd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8de>   DW_AT_name        : (indirect string, offset: 0x7f9): inject_data
    <8e2>   DW_AT_byte_size   : 10
    <8e3>   DW_AT_decl_file   : 19
    <8e4>   DW_AT_decl_line   : 241
    <8e5>   DW_AT_decl_column : 8
    <8e6>   DW_AT_sibling     : <0x945>
 <2><8ea>: Abbrev Number: 9 (DW_TAG_member)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x4d9): flags
    <8ef>   DW_AT_decl_file   : 19
    <8f0>   DW_AT_decl_line   : 242
    <8f1>   DW_AT_decl_column : 10
    <8f2>   DW_AT_type        : <0xeb>
    <8f6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f9>: Abbrev Number: 9 (DW_TAG_member)
    <8fa>   DW_AT_name        : (indirect string, offset: 0x90e): signo
    <8fe>   DW_AT_decl_file   : 19
    <8ff>   DW_AT_decl_line   : 243
    <900>   DW_AT_decl_column : 10
    <901>   DW_AT_type        : <0xeb>
    <905>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><908>: Abbrev Number: 9 (DW_TAG_member)
    <909>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <90d>   DW_AT_decl_file   : 19
    <90e>   DW_AT_decl_line   : 244
    <90f>   DW_AT_decl_column : 11
    <910>   DW_AT_type        : <0xf7>
    <914>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><917>: Abbrev Number: 9 (DW_TAG_member)
    <918>   DW_AT_name        : (indirect string, offset: 0xca1): delay_idx
    <91c>   DW_AT_decl_file   : 19
    <91d>   DW_AT_decl_line   : 245
    <91e>   DW_AT_decl_column : 11
    <91f>   DW_AT_type        : <0xf7>
    <923>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><926>: Abbrev Number: 9 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x5ff): poke_idx
    <92b>   DW_AT_decl_file   : 19
    <92c>   DW_AT_decl_line   : 246
    <92d>   DW_AT_decl_column : 11
    <92e>   DW_AT_type        : <0xf7>
    <932>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><935>: Abbrev Number: 9 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <93a>   DW_AT_decl_file   : 19
    <93b>   DW_AT_decl_line   : 247
    <93c>   DW_AT_decl_column : 11
    <93d>   DW_AT_type        : <0xf7>
    <941>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><944>: Abbrev Number: 0
 <1><945>: Abbrev Number: 8 (DW_TAG_structure_type)
    <946>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <94a>   DW_AT_byte_size   : 16
    <94b>   DW_AT_decl_file   : 19
    <94c>   DW_AT_decl_line   : 250
    <94d>   DW_AT_decl_column : 8
    <94e>   DW_AT_sibling     : <0x98f>
 <2><952>: Abbrev Number: 9 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0x9fe): first
    <957>   DW_AT_decl_file   : 19
    <958>   DW_AT_decl_line   : 251
    <959>   DW_AT_decl_column : 11
    <95a>   DW_AT_type        : <0xf7>
    <95e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><961>: Abbrev Number: 9 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x10b6): last
    <966>   DW_AT_decl_file   : 19
    <967>   DW_AT_decl_line   : 252
    <968>   DW_AT_decl_column : 11
    <969>   DW_AT_type        : <0xf7>
    <96d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><970>: Abbrev Number: 9 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x3b4): step
    <975>   DW_AT_decl_file   : 19
    <976>   DW_AT_decl_line   : 253
    <977>   DW_AT_decl_column : 11
    <978>   DW_AT_type        : <0xf7>
    <97c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><97f>: Abbrev Number: 9 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0x1082): data
    <984>   DW_AT_decl_file   : 19
    <985>   DW_AT_decl_line   : 254
    <986>   DW_AT_decl_column : 21
    <987>   DW_AT_type        : <0x8dd>
    <98b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 15 (DW_TAG_array_type)
    <990>   DW_AT_type        : <0x556>
    <994>   DW_AT_sibling     : <0x99f>
 <2><998>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <999>   DW_AT_type        : <0x2b>
    <99d>   DW_AT_upper_bound : 5
 <2><99e>: Abbrev Number: 0
 <1><99f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9a0>   DW_AT_name        : (indirect string, offset: 0xebb): staged_output_data
    <9a4>   DW_AT_declaration : 1
 <1><9a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a6>   DW_AT_byte_size   : 4
    <9a7>   DW_AT_type        : <0x99f>
 <1><9ab>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9ac>   DW_AT_prototyped  : 1
    <9ad>   DW_AT_sibling     : <0x9b7>
 <2><9b1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9b2>   DW_AT_type        : <0xc6>
 <2><9b6>: Abbrev Number: 0
 <1><9b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b8>   DW_AT_byte_size   : 4
    <9b9>   DW_AT_type        : <0x9ab>
 <1><9bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9be>   DW_AT_byte_size   : 4
    <9bf>   DW_AT_type        : <0x871>
 <1><9c3>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c4>   DW_AT_type        : <0x9bd>
 <1><9c8>: Abbrev Number: 15 (DW_TAG_array_type)
    <9c9>   DW_AT_type        : <0x9d8>
    <9cd>   DW_AT_sibling     : <0x9d8>
 <2><9d1>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9d2>   DW_AT_type        : <0x2b>
    <9d6>   DW_AT_upper_bound : 2
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d9>   DW_AT_byte_size   : 4
    <9da>   DW_AT_type        : <0x945>
 <1><9de>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9df>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9e3>   DW_AT_declaration : 1
 <1><9e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e5>   DW_AT_byte_size   : 4
    <9e6>   DW_AT_type        : <0x9de>
 <1><9ea>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x3cf): tcb_wait_data
    <9ef>   DW_AT_declaration : 1
 <1><9f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f1>   DW_AT_byte_size   : 4
    <9f2>   DW_AT_type        : <0x9ea>
 <1><9f6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <9fb>   DW_AT_declaration : 1
 <1><9fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x9f6>
 <1><a02>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a03>   DW_AT_name        : (indirect string, offset: 0xe9f): unwind_queue_t
    <a07>   DW_AT_declaration : 1
 <1><a08>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a09>   DW_AT_byte_size   : 4
    <a0a>   DW_AT_type        : <0xa02>
 <1><a0e>: Abbrev Number: 15 (DW_TAG_array_type)
    <a0f>   DW_AT_type        : <0xdf>
    <a13>   DW_AT_sibling     : <0xa1e>
 <2><a17>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a18>   DW_AT_type        : <0x2b>
    <a1c>   DW_AT_upper_bound : 15
 <2><a1d>: Abbrev Number: 0
 <1><a1e>: Abbrev Number: 10 (DW_TAG_variable)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xb4d): stub_sysent
    <a23>   DW_AT_decl_file   : 19
    <a24>   DW_AT_decl_line   : 403
    <a26>   DW_AT_decl_column : 28
    <a27>   DW_AT_type        : <0x871>
    <a2b>   DW_AT_external    : 1
    <a2c>   DW_AT_declaration : 1
 <1><a2d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x1065): xlat_type
    <a32>   DW_AT_encoding    : 7	(unsigned)
    <a33>   DW_AT_byte_size   : 4
    <a34>   DW_AT_type        : <0x2b>
    <a38>   DW_AT_decl_file   : 20
    <a39>   DW_AT_decl_line   : 13
    <a3a>   DW_AT_decl_column : 6
    <a3b>   DW_AT_sibling     : <0xa52>
 <2><a3f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a40>   DW_AT_name        : (indirect string, offset: 0x2d3): XT_NORMAL
    <a44>   DW_AT_const_value : 0
 <2><a45>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a46>   DW_AT_name        : (indirect string, offset: 0xc1d): XT_SORTED
    <a4a>   DW_AT_const_value : 1
 <2><a4b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xd87): XT_INDEXED
    <a50>   DW_AT_const_value : 2
 <2><a51>: Abbrev Number: 0
 <1><a52>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a53>   DW_AT_name        : (indirect string, offset: 0xb79): xlat_style
    <a57>   DW_AT_encoding    : 7	(unsigned)
    <a58>   DW_AT_byte_size   : 4
    <a59>   DW_AT_type        : <0x2b>
    <a5d>   DW_AT_decl_file   : 20
    <a5e>   DW_AT_decl_line   : 19
    <a5f>   DW_AT_decl_column : 6
    <a60>   DW_AT_sibling     : <0xa8f>
 <2><a64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a69>   DW_AT_const_value : 0
 <2><a6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xbac): XLAT_STYLE_RAW
    <a6f>   DW_AT_const_value : 1
 <2><a70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a71>   DW_AT_name        : (indirect string, offset: 0x1030): XLAT_STYLE_ABBREV
    <a75>   DW_AT_const_value : 2
 <2><a76>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a77>   DW_AT_name        : (indirect string, offset: 0x2f7): XLAT_STYLE_VERBOSE
    <a7b>   DW_AT_const_value : 3
 <2><a7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a81>   DW_AT_const_value : 0
 <2><a82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a87>   DW_AT_const_value : 4
 <2><a88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0x10a5): XLAT_STYLE_FMT_D
    <a8d>   DW_AT_const_value : 8
 <2><a8e>: Abbrev Number: 0
 <1><a8f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a90>   DW_AT_name        : (indirect string, offset: 0x337): xlat_data
    <a94>   DW_AT_byte_size   : 16
    <a95>   DW_AT_decl_file   : 20
    <a96>   DW_AT_decl_line   : 51
    <a97>   DW_AT_decl_column : 8
    <a98>   DW_AT_sibling     : <0xabb>
 <2><a9c>: Abbrev Number: 18 (DW_TAG_member)
    <a9d>   DW_AT_name        : val
    <aa1>   DW_AT_decl_file   : 20
    <aa2>   DW_AT_decl_line   : 52
    <aa3>   DW_AT_decl_column : 11
    <aa4>   DW_AT_type        : <0x10f>
    <aa8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aab>: Abbrev Number: 18 (DW_TAG_member)
    <aac>   DW_AT_name        : str
    <ab0>   DW_AT_decl_file   : 20
    <ab1>   DW_AT_decl_line   : 53
    <ab2>   DW_AT_decl_column : 14
    <ab3>   DW_AT_type        : <0x1c2>
    <ab7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aba>: Abbrev Number: 0
 <1><abb>: Abbrev Number: 3 (DW_TAG_const_type)
    <abc>   DW_AT_type        : <0xa8f>
 <1><ac0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ac5>   DW_AT_byte_size   : 24
    <ac6>   DW_AT_decl_file   : 20
    <ac7>   DW_AT_decl_line   : 56
    <ac8>   DW_AT_decl_column : 8
    <ac9>   DW_AT_sibling     : <0xb19>
 <2><acd>: Abbrev Number: 9 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0x1082): data
    <ad2>   DW_AT_decl_file   : 20
    <ad3>   DW_AT_decl_line   : 57
    <ad4>   DW_AT_decl_column : 26
    <ad5>   DW_AT_type        : <0xb1e>
    <ad9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><adc>: Abbrev Number: 9 (DW_TAG_member)
    <add>   DW_AT_name        : (indirect string, offset: 0x857): flags_strsz
    <ae1>   DW_AT_decl_file   : 20
    <ae2>   DW_AT_decl_line   : 58
    <ae3>   DW_AT_decl_column : 9
    <ae4>   DW_AT_type        : <0x122>
    <ae8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><aeb>: Abbrev Number: 9 (DW_TAG_member)
    <aec>   DW_AT_name        : (indirect string, offset: 0xb1e): size
    <af0>   DW_AT_decl_file   : 20
    <af1>   DW_AT_decl_line   : 59
    <af2>   DW_AT_decl_column : 11
    <af3>   DW_AT_type        : <0x103>
    <af7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><afa>: Abbrev Number: 9 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x1a1): type
    <aff>   DW_AT_decl_file   : 20
    <b00>   DW_AT_decl_line   : 60
    <b01>   DW_AT_decl_column : 17
    <b02>   DW_AT_type        : <0xa2d>
    <b06>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b09>: Abbrev Number: 9 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x725): flags_mask
    <b0e>   DW_AT_decl_file   : 20
    <b0f>   DW_AT_decl_line   : 61
    <b10>   DW_AT_decl_column : 11
    <b11>   DW_AT_type        : <0x10f>
    <b15>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b18>: Abbrev Number: 0
 <1><b19>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1a>   DW_AT_type        : <0xac0>
 <1><b1e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b1f>   DW_AT_byte_size   : 4
    <b20>   DW_AT_type        : <0xabb>
 <1><b24>: Abbrev Number: 15 (DW_TAG_array_type)
    <b25>   DW_AT_type        : <0xb19>
    <b29>   DW_AT_sibling     : <0xb2f>
 <2><b2d>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b2e>: Abbrev Number: 0
 <1><b2f>: Abbrev Number: 3 (DW_TAG_const_type)
    <b30>   DW_AT_type        : <0xb24>
 <1><b34>: Abbrev Number: 10 (DW_TAG_variable)
    <b35>   DW_AT_name        : (indirect string, offset: 0xdf0): addrfams
    <b39>   DW_AT_decl_file   : 19
    <b3a>   DW_AT_decl_line   : 409
    <b3c>   DW_AT_decl_column : 26
    <b3d>   DW_AT_type        : <0xb2f>
    <b41>   DW_AT_external    : 1
    <b42>   DW_AT_declaration : 1
 <1><b43>: Abbrev Number: 10 (DW_TAG_variable)
    <b44>   DW_AT_name        : (indirect string, offset: 0xcd4): arp_hardware_types
    <b48>   DW_AT_decl_file   : 19
    <b49>   DW_AT_decl_line   : 410
    <b4b>   DW_AT_decl_column : 26
    <b4c>   DW_AT_type        : <0xb2f>
    <b50>   DW_AT_external    : 1
    <b51>   DW_AT_declaration : 1
 <1><b52>: Abbrev Number: 10 (DW_TAG_variable)
    <b53>   DW_AT_name        : (indirect string, offset: 0xfb0): at_flags
    <b57>   DW_AT_decl_file   : 19
    <b58>   DW_AT_decl_line   : 411
    <b5a>   DW_AT_decl_column : 26
    <b5b>   DW_AT_type        : <0xb2f>
    <b5f>   DW_AT_external    : 1
    <b60>   DW_AT_declaration : 1
 <1><b61>: Abbrev Number: 10 (DW_TAG_variable)
    <b62>   DW_AT_name        : (indirect string, offset: 0x49b): clocknames
    <b66>   DW_AT_decl_file   : 19
    <b67>   DW_AT_decl_line   : 412
    <b69>   DW_AT_decl_column : 26
    <b6a>   DW_AT_type        : <0xb2f>
    <b6e>   DW_AT_external    : 1
    <b6f>   DW_AT_declaration : 1
 <1><b70>: Abbrev Number: 10 (DW_TAG_variable)
    <b71>   DW_AT_name        : (indirect string, offset: 0xf7a): dirent_types
    <b75>   DW_AT_decl_file   : 19
    <b76>   DW_AT_decl_line   : 413
    <b78>   DW_AT_decl_column : 26
    <b79>   DW_AT_type        : <0xb2f>
    <b7d>   DW_AT_external    : 1
    <b7e>   DW_AT_declaration : 1
 <1><b7f>: Abbrev Number: 10 (DW_TAG_variable)
    <b80>   DW_AT_name        : (indirect string, offset: 0x8a8): ethernet_protocols
    <b84>   DW_AT_decl_file   : 19
    <b85>   DW_AT_decl_line   : 414
    <b87>   DW_AT_decl_column : 26
    <b88>   DW_AT_type        : <0xb2f>
    <b8c>   DW_AT_external    : 1
    <b8d>   DW_AT_declaration : 1
 <1><b8e>: Abbrev Number: 10 (DW_TAG_variable)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x652): inet_protocols
    <b93>   DW_AT_decl_file   : 19
    <b94>   DW_AT_decl_line   : 415
    <b96>   DW_AT_decl_column : 26
    <b97>   DW_AT_type        : <0xb2f>
    <b9b>   DW_AT_external    : 1
    <b9c>   DW_AT_declaration : 1
 <1><b9d>: Abbrev Number: 10 (DW_TAG_variable)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x2c0): evdev_abs
    <ba2>   DW_AT_decl_file   : 19
    <ba3>   DW_AT_decl_line   : 416
    <ba5>   DW_AT_decl_column : 26
    <ba6>   DW_AT_type        : <0xb2f>
    <baa>   DW_AT_external    : 1
    <bab>   DW_AT_declaration : 1
 <1><bac>: Abbrev Number: 10 (DW_TAG_variable)
    <bad>   DW_AT_name        : (indirect string, offset: 0x71a): audit_arch
    <bb1>   DW_AT_decl_file   : 19
    <bb2>   DW_AT_decl_line   : 417
    <bb4>   DW_AT_decl_column : 26
    <bb5>   DW_AT_type        : <0xb2f>
    <bb9>   DW_AT_external    : 1
    <bba>   DW_AT_declaration : 1
 <1><bbb>: Abbrev Number: 10 (DW_TAG_variable)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bc0>   DW_AT_decl_file   : 19
    <bc1>   DW_AT_decl_line   : 418
    <bc3>   DW_AT_decl_column : 26
    <bc4>   DW_AT_type        : <0xb2f>
    <bc8>   DW_AT_external    : 1
    <bc9>   DW_AT_declaration : 1
 <1><bca>: Abbrev Number: 10 (DW_TAG_variable)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x47c): iffflags
    <bcf>   DW_AT_decl_file   : 19
    <bd0>   DW_AT_decl_line   : 419
    <bd2>   DW_AT_decl_column : 26
    <bd3>   DW_AT_type        : <0xb2f>
    <bd7>   DW_AT_external    : 1
    <bd8>   DW_AT_declaration : 1
 <1><bd9>: Abbrev Number: 10 (DW_TAG_variable)
    <bda>   DW_AT_name        : (indirect string, offset: 0xbbb): ip_type_of_services
    <bde>   DW_AT_decl_file   : 19
    <bdf>   DW_AT_decl_line   : 420
    <be1>   DW_AT_decl_column : 26
    <be2>   DW_AT_type        : <0xb2f>
    <be6>   DW_AT_external    : 1
    <be7>   DW_AT_declaration : 1
 <1><be8>: Abbrev Number: 10 (DW_TAG_variable)
    <be9>   DW_AT_name        : (indirect string, offset: 0x6ad): ipc_private
    <bed>   DW_AT_decl_file   : 19
    <bee>   DW_AT_decl_line   : 421
    <bf0>   DW_AT_decl_column : 26
    <bf1>   DW_AT_type        : <0xb2f>
    <bf5>   DW_AT_external    : 1
    <bf6>   DW_AT_declaration : 1
 <1><bf7>: Abbrev Number: 10 (DW_TAG_variable)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x32d): msg_flags
    <bfc>   DW_AT_decl_file   : 19
    <bfd>   DW_AT_decl_line   : 422
    <bff>   DW_AT_decl_column : 26
    <c00>   DW_AT_type        : <0xb2f>
    <c04>   DW_AT_external    : 1
    <c05>   DW_AT_declaration : 1
 <1><c06>: Abbrev Number: 10 (DW_TAG_variable)
    <c07>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c0b>   DW_AT_decl_file   : 19
    <c0c>   DW_AT_decl_line   : 423
    <c0e>   DW_AT_decl_column : 26
    <c0f>   DW_AT_type        : <0xb2f>
    <c13>   DW_AT_external    : 1
    <c14>   DW_AT_declaration : 1
 <1><c15>: Abbrev Number: 10 (DW_TAG_variable)
    <c16>   DW_AT_name        : (indirect string, offset: 0xece): nl_bridge_vlan_flags
    <c1a>   DW_AT_decl_file   : 19
    <c1b>   DW_AT_decl_line   : 424
    <c1d>   DW_AT_decl_column : 26
    <c1e>   DW_AT_type        : <0xb2f>
    <c22>   DW_AT_external    : 1
    <c23>   DW_AT_declaration : 1
 <1><c24>: Abbrev Number: 10 (DW_TAG_variable)
    <c25>   DW_AT_name        : (indirect string, offset: 0xd70): nl_netfilter_msg_types
    <c29>   DW_AT_decl_file   : 19
    <c2a>   DW_AT_decl_line   : 425
    <c2c>   DW_AT_decl_column : 26
    <c2d>   DW_AT_type        : <0xb2f>
    <c31>   DW_AT_external    : 1
    <c32>   DW_AT_declaration : 1
 <1><c33>: Abbrev Number: 10 (DW_TAG_variable)
    <c34>   DW_AT_name        : (indirect string, offset: 0x45e): nl_route_types
    <c38>   DW_AT_decl_file   : 19
    <c39>   DW_AT_decl_line   : 426
    <c3b>   DW_AT_decl_column : 26
    <c3c>   DW_AT_type        : <0xb2f>
    <c40>   DW_AT_external    : 1
    <c41>   DW_AT_declaration : 1
 <1><c42>: Abbrev Number: 10 (DW_TAG_variable)
    <c43>   DW_AT_name        : (indirect string, offset: 0xe27): open_access_modes
    <c47>   DW_AT_decl_file   : 19
    <c48>   DW_AT_decl_line   : 427
    <c4a>   DW_AT_decl_column : 26
    <c4b>   DW_AT_type        : <0xb2f>
    <c4f>   DW_AT_external    : 1
    <c50>   DW_AT_declaration : 1
 <1><c51>: Abbrev Number: 10 (DW_TAG_variable)
    <c52>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c56>   DW_AT_decl_file   : 19
    <c57>   DW_AT_decl_line   : 428
    <c59>   DW_AT_decl_column : 26
    <c5a>   DW_AT_type        : <0xb2f>
    <c5e>   DW_AT_external    : 1
    <c5f>   DW_AT_declaration : 1
 <1><c60>: Abbrev Number: 10 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0xbf9): perf_type_id
    <c65>   DW_AT_decl_file   : 19
    <c66>   DW_AT_decl_line   : 429
    <c68>   DW_AT_decl_column : 26
    <c69>   DW_AT_type        : <0xb2f>
    <c6d>   DW_AT_external    : 1
    <c6e>   DW_AT_declaration : 1
 <1><c6f>: Abbrev Number: 10 (DW_TAG_variable)
    <c70>   DW_AT_name        : (indirect string, offset: 0xdf9): pollflags
    <c74>   DW_AT_decl_file   : 19
    <c75>   DW_AT_decl_line   : 430
    <c77>   DW_AT_decl_column : 26
    <c78>   DW_AT_type        : <0xb2f>
    <c7c>   DW_AT_external    : 1
    <c7d>   DW_AT_declaration : 1
 <1><c7e>: Abbrev Number: 10 (DW_TAG_variable)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x5f3): ptrace_cmds
    <c83>   DW_AT_decl_file   : 19
    <c84>   DW_AT_decl_line   : 431
    <c86>   DW_AT_decl_column : 26
    <c87>   DW_AT_type        : <0xb2f>
    <c8b>   DW_AT_external    : 1
    <c8c>   DW_AT_declaration : 1
 <1><c8d>: Abbrev Number: 10 (DW_TAG_variable)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x7ea): resource_flags
    <c92>   DW_AT_decl_file   : 19
    <c93>   DW_AT_decl_line   : 432
    <c95>   DW_AT_decl_column : 26
    <c96>   DW_AT_type        : <0xb2f>
    <c9a>   DW_AT_external    : 1
    <c9b>   DW_AT_declaration : 1
 <1><c9c>: Abbrev Number: 10 (DW_TAG_variable)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x296): route_nexthop_flags
    <ca1>   DW_AT_decl_file   : 19
    <ca2>   DW_AT_decl_line   : 433
    <ca4>   DW_AT_decl_column : 26
    <ca5>   DW_AT_type        : <0xb2f>
    <ca9>   DW_AT_external    : 1
    <caa>   DW_AT_declaration : 1
 <1><cab>: Abbrev Number: 10 (DW_TAG_variable)
    <cac>   DW_AT_name        : (indirect string, offset: 0xe59): routing_protocols
    <cb0>   DW_AT_decl_file   : 19
    <cb1>   DW_AT_decl_line   : 434
    <cb3>   DW_AT_decl_column : 26
    <cb4>   DW_AT_type        : <0xb2f>
    <cb8>   DW_AT_external    : 1
    <cb9>   DW_AT_declaration : 1
 <1><cba>: Abbrev Number: 10 (DW_TAG_variable)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x46d): routing_scopes
    <cbf>   DW_AT_decl_file   : 19
    <cc0>   DW_AT_decl_line   : 435
    <cc2>   DW_AT_decl_column : 26
    <cc3>   DW_AT_type        : <0xb2f>
    <cc7>   DW_AT_external    : 1
    <cc8>   DW_AT_declaration : 1
 <1><cc9>: Abbrev Number: 10 (DW_TAG_variable)
    <cca>   DW_AT_name        : (indirect string, offset: 0xd5e): routing_table_ids
    <cce>   DW_AT_decl_file   : 19
    <ccf>   DW_AT_decl_line   : 436
    <cd1>   DW_AT_decl_column : 26
    <cd2>   DW_AT_type        : <0xb2f>
    <cd6>   DW_AT_external    : 1
    <cd7>   DW_AT_declaration : 1
 <1><cd8>: Abbrev Number: 10 (DW_TAG_variable)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x68a): routing_types
    <cdd>   DW_AT_decl_file   : 19
    <cde>   DW_AT_decl_line   : 437
    <ce0>   DW_AT_decl_column : 26
    <ce1>   DW_AT_type        : <0xb2f>
    <ce5>   DW_AT_external    : 1
    <ce6>   DW_AT_declaration : 1
 <1><ce7>: Abbrev Number: 10 (DW_TAG_variable)
    <ce8>   DW_AT_name        : (indirect string, offset: 0x1c5): rwf_flags
    <cec>   DW_AT_decl_file   : 19
    <ced>   DW_AT_decl_line   : 438
    <cef>   DW_AT_decl_column : 26
    <cf0>   DW_AT_type        : <0xb2f>
    <cf4>   DW_AT_external    : 1
    <cf5>   DW_AT_declaration : 1
 <1><cf6>: Abbrev Number: 10 (DW_TAG_variable)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x822): seccomp_filter_flags
    <cfb>   DW_AT_decl_file   : 19
    <cfc>   DW_AT_decl_line   : 439
    <cfe>   DW_AT_decl_column : 26
    <cff>   DW_AT_type        : <0xb2f>
    <d03>   DW_AT_external    : 1
    <d04>   DW_AT_declaration : 1
 <1><d05>: Abbrev Number: 10 (DW_TAG_variable)
    <d06>   DW_AT_name        : (indirect string, offset: 0x2dd): seccomp_ret_action
    <d0a>   DW_AT_decl_file   : 19
    <d0b>   DW_AT_decl_line   : 440
    <d0d>   DW_AT_decl_column : 26
    <d0e>   DW_AT_type        : <0xb2f>
    <d12>   DW_AT_external    : 1
    <d13>   DW_AT_declaration : 1
 <1><d14>: Abbrev Number: 10 (DW_TAG_variable)
    <d15>   DW_AT_name        : (indirect string, offset: 0x439): setns_types
    <d19>   DW_AT_decl_file   : 19
    <d1a>   DW_AT_decl_line   : 441
    <d1c>   DW_AT_decl_column : 26
    <d1d>   DW_AT_type        : <0xb2f>
    <d21>   DW_AT_external    : 1
    <d22>   DW_AT_declaration : 1
 <1><d23>: Abbrev Number: 10 (DW_TAG_variable)
    <d24>   DW_AT_name        : (indirect string, offset: 0xde5): sg_io_info
    <d28>   DW_AT_decl_file   : 19
    <d29>   DW_AT_decl_line   : 442
    <d2b>   DW_AT_decl_column : 26
    <d2c>   DW_AT_type        : <0xb2f>
    <d30>   DW_AT_external    : 1
    <d31>   DW_AT_declaration : 1
 <1><d32>: Abbrev Number: 10 (DW_TAG_variable)
    <d33>   DW_AT_name        : (indirect string, offset: 0xb61): socketlayers
    <d37>   DW_AT_decl_file   : 19
    <d38>   DW_AT_decl_line   : 443
    <d3a>   DW_AT_decl_column : 26
    <d3b>   DW_AT_type        : <0xb2f>
    <d3f>   DW_AT_external    : 1
    <d40>   DW_AT_declaration : 1
 <1><d41>: Abbrev Number: 10 (DW_TAG_variable)
    <d42>   DW_AT_name        : (indirect string, offset: 0xd48): socktypes
    <d46>   DW_AT_decl_file   : 19
    <d47>   DW_AT_decl_line   : 444
    <d49>   DW_AT_decl_column : 26
    <d4a>   DW_AT_type        : <0xb2f>
    <d4e>   DW_AT_external    : 1
    <d4f>   DW_AT_declaration : 1
 <1><d50>: Abbrev Number: 10 (DW_TAG_variable)
    <d51>   DW_AT_name        : (indirect string, offset: 0xa3b): tcp_state_flags
    <d55>   DW_AT_decl_file   : 19
    <d56>   DW_AT_decl_line   : 445
    <d58>   DW_AT_decl_column : 26
    <d59>   DW_AT_type        : <0xb2f>
    <d5d>   DW_AT_external    : 1
    <d5e>   DW_AT_declaration : 1
 <1><d5f>: Abbrev Number: 10 (DW_TAG_variable)
    <d60>   DW_AT_name        : (indirect string, offset: 0x74f): tcp_states
    <d64>   DW_AT_decl_file   : 19
    <d65>   DW_AT_decl_line   : 446
    <d67>   DW_AT_decl_column : 26
    <d68>   DW_AT_type        : <0xb2f>
    <d6c>   DW_AT_external    : 1
    <d6d>   DW_AT_declaration : 1
 <1><d6e>: Abbrev Number: 10 (DW_TAG_variable)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x1013): whence_codes
    <d73>   DW_AT_decl_file   : 19
    <d74>   DW_AT_decl_line   : 447
    <d76>   DW_AT_decl_column : 26
    <d77>   DW_AT_type        : <0xb2f>
    <d7b>   DW_AT_external    : 1
    <d7c>   DW_AT_declaration : 1
 <1><d7d>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d7e>   DW_AT_encoding    : 7	(unsigned)
    <d7f>   DW_AT_byte_size   : 4
    <d80>   DW_AT_type        : <0x2b>
    <d84>   DW_AT_decl_file   : 19
    <d85>   DW_AT_decl_line   : 508
    <d87>   DW_AT_decl_column : 14
    <d88>   DW_AT_sibling     : <0xd9f>
 <2><d8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x978): CFLAG_NONE
    <d91>   DW_AT_const_value : 0
 <2><d92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d93>   DW_AT_name        : (indirect string, offset: 0x8bb): CFLAG_ONLY_STATS
    <d97>   DW_AT_const_value : 1
 <2><d98>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d99>   DW_AT_name        : (indirect string, offset: 0xb6e): CFLAG_BOTH
    <d9d>   DW_AT_const_value : 2
 <2><d9e>: Abbrev Number: 0
 <1><d9f>: Abbrev Number: 28 (DW_TAG_typedef)
    <da0>   DW_AT_name        : (indirect string, offset: 0x10bb): cflag_t
    <da4>   DW_AT_decl_file   : 19
    <da5>   DW_AT_decl_line   : 512
    <da7>   DW_AT_decl_column : 3
    <da8>   DW_AT_type        : <0xd7d>
 <1><dac>: Abbrev Number: 10 (DW_TAG_variable)
    <dad>   DW_AT_name        : (indirect string, offset: 0xc9b): cflag
    <db1>   DW_AT_decl_file   : 19
    <db2>   DW_AT_decl_line   : 513
    <db4>   DW_AT_decl_column : 16
    <db5>   DW_AT_type        : <0xd9f>
    <db9>   DW_AT_external    : 1
    <dba>   DW_AT_declaration : 1
 <1><dbb>: Abbrev Number: 10 (DW_TAG_variable)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x190): Tflag
    <dc0>   DW_AT_decl_file   : 19
    <dc1>   DW_AT_decl_line   : 514
    <dc3>   DW_AT_decl_column : 13
    <dc4>   DW_AT_type        : <0x50e>
    <dc8>   DW_AT_external    : 1
    <dc9>   DW_AT_declaration : 1
 <1><dca>: Abbrev Number: 10 (DW_TAG_variable)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x7a5): Tflag_scale
    <dcf>   DW_AT_decl_file   : 19
    <dd0>   DW_AT_decl_line   : 515
    <dd2>   DW_AT_decl_column : 12
    <dd3>   DW_AT_type        : <0x64>
    <dd7>   DW_AT_external    : 1
    <dd8>   DW_AT_declaration : 1
 <1><dd9>: Abbrev Number: 10 (DW_TAG_variable)
    <dda>   DW_AT_name        : (indirect string, offset: 0x837): Tflag_width
    <dde>   DW_AT_decl_file   : 19
    <ddf>   DW_AT_decl_line   : 516
    <de1>   DW_AT_decl_column : 12
    <de2>   DW_AT_type        : <0x64>
    <de6>   DW_AT_external    : 1
    <de7>   DW_AT_declaration : 1
 <1><de8>: Abbrev Number: 10 (DW_TAG_variable)
    <de9>   DW_AT_name        : (indirect string, offset: 0xdd7): iflag
    <ded>   DW_AT_decl_file   : 19
    <dee>   DW_AT_decl_line   : 517
    <df0>   DW_AT_decl_column : 13
    <df1>   DW_AT_type        : <0x50e>
    <df5>   DW_AT_external    : 1
    <df6>   DW_AT_declaration : 1
 <1><df7>: Abbrev Number: 10 (DW_TAG_variable)
    <df8>   DW_AT_name        : (indirect string, offset: 0x633): count_wallclock
    <dfc>   DW_AT_decl_file   : 19
    <dfd>   DW_AT_decl_line   : 518
    <dff>   DW_AT_decl_column : 13
    <e00>   DW_AT_type        : <0x50e>
    <e04>   DW_AT_external    : 1
    <e05>   DW_AT_declaration : 1
 <1><e06>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e07>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e0b>   DW_AT_byte_size   : 4
    <e0c>   DW_AT_decl_file   : 19
    <e0d>   DW_AT_decl_line   : 520
    <e0f>   DW_AT_decl_column : 8
    <e10>   DW_AT_sibling     : <0xe25>
 <2><e14>: Abbrev Number: 22 (DW_TAG_member)
    <e15>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e19>   DW_AT_decl_file   : 19
    <e1a>   DW_AT_decl_line   : 521
    <e1c>   DW_AT_decl_column : 14
    <e1d>   DW_AT_type        : <0x1c2>
    <e21>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e24>: Abbrev Number: 0
 <1><e25>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e26>   DW_AT_name        : (indirect string, offset: 0x75a): path_set
    <e2a>   DW_AT_byte_size   : 12
    <e2b>   DW_AT_decl_file   : 19
    <e2c>   DW_AT_decl_line   : 525
    <e2e>   DW_AT_decl_column : 15
    <e2f>   DW_AT_sibling     : <0xe64>
 <2><e33>: Abbrev Number: 22 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0x6e8): paths_selected
    <e38>   DW_AT_decl_file   : 19
    <e39>   DW_AT_decl_line   : 526
    <e3b>   DW_AT_decl_column : 24
    <e3c>   DW_AT_type        : <0xe64>
    <e40>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e43>: Abbrev Number: 22 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0x1006): num_selected
    <e48>   DW_AT_decl_file   : 19
    <e49>   DW_AT_decl_line   : 527
    <e4b>   DW_AT_decl_column : 9
    <e4c>   DW_AT_type        : <0x122>
    <e50>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e53>: Abbrev Number: 22 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0xb1e): size
    <e58>   DW_AT_decl_file   : 19
    <e59>   DW_AT_decl_line   : 528
    <e5b>   DW_AT_decl_column : 9
    <e5c>   DW_AT_type        : <0x122>
    <e60>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e63>: Abbrev Number: 0
 <1><e64>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e65>   DW_AT_byte_size   : 4
    <e66>   DW_AT_type        : <0xe06>
 <1><e6a>: Abbrev Number: 10 (DW_TAG_variable)
    <e6b>   DW_AT_name        : (indirect string, offset: 0x1055): global_path_set
    <e6f>   DW_AT_decl_file   : 19
    <e70>   DW_AT_decl_line   : 529
    <e72>   DW_AT_decl_column : 3
    <e73>   DW_AT_type        : <0xe25>
    <e77>   DW_AT_external    : 1
    <e78>   DW_AT_declaration : 1
 <1><e79>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7a>   DW_AT_name        : (indirect string, offset: 0xf55): xflag_opts
    <e7e>   DW_AT_encoding    : 7	(unsigned)
    <e7f>   DW_AT_byte_size   : 4
    <e80>   DW_AT_type        : <0x2b>
    <e84>   DW_AT_decl_file   : 19
    <e85>   DW_AT_decl_line   : 531
    <e87>   DW_AT_decl_column : 6
    <e88>   DW_AT_sibling     : <0xeab>
 <2><e8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x9f2): HEXSTR_NONE
    <e91>   DW_AT_const_value : 0
 <2><e92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e93>   DW_AT_name        : (indirect string, offset: 0xf92): HEXSTR_NON_ASCII
    <e97>   DW_AT_const_value : 1
 <2><e98>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e99>   DW_AT_name        : (indirect string, offset: 0x8f9): HEXSTR_ALL
    <e9d>   DW_AT_const_value : 2
 <2><e9e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x673): HEXSTR_NON_ASCII_CHARS
    <ea3>   DW_AT_const_value : 3
 <2><ea4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x1020): NUM_HEXSTR_OPTS
    <ea9>   DW_AT_const_value : 4
 <2><eaa>: Abbrev Number: 0
 <1><eab>: Abbrev Number: 10 (DW_TAG_variable)
    <eac>   DW_AT_name        : (indirect string, offset: 0xdb1): xflag
    <eb0>   DW_AT_decl_file   : 19
    <eb1>   DW_AT_decl_line   : 544
    <eb3>   DW_AT_decl_column : 17
    <eb4>   DW_AT_type        : <0x2b>
    <eb8>   DW_AT_external    : 1
    <eb9>   DW_AT_declaration : 1
 <1><eba>: Abbrev Number: 10 (DW_TAG_variable)
    <ebb>   DW_AT_name        : (indirect string, offset: 0xc56): followfork
    <ebf>   DW_AT_decl_file   : 19
    <ec0>   DW_AT_decl_line   : 545
    <ec2>   DW_AT_decl_column : 13
    <ec3>   DW_AT_type        : <0x50e>
    <ec7>   DW_AT_external    : 1
    <ec8>   DW_AT_declaration : 1
 <1><ec9>: Abbrev Number: 10 (DW_TAG_variable)
    <eca>   DW_AT_name        : (indirect string, offset: 0x341): output_separately
    <ece>   DW_AT_decl_file   : 19
    <ecf>   DW_AT_decl_line   : 546
    <ed1>   DW_AT_decl_column : 13
    <ed2>   DW_AT_type        : <0x50e>
    <ed6>   DW_AT_external    : 1
    <ed7>   DW_AT_declaration : 1
 <1><ed8>: Abbrev Number: 10 (DW_TAG_variable)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x22c): stack_trace_enabled
    <edd>   DW_AT_decl_file   : 19
    <ede>   DW_AT_decl_line   : 549
    <ee0>   DW_AT_decl_column : 13
    <ee1>   DW_AT_type        : <0x50e>
    <ee5>   DW_AT_external    : 1
    <ee6>   DW_AT_declaration : 1
 <1><ee7>: Abbrev Number: 10 (DW_TAG_variable)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x661): ptrace_setoptions
    <eec>   DW_AT_decl_file   : 19
    <eed>   DW_AT_decl_line   : 553
    <eef>   DW_AT_decl_column : 17
    <ef0>   DW_AT_type        : <0x2b>
    <ef4>   DW_AT_external    : 1
    <ef5>   DW_AT_declaration : 1
 <1><ef6>: Abbrev Number: 10 (DW_TAG_variable)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x9e7): max_strlen
    <efb>   DW_AT_decl_file   : 19
    <efc>   DW_AT_decl_line   : 554
    <efe>   DW_AT_decl_column : 17
    <eff>   DW_AT_type        : <0x2b>
    <f03>   DW_AT_external    : 1
    <f04>   DW_AT_declaration : 1
 <1><f05>: Abbrev Number: 10 (DW_TAG_variable)
    <f06>   DW_AT_name        : (indirect string, offset: 0xa15): os_release
    <f0a>   DW_AT_decl_file   : 19
    <f0b>   DW_AT_decl_line   : 555
    <f0d>   DW_AT_decl_column : 17
    <f0e>   DW_AT_type        : <0x2b>
    <f12>   DW_AT_external    : 1
    <f13>   DW_AT_declaration : 1
 <1><f14>: Abbrev Number: 10 (DW_TAG_variable)
    <f15>   DW_AT_name        : (indirect string, offset: 0x6f7): xlat_verbosity
    <f19>   DW_AT_decl_file   : 19
    <f1a>   DW_AT_decl_line   : 917
    <f1c>   DW_AT_decl_column : 24
    <f1d>   DW_AT_type        : <0xa52>
    <f21>   DW_AT_external    : 1
    <f22>   DW_AT_declaration : 1
 <1><f23>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f24>   DW_AT_name        : (indirect string, offset: 0x616): xlat_style_private_flag_bits
    <f28>   DW_AT_encoding    : 7	(unsigned)
    <f29>   DW_AT_byte_size   : 4
    <f2a>   DW_AT_type        : <0x2b>
    <f2e>   DW_AT_decl_file   : 19
    <f2f>   DW_AT_decl_line   : 937
    <f31>   DW_AT_decl_column : 6
    <f32>   DW_AT_sibling     : <0xf4f>
 <2><f36>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x2aa): PAF_PRINT_INDICES_BIT
    <f3b>   DW_AT_const_value : 5
 <2><f3c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0xad5): PAF_ARRAY_TRUNCATED_BIT
    <f41>   DW_AT_const_value : 6
 <2><f42>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x3f9): PXF_DEFAULT_STR_BIT
    <f47>   DW_AT_const_value : 7
 <2><f48>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0xc30): SPFF_AUXSTR_MODE_BIT
    <f4d>   DW_AT_const_value : 8
 <2><f4e>: Abbrev Number: 0
 <1><f4f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f50>   DW_AT_name        : (indirect string, offset: 0xce7): find_xlat_flag_bits
    <f54>   DW_AT_encoding    : 7	(unsigned)
    <f55>   DW_AT_byte_size   : 4
    <f56>   DW_AT_type        : <0x2b>
    <f5a>   DW_AT_decl_file   : 19
    <f5b>   DW_AT_decl_line   : 1441
    <f5d>   DW_AT_decl_column : 6
    <f5e>   DW_AT_sibling     : <0xf69>
 <2><f62>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f63>   DW_AT_name        : (indirect string, offset: 0x936): FXL_CASE_SENSITIVE_BIT
    <f67>   DW_AT_const_value : 0
 <2><f68>: Abbrev Number: 0
 <1><f69>: Abbrev Number: 10 (DW_TAG_variable)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x9c3): printing_tcp
    <f6e>   DW_AT_decl_file   : 19
    <f6f>   DW_AT_decl_line   : 1687
    <f71>   DW_AT_decl_column : 20
    <f72>   DW_AT_type        : <0x602>
    <f76>   DW_AT_external    : 1
    <f77>   DW_AT_declaration : 1
 <1><f78>: Abbrev Number: 10 (DW_TAG_variable)
    <f79>   DW_AT_name        : (indirect string, offset: 0x5ca): errnoent
    <f7d>   DW_AT_decl_file   : 19
    <f7e>   DW_AT_decl_line   : 1885
    <f80>   DW_AT_decl_column : 26
    <f81>   DW_AT_type        : <0x442>
    <f85>   DW_AT_external    : 1
    <f86>   DW_AT_declaration : 1
 <1><f87>: Abbrev Number: 10 (DW_TAG_variable)
    <f88>   DW_AT_name        : (indirect string, offset: 0x843): signalent
    <f8c>   DW_AT_decl_file   : 19
    <f8d>   DW_AT_decl_line   : 1886
    <f8f>   DW_AT_decl_column : 26
    <f90>   DW_AT_type        : <0x442>
    <f94>   DW_AT_external    : 1
    <f95>   DW_AT_declaration : 1
 <1><f96>: Abbrev Number: 10 (DW_TAG_variable)
    <f97>   DW_AT_name        : (indirect string, offset: 0xe1f): nerrnos
    <f9b>   DW_AT_decl_file   : 19
    <f9c>   DW_AT_decl_line   : 1887
    <f9e>   DW_AT_decl_column : 27
    <f9f>   DW_AT_type        : <0x32>
    <fa3>   DW_AT_external    : 1
    <fa4>   DW_AT_declaration : 1
 <1><fa5>: Abbrev Number: 10 (DW_TAG_variable)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xfef): nsignals
    <faa>   DW_AT_decl_file   : 19
    <fab>   DW_AT_decl_line   : 1888
    <fad>   DW_AT_decl_column : 27
    <fae>   DW_AT_type        : <0x32>
    <fb2>   DW_AT_external    : 1
    <fb3>   DW_AT_declaration : 1
 <1><fb4>: Abbrev Number: 15 (DW_TAG_array_type)
    <fb5>   DW_AT_type        : <0x871>
    <fb9>   DW_AT_sibling     : <0xfbf>
 <2><fbd>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fbe>: Abbrev Number: 0
 <1><fbf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc0>   DW_AT_type        : <0xfb4>
 <1><fc4>: Abbrev Number: 10 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0xcb2): sysent0
    <fc9>   DW_AT_decl_file   : 19
    <fca>   DW_AT_decl_line   : 1890
    <fcc>   DW_AT_decl_column : 28
    <fcd>   DW_AT_type        : <0xfbf>
    <fd1>   DW_AT_external    : 1
    <fd2>   DW_AT_declaration : 1
 <1><fd3>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd4>   DW_AT_type        : <0x8d8>
    <fd8>   DW_AT_sibling     : <0xfde>
 <2><fdc>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fdd>: Abbrev Number: 0
 <1><fde>: Abbrev Number: 3 (DW_TAG_const_type)
    <fdf>   DW_AT_type        : <0xfd3>
 <1><fe3>: Abbrev Number: 10 (DW_TAG_variable)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x104b): ioctlent0
    <fe8>   DW_AT_decl_file   : 19
    <fe9>   DW_AT_decl_line   : 1891
    <feb>   DW_AT_decl_column : 30
    <fec>   DW_AT_type        : <0xfde>
    <ff0>   DW_AT_external    : 1
    <ff1>   DW_AT_declaration : 1
 <1><ff2>: Abbrev Number: 10 (DW_TAG_variable)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xf60): personality_names
    <ff7>   DW_AT_decl_file   : 19
    <ff8>   DW_AT_decl_line   : 1893
    <ffa>   DW_AT_decl_column : 26
    <ffb>   DW_AT_type        : <0x442>
    <fff>   DW_AT_external    : 1
    <1000>   DW_AT_declaration : 1
 <1><1001>: Abbrev Number: 10 (DW_TAG_variable)
    <1002>   DW_AT_name        : (indirect string, offset: 0x863): sysent
    <1006>   DW_AT_decl_file   : 19
    <1007>   DW_AT_decl_line   : 1896
    <1009>   DW_AT_decl_column : 29
    <100a>   DW_AT_type        : <0x9bd>
    <100e>   DW_AT_external    : 1
    <100f>   DW_AT_declaration : 1
 <1><1010>: Abbrev Number: 10 (DW_TAG_variable)
    <1011>   DW_AT_name        : (indirect string, offset: 0xc4d): ioctlent
    <1015>   DW_AT_decl_file   : 19
    <1016>   DW_AT_decl_line   : 1897
    <1018>   DW_AT_decl_column : 31
    <1019>   DW_AT_type        : <0x101f>
    <101d>   DW_AT_external    : 1
    <101e>   DW_AT_declaration : 1
 <1><101f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1020>   DW_AT_byte_size   : 4
    <1021>   DW_AT_type        : <0x8d8>
 <1><1025>: Abbrev Number: 10 (DW_TAG_variable)
    <1026>   DW_AT_name        : (indirect string, offset: 0x84d): nsyscalls
    <102a>   DW_AT_decl_file   : 19
    <102b>   DW_AT_decl_line   : 1903
    <102d>   DW_AT_decl_column : 17
    <102e>   DW_AT_type        : <0x2b>
    <1032>   DW_AT_external    : 1
    <1033>   DW_AT_declaration : 1
 <1><1034>: Abbrev Number: 10 (DW_TAG_variable)
    <1035>   DW_AT_name        : (indirect string, offset: 0xe39): nioctlents
    <1039>   DW_AT_decl_file   : 19
    <103a>   DW_AT_decl_line   : 1904
    <103c>   DW_AT_decl_column : 17
    <103d>   DW_AT_type        : <0x2b>
    <1041>   DW_AT_external    : 1
    <1042>   DW_AT_declaration : 1
 <1><1043>: Abbrev Number: 15 (DW_TAG_array_type)
    <1044>   DW_AT_type        : <0x32>
    <1048>   DW_AT_sibling     : <0x1053>
 <2><104c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <104d>   DW_AT_type        : <0x2b>
    <1051>   DW_AT_upper_bound : 2
 <2><1052>: Abbrev Number: 0
 <1><1053>: Abbrev Number: 3 (DW_TAG_const_type)
    <1054>   DW_AT_type        : <0x1043>
 <1><1058>: Abbrev Number: 10 (DW_TAG_variable)
    <1059>   DW_AT_name        : (indirect string, offset: 0xeae): nsyscall_vec
    <105d>   DW_AT_decl_file   : 19
    <105e>   DW_AT_decl_line   : 1906
    <1060>   DW_AT_decl_column : 27
    <1061>   DW_AT_type        : <0x1053>
    <1065>   DW_AT_external    : 1
    <1066>   DW_AT_declaration : 1
 <1><1067>: Abbrev Number: 15 (DW_TAG_array_type)
    <1068>   DW_AT_type        : <0x9c3>
    <106c>   DW_AT_sibling     : <0x1077>
 <2><1070>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1071>   DW_AT_type        : <0x2b>
    <1075>   DW_AT_upper_bound : 2
 <2><1076>: Abbrev Number: 0
 <1><1077>: Abbrev Number: 3 (DW_TAG_const_type)
    <1078>   DW_AT_type        : <0x1067>
 <1><107c>: Abbrev Number: 10 (DW_TAG_variable)
    <107d>   DW_AT_name        : (indirect string, offset: 0x792): sysent_vec
    <1081>   DW_AT_decl_file   : 19
    <1082>   DW_AT_decl_line   : 1907
    <1084>   DW_AT_decl_column : 35
    <1085>   DW_AT_type        : <0x1077>
    <1089>   DW_AT_external    : 1
    <108a>   DW_AT_declaration : 1
 <1><108b>: Abbrev Number: 10 (DW_TAG_variable)
    <108c>   DW_AT_name        : (indirect string, offset: 0x39a): inject_vec
    <1090>   DW_AT_decl_file   : 19
    <1091>   DW_AT_decl_line   : 1908
    <1093>   DW_AT_decl_column : 28
    <1094>   DW_AT_type        : <0x9c8>
    <1098>   DW_AT_external    : 1
    <1099>   DW_AT_declaration : 1
 <1><109a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <109b>   DW_AT_name        : (indirect string, offset: 0xd3b): audit_arch_t
    <109f>   DW_AT_byte_size   : 8
    <10a0>   DW_AT_decl_file   : 19
    <10a1>   DW_AT_decl_line   : 1910
    <10a3>   DW_AT_decl_column : 8
    <10a4>   DW_AT_sibling     : <0x10c9>
 <2><10a8>: Abbrev Number: 22 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x608): arch
    <10ad>   DW_AT_decl_file   : 19
    <10ae>   DW_AT_decl_line   : 1911
    <10b0>   DW_AT_decl_column : 15
    <10b1>   DW_AT_type        : <0x2b>
    <10b5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b8>: Abbrev Number: 22 (DW_TAG_member)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x9a9): flag
    <10bd>   DW_AT_decl_file   : 19
    <10be>   DW_AT_decl_line   : 1912
    <10c0>   DW_AT_decl_column : 15
    <10c1>   DW_AT_type        : <0x2b>
    <10c5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c8>: Abbrev Number: 0
 <1><10c9>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ca>   DW_AT_type        : <0x109a>
 <1><10ce>: Abbrev Number: 15 (DW_TAG_array_type)
    <10cf>   DW_AT_type        : <0x10c9>
    <10d3>   DW_AT_sibling     : <0x10de>
 <2><10d7>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d8>   DW_AT_type        : <0x2b>
    <10dc>   DW_AT_upper_bound : 2
 <2><10dd>: Abbrev Number: 0
 <1><10de>: Abbrev Number: 3 (DW_TAG_const_type)
    <10df>   DW_AT_type        : <0x10ce>
 <1><10e3>: Abbrev Number: 10 (DW_TAG_variable)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x927): audit_arch_vec
    <10e8>   DW_AT_decl_file   : 19
    <10e9>   DW_AT_decl_line   : 1915
    <10eb>   DW_AT_decl_column : 34
    <10ec>   DW_AT_type        : <0x10de>
    <10f0>   DW_AT_external    : 1
    <10f1>   DW_AT_declaration : 1
 <1><10f2>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f3>   DW_AT_byte_size   : 180
    <10f4>   DW_AT_decl_file   : 21
    <10f5>   DW_AT_decl_line   : 2
    <10f6>   DW_AT_decl_column : 9
    <10f7>   DW_AT_sibling     : <0x13ac>
 <2><10fb>: Abbrev Number: 9 (DW_TAG_member)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x1dd): block_ioctl
    <1100>   DW_AT_decl_file   : 21
    <1101>   DW_AT_decl_line   : 3
    <1102>   DW_AT_decl_column : 8
    <1103>   DW_AT_type        : <0x13c6>
    <1107>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110a>: Abbrev Number: 9 (DW_TAG_member)
    <110b>   DW_AT_name        : (indirect string, offset: 0xa74): btrfs_ioctl
    <110f>   DW_AT_decl_file   : 21
    <1110>   DW_AT_decl_line   : 6
    <1111>   DW_AT_decl_column : 8
    <1112>   DW_AT_type        : <0x13c6>
    <1116>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1119>: Abbrev Number: 9 (DW_TAG_member)
    <111a>   DW_AT_name        : (indirect string, offset: 0x730): evdev_write_ioctl_mpers
    <111e>   DW_AT_decl_file   : 21
    <111f>   DW_AT_decl_line   : 9
    <1120>   DW_AT_decl_column : 8
    <1121>   DW_AT_type        : <0x13c6>
    <1125>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1128>: Abbrev Number: 9 (DW_TAG_member)
    <1129>   DW_AT_name        : (indirect string, offset: 0x706): get_sock_fprog_size
    <112d>   DW_AT_decl_file   : 21
    <112e>   DW_AT_decl_line   : 12
    <112f>   DW_AT_decl_column : 17
    <1130>   DW_AT_type        : <0x13d2>
    <1134>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1137>: Abbrev Number: 9 (DW_TAG_member)
    <1138>   DW_AT_name        : (indirect string, offset: 0x1ac): fetch_bpf_fprog
    <113c>   DW_AT_decl_file   : 21
    <113d>   DW_AT_decl_line   : 15
    <113e>   DW_AT_decl_column : 10
    <113f>   DW_AT_type        : <0x13f2>
    <1143>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1146>: Abbrev Number: 9 (DW_TAG_member)
    <1147>   DW_AT_name        : (indirect string, offset: 0x914): fetch_struct_flock
    <114b>   DW_AT_decl_file   : 21
    <114c>   DW_AT_decl_line   : 18
    <114d>   DW_AT_decl_column : 10
    <114e>   DW_AT_type        : <0x13f2>
