Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1736 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x67c): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc38): mpers-mx32/struct_v4l2_framebuffer.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x1db): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0xef5): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xb2a): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x238): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x1035): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0xd93): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xa47): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x43d): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x850): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xb20): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x900): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x5e1): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0x40b): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0x1019): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0x115d): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xe29): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x9a4): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x752): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x85b): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xb63): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x343): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xd1e): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x0): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x52d): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0x749): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0xe0b): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x51a): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 16
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xa2b): long double
 <1><166>: Abbrev Number: 10 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0xd27): __environ
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 543
    <16e>   DW_AT_decl_column : 15
    <16f>   DW_AT_type        : <0x175>
    <173>   DW_AT_external    : 1
    <174>   DW_AT_declaration : 1
 <1><175>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <176>   DW_AT_byte_size   : 4
    <177>   DW_AT_type        : <0xd9>
 <1><17b>: Abbrev Number: 10 (DW_TAG_variable)
    <17c>   DW_AT_name        : (indirect string, offset: 0x7ea): environ
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 545
    <183>   DW_AT_decl_column : 15
    <184>   DW_AT_type        : <0x175>
    <188>   DW_AT_external    : 1
    <189>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 11 (DW_TAG_variable)
    <18b>   DW_AT_name        : (indirect string, offset: 0xb05): optarg
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 14
    <192>   DW_AT_type        : <0xd9>
    <196>   DW_AT_external    : 1
    <197>   DW_AT_declaration : 1
 <1><198>: Abbrev Number: 11 (DW_TAG_variable)
    <199>   DW_AT_name        : (indirect string, offset: 0x973): optind
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 50
    <19f>   DW_AT_decl_column : 12
    <1a0>   DW_AT_type        : <0x64>
    <1a4>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a6>: Abbrev Number: 11 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xaab): opterr
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 55
    <1ad>   DW_AT_decl_column : 12
    <1ae>   DW_AT_type        : <0x64>
    <1b2>   DW_AT_external    : 1
    <1b3>   DW_AT_declaration : 1
 <1><1b4>: Abbrev Number: 11 (DW_TAG_variable)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xe9): optopt
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 59
    <1bb>   DW_AT_decl_column : 12
    <1bc>   DW_AT_type        : <0x64>
    <1c0>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 4
    <1c4>   DW_AT_type        : <0xe6>
 <1><1c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1c9>   DW_AT_type        : <0x1c2>
 <1><1cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ce>   DW_AT_byte_size   : 4
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1d4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d5>   DW_AT_name        : (indirect string, offset: 0xe62): _IO_FILE
    <1d9>   DW_AT_byte_size   : 152
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 49
    <1dc>   DW_AT_decl_column : 8
    <1dd>   DW_AT_sibling     : <0x395>
 <2><1e1>: Abbrev Number: 9 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x192): _flags
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 51
    <1e8>   DW_AT_decl_column : 7
    <1e9>   DW_AT_type        : <0x64>
    <1ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f0>: Abbrev Number: 9 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x811): _IO_read_ptr
    <1f5>   DW_AT_decl_file   : 7
    <1f6>   DW_AT_decl_line   : 54
    <1f7>   DW_AT_decl_column : 9
    <1f8>   DW_AT_type        : <0xd9>
    <1fc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1ff>: Abbrev Number: 9 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0xbf2): _IO_read_end
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0xd9>
    <20b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><20e>: Abbrev Number: 9 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x586): _IO_read_base
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 56
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0xd9>
    <21a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><21d>: Abbrev Number: 9 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x802): _IO_write_base
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 57
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><22c>: Abbrev Number: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0xf44): _IO_write_ptr
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 58
    <233>   DW_AT_decl_column : 9
    <234>   DW_AT_type        : <0xd9>
    <238>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><23b>: Abbrev Number: 9 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x130): _IO_write_end
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 59
    <242>   DW_AT_decl_column : 9
    <243>   DW_AT_type        : <0xd9>
    <247>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0xdd2): _IO_buf_base
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 60
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0xd9>
    <256>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><259>: Abbrev Number: 9 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0xb4): _IO_buf_end
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 61
    <260>   DW_AT_decl_column : 9
    <261>   DW_AT_type        : <0xd9>
    <265>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><268>: Abbrev Number: 9 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x919): _IO_save_base
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 64
    <26f>   DW_AT_decl_column : 9
    <270>   DW_AT_type        : <0xd9>
    <274>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x45f): _IO_backup_base
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 65
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><286>: Abbrev Number: 9 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x363): _IO_save_end
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 66
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><295>: Abbrev Number: 9 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x1f7): _markers
    <29a>   DW_AT_decl_file   : 7
    <29b>   DW_AT_decl_line   : 68
    <29c>   DW_AT_decl_column : 22
    <29d>   DW_AT_type        : <0x3af>
    <2a1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2a4>: Abbrev Number: 9 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x10c5): _chain
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x3b5>
    <2b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x4c0): _fileno
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 72
    <2ba>   DW_AT_decl_column : 7
    <2bb>   DW_AT_type        : <0x64>
    <2bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x10e2): _flags2
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 73
    <2c9>   DW_AT_decl_column : 7
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d1>: Abbrev Number: 9 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x82a): _old_offset
    <2d6>   DW_AT_decl_file   : 7
    <2d7>   DW_AT_decl_line   : 74
    <2d8>   DW_AT_decl_column : 11
    <2d9>   DW_AT_type        : <0xa2>
    <2dd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e0>: Abbrev Number: 9 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x1112): _cur_column
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 77
    <2e7>   DW_AT_decl_column : 18
    <2e8>   DW_AT_type        : <0x24>
    <2ec>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xa9c): _vtable_offset
    <2f4>   DW_AT_decl_file   : 7
    <2f5>   DW_AT_decl_line   : 78
    <2f6>   DW_AT_decl_column : 15
    <2f7>   DW_AT_type        : <0x3e>
    <2fb>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><2fe>: Abbrev Number: 9 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x62): _shortbuf
    <303>   DW_AT_decl_file   : 7
    <304>   DW_AT_decl_line   : 79
    <305>   DW_AT_decl_column : 8
    <306>   DW_AT_type        : <0x3bb>
    <30a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><30d>: Abbrev Number: 9 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xe05): _lock
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 81
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3cb>
    <319>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><31c>: Abbrev Number: 9 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x485): _offset
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 89
    <323>   DW_AT_decl_column : 13
    <324>   DW_AT_type        : <0xae>
    <328>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xfe4): _codecvt
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 91
    <332>   DW_AT_decl_column : 23
    <333>   DW_AT_type        : <0x3d7>
    <337>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><33a>: Abbrev Number: 9 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0xdef): _wide_data
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 92
    <341>   DW_AT_decl_column : 25
    <342>   DW_AT_type        : <0x3e3>
    <346>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><349>: Abbrev Number: 9 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x16f): _freeres_list
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 93
    <350>   DW_AT_decl_column : 20
    <351>   DW_AT_type        : <0x3b5>
    <355>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0xa07): _freeres_buf
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 94
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0xc6>
    <364>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><367>: Abbrev Number: 9 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0xa70): __pad5
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 95
    <36e>   DW_AT_decl_column : 10
    <36f>   DW_AT_type        : <0x122>
    <373>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><376>: Abbrev Number: 9 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0xaf2): _mode
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 96
    <37d>   DW_AT_decl_column : 7
    <37e>   DW_AT_type        : <0x64>
    <382>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><385>: Abbrev Number: 9 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x114b): _unused2
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 98
    <38c>   DW_AT_decl_column : 8
    <38d>   DW_AT_type        : <0x3e9>
    <391>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0x10d7): FILE
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 7
    <39c>   DW_AT_decl_column : 25
    <39d>   DW_AT_type        : <0x1d4>
 <1><3a1>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x276): _IO_lock_t
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 43
    <3a8>   DW_AT_decl_column : 14
 <1><3a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x7df): _IO_marker
    <3ae>   DW_AT_declaration : 1
 <1><3af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
    <3b1>   DW_AT_type        : <0x3a9>
 <1><3b5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b6>   DW_AT_byte_size   : 4
    <3b7>   DW_AT_type        : <0x1d4>
 <1><3bb>: Abbrev Number: 15 (DW_TAG_array_type)
    <3bc>   DW_AT_type        : <0xdf>
    <3c0>   DW_AT_sibling     : <0x3cb>
 <2><3c4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c5>   DW_AT_type        : <0x2b>
    <3c9>   DW_AT_upper_bound : 0
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x3a1>
 <1><3d1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0xe1d): _IO_codecvt
    <3d6>   DW_AT_declaration : 1
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3d1>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0xd0b): _IO_wide_data
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_array_type)
    <3ea>   DW_AT_type        : <0xdf>
    <3ee>   DW_AT_sibling     : <0x3f9>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f3>   DW_AT_type        : <0x2b>
    <3f7>   DW_AT_upper_bound : 39
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 11 (DW_TAG_variable)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5b7): stdin
    <3fe>   DW_AT_decl_file   : 9
    <3ff>   DW_AT_decl_line   : 137
    <400>   DW_AT_decl_column : 14
    <401>   DW_AT_type        : <0x407>
    <405>   DW_AT_external    : 1
    <406>   DW_AT_declaration : 1
 <1><407>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <408>   DW_AT_byte_size   : 4
    <409>   DW_AT_type        : <0x395>
 <1><40d>: Abbrev Number: 11 (DW_TAG_variable)
    <40e>   DW_AT_name        : (indirect string, offset: 0x34c): stdout
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 138
    <414>   DW_AT_decl_column : 14
    <415>   DW_AT_type        : <0x407>
    <419>   DW_AT_external    : 1
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 11 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0xad): stderr
    <420>   DW_AT_decl_file   : 9
    <421>   DW_AT_decl_line   : 139
    <422>   DW_AT_decl_column : 14
    <423>   DW_AT_type        : <0x407>
    <427>   DW_AT_external    : 1
    <428>   DW_AT_declaration : 1
 <1><429>: Abbrev Number: 11 (DW_TAG_variable)
    <42a>   DW_AT_name        : (indirect string, offset: 0x48d): sys_nerr
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 26
    <430>   DW_AT_decl_column : 12
    <431>   DW_AT_type        : <0x64>
    <435>   DW_AT_external    : 1
    <436>   DW_AT_declaration : 1
 <1><437>: Abbrev Number: 15 (DW_TAG_array_type)
    <438>   DW_AT_type        : <0x1c8>
    <43c>   DW_AT_sibling     : <0x442>
 <2><440>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><441>: Abbrev Number: 0
 <1><442>: Abbrev Number: 3 (DW_TAG_const_type)
    <443>   DW_AT_type        : <0x437>
 <1><447>: Abbrev Number: 11 (DW_TAG_variable)
    <448>   DW_AT_name        : (indirect string, offset: 0x453): sys_errlist
    <44c>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 27
    <44e>   DW_AT_decl_column : 26
    <44f>   DW_AT_type        : <0x442>
    <453>   DW_AT_external    : 1
    <454>   DW_AT_declaration : 1
 <1><455>: Abbrev Number: 11 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0x21b): _sys_nerr
    <45a>   DW_AT_decl_file   : 10
    <45b>   DW_AT_decl_line   : 30
    <45c>   DW_AT_decl_column : 12
    <45d>   DW_AT_type        : <0x64>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 11 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0x1075): _sys_errlist
    <468>   DW_AT_decl_file   : 10
    <469>   DW_AT_decl_line   : 31
    <46a>   DW_AT_decl_column : 26
    <46b>   DW_AT_type        : <0x442>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 11 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0xada): program_invocation_name
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 45
    <478>   DW_AT_decl_column : 14
    <479>   DW_AT_type        : <0xd9>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 11 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0x8f): program_invocation_short_name
    <484>   DW_AT_decl_file   : 11
    <485>   DW_AT_decl_line   : 46
    <486>   DW_AT_decl_column : 14
    <487>   DW_AT_type        : <0xd9>
    <48b>   DW_AT_external    : 1
    <48c>   DW_AT_declaration : 1
 <1><48d>: Abbrev Number: 15 (DW_TAG_array_type)
    <48e>   DW_AT_type        : <0xd9>
    <492>   DW_AT_sibling     : <0x49d>
 <2><496>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <497>   DW_AT_type        : <0x2b>
    <49b>   DW_AT_upper_bound : 1
 <2><49c>: Abbrev Number: 0
 <1><49d>: Abbrev Number: 11 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0xf21): __tzname
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 159
    <4a4>   DW_AT_decl_column : 14
    <4a5>   DW_AT_type        : <0x48d>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 11 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x78f): __daylight
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 160
    <4b2>   DW_AT_decl_column : 12
    <4b3>   DW_AT_type        : <0x64>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 11 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x303): __timezone
    <4be>   DW_AT_decl_file   : 12
    <4bf>   DW_AT_decl_line   : 161
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x11b>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 11 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xe96): tzname
    <4cc>   DW_AT_decl_file   : 12
    <4cd>   DW_AT_decl_line   : 166
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0x48d>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 11 (DW_TAG_variable)
    <4d6>   DW_AT_name        : (indirect string, offset: 0xfed): daylight
    <4da>   DW_AT_decl_file   : 12
    <4db>   DW_AT_decl_line   : 174
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x64>
    <4e1>   DW_AT_external    : 1
    <4e2>   DW_AT_declaration : 1
 <1><4e3>: Abbrev Number: 11 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0xb98): timezone
    <4e8>   DW_AT_decl_file   : 12
    <4e9>   DW_AT_decl_line   : 175
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x11b>
    <4ef>   DW_AT_external    : 1
    <4f0>   DW_AT_declaration : 1
 <1><4f1>: Abbrev Number: 10 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x17d): getdate_err
    <4f6>   DW_AT_decl_file   : 12
    <4f7>   DW_AT_decl_line   : 274
    <4f9>   DW_AT_decl_column : 12
    <4fa>   DW_AT_type        : <0x64>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0x1021): debug_flag
    <505>   DW_AT_decl_file   : 13
    <506>   DW_AT_decl_line   : 20
    <507>   DW_AT_decl_column : 13
    <508>   DW_AT_type        : <0x50e>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 2 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 2	(boolean)
    <511>   DW_AT_name        : (indirect string, offset: 0x594): _Bool
 <1><515>: Abbrev Number: 3 (DW_TAG_const_type)
    <516>   DW_AT_type        : <0x50e>
 <1><51a>: Abbrev Number: 4 (DW_TAG_typedef)
    <51b>   DW_AT_name        : (indirect string, offset: 0xf34): __kernel_long_t
    <51f>   DW_AT_decl_file   : 14
    <520>   DW_AT_decl_line   : 14
    <521>   DW_AT_decl_column : 19
    <522>   DW_AT_type        : <0x88>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0x37): __kernel_ulong_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 15
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x9b>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x95f): kernel_long_t
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 16
    <539>   DW_AT_decl_column : 25
    <53a>   DW_AT_type        : <0x51a>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x557): kernel_ulong_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 17
    <545>   DW_AT_decl_column : 26
    <546>   DW_AT_type        : <0x526>
 <1><54a>: Abbrev Number: 3 (DW_TAG_const_type)
    <54b>   DW_AT_type        : <0x53e>
 <1><54f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <550>   DW_AT_name        : (indirect string, offset: 0xc23): list_item
    <554>   DW_AT_byte_size   : 8
    <555>   DW_AT_decl_file   : 16
    <556>   DW_AT_decl_line   : 92
    <557>   DW_AT_decl_column : 8
    <558>   DW_AT_sibling     : <0x57b>
 <2><55c>: Abbrev Number: 9 (DW_TAG_member)
    <55d>   DW_AT_name        : (indirect string, offset: 0x271): prev
    <561>   DW_AT_decl_file   : 16
    <562>   DW_AT_decl_line   : 93
    <563>   DW_AT_decl_column : 20
    <564>   DW_AT_type        : <0x57b>
    <568>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><56b>: Abbrev Number: 9 (DW_TAG_member)
    <56c>   DW_AT_name        : (indirect string, offset: 0x150): next
    <570>   DW_AT_decl_file   : 16
    <571>   DW_AT_decl_line   : 94
    <572>   DW_AT_decl_column : 20
    <573>   DW_AT_type        : <0x57b>
    <577>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><57a>: Abbrev Number: 0
 <1><57b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <57c>   DW_AT_byte_size   : 4
    <57d>   DW_AT_type        : <0x54f>
 <1><581>: Abbrev Number: 8 (DW_TAG_structure_type)
    <582>   DW_AT_name        : (indirect string, offset: 0x225): sysent
    <586>   DW_AT_byte_size   : 20
    <587>   DW_AT_decl_file   : 17
    <588>   DW_AT_decl_line   : 13
    <589>   DW_AT_decl_column : 16
    <58a>   DW_AT_sibling     : <0x5da>
 <2><58e>: Abbrev Number: 9 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0xbff): nargs
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 14
    <595>   DW_AT_decl_column : 11
    <596>   DW_AT_type        : <0x2b>
    <59a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><59d>: Abbrev Number: 9 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0xc87): sys_flags
    <5a2>   DW_AT_decl_file   : 17
    <5a3>   DW_AT_decl_line   : 15
    <5a4>   DW_AT_decl_column : 6
    <5a5>   DW_AT_type        : <0x64>
    <5a9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5ac>: Abbrev Number: 18 (DW_TAG_member)
    <5ad>   DW_AT_name        : sen
    <5b1>   DW_AT_decl_file   : 17
    <5b2>   DW_AT_decl_line   : 16
    <5b3>   DW_AT_decl_column : 6
    <5b4>   DW_AT_type        : <0x64>
    <5b8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5bb>: Abbrev Number: 9 (DW_TAG_member)
    <5bc>   DW_AT_name        : (indirect string, offset: 0xc9f): sys_func
    <5c0>   DW_AT_decl_file   : 17
    <5c1>   DW_AT_decl_line   : 17
    <5c2>   DW_AT_decl_column : 8
    <5c3>   DW_AT_type        : <0x858>
    <5c7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ca>: Abbrev Number: 9 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x5ec): sys_name
    <5cf>   DW_AT_decl_file   : 17
    <5d0>   DW_AT_decl_line   : 18
    <5d1>   DW_AT_decl_column : 14
    <5d2>   DW_AT_type        : <0x1c2>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5d9>: Abbrev Number: 0
 <1><5da>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5db>   DW_AT_prototyped  : 1
    <5dc>   DW_AT_type        : <0x64>
    <5e0>   DW_AT_sibling     : <0x5ea>
 <2><5e4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5e5>   DW_AT_type        : <0x5ea>
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5eb>   DW_AT_byte_size   : 4
    <5ec>   DW_AT_type        : <0x5f5>
 <1><5f0>: Abbrev Number: 3 (DW_TAG_const_type)
    <5f1>   DW_AT_type        : <0x5ea>
 <1><5f5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <5f6>   DW_AT_name        : tcb
    <5fa>   DW_AT_byte_size   : 304
    <5fc>   DW_AT_decl_file   : 18
    <5fd>   DW_AT_decl_line   : 262
    <5ff>   DW_AT_decl_column : 8
    <600>   DW_AT_sibling     : <0x858>
 <2><604>: Abbrev Number: 22 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0xfd): flags
    <609>   DW_AT_decl_file   : 18
    <60a>   DW_AT_decl_line   : 263
    <60c>   DW_AT_decl_column : 6
    <60d>   DW_AT_type        : <0x64>
    <611>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><614>: Abbrev Number: 23 (DW_TAG_member)
    <615>   DW_AT_name        : pid
    <619>   DW_AT_decl_file   : 18
    <61a>   DW_AT_decl_line   : 264
    <61c>   DW_AT_decl_column : 6
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><624>: Abbrev Number: 22 (DW_TAG_member)
    <625>   DW_AT_name        : (indirect string, offset: 0x3d2): qual_flg
    <629>   DW_AT_decl_file   : 18
    <62a>   DW_AT_decl_line   : 265
    <62c>   DW_AT_decl_column : 6
    <62d>   DW_AT_type        : <0x64>
    <631>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><634>: Abbrev Number: 22 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x402): currpers
    <639>   DW_AT_decl_file   : 18
    <63a>   DW_AT_decl_line   : 267
    <63c>   DW_AT_decl_column : 15
    <63d>   DW_AT_type        : <0x2b>
    <641>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><644>: Abbrev Number: 22 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x7c3): u_error
    <649>   DW_AT_decl_file   : 18
    <64a>   DW_AT_decl_line   : 269
    <64c>   DW_AT_decl_column : 16
    <64d>   DW_AT_type        : <0x37>
    <651>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><654>: Abbrev Number: 22 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0x72e): scno
    <659>   DW_AT_decl_file   : 18
    <65a>   DW_AT_decl_line   : 270
    <65c>   DW_AT_decl_column : 17
    <65d>   DW_AT_type        : <0x53e>
    <661>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><664>: Abbrev Number: 22 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x32c): true_scno
    <669>   DW_AT_decl_file   : 18
    <66a>   DW_AT_decl_line   : 271
    <66c>   DW_AT_decl_column : 17
    <66d>   DW_AT_type        : <0x53e>
    <671>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><674>: Abbrev Number: 22 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x1082): u_arg
    <679>   DW_AT_decl_file   : 18
    <67a>   DW_AT_decl_line   : 272
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x988>
    <681>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><684>: Abbrev Number: 22 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x3db): u_rval
    <689>   DW_AT_decl_file   : 18
    <68a>   DW_AT_decl_line   : 273
    <68c>   DW_AT_decl_column : 16
    <68d>   DW_AT_type        : <0x532>
    <691>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><694>: Abbrev Number: 22 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0x245): sys_func_rval
    <699>   DW_AT_decl_file   : 18
    <69a>   DW_AT_decl_line   : 274
    <69c>   DW_AT_decl_column : 6
    <69d>   DW_AT_type        : <0x64>
    <6a1>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6a4>: Abbrev Number: 22 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0x168): curcol
    <6a9>   DW_AT_decl_file   : 18
    <6aa>   DW_AT_decl_line   : 275
    <6ac>   DW_AT_decl_column : 6
    <6ad>   DW_AT_type        : <0x64>
    <6b1>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6b4>: Abbrev Number: 22 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0xd31): outf
    <6b9>   DW_AT_decl_file   : 18
    <6ba>   DW_AT_decl_line   : 276
    <6bc>   DW_AT_decl_column : 8
    <6bd>   DW_AT_type        : <0x407>
    <6c1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6c4>: Abbrev Number: 22 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x757): staged_output_data
    <6c9>   DW_AT_decl_file   : 18
    <6ca>   DW_AT_decl_line   : 277
    <6cc>   DW_AT_decl_column : 29
    <6cd>   DW_AT_type        : <0x99e>
    <6d1>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6d4>: Abbrev Number: 22 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0xd3): auxstr
    <6d9>   DW_AT_decl_file   : 18
    <6da>   DW_AT_decl_line   : 279
    <6dc>   DW_AT_decl_column : 14
    <6dd>   DW_AT_type        : <0x1c2>
    <6e1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6e4>: Abbrev Number: 22 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0xfae): _priv_data
    <6e9>   DW_AT_decl_file   : 18
    <6ea>   DW_AT_decl_line   : 280
    <6ec>   DW_AT_decl_column : 8
    <6ed>   DW_AT_type        : <0xc6>
    <6f1>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><6f4>: Abbrev Number: 22 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0xb3d): _free_priv_data
    <6f9>   DW_AT_decl_file   : 18
    <6fa>   DW_AT_decl_line   : 281
    <6fc>   DW_AT_decl_column : 9
    <6fd>   DW_AT_type        : <0x9b0>
    <701>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><704>: Abbrev Number: 22 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x10dc): s_ent
    <709>   DW_AT_decl_file   : 18
    <70a>   DW_AT_decl_line   : 282
    <70c>   DW_AT_decl_column : 23
    <70d>   DW_AT_type        : <0x9b6>
    <711>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><714>: Abbrev Number: 22 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x4da): s_prev_ent
    <719>   DW_AT_decl_file   : 18
    <71a>   DW_AT_decl_line   : 285
    <71c>   DW_AT_decl_column : 23
    <71d>   DW_AT_type        : <0x9b6>
    <721>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><725>: Abbrev Number: 22 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x636): inject_vec
    <72a>   DW_AT_decl_file   : 18
    <72b>   DW_AT_decl_line   : 286
    <72d>   DW_AT_decl_column : 22
    <72e>   DW_AT_type        : <0x9c1>
    <732>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><736>: Abbrev Number: 22 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0xa90): stime
    <73b>   DW_AT_decl_file   : 18
    <73c>   DW_AT_decl_line   : 287
    <73e>   DW_AT_decl_column : 18
    <73f>   DW_AT_type        : <0x133>
    <743>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><747>: Abbrev Number: 22 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x253): ltime
    <74c>   DW_AT_decl_file   : 18
    <74d>   DW_AT_decl_line   : 288
    <74f>   DW_AT_decl_column : 18
    <750>   DW_AT_type        : <0x133>
    <754>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><758>: Abbrev Number: 22 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0x10ea): atime
    <75d>   DW_AT_decl_file   : 18
    <75e>   DW_AT_decl_line   : 289
    <760>   DW_AT_decl_column : 18
    <761>   DW_AT_type        : <0x133>
    <765>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><769>: Abbrev Number: 22 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0xa41): etime
    <76e>   DW_AT_decl_file   : 18
    <76f>   DW_AT_decl_line   : 290
    <771>   DW_AT_decl_column : 18
    <772>   DW_AT_type        : <0x133>
    <776>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><77a>: Abbrev Number: 22 (DW_TAG_member)
    <77b>   DW_AT_name        : (indirect string, offset: 0xe32): delay_expiration_time
    <77f>   DW_AT_decl_file   : 18
    <780>   DW_AT_decl_line   : 291
    <782>   DW_AT_decl_column : 18
    <783>   DW_AT_type        : <0x133>
    <787>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><78b>: Abbrev Number: 22 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x7ab): pid_ns
    <790>   DW_AT_decl_file   : 18
    <791>   DW_AT_decl_line   : 298
    <793>   DW_AT_decl_column : 15
    <794>   DW_AT_type        : <0x2b>
    <798>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><79c>: Abbrev Number: 22 (DW_TAG_member)
    <79d>   DW_AT_name        : (indirect string, offset: 0xd43): last_dirfd
    <7a1>   DW_AT_decl_file   : 18
    <7a2>   DW_AT_decl_line   : 301
    <7a4>   DW_AT_decl_column : 6
    <7a5>   DW_AT_type        : <0x64>
    <7a9>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7ad>: Abbrev Number: 22 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0x3c1): mmap_cache
    <7b2>   DW_AT_decl_file   : 18
    <7b3>   DW_AT_decl_line   : 304
    <7b5>   DW_AT_decl_column : 23
    <7b6>   DW_AT_type        : <0x9dd>
    <7ba>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7be>: Abbrev Number: 22 (DW_TAG_member)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xb80): wait_data_idx
    <7c3>   DW_AT_decl_file   : 18
    <7c4>   DW_AT_decl_line   : 311
    <7c6>   DW_AT_decl_column : 9
    <7c7>   DW_AT_type        : <0x122>
    <7cb>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7cf>: Abbrev Number: 22 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x199): delayed_wait_data
    <7d4>   DW_AT_decl_file   : 18
    <7d5>   DW_AT_decl_line   : 313
    <7d7>   DW_AT_decl_column : 24
    <7d8>   DW_AT_type        : <0x9e9>
    <7dc>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7e0>: Abbrev Number: 22 (DW_TAG_member)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xc7d): wait_list
    <7e5>   DW_AT_decl_file   : 18
    <7e6>   DW_AT_decl_line   : 314
    <7e8>   DW_AT_decl_column : 19
    <7e9>   DW_AT_type        : <0x54f>
    <7ed>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><7f1>: Abbrev Number: 22 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x496): vcpu_info_list
    <7f6>   DW_AT_decl_file   : 18
    <7f7>   DW_AT_decl_line   : 318
    <7f9>   DW_AT_decl_column : 20
    <7fa>   DW_AT_type        : <0x9f5>
    <7fe>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><802>: Abbrev Number: 22 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0xfc4): unwind_ctx
    <807>   DW_AT_decl_file   : 18
    <808>   DW_AT_decl_line   : 322
    <80a>   DW_AT_decl_column : 8
    <80b>   DW_AT_type        : <0xc6>
    <80f>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><813>: Abbrev Number: 22 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0xcf3): unwind_queue
    <818>   DW_AT_decl_file   : 18
    <819>   DW_AT_decl_line   : 323
    <81b>   DW_AT_decl_column : 25
    <81c>   DW_AT_type        : <0xa01>
    <820>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><824>: Abbrev Number: 22 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x10f0): comm
    <829>   DW_AT_decl_file   : 18
    <82a>   DW_AT_decl_line   : 327
    <82c>   DW_AT_decl_column : 7
    <82d>   DW_AT_type        : <0xa07>
    <831>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><835>: Abbrev Number: 22 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0xb8e): start_prc
    <83a>   DW_AT_decl_file   : 18
    <83b>   DW_AT_decl_line   : 329
    <83d>   DW_AT_decl_column : 16
    <83e>   DW_AT_type        : <0x37>
    <842>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><846>: Abbrev Number: 22 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0x189): pre_comm
    <84b>   DW_AT_decl_file   : 18
    <84c>   DW_AT_decl_line   : 330
    <84e>   DW_AT_decl_column : 7
    <84f>   DW_AT_type        : <0xa07>
    <853>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><857>: Abbrev Number: 0
 <1><858>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <859>   DW_AT_byte_size   : 4
    <85a>   DW_AT_type        : <0x5da>
 <1><85e>: Abbrev Number: 4 (DW_TAG_typedef)
    <85f>   DW_AT_name        : (indirect string, offset: 0x86f): struct_sysent
    <863>   DW_AT_decl_file   : 17
    <864>   DW_AT_decl_line   : 19
    <865>   DW_AT_decl_column : 3
    <866>   DW_AT_type        : <0x581>
 <1><86a>: Abbrev Number: 3 (DW_TAG_const_type)
    <86b>   DW_AT_type        : <0x85e>
 <1><86f>: Abbrev Number: 11 (DW_TAG_variable)
    <870>   DW_AT_name        : (indirect string, offset: 0xe82): current_personality
    <874>   DW_AT_decl_file   : 18
    <875>   DW_AT_decl_line   : 158
    <876>   DW_AT_decl_column : 17
    <877>   DW_AT_type        : <0x2b>
    <87b>   DW_AT_external    : 1
    <87c>   DW_AT_declaration : 1
 <1><87d>: Abbrev Number: 11 (DW_TAG_variable)
    <87e>   DW_AT_name        : (indirect string, offset: 0x984): current_wordsize
    <882>   DW_AT_decl_file   : 18
    <883>   DW_AT_decl_line   : 171
    <884>   DW_AT_decl_column : 17
    <885>   DW_AT_type        : <0x2b>
    <889>   DW_AT_external    : 1
    <88a>   DW_AT_declaration : 1
 <1><88b>: Abbrev Number: 11 (DW_TAG_variable)
    <88c>   DW_AT_name        : (indirect string, offset: 0x4a5): current_klongsize
    <890>   DW_AT_decl_file   : 18
    <891>   DW_AT_decl_line   : 176
    <892>   DW_AT_decl_column : 17
    <893>   DW_AT_type        : <0x2b>
    <897>   DW_AT_external    : 1
    <898>   DW_AT_declaration : 1
 <1><899>: Abbrev Number: 8 (DW_TAG_structure_type)
    <89a>   DW_AT_name        : (indirect string, offset: 0xc5d): ioctlent
    <89e>   DW_AT_byte_size   : 8
    <89f>   DW_AT_decl_file   : 18
    <8a0>   DW_AT_decl_line   : 217
    <8a1>   DW_AT_decl_column : 16
    <8a2>   DW_AT_sibling     : <0x8c5>
 <2><8a6>: Abbrev Number: 9 (DW_TAG_member)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x1ab): symbol
    <8ab>   DW_AT_decl_file   : 18
    <8ac>   DW_AT_decl_line   : 218
    <8ad>   DW_AT_decl_column : 14
    <8ae>   DW_AT_type        : <0x1c2>
    <8b2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b5>: Abbrev Number: 9 (DW_TAG_member)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x631): code
    <8ba>   DW_AT_decl_file   : 18
    <8bb>   DW_AT_decl_line   : 219
    <8bc>   DW_AT_decl_column : 15
    <8bd>   DW_AT_type        : <0x2b>
    <8c1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8c4>: Abbrev Number: 0
 <1><8c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x7f2): struct_ioctlent
    <8ca>   DW_AT_decl_file   : 18
    <8cb>   DW_AT_decl_line   : 220
    <8cc>   DW_AT_decl_column : 3
    <8cd>   DW_AT_type        : <0x899>
 <1><8d1>: Abbrev Number: 3 (DW_TAG_const_type)
    <8d2>   DW_AT_type        : <0x8c5>
 <1><8d6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x113f): inject_data
    <8db>   DW_AT_byte_size   : 10
    <8dc>   DW_AT_decl_file   : 18
    <8dd>   DW_AT_decl_line   : 241
    <8de>   DW_AT_decl_column : 8
    <8df>   DW_AT_sibling     : <0x93e>
 <2><8e3>: Abbrev Number: 9 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0xfd): flags
    <8e8>   DW_AT_decl_file   : 18
    <8e9>   DW_AT_decl_line   : 242
    <8ea>   DW_AT_decl_column : 10
    <8eb>   DW_AT_type        : <0xeb>
    <8ef>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f2>: Abbrev Number: 9 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x96d): signo
    <8f7>   DW_AT_decl_file   : 18
    <8f8>   DW_AT_decl_line   : 243
    <8f9>   DW_AT_decl_column : 10
    <8fa>   DW_AT_type        : <0xeb>
    <8fe>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><901>: Abbrev Number: 9 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x102c): rval_idx
    <906>   DW_AT_decl_file   : 18
    <907>   DW_AT_decl_line   : 244
    <908>   DW_AT_decl_column : 11
    <909>   DW_AT_type        : <0xf7>
    <90d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><910>: Abbrev Number: 9 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0x47b): delay_idx
    <915>   DW_AT_decl_file   : 18
    <916>   DW_AT_decl_line   : 245
    <917>   DW_AT_decl_column : 11
    <918>   DW_AT_type        : <0xf7>
    <91c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><91f>: Abbrev Number: 9 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0xdc9): poke_idx
    <924>   DW_AT_decl_file   : 18
    <925>   DW_AT_decl_line   : 246
    <926>   DW_AT_decl_column : 11
    <927>   DW_AT_type        : <0xf7>
    <92b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><92e>: Abbrev Number: 9 (DW_TAG_member)
    <92f>   DW_AT_name        : (indirect string, offset: 0x72e): scno
    <933>   DW_AT_decl_file   : 18
    <934>   DW_AT_decl_line   : 247
    <935>   DW_AT_decl_column : 11
    <936>   DW_AT_type        : <0xf7>
    <93a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><93d>: Abbrev Number: 0
 <1><93e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <93f>   DW_AT_name        : (indirect string, offset: 0x4e5): inject_opts
    <943>   DW_AT_byte_size   : 16
    <944>   DW_AT_decl_file   : 18
    <945>   DW_AT_decl_line   : 250
    <946>   DW_AT_decl_column : 8
    <947>   DW_AT_sibling     : <0x988>
 <2><94b>: Abbrev Number: 9 (DW_TAG_member)
    <94c>   DW_AT_name        : (indirect string, offset: 0xf9f): first
    <950>   DW_AT_decl_file   : 18
    <951>   DW_AT_decl_line   : 251
    <952>   DW_AT_decl_column : 11
    <953>   DW_AT_type        : <0xf7>
    <957>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><95a>: Abbrev Number: 9 (DW_TAG_member)
    <95b>   DW_AT_name        : (indirect string, offset: 0x32): last
    <95f>   DW_AT_decl_file   : 18
    <960>   DW_AT_decl_line   : 252
    <961>   DW_AT_decl_column : 11
    <962>   DW_AT_type        : <0xf7>
    <966>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><969>: Abbrev Number: 9 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0x9fd): step
    <96e>   DW_AT_decl_file   : 18
    <96f>   DW_AT_decl_line   : 253
    <970>   DW_AT_decl_column : 11
    <971>   DW_AT_type        : <0xf7>
    <975>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><978>: Abbrev Number: 9 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0x836): data
    <97d>   DW_AT_decl_file   : 18
    <97e>   DW_AT_decl_line   : 254
    <97f>   DW_AT_decl_column : 21
    <980>   DW_AT_type        : <0x8d6>
    <984>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><987>: Abbrev Number: 0
 <1><988>: Abbrev Number: 15 (DW_TAG_array_type)
    <989>   DW_AT_type        : <0x53e>
    <98d>   DW_AT_sibling     : <0x998>
 <2><991>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <992>   DW_AT_type        : <0x2b>
    <996>   DW_AT_upper_bound : 5
 <2><997>: Abbrev Number: 0
 <1><998>: Abbrev Number: 14 (DW_TAG_structure_type)
    <999>   DW_AT_name        : (indirect string, offset: 0x757): staged_output_data
    <99d>   DW_AT_declaration : 1
 <1><99e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <99f>   DW_AT_byte_size   : 4
    <9a0>   DW_AT_type        : <0x998>
 <1><9a4>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a5>   DW_AT_prototyped  : 1
    <9a6>   DW_AT_sibling     : <0x9b0>
 <2><9aa>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ab>   DW_AT_type        : <0xc6>
 <2><9af>: Abbrev Number: 0
 <1><9b0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b1>   DW_AT_byte_size   : 4
    <9b2>   DW_AT_type        : <0x9a4>
 <1><9b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b7>   DW_AT_byte_size   : 4
    <9b8>   DW_AT_type        : <0x86a>
 <1><9bc>: Abbrev Number: 3 (DW_TAG_const_type)
    <9bd>   DW_AT_type        : <0x9b6>
 <1><9c1>: Abbrev Number: 15 (DW_TAG_array_type)
    <9c2>   DW_AT_type        : <0x9d1>
    <9c6>   DW_AT_sibling     : <0x9d1>
 <2><9ca>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9cb>   DW_AT_type        : <0x2b>
    <9cf>   DW_AT_upper_bound : 2
 <2><9d0>: Abbrev Number: 0
 <1><9d1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d2>   DW_AT_byte_size   : 4
    <9d3>   DW_AT_type        : <0x93e>
 <1><9d7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d8>   DW_AT_name        : (indirect string, offset: 0xf0): mmap_cache_t
    <9dc>   DW_AT_declaration : 1
 <1><9dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9de>   DW_AT_byte_size   : 4
    <9df>   DW_AT_type        : <0x9d7>
 <1><9e3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e4>   DW_AT_name        : (indirect string, offset: 0xf52): tcb_wait_data
    <9e8>   DW_AT_declaration : 1
 <1><9e9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ea>   DW_AT_byte_size   : 4
    <9eb>   DW_AT_type        : <0x9e3>
 <1><9ef>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x71): vcpu_info
    <9f4>   DW_AT_declaration : 1
 <1><9f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f6>   DW_AT_byte_size   : 4
    <9f7>   DW_AT_type        : <0x9ef>
 <1><9fb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fc>   DW_AT_name        : (indirect string, offset: 0xda): unwind_queue_t
    <a00>   DW_AT_declaration : 1
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9fb>
 <1><a07>: Abbrev Number: 15 (DW_TAG_array_type)
    <a08>   DW_AT_type        : <0xdf>
    <a0c>   DW_AT_sibling     : <0xa17>
 <2><a10>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a11>   DW_AT_type        : <0x2b>
    <a15>   DW_AT_upper_bound : 15
 <2><a16>: Abbrev Number: 0
 <1><a17>: Abbrev Number: 10 (DW_TAG_variable)
    <a18>   DW_AT_name        : (indirect string, offset: 0xc05): stub_sysent
    <a1c>   DW_AT_decl_file   : 18
    <a1d>   DW_AT_decl_line   : 405
    <a1f>   DW_AT_decl_column : 28
    <a20>   DW_AT_type        : <0x86a>
    <a24>   DW_AT_external    : 1
    <a25>   DW_AT_declaration : 1
 <1><a26>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a27>   DW_AT_name        : (indirect string, offset: 0x3e2): xlat_type
    <a2b>   DW_AT_encoding    : 7	(unsigned)
    <a2c>   DW_AT_byte_size   : 4
    <a2d>   DW_AT_type        : <0x2b>
    <a31>   DW_AT_decl_file   : 19
    <a32>   DW_AT_decl_line   : 13
    <a33>   DW_AT_decl_column : 6
    <a34>   DW_AT_sibling     : <0xa4b>
 <2><a38>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a39>   DW_AT_name        : (indirect string, offset: 0xb76): XT_NORMAL
    <a3d>   DW_AT_const_value : 0
 <2><a3e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3f>   DW_AT_name        : (indirect string, offset: 0xd9d): XT_SORTED
    <a43>   DW_AT_const_value : 1
 <2><a44>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a45>   DW_AT_name        : (indirect string, offset: 0x448): XT_INDEXED
    <a49>   DW_AT_const_value : 2
 <2><a4a>: Abbrev Number: 0
 <1><a4b>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x103): xlat_style
    <a50>   DW_AT_encoding    : 7	(unsigned)
    <a51>   DW_AT_byte_size   : 4
    <a52>   DW_AT_type        : <0x2b>
    <a56>   DW_AT_decl_file   : 19
    <a57>   DW_AT_decl_line   : 19
    <a58>   DW_AT_decl_column : 6
    <a59>   DW_AT_sibling     : <0xa88>
 <2><a5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xeb4): XLAT_STYLE_DEFAULT
    <a62>   DW_AT_const_value : 0
 <2><a63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0xe53): XLAT_STYLE_RAW
    <a68>   DW_AT_const_value : 1
 <2><a69>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x77d): XLAT_STYLE_ABBREV
    <a6e>   DW_AT_const_value : 2
 <2><a6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0xda7): XLAT_STYLE_VERBOSE
    <a74>   DW_AT_const_value : 3
 <2><a75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x7b2): XLAT_STYLE_FMT_X
    <a7a>   DW_AT_const_value : 0
 <2><a7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x79a): XLAT_STYLE_FMT_U
    <a80>   DW_AT_const_value : 4
 <2><a81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x733): XLAT_STYLE_FMT_D
    <a86>   DW_AT_const_value : 8
 <2><a87>: Abbrev Number: 0
 <1><a88>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a89>   DW_AT_name        : (indirect string, offset: 0xd63): xlat_data
    <a8d>   DW_AT_byte_size   : 16
    <a8e>   DW_AT_decl_file   : 19
    <a8f>   DW_AT_decl_line   : 51
    <a90>   DW_AT_decl_column : 8
    <a91>   DW_AT_sibling     : <0xab4>
 <2><a95>: Abbrev Number: 18 (DW_TAG_member)
    <a96>   DW_AT_name        : val
    <a9a>   DW_AT_decl_file   : 19
    <a9b>   DW_AT_decl_line   : 52
    <a9c>   DW_AT_decl_column : 11
    <a9d>   DW_AT_type        : <0x10f>
    <aa1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aa4>: Abbrev Number: 18 (DW_TAG_member)
    <aa5>   DW_AT_name        : str
    <aa9>   DW_AT_decl_file   : 19
    <aaa>   DW_AT_decl_line   : 53
    <aab>   DW_AT_decl_column : 14
    <aac>   DW_AT_type        : <0x1c2>
    <ab0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ab3>: Abbrev Number: 0
 <1><ab4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab5>   DW_AT_type        : <0xa88>
 <1><ab9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aba>   DW_AT_name        : (indirect string, offset: 0x2d): xlat
    <abe>   DW_AT_byte_size   : 24
    <abf>   DW_AT_decl_file   : 19
    <ac0>   DW_AT_decl_line   : 56
    <ac1>   DW_AT_decl_column : 8
    <ac2>   DW_AT_sibling     : <0xb12>
 <2><ac6>: Abbrev Number: 9 (DW_TAG_member)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x836): data
    <acb>   DW_AT_decl_file   : 19
    <acc>   DW_AT_decl_line   : 57
    <acd>   DW_AT_decl_column : 26
    <ace>   DW_AT_type        : <0xb17>
    <ad2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad5>: Abbrev Number: 9 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x57a): flags_strsz
    <ada>   DW_AT_decl_file   : 19
    <adb>   DW_AT_decl_line   : 58
    <adc>   DW_AT_decl_column : 9
    <add>   DW_AT_type        : <0x122>
    <ae1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ae4>: Abbrev Number: 9 (DW_TAG_member)
    <ae5>   DW_AT_name        : (indirect string, offset: 0xa02): size
    <ae9>   DW_AT_decl_file   : 19
    <aea>   DW_AT_decl_line   : 59
    <aeb>   DW_AT_decl_column : 11
    <aec>   DW_AT_type        : <0x103>
    <af0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af3>: Abbrev Number: 9 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0xeea): type
    <af8>   DW_AT_decl_file   : 19
    <af9>   DW_AT_decl_line   : 60
    <afa>   DW_AT_decl_column : 17
    <afb>   DW_AT_type        : <0xa26>
    <aff>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b02>: Abbrev Number: 9 (DW_TAG_member)
    <b03>   DW_AT_name        : (indirect string, offset: 0xbd8): flags_mask
    <b07>   DW_AT_decl_file   : 19
    <b08>   DW_AT_decl_line   : 61
    <b09>   DW_AT_decl_column : 11
    <b0a>   DW_AT_type        : <0x10f>
    <b0e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b11>: Abbrev Number: 0
 <1><b12>: Abbrev Number: 3 (DW_TAG_const_type)
    <b13>   DW_AT_type        : <0xab9>
 <1><b17>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b18>   DW_AT_byte_size   : 4
    <b19>   DW_AT_type        : <0xab4>
 <1><b1d>: Abbrev Number: 15 (DW_TAG_array_type)
    <b1e>   DW_AT_type        : <0xb12>
    <b22>   DW_AT_sibling     : <0xb28>
 <2><b26>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b27>: Abbrev Number: 0
 <1><b28>: Abbrev Number: 3 (DW_TAG_const_type)
    <b29>   DW_AT_type        : <0xb1d>
 <1><b2d>: Abbrev Number: 10 (DW_TAG_variable)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xe74): addrfams
    <b32>   DW_AT_decl_file   : 18
    <b33>   DW_AT_decl_line   : 411
    <b35>   DW_AT_decl_column : 26
    <b36>   DW_AT_type        : <0xb28>
    <b3a>   DW_AT_external    : 1
    <b3b>   DW_AT_declaration : 1
 <1><b3c>: Abbrev Number: 10 (DW_TAG_variable)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x155): arp_hardware_types
    <b41>   DW_AT_decl_file   : 18
    <b42>   DW_AT_decl_line   : 412
    <b44>   DW_AT_decl_column : 26
    <b45>   DW_AT_type        : <0xb28>
    <b49>   DW_AT_external    : 1
    <b4a>   DW_AT_declaration : 1
 <1><b4b>: Abbrev Number: 10 (DW_TAG_variable)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x1154): at_flags
    <b50>   DW_AT_decl_file   : 18
    <b51>   DW_AT_decl_line   : 413
    <b53>   DW_AT_decl_column : 26
    <b54>   DW_AT_type        : <0xb28>
    <b58>   DW_AT_external    : 1
    <b59>   DW_AT_declaration : 1
 <1><b5a>: Abbrev Number: 10 (DW_TAG_variable)
    <b5b>   DW_AT_name        : (indirect string, offset: 0xc2d): clocknames
    <b5f>   DW_AT_decl_file   : 18
    <b60>   DW_AT_decl_line   : 414
    <b62>   DW_AT_decl_column : 26
    <b63>   DW_AT_type        : <0xb28>
    <b67>   DW_AT_external    : 1
    <b68>   DW_AT_declaration : 1
 <1><b69>: Abbrev Number: 10 (DW_TAG_variable)
    <b6a>   DW_AT_name        : (indirect string, offset: 0xd36): dirent_types
    <b6e>   DW_AT_decl_file   : 18
    <b6f>   DW_AT_decl_line   : 415
    <b71>   DW_AT_decl_column : 26
    <b72>   DW_AT_type        : <0xb28>
    <b76>   DW_AT_external    : 1
    <b77>   DW_AT_declaration : 1
 <1><b78>: Abbrev Number: 10 (DW_TAG_variable)
    <b79>   DW_AT_name        : (indirect string, offset: 0x76a): ethernet_protocols
    <b7d>   DW_AT_decl_file   : 18
    <b7e>   DW_AT_decl_line   : 416
    <b80>   DW_AT_decl_column : 26
    <b81>   DW_AT_type        : <0xb28>
    <b85>   DW_AT_external    : 1
    <b86>   DW_AT_declaration : 1
 <1><b87>: Abbrev Number: 10 (DW_TAG_variable)
    <b88>   DW_AT_name        : (indirect string, offset: 0x59a): inet_protocols
    <b8c>   DW_AT_decl_file   : 18
    <b8d>   DW_AT_decl_line   : 417
    <b8f>   DW_AT_decl_column : 26
    <b90>   DW_AT_type        : <0xb28>
    <b94>   DW_AT_external    : 1
    <b95>   DW_AT_declaration : 1
 <1><b96>: Abbrev Number: 10 (DW_TAG_variable)
    <b97>   DW_AT_name        : (indirect string, offset: 0xa37): evdev_abs
    <b9b>   DW_AT_decl_file   : 18
    <b9c>   DW_AT_decl_line   : 418
    <b9e>   DW_AT_decl_column : 26
    <b9f>   DW_AT_type        : <0xb28>
    <ba3>   DW_AT_external    : 1
    <ba4>   DW_AT_declaration : 1
 <1><ba5>: Abbrev Number: 10 (DW_TAG_variable)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x9d5): audit_arch
    <baa>   DW_AT_decl_file   : 18
    <bab>   DW_AT_decl_line   : 419
    <bad>   DW_AT_decl_column : 26
    <bae>   DW_AT_type        : <0xb28>
    <bb2>   DW_AT_external    : 1
    <bb3>   DW_AT_declaration : 1
 <1><bb4>: Abbrev Number: 10 (DW_TAG_variable)
    <bb5>   DW_AT_name        : (indirect string, offset: 0xe6b): evdev_ev
    <bb9>   DW_AT_decl_file   : 18
    <bba>   DW_AT_decl_line   : 420
    <bbc>   DW_AT_decl_column : 26
    <bbd>   DW_AT_type        : <0xb28>
    <bc1>   DW_AT_external    : 1
    <bc2>   DW_AT_declaration : 1
 <1><bc3>: Abbrev Number: 10 (DW_TAG_variable)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x5bd): iffflags
    <bc8>   DW_AT_decl_file   : 18
    <bc9>   DW_AT_decl_line   : 421
    <bcb>   DW_AT_decl_column : 26
    <bcc>   DW_AT_type        : <0xb28>
    <bd0>   DW_AT_external    : 1
    <bd1>   DW_AT_declaration : 1
 <1><bd2>: Abbrev Number: 10 (DW_TAG_variable)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x8a4): ip_type_of_services
    <bd7>   DW_AT_decl_file   : 18
    <bd8>   DW_AT_decl_line   : 422
    <bda>   DW_AT_decl_column : 26
    <bdb>   DW_AT_type        : <0xb28>
    <bdf>   DW_AT_external    : 1
    <be0>   DW_AT_declaration : 1
 <1><be1>: Abbrev Number: 10 (DW_TAG_variable)
    <be2>   DW_AT_name        : (indirect string, offset: 0x431): ipc_private
    <be6>   DW_AT_decl_file   : 18
    <be7>   DW_AT_decl_line   : 423
    <be9>   DW_AT_decl_column : 26
    <bea>   DW_AT_type        : <0xb28>
    <bee>   DW_AT_external    : 1
    <bef>   DW_AT_declaration : 1
 <1><bf0>: Abbrev Number: 10 (DW_TAG_variable)
    <bf1>   DW_AT_name        : (indirect string, offset: 0xabf): msg_flags
    <bf5>   DW_AT_decl_file   : 18
    <bf6>   DW_AT_decl_line   : 424
    <bf8>   DW_AT_decl_column : 26
    <bf9>   DW_AT_type        : <0xb28>
    <bfd>   DW_AT_external    : 1
    <bfe>   DW_AT_declaration : 1
 <1><bff>: Abbrev Number: 10 (DW_TAG_variable)
    <c00>   DW_AT_name        : (indirect string, offset: 0x281): netlink_protocols
    <c04>   DW_AT_decl_file   : 18
    <c05>   DW_AT_decl_line   : 425
    <c07>   DW_AT_decl_column : 26
    <c08>   DW_AT_type        : <0xb28>
    <c0c>   DW_AT_external    : 1
    <c0d>   DW_AT_declaration : 1
 <1><c0e>: Abbrev Number: 10 (DW_TAG_variable)
    <c0f>   DW_AT_name        : (indirect string, offset: 0xcde): nl_bridge_vlan_flags
    <c13>   DW_AT_decl_file   : 18
    <c14>   DW_AT_decl_line   : 426
    <c16>   DW_AT_decl_column : 26
    <c17>   DW_AT_type        : <0xb28>
    <c1b>   DW_AT_external    : 1
    <c1c>   DW_AT_declaration : 1
 <1><c1d>: Abbrev Number: 10 (DW_TAG_variable)
    <c1e>   DW_AT_name        : (indirect string, offset: 0xc66): nl_netfilter_msg_types
    <c22>   DW_AT_decl_file   : 18
    <c23>   DW_AT_decl_line   : 427
    <c25>   DW_AT_decl_column : 26
    <c26>   DW_AT_type        : <0xb28>
    <c2a>   DW_AT_external    : 1
    <c2b>   DW_AT_declaration : 1
 <1><c2c>: Abbrev Number: 10 (DW_TAG_variable)
    <c2d>   DW_AT_name        : (indirect string, offset: 0xdba): nl_route_types
    <c31>   DW_AT_decl_file   : 18
    <c32>   DW_AT_decl_line   : 428
    <c34>   DW_AT_decl_column : 26
    <c35>   DW_AT_type        : <0xb28>
    <c39>   DW_AT_external    : 1
    <c3a>   DW_AT_declaration : 1
 <1><c3b>: Abbrev Number: 10 (DW_TAG_variable)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x8b8): open_access_modes
    <c40>   DW_AT_decl_file   : 18
    <c41>   DW_AT_decl_line   : 429
    <c43>   DW_AT_decl_column : 26
    <c44>   DW_AT_type        : <0xb28>
    <c48>   DW_AT_external    : 1
    <c49>   DW_AT_declaration : 1
 <1><c4a>: Abbrev Number: 10 (DW_TAG_variable)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x8de): open_mode_flags
    <c4f>   DW_AT_decl_file   : 18
    <c50>   DW_AT_decl_line   : 430
    <c52>   DW_AT_decl_column : 26
    <c53>   DW_AT_type        : <0xb28>
    <c57>   DW_AT_external    : 1
    <c58>   DW_AT_declaration : 1
 <1><c59>: Abbrev Number: 10 (DW_TAG_variable)
    <c5a>   DW_AT_name        : (indirect string, offset: 0xbbc): perf_type_id
    <c5e>   DW_AT_decl_file   : 18
    <c5f>   DW_AT_decl_line   : 431
    <c61>   DW_AT_decl_column : 26
    <c62>   DW_AT_type        : <0xb28>
    <c66>   DW_AT_external    : 1
    <c67>   DW_AT_declaration : 1
 <1><c68>: Abbrev Number: 10 (DW_TAG_variable)
    <c69>   DW_AT_name        : (indirect string, offset: 0x39f): pollflags
    <c6d>   DW_AT_decl_file   : 18
    <c6e>   DW_AT_decl_line   : 432
    <c70>   DW_AT_decl_column : 26
    <c71>   DW_AT_type        : <0xb28>
    <c75>   DW_AT_external    : 1
    <c76>   DW_AT_declaration : 1
 <1><c77>: Abbrev Number: 10 (DW_TAG_variable)
    <c78>   DW_AT_name        : (indirect string, offset: 0x1041): ptrace_cmds
    <c7c>   DW_AT_decl_file   : 18
    <c7d>   DW_AT_decl_line   : 433
    <c7f>   DW_AT_decl_column : 26
    <c80>   DW_AT_type        : <0xb28>
    <c84>   DW_AT_external    : 1
    <c85>   DW_AT_declaration : 1
 <1><c86>: Abbrev Number: 10 (DW_TAG_variable)
    <c87>   DW_AT_name        : (indirect string, offset: 0xbc9): resource_flags
    <c8b>   DW_AT_decl_file   : 18
    <c8c>   DW_AT_decl_line   : 434
    <c8e>   DW_AT_decl_column : 26
    <c8f>   DW_AT_type        : <0xb28>
    <c93>   DW_AT_external    : 1
    <c94>   DW_AT_declaration : 1
 <1><c95>: Abbrev Number: 10 (DW_TAG_variable)
    <c96>   DW_AT_name        : (indirect string, offset: 0x48): route_nexthop_flags
    <c9a>   DW_AT_decl_file   : 18
    <c9b>   DW_AT_decl_line   : 435
    <c9d>   DW_AT_decl_column : 26
    <c9e>   DW_AT_type        : <0xb28>
    <ca2>   DW_AT_external    : 1
    <ca3>   DW_AT_declaration : 1
 <1><ca4>: Abbrev Number: 10 (DW_TAG_variable)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x5f5): routing_protocols
    <ca9>   DW_AT_decl_file   : 18
    <caa>   DW_AT_decl_line   : 436
    <cac>   DW_AT_decl_column : 26
    <cad>   DW_AT_type        : <0xb28>
    <cb1>   DW_AT_external    : 1
    <cb2>   DW_AT_declaration : 1
 <1><cb3>: Abbrev Number: 10 (DW_TAG_variable)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x422): routing_scopes
    <cb8>   DW_AT_decl_file   : 18
    <cb9>   DW_AT_decl_line   : 437
    <cbb>   DW_AT_decl_column : 26
    <cbc>   DW_AT_type        : <0xb28>
    <cc0>   DW_AT_external    : 1
    <cc1>   DW_AT_declaration : 1
 <1><cc2>: Abbrev Number: 10 (DW_TAG_variable)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x8ee): routing_table_ids
    <cc7>   DW_AT_decl_file   : 18
    <cc8>   DW_AT_decl_line   : 438
    <cca>   DW_AT_decl_column : 26
    <ccb>   DW_AT_type        : <0xb28>
    <ccf>   DW_AT_external    : 1
    <cd0>   DW_AT_declaration : 1
 <1><cd1>: Abbrev Number: 10 (DW_TAG_variable)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x5a9): routing_types
    <cd6>   DW_AT_decl_file   : 18
    <cd7>   DW_AT_decl_line   : 439
    <cd9>   DW_AT_decl_column : 26
    <cda>   DW_AT_type        : <0xb28>
    <cde>   DW_AT_external    : 1
    <cdf>   DW_AT_declaration : 1
 <1><ce0>: Abbrev Number: 10 (DW_TAG_variable)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x97a): rwf_flags
    <ce5>   DW_AT_decl_file   : 18
    <ce6>   DW_AT_decl_line   : 440
    <ce8>   DW_AT_decl_column : 26
    <ce9>   DW_AT_type        : <0xb28>
    <ced>   DW_AT_external    : 1
    <cee>   DW_AT_declaration : 1
 <1><cef>: Abbrev Number: 10 (DW_TAG_variable)
    <cf0>   DW_AT_name        : (indirect string, offset: 0xd4e): seccomp_filter_flags
    <cf4>   DW_AT_decl_file   : 18
    <cf5>   DW_AT_decl_line   : 441
    <cf7>   DW_AT_decl_column : 26
    <cf8>   DW_AT_type        : <0xb28>
    <cfc>   DW_AT_external    : 1
    <cfd>   DW_AT_declaration : 1
 <1><cfe>: Abbrev Number: 10 (DW_TAG_variable)
    <cff>   DW_AT_name        : (indirect string, offset: 0x4f1): seccomp_ret_action
    <d03>   DW_AT_decl_file   : 18
    <d04>   DW_AT_decl_line   : 442
    <d06>   DW_AT_decl_column : 26
    <d07>   DW_AT_type        : <0xb28>
    <d0b>   DW_AT_external    : 1
    <d0c>   DW_AT_declaration : 1
 <1><d0d>: Abbrev Number: 10 (DW_TAG_variable)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x46f): setns_types
    <d12>   DW_AT_decl_file   : 18
    <d13>   DW_AT_decl_line   : 443
    <d15>   DW_AT_decl_column : 26
    <d16>   DW_AT_type        : <0xb28>
    <d1a>   DW_AT_external    : 1
    <d1b>   DW_AT_declaration : 1
 <1><d1c>: Abbrev Number: 10 (DW_TAG_variable)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x380): sg_io_info
    <d21>   DW_AT_decl_file   : 18
    <d22>   DW_AT_decl_line   : 444
    <d24>   DW_AT_decl_column : 26
    <d25>   DW_AT_type        : <0xb28>
    <d29>   DW_AT_external    : 1
    <d2a>   DW_AT_declaration : 1
 <1><d2b>: Abbrev Number: 10 (DW_TAG_variable)
    <d2c>   DW_AT_name        : (indirect string, offset: 0xf80): socketlayers
    <d30>   DW_AT_decl_file   : 18
    <d31>   DW_AT_decl_line   : 445
    <d33>   DW_AT_decl_column : 26
    <d34>   DW_AT_type        : <0xb28>
    <d38>   DW_AT_external    : 1
    <d39>   DW_AT_declaration : 1
 <1><d3a>: Abbrev Number: 10 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x126): socktypes
    <d3f>   DW_AT_decl_file   : 18
    <d40>   DW_AT_decl_line   : 446
    <d42>   DW_AT_decl_column : 26
    <d43>   DW_AT_type        : <0xb28>
    <d47>   DW_AT_external    : 1
    <d48>   DW_AT_declaration : 1
 <1><d49>: Abbrev Number: 10 (DW_TAG_variable)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x9c5): tcp_state_flags
    <d4e>   DW_AT_decl_file   : 18
    <d4f>   DW_AT_decl_line   : 447
    <d51>   DW_AT_decl_column : 26
    <d52>   DW_AT_type        : <0xb28>
    <d56>   DW_AT_external    : 1
    <d57>   DW_AT_declaration : 1
 <1><d58>: Abbrev Number: 10 (DW_TAG_variable)
    <d59>   DW_AT_name        : (indirect string, offset: 0xba1): tcp_states
    <d5d>   DW_AT_decl_file   : 18
    <d5e>   DW_AT_decl_line   : 448
    <d60>   DW_AT_decl_column : 26
    <d61>   DW_AT_type        : <0xb28>
    <d65>   DW_AT_external    : 1
    <d66>   DW_AT_declaration : 1
 <1><d67>: Abbrev Number: 10 (DW_TAG_variable)
    <d68>   DW_AT_name        : (indirect string, offset: 0x336): whence_codes
    <d6c>   DW_AT_decl_file   : 18
    <d6d>   DW_AT_decl_line   : 449
    <d6f>   DW_AT_decl_column : 26
    <d70>   DW_AT_type        : <0xb28>
    <d74>   DW_AT_external    : 1
    <d75>   DW_AT_declaration : 1
 <1><d76>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d77>   DW_AT_encoding    : 7	(unsigned)
    <d78>   DW_AT_byte_size   : 4
    <d79>   DW_AT_type        : <0x2b>
    <d7d>   DW_AT_decl_file   : 18
    <d7e>   DW_AT_decl_line   : 510
    <d80>   DW_AT_decl_column : 14
    <d81>   DW_AT_sibling     : <0xd98>
 <2><d85>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d86>   DW_AT_name        : (indirect string, offset: 0x8d3): CFLAG_NONE
    <d8a>   DW_AT_const_value : 0
 <2><d8b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xac9): CFLAG_ONLY_STATS
    <d90>   DW_AT_const_value : 1
 <2><d91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0x10cc): CFLAG_BOTH
    <d96>   DW_AT_const_value : 2
 <2><d97>: Abbrev Number: 0
 <1><d98>: Abbrev Number: 28 (DW_TAG_typedef)
    <d99>   DW_AT_name        : (indirect string, offset: 0x10f5): cflag_t
    <d9d>   DW_AT_decl_file   : 18
    <d9e>   DW_AT_decl_line   : 514
    <da0>   DW_AT_decl_column : 3
    <da1>   DW_AT_type        : <0xd76>
 <1><da5>: Abbrev Number: 10 (DW_TAG_variable)
    <da6>   DW_AT_name        : (indirect string, offset: 0xa96): cflag
    <daa>   DW_AT_decl_file   : 18
    <dab>   DW_AT_decl_line   : 515
    <dad>   DW_AT_decl_column : 16
    <dae>   DW_AT_type        : <0xd98>
    <db2>   DW_AT_external    : 1
    <db3>   DW_AT_declaration : 1
 <1><db4>: Abbrev Number: 10 (DW_TAG_variable)
    <db5>   DW_AT_name        : (indirect string, offset: 0xeef): Tflag
    <db9>   DW_AT_decl_file   : 18
    <dba>   DW_AT_decl_line   : 516
    <dbc>   DW_AT_decl_column : 13
    <dbd>   DW_AT_type        : <0x50e>
    <dc1>   DW_AT_external    : 1
    <dc2>   DW_AT_declaration : 1
 <1><dc3>: Abbrev Number: 10 (DW_TAG_variable)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x5d5): Tflag_scale
    <dc8>   DW_AT_decl_file   : 18
    <dc9>   DW_AT_decl_line   : 517
    <dcb>   DW_AT_decl_column : 12
    <dcc>   DW_AT_type        : <0x64>
    <dd0>   DW_AT_external    : 1
    <dd1>   DW_AT_declaration : 1
 <1><dd2>: Abbrev Number: 10 (DW_TAG_variable)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x265): Tflag_width
    <dd7>   DW_AT_decl_file   : 18
    <dd8>   DW_AT_decl_line   : 518
    <dda>   DW_AT_decl_column : 12
    <ddb>   DW_AT_type        : <0x64>
    <ddf>   DW_AT_external    : 1
    <de0>   DW_AT_declaration : 1
 <1><de1>: Abbrev Number: 10 (DW_TAG_variable)
    <de2>   DW_AT_name        : (indirect string, offset: 0x927): iflag
    <de6>   DW_AT_decl_file   : 18
    <de7>   DW_AT_decl_line   : 519
    <de9>   DW_AT_decl_column : 13
    <dea>   DW_AT_type        : <0x50e>
    <dee>   DW_AT_external    : 1
    <def>   DW_AT_declaration : 1
 <1><df0>: Abbrev Number: 10 (DW_TAG_variable)
    <df1>   DW_AT_name        : (indirect string, offset: 0x661): count_wallclock
    <df5>   DW_AT_decl_file   : 18
    <df6>   DW_AT_decl_line   : 520
    <df8>   DW_AT_decl_column : 13
    <df9>   DW_AT_type        : <0x50e>
    <dfd>   DW_AT_external    : 1
    <dfe>   DW_AT_declaration : 1
 <1><dff>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e00>   DW_AT_name        : (indirect string, offset: 0x1be): path_set_item
    <e04>   DW_AT_byte_size   : 4
    <e05>   DW_AT_decl_file   : 18
    <e06>   DW_AT_decl_line   : 522
    <e08>   DW_AT_decl_column : 8
    <e09>   DW_AT_sibling     : <0xe1e>
 <2><e0d>: Abbrev Number: 22 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x62c): path
    <e12>   DW_AT_decl_file   : 18
    <e13>   DW_AT_decl_line   : 523
    <e15>   DW_AT_decl_column : 14
    <e16>   DW_AT_type        : <0x1c2>
    <e1a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e1d>: Abbrev Number: 0
 <1><e1e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x658): path_set
    <e23>   DW_AT_byte_size   : 12
    <e24>   DW_AT_decl_file   : 18
    <e25>   DW_AT_decl_line   : 527
    <e27>   DW_AT_decl_column : 15
    <e28>   DW_AT_sibling     : <0xe5d>
 <2><e2c>: Abbrev Number: 22 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xbe3): paths_selected
    <e31>   DW_AT_decl_file   : 18
    <e32>   DW_AT_decl_line   : 528
    <e34>   DW_AT_decl_column : 24
    <e35>   DW_AT_type        : <0xe5d>
    <e39>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3c>: Abbrev Number: 22 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x534): num_selected
    <e41>   DW_AT_decl_file   : 18
    <e42>   DW_AT_decl_line   : 529
    <e44>   DW_AT_decl_column : 9
    <e45>   DW_AT_type        : <0x122>
    <e49>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e4c>: Abbrev Number: 22 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0xa02): size
    <e51>   DW_AT_decl_file   : 18
    <e52>   DW_AT_decl_line   : 530
    <e54>   DW_AT_decl_column : 9
    <e55>   DW_AT_type        : <0x122>
    <e59>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e5c>: Abbrev Number: 0
 <1><e5d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e5e>   DW_AT_byte_size   : 4
    <e5f>   DW_AT_type        : <0xdff>
 <1><e63>: Abbrev Number: 10 (DW_TAG_variable)
    <e64>   DW_AT_name        : (indirect string, offset: 0x30e): global_path_set
    <e68>   DW_AT_decl_file   : 18
    <e69>   DW_AT_decl_line   : 531
    <e6b>   DW_AT_decl_column : 3
    <e6c>   DW_AT_type        : <0xe1e>
    <e70>   DW_AT_external    : 1
    <e71>   DW_AT_declaration : 1
 <1><e72>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e73>   DW_AT_name        : (indirect string, offset: 0xcd3): xflag_opts
    <e77>   DW_AT_encoding    : 7	(unsigned)
    <e78>   DW_AT_byte_size   : 4
    <e79>   DW_AT_type        : <0x2b>
    <e7d>   DW_AT_decl_file   : 18
    <e7e>   DW_AT_decl_line   : 533
    <e80>   DW_AT_decl_column : 6
    <e81>   DW_AT_sibling     : <0xea4>
 <2><e85>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e86>   DW_AT_name        : (indirect string, offset: 0x1b2): HEXSTR_NONE
    <e8a>   DW_AT_const_value : 0
 <2><e8b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x1057): HEXSTR_NON_ASCII
    <e90>   DW_AT_const_value : 1
 <2><e91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e92>   DW_AT_name        : (indirect string, offset: 0x522): HEXSTR_ALL
    <e96>   DW_AT_const_value : 2
 <2><e97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e98>   DW_AT_name        : (indirect string, offset: 0x1128): HEXSTR_NON_ASCII_CHARS
    <e9c>   DW_AT_const_value : 3
 <2><e9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9e>   DW_AT_name        : (indirect string, offset: 0xddf): NUM_HEXSTR_OPTS
    <ea2>   DW_AT_const_value : 4
 <2><ea3>: Abbrev Number: 0
 <1><ea4>: Abbrev Number: 10 (DW_TAG_variable)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x2d7): xflag
    <ea9>   DW_AT_decl_file   : 18
    <eaa>   DW_AT_decl_line   : 546
    <eac>   DW_AT_decl_column : 17
    <ead>   DW_AT_type        : <0x2b>
    <eb1>   DW_AT_external    : 1
    <eb2>   DW_AT_declaration : 1
 <1><eb3>: Abbrev Number: 10 (DW_TAG_variable)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xff6): followfork
    <eb8>   DW_AT_decl_file   : 18
    <eb9>   DW_AT_decl_line   : 547
    <ebb>   DW_AT_decl_column : 13
    <ebc>   DW_AT_type        : <0x50e>
    <ec0>   DW_AT_external    : 1
    <ec1>   DW_AT_declaration : 1
 <1><ec2>: Abbrev Number: 10 (DW_TAG_variable)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x13e): output_separately
    <ec7>   DW_AT_decl_file   : 18
    <ec8>   DW_AT_decl_line   : 548
    <eca>   DW_AT_decl_column : 13
    <ecb>   DW_AT_type        : <0x50e>
    <ecf>   DW_AT_external    : 1
    <ed0>   DW_AT_declaration : 1
 <1><ed1>: Abbrev Number: 10 (DW_TAG_variable)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x607): stack_trace_enabled
    <ed6>   DW_AT_decl_file   : 18
    <ed7>   DW_AT_decl_line   : 551
    <ed9>   DW_AT_decl_column : 13
    <eda>   DW_AT_type        : <0x50e>
    <ede>   DW_AT_external    : 1
    <edf>   DW_AT_declaration : 1
 <1><ee0>: Abbrev Number: 10 (DW_TAG_variable)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xf8d): ptrace_setoptions
    <ee5>   DW_AT_decl_file   : 18
    <ee6>   DW_AT_decl_line   : 555
    <ee8>   DW_AT_decl_column : 17
    <ee9>   DW_AT_type        : <0x2b>
    <eed>   DW_AT_external    : 1
    <eee>   DW_AT_declaration : 1
 <1><eef>: Abbrev Number: 10 (DW_TAG_variable)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x9): max_strlen
    <ef4>   DW_AT_decl_file   : 18
    <ef5>   DW_AT_decl_line   : 556
    <ef7>   DW_AT_decl_column : 17
    <ef8>   DW_AT_type        : <0x2b>
    <efc>   DW_AT_external    : 1
    <efd>   DW_AT_declaration : 1
 <1><efe>: Abbrev Number: 10 (DW_TAG_variable)
    <eff>   DW_AT_name        : (indirect string, offset: 0x90e): os_release
    <f03>   DW_AT_decl_file   : 18
    <f04>   DW_AT_decl_line   : 557
    <f06>   DW_AT_decl_column : 17
    <f07>   DW_AT_type        : <0x2b>
    <f0b>   DW_AT_external    : 1
    <f0c>   DW_AT_declaration : 1
 <1><f0d>: Abbrev Number: 10 (DW_TAG_variable)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x9b6): xlat_verbosity
    <f12>   DW_AT_decl_file   : 18
    <f13>   DW_AT_decl_line   : 919
    <f15>   DW_AT_decl_column : 24
    <f16>   DW_AT_type        : <0xa4b>
    <f1a>   DW_AT_external    : 1
    <f1b>   DW_AT_declaration : 1
 <1><f1c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x9e0): xlat_style_private_flag_bits
    <f21>   DW_AT_encoding    : 7	(unsigned)
    <f22>   DW_AT_byte_size   : 4
    <f23>   DW_AT_type        : <0x2b>
    <f27>   DW_AT_decl_file   : 18
    <f28>   DW_AT_decl_line   : 939
    <f2a>   DW_AT_decl_column : 6
    <f2b>   DW_AT_sibling     : <0xf48>
 <2><f2f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0xb4d): PAF_PRINT_INDICES_BIT
    <f34>   DW_AT_const_value : 5
 <2><f35>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x2eb): PAF_ARRAY_TRUNCATED_BIT
    <f3a>   DW_AT_const_value : 6
 <2><f3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x1088): PXF_DEFAULT_STR_BIT
    <f40>   DW_AT_const_value : 7
 <2><f41>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0xd6d): SPFF_AUXSTR_MODE_BIT
    <f46>   DW_AT_const_value : 8
 <2><f47>: Abbrev Number: 0
 <1><f48>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f49>   DW_AT_name        : (indirect string, offset: 0x7b): find_xlat_flag_bits
    <f4d>   DW_AT_encoding    : 7	(unsigned)
    <f4e>   DW_AT_byte_size   : 4
    <f4f>   DW_AT_type        : <0x2b>
    <f53>   DW_AT_decl_file   : 18
    <f54>   DW_AT_decl_line   : 1443
    <f56>   DW_AT_decl_column : 6
    <f57>   DW_AT_sibling     : <0xf62>
 <2><f5b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x948): FXL_CASE_SENSITIVE_BIT
    <f60>   DW_AT_const_value : 0
 <2><f61>: Abbrev Number: 0
 <1><f62>: Abbrev Number: 10 (DW_TAG_variable)
    <f63>   DW_AT_name        : (indirect string, offset: 0x1068): printing_tcp
    <f67>   DW_AT_decl_file   : 18
    <f68>   DW_AT_decl_line   : 1689
    <f6a>   DW_AT_decl_column : 20
    <f6b>   DW_AT_type        : <0x5ea>
    <f6f>   DW_AT_external    : 1
    <f70>   DW_AT_declaration : 1
 <1><f71>: Abbrev Number: 10 (DW_TAG_variable)
    <f72>   DW_AT_name        : (indirect string, offset: 0xfa5): errnoent
    <f76>   DW_AT_decl_file   : 18
    <f77>   DW_AT_decl_line   : 1887
    <f79>   DW_AT_decl_column : 26
    <f7a>   DW_AT_type        : <0x442>
    <f7e>   DW_AT_external    : 1
    <f7f>   DW_AT_declaration : 1
 <1><f80>: Abbrev Number: 10 (DW_TAG_variable)
    <f81>   DW_AT_name        : (indirect string, offset: 0xb6c): signalent
    <f85>   DW_AT_decl_file   : 18
    <f86>   DW_AT_decl_line   : 1888
    <f88>   DW_AT_decl_column : 26
    <f89>   DW_AT_type        : <0x442>
    <f8d>   DW_AT_external    : 1
    <f8e>   DW_AT_declaration : 1
 <1><f8f>: Abbrev Number: 10 (DW_TAG_variable)
    <f90>   DW_AT_name        : (indirect string, offset: 0x110a): nerrnos
    <f94>   DW_AT_decl_file   : 18
    <f95>   DW_AT_decl_line   : 1889
    <f97>   DW_AT_decl_column : 27
    <f98>   DW_AT_type        : <0x32>
    <f9c>   DW_AT_external    : 1
    <f9d>   DW_AT_declaration : 1
 <1><f9e>: Abbrev Number: 10 (DW_TAG_variable)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x4b7): nsignals
    <fa3>   DW_AT_decl_file   : 18
    <fa4>   DW_AT_decl_line   : 1890
    <fa6>   DW_AT_decl_column : 27
    <fa7>   DW_AT_type        : <0x32>
    <fab>   DW_AT_external    : 1
    <fac>   DW_AT_declaration : 1
 <1><fad>: Abbrev Number: 15 (DW_TAG_array_type)
    <fae>   DW_AT_type        : <0x86a>
    <fb2>   DW_AT_sibling     : <0xfb8>
 <2><fb6>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb7>: Abbrev Number: 0
 <1><fb8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb9>   DW_AT_type        : <0xfad>
 <1><fbd>: Abbrev Number: 10 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x1001): sysent0
    <fc2>   DW_AT_decl_file   : 18
    <fc3>   DW_AT_decl_line   : 1892
    <fc5>   DW_AT_decl_column : 28
    <fc6>   DW_AT_type        : <0xfb8>
    <fca>   DW_AT_external    : 1
    <fcb>   DW_AT_declaration : 1
 <1><fcc>: Abbrev Number: 15 (DW_TAG_array_type)
    <fcd>   DW_AT_type        : <0x8d1>
    <fd1>   DW_AT_sibling     : <0xfd7>
 <2><fd5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd6>: Abbrev Number: 0
 <1><fd7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd8>   DW_AT_type        : <0xfcc>
 <1><fdc>: Abbrev Number: 10 (DW_TAG_variable)
    <fdd>   DW_AT_name        : (indirect string, offset: 0xf2a): ioctlent0
    <fe1>   DW_AT_decl_file   : 18
    <fe2>   DW_AT_decl_line   : 1893
    <fe4>   DW_AT_decl_column : 30
    <fe5>   DW_AT_type        : <0xfd7>
    <fe9>   DW_AT_external    : 1
    <fea>   DW_AT_declaration : 1
 <1><feb>: Abbrev Number: 10 (DW_TAG_variable)
    <fec>   DW_AT_name        : (indirect string, offset: 0x4c8): personality_names
    <ff0>   DW_AT_decl_file   : 18
    <ff1>   DW_AT_decl_line   : 1895
    <ff3>   DW_AT_decl_column : 26
    <ff4>   DW_AT_type        : <0x442>
    <ff8>   DW_AT_external    : 1
    <ff9>   DW_AT_declaration : 1
 <1><ffa>: Abbrev Number: 10 (DW_TAG_variable)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x225): sysent
    <fff>   DW_AT_decl_file   : 18
    <1000>   DW_AT_decl_line   : 1898
    <1002>   DW_AT_decl_column : 29
    <1003>   DW_AT_type        : <0x9b6>
    <1007>   DW_AT_external    : 1
    <1008>   DW_AT_declaration : 1
 <1><1009>: Abbrev Number: 10 (DW_TAG_variable)
    <100a>   DW_AT_name        : (indirect string, offset: 0xc5d): ioctlent
    <100e>   DW_AT_decl_file   : 18
    <100f>   DW_AT_decl_line   : 1899
    <1011>   DW_AT_decl_column : 31
    <1012>   DW_AT_type        : <0x1018>
    <1016>   DW_AT_external    : 1
    <1017>   DW_AT_declaration : 1
 <1><1018>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1019>   DW_AT_byte_size   : 4
    <101a>   DW_AT_type        : <0x8d1>
 <1><101e>: Abbrev Number: 10 (DW_TAG_variable)
    <101f>   DW_AT_name        : (indirect string, offset: 0x104d): nsyscalls
    <1023>   DW_AT_decl_file   : 18
    <1024>   DW_AT_decl_line   : 1905
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_type        : <0x2b>
    <102b>   DW_AT_external    : 1
    <102c>   DW_AT_declaration : 1
 <1><102d>: Abbrev Number: 10 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0x210): nioctlents
    <1032>   DW_AT_decl_file   : 18
    <1033>   DW_AT_decl_line   : 1906
    <1035>   DW_AT_decl_column : 17
    <1036>   DW_AT_type        : <0x2b>
    <103a>   DW_AT_external    : 1
    <103b>   DW_AT_declaration : 1
 <1><103c>: Abbrev Number: 15 (DW_TAG_array_type)
    <103d>   DW_AT_type        : <0x32>
    <1041>   DW_AT_sibling     : <0x104c>
 <2><1045>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1046>   DW_AT_type        : <0x2b>
    <104a>   DW_AT_upper_bound : 2
 <2><104b>: Abbrev Number: 0
 <1><104c>: Abbrev Number: 3 (DW_TAG_const_type)
    <104d>   DW_AT_type        : <0x103c>
 <1><1051>: Abbrev Number: 10 (DW_TAG_variable)
    <1052>   DW_AT_name        : (indirect string, offset: 0xaf8): nsyscall_vec
    <1056>   DW_AT_decl_file   : 18
    <1057>   DW_AT_decl_line   : 1908
    <1059>   DW_AT_decl_column : 27
    <105a>   DW_AT_type        : <0x104c>
    <105e>   DW_AT_external    : 1
    <105f>   DW_AT_declaration : 1
 <1><1060>: Abbrev Number: 15 (DW_TAG_array_type)
    <1061>   DW_AT_type        : <0x9bc>
    <1065>   DW_AT_sibling     : <0x1070>
 <2><1069>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <106a>   DW_AT_type        : <0x2b>
    <106e>   DW_AT_upper_bound : 2
 <2><106f>: Abbrev Number: 0
 <1><1070>: Abbrev Number: 3 (DW_TAG_const_type)
    <1071>   DW_AT_type        : <0x1060>
 <1><1075>: Abbrev Number: 10 (DW_TAG_variable)
    <1076>   DW_AT_name        : (indirect string, offset: 0xdfa): sysent_vec
    <107a>   DW_AT_decl_file   : 18
    <107b>   DW_AT_decl_line   : 1909
    <107d>   DW_AT_decl_column : 35
    <107e>   DW_AT_type        : <0x1070>
    <1082>   DW_AT_external    : 1
    <1083>   DW_AT_declaration : 1
 <1><1084>: Abbrev Number: 10 (DW_TAG_variable)
    <1085>   DW_AT_name        : (indirect string, offset: 0x636): inject_vec
    <1089>   DW_AT_decl_file   : 18
    <108a>   DW_AT_decl_line   : 1910
    <108c>   DW_AT_decl_column : 28
    <108d>   DW_AT_type        : <0x9c1>
    <1091>   DW_AT_external    : 1
    <1092>   DW_AT_declaration : 1
 <1><1093>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1094>   DW_AT_name        : (indirect string, offset: 0xab2): audit_arch_t
    <1098>   DW_AT_byte_size   : 8
    <1099>   DW_AT_decl_file   : 18
    <109a>   DW_AT_decl_line   : 1912
    <109c>   DW_AT_decl_column : 8
    <109d>   DW_AT_sibling     : <0x10c2>
 <2><10a1>: Abbrev Number: 22 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0xe7d): arch
    <10a6>   DW_AT_decl_file   : 18
    <10a7>   DW_AT_decl_line   : 1913
    <10a9>   DW_AT_decl_column : 15
    <10aa>   DW_AT_type        : <0x2b>
    <10ae>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b1>: Abbrev Number: 22 (DW_TAG_member)
    <10b2>   DW_AT_name        : (indirect string, offset: 0xd19): flag
    <10b6>   DW_AT_decl_file   : 18
    <10b7>   DW_AT_decl_line   : 1914
    <10b9>   DW_AT_decl_column : 15
    <10ba>   DW_AT_type        : <0x2b>
    <10be>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c1>: Abbrev Number: 0
 <1><10c2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c3>   DW_AT_type        : <0x1093>
 <1><10c7>: Abbrev Number: 15 (DW_TAG_array_type)
    <10c8>   DW_AT_type        : <0x10c2>
    <10cc>   DW_AT_sibling     : <0x10d7>
 <2><10d0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d1>   DW_AT_type        : <0x2b>
    <10d5>   DW_AT_upper_bound : 2
 <2><10d6>: Abbrev Number: 0
 <1><10d7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d8>   DW_AT_type        : <0x10c7>
 <1><10dc>: Abbrev Number: 10 (DW_TAG_variable)
    <10dd>   DW_AT_name        : (indirect string, offset: 0xf71): audit_arch_vec
    <10e1>   DW_AT_decl_file   : 18
    <10e2>   DW_AT_decl_line   : 1917
    <10e4>   DW_AT_decl_column : 34
    <10e5>   DW_AT_type        : <0x10d7>
    <10e9>   DW_AT_external    : 1
    <10ea>   DW_AT_declaration : 1
 <1><10eb>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10ec>   DW_AT_byte_size   : 180
    <10ed>   DW_AT_decl_file   : 20
    <10ee>   DW_AT_decl_line   : 2
    <10ef>   DW_AT_decl_column : 9
    <10f0>   DW_AT_sibling     : <0x13a5>
 <2><10f4>: Abbrev Number: 9 (DW_TAG_member)
    <10f5>   DW_AT_name        : (indirect string, offset: 0xec7): block_ioctl
    <10f9>   DW_AT_decl_file   : 20
    <10fa>   DW_AT_decl_line   : 3
    <10fb>   DW_AT_decl_column : 8
    <10fc>   DW_AT_type        : <0x13bf>
    <1100>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1103>: Abbrev Number: 9 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0x259): btrfs_ioctl
    <1108>   DW_AT_decl_file   : 20
    <1109>   DW_AT_decl_line   : 6
    <110a>   DW_AT_decl_column : 8
    <110b>   DW_AT_type        : <0x13bf>
    <110f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1112>: Abbrev Number: 9 (DW_TAG_member)
    <1113>   DW_AT_name        : (indirect string, offset: 0x716): evdev_write_ioctl_mpers
    <1117>   DW_AT_decl_file   : 20
    <1118>   DW_AT_decl_line   : 9
    <1119>   DW_AT_decl_column : 8
    <111a>   DW_AT_type        : <0x13bf>
    <111e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1121>: Abbrev Number: 9 (DW_TAG_member)
    <1122>   DW_AT_name        : (indirect string, offset: 0x890): get_sock_fprog_size
    <1126>   DW_AT_decl_file   : 20
    <1127>   DW_AT_decl_line   : 12
    <1128>   DW_AT_decl_column : 17
    <1129>   DW_AT_type        : <0x13cb>
    <112d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1130>: Abbrev Number: 9 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0x938): fetch_bpf_fprog
    <1135>   DW_AT_decl_file   : 20
    <1136>   DW_AT_decl_line   : 15
    <1137>   DW_AT_decl_column : 10
    <1138>   DW_AT_type        : <0x13eb>
    <113c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><113f>: Abbrev Number: 9 (DW_TAG_member)
    <1140>   DW_AT_name        : (indirect string, offset: 0x87d): fetch_struct_flock
    <1144>   DW_AT_decl_file   : 20
    <1145>   DW_AT_decl_line   : 18
    <1146>   DW_AT_decl_column : 10
    <1147>   DW_AT_type        : <0x13eb>
    <114b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><114e>: Abbrev Number: 9 (DW_TAG_member)
    <114f>   DW_AT_name        : (indirect string, offset: 0xfcf): fetch_struct_flock64
