Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1816 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x542): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x95): mpers-mx32/struct_ifconf.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa99): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3dc): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10b2): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9f0): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe89): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4e6): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8e3): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf6b): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x913): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7d5): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbd8): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xc1a): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd8b): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xcf8): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x447): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x325): __caddr_t
    <de>   DW_AT_decl_file   : 1
    <df>   DW_AT_decl_line   : 203
    <e0>   DW_AT_decl_column : 15
    <e1>   DW_AT_type        : <0xe5>
 <1><e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6>   DW_AT_byte_size   : 4
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 2 (DW_TAG_base_type)
    <ec>   DW_AT_byte_size   : 1
    <ed>   DW_AT_encoding    : 6	(signed char)
    <ee>   DW_AT_name        : (indirect string, offset: 0x493): char
 <1><f2>: Abbrev Number: 3 (DW_TAG_const_type)
    <f3>   DW_AT_type        : <0xeb>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x37d): uint8_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 24
    <fe>   DW_AT_decl_column : 19
    <ff>   DW_AT_type        : <0x45>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xc05): uint16_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 25
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x58>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0x102d): uint32_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 26
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x70>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xe99): uint64_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 27
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x8f>
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 4
    <129>   DW_AT_encoding    : 5	(signed)
    <12a>   DW_AT_name        : (indirect string, offset: 0x2e3): long int
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xb81): timespec
    <144>   DW_AT_byte_size   : 16
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x118a): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xba>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xebf): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xcd>
    <167>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xb43): long double
 <1><172>: Abbrev Number: 10 (DW_TAG_variable)
    <173>   DW_AT_name        : (indirect string, offset: 0x29a): __environ
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 543
    <17a>   DW_AT_decl_column : 15
    <17b>   DW_AT_type        : <0x181>
    <17f>   DW_AT_external    : 1
    <180>   DW_AT_declaration : 1
 <1><181>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <182>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0xe5>
 <1><187>: Abbrev Number: 10 (DW_TAG_variable)
    <188>   DW_AT_name        : (indirect string, offset: 0x3d4): environ
    <18c>   DW_AT_decl_file   : 5
    <18d>   DW_AT_decl_line   : 545
    <18f>   DW_AT_decl_column : 15
    <190>   DW_AT_type        : <0x181>
    <194>   DW_AT_external    : 1
    <195>   DW_AT_declaration : 1
 <1><196>: Abbrev Number: 11 (DW_TAG_variable)
    <197>   DW_AT_name        : (indirect string, offset: 0x1096): optarg
    <19b>   DW_AT_decl_file   : 6
    <19c>   DW_AT_decl_line   : 36
    <19d>   DW_AT_decl_column : 14
    <19e>   DW_AT_type        : <0xe5>
    <1a2>   DW_AT_external    : 1
    <1a3>   DW_AT_declaration : 1
 <1><1a4>: Abbrev Number: 11 (DW_TAG_variable)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x7a8): optind
    <1a9>   DW_AT_decl_file   : 6
    <1aa>   DW_AT_decl_line   : 50
    <1ab>   DW_AT_decl_column : 12
    <1ac>   DW_AT_type        : <0x64>
    <1b0>   DW_AT_external    : 1
    <1b1>   DW_AT_declaration : 1
 <1><1b2>: Abbrev Number: 11 (DW_TAG_variable)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xcd2): opterr
    <1b7>   DW_AT_decl_file   : 6
    <1b8>   DW_AT_decl_line   : 55
    <1b9>   DW_AT_decl_column : 12
    <1ba>   DW_AT_type        : <0x64>
    <1be>   DW_AT_external    : 1
    <1bf>   DW_AT_declaration : 1
 <1><1c0>: Abbrev Number: 11 (DW_TAG_variable)
    <1c1>   DW_AT_name        : (indirect string, offset: 0xbbe): optopt
    <1c5>   DW_AT_decl_file   : 6
    <1c6>   DW_AT_decl_line   : 59
    <1c7>   DW_AT_decl_column : 12
    <1c8>   DW_AT_type        : <0x64>
    <1cc>   DW_AT_external    : 1
    <1cd>   DW_AT_declaration : 1
 <1><1ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1cf>   DW_AT_byte_size   : 4
    <1d0>   DW_AT_type        : <0xf2>
 <1><1d4>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d5>   DW_AT_type        : <0x1ce>
 <1><1d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0x1df>
 <1><1df>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1e0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x385): _IO_FILE
    <1e5>   DW_AT_byte_size   : 152
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 49
    <1e8>   DW_AT_decl_column : 8
    <1e9>   DW_AT_sibling     : <0x3a1>
 <2><1ed>: Abbrev Number: 9 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0xa75): _flags
    <1f2>   DW_AT_decl_file   : 7
    <1f3>   DW_AT_decl_line   : 51
    <1f4>   DW_AT_decl_column : 7
    <1f5>   DW_AT_type        : <0x64>
    <1f9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1fc>: Abbrev Number: 9 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x535): _IO_read_ptr
    <201>   DW_AT_decl_file   : 7
    <202>   DW_AT_decl_line   : 54
    <203>   DW_AT_decl_column : 9
    <204>   DW_AT_type        : <0xe5>
    <208>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20b>: Abbrev Number: 9 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0xfc8): _IO_read_end
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 55
    <212>   DW_AT_decl_column : 9
    <213>   DW_AT_type        : <0xe5>
    <217>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21a>: Abbrev Number: 9 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x811): _IO_read_base
    <21f>   DW_AT_decl_file   : 7
    <220>   DW_AT_decl_line   : 56
    <221>   DW_AT_decl_column : 9
    <222>   DW_AT_type        : <0xe5>
    <226>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x149): _IO_write_base
    <22e>   DW_AT_decl_file   : 7
    <22f>   DW_AT_decl_line   : 57
    <230>   DW_AT_decl_column : 9
    <231>   DW_AT_type        : <0xe5>
    <235>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><238>: Abbrev Number: 9 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x10f6): _IO_write_ptr
    <23d>   DW_AT_decl_file   : 7
    <23e>   DW_AT_decl_line   : 58
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0xe5>
    <244>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><247>: Abbrev Number: 9 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0x95f): _IO_write_end
    <24c>   DW_AT_decl_file   : 7
    <24d>   DW_AT_decl_line   : 59
    <24e>   DW_AT_decl_column : 9
    <24f>   DW_AT_type        : <0xe5>
    <253>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><256>: Abbrev Number: 9 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x9d9): _IO_buf_base
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 60
    <25d>   DW_AT_decl_column : 9
    <25e>   DW_AT_type        : <0xe5>
    <262>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><265>: Abbrev Number: 9 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0xe23): _IO_buf_end
    <26a>   DW_AT_decl_file   : 7
    <26b>   DW_AT_decl_line   : 61
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0xe5>
    <271>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><274>: Abbrev Number: 9 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x1f1): _IO_save_base
    <279>   DW_AT_decl_file   : 7
    <27a>   DW_AT_decl_line   : 64
    <27b>   DW_AT_decl_column : 9
    <27c>   DW_AT_type        : <0xe5>
    <280>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><283>: Abbrev Number: 9 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0xd4a): _IO_backup_base
    <288>   DW_AT_decl_file   : 7
    <289>   DW_AT_decl_line   : 65
    <28a>   DW_AT_decl_column : 9
    <28b>   DW_AT_type        : <0xe5>
    <28f>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><292>: Abbrev Number: 9 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0xd1): _IO_save_end
    <297>   DW_AT_decl_file   : 7
    <298>   DW_AT_decl_line   : 66
    <299>   DW_AT_decl_column : 9
    <29a>   DW_AT_type        : <0xe5>
    <29e>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a1>: Abbrev Number: 9 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x663): _markers
    <2a6>   DW_AT_decl_file   : 7
    <2a7>   DW_AT_decl_line   : 68
    <2a8>   DW_AT_decl_column : 22
    <2a9>   DW_AT_type        : <0x3bb>
    <2ad>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b0>: Abbrev Number: 9 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x234): _chain
    <2b5>   DW_AT_decl_file   : 7
    <2b6>   DW_AT_decl_line   : 70
    <2b7>   DW_AT_decl_column : 20
    <2b8>   DW_AT_type        : <0x3c1>
    <2bc>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2bf>: Abbrev Number: 9 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x1053): _fileno
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 72
    <2c6>   DW_AT_decl_column : 7
    <2c7>   DW_AT_type        : <0x64>
    <2cb>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2ce>: Abbrev Number: 9 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x7fd): _flags2
    <2d3>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 73
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x64>
    <2da>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2dd>: Abbrev Number: 9 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x88f): _old_offset
    <2e2>   DW_AT_decl_file   : 7
    <2e3>   DW_AT_decl_line   : 74
    <2e4>   DW_AT_decl_column : 11
    <2e5>   DW_AT_type        : <0xa2>
    <2e9>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2ec>: Abbrev Number: 9 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x262): _cur_column
    <2f1>   DW_AT_decl_file   : 7
    <2f2>   DW_AT_decl_line   : 77
    <2f3>   DW_AT_decl_column : 18
    <2f4>   DW_AT_type        : <0x24>
    <2f8>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2fb>: Abbrev Number: 9 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0xee5): _vtable_offset
    <300>   DW_AT_decl_file   : 7
    <301>   DW_AT_decl_line   : 78
    <302>   DW_AT_decl_column : 15
    <303>   DW_AT_type        : <0x3e>
    <307>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30a>: Abbrev Number: 9 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0xd5a): _shortbuf
    <30f>   DW_AT_decl_file   : 7
    <310>   DW_AT_decl_line   : 79
    <311>   DW_AT_decl_column : 8
    <312>   DW_AT_type        : <0x3c7>
    <316>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><319>: Abbrev Number: 9 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x18a): _lock
    <31e>   DW_AT_decl_file   : 7
    <31f>   DW_AT_decl_line   : 81
    <320>   DW_AT_decl_column : 15
    <321>   DW_AT_type        : <0x3d7>
    <325>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><328>: Abbrev Number: 9 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x740): _offset
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 89
    <32f>   DW_AT_decl_column : 13
    <330>   DW_AT_type        : <0xae>
    <334>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><337>: Abbrev Number: 9 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0xacb): _codecvt
    <33c>   DW_AT_decl_file   : 7
    <33d>   DW_AT_decl_line   : 91
    <33e>   DW_AT_decl_column : 23
    <33f>   DW_AT_type        : <0x3e3>
    <343>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><346>: Abbrev Number: 9 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x107a): _wide_data
    <34b>   DW_AT_decl_file   : 7
    <34c>   DW_AT_decl_line   : 92
    <34d>   DW_AT_decl_column : 25
    <34e>   DW_AT_type        : <0x3ef>
    <352>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><355>: Abbrev Number: 9 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x3f8): _freeres_list
    <35a>   DW_AT_decl_file   : 7
    <35b>   DW_AT_decl_line   : 93
    <35c>   DW_AT_decl_column : 20
    <35d>   DW_AT_type        : <0x3c1>
    <361>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><364>: Abbrev Number: 9 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0xca8): _freeres_buf
    <369>   DW_AT_decl_file   : 7
    <36a>   DW_AT_decl_line   : 94
    <36b>   DW_AT_decl_column : 9
    <36c>   DW_AT_type        : <0xc6>
    <370>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><373>: Abbrev Number: 9 (DW_TAG_member)
    <374>   DW_AT_name        : (indirect string, offset: 0xa37): __pad5
    <378>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 95
    <37a>   DW_AT_decl_column : 10
    <37b>   DW_AT_type        : <0x12e>
    <37f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><382>: Abbrev Number: 9 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x281): _mode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 96
    <389>   DW_AT_decl_column : 7
    <38a>   DW_AT_type        : <0x64>
    <38e>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><391>: Abbrev Number: 9 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x835): _unused2
    <396>   DW_AT_decl_file   : 7
    <397>   DW_AT_decl_line   : 98
    <398>   DW_AT_decl_column : 8
    <399>   DW_AT_type        : <0x3f5>
    <39d>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a0>: Abbrev Number: 0
 <1><3a1>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xb63): FILE
    <3a6>   DW_AT_decl_file   : 8
    <3a7>   DW_AT_decl_line   : 7
    <3a8>   DW_AT_decl_column : 25
    <3a9>   DW_AT_type        : <0x1e0>
 <1><3ad>: Abbrev Number: 13 (DW_TAG_typedef)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x4d2): _IO_lock_t
    <3b2>   DW_AT_decl_file   : 7
    <3b3>   DW_AT_decl_line   : 43
    <3b4>   DW_AT_decl_column : 14
 <1><3b5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x32f): _IO_marker
    <3ba>   DW_AT_declaration : 1
 <1><3bb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bc>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x3b5>
 <1><3c1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c3>   DW_AT_type        : <0x1e0>
 <1><3c7>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c8>   DW_AT_type        : <0xeb>
    <3cc>   DW_AT_sibling     : <0x3d7>
 <2><3d0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3d1>   DW_AT_type        : <0x2b>
    <3d5>   DW_AT_upper_bound : 0
 <2><3d6>: Abbrev Number: 0
 <1><3d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x3ad>
 <1><3dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3de>   DW_AT_name        : (indirect string, offset: 0x79): _IO_codecvt
    <3e2>   DW_AT_declaration : 1
 <1><3e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
    <3e5>   DW_AT_type        : <0x3dd>
 <1><3e9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x399): _IO_wide_data
    <3ee>   DW_AT_declaration : 1
 <1><3ef>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f0>   DW_AT_byte_size   : 4
    <3f1>   DW_AT_type        : <0x3e9>
 <1><3f5>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f6>   DW_AT_type        : <0xeb>
    <3fa>   DW_AT_sibling     : <0x405>
 <2><3fe>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3ff>   DW_AT_type        : <0x2b>
    <403>   DW_AT_upper_bound : 39
 <2><404>: Abbrev Number: 0
 <1><405>: Abbrev Number: 11 (DW_TAG_variable)
    <406>   DW_AT_name        : (indirect string, offset: 0x61a): stdin
    <40a>   DW_AT_decl_file   : 9
    <40b>   DW_AT_decl_line   : 137
    <40c>   DW_AT_decl_column : 14
    <40d>   DW_AT_type        : <0x413>
    <411>   DW_AT_external    : 1
    <412>   DW_AT_declaration : 1
 <1><413>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_type        : <0x3a1>
 <1><419>: Abbrev Number: 11 (DW_TAG_variable)
    <41a>   DW_AT_name        : (indirect string, offset: 0x10c5): stdout
    <41e>   DW_AT_decl_file   : 9
    <41f>   DW_AT_decl_line   : 138
    <420>   DW_AT_decl_column : 14
    <421>   DW_AT_type        : <0x413>
    <425>   DW_AT_external    : 1
    <426>   DW_AT_declaration : 1
 <1><427>: Abbrev Number: 11 (DW_TAG_variable)
    <428>   DW_AT_name        : (indirect string, offset: 0xe82): stderr
    <42c>   DW_AT_decl_file   : 9
    <42d>   DW_AT_decl_line   : 139
    <42e>   DW_AT_decl_column : 14
    <42f>   DW_AT_type        : <0x413>
    <433>   DW_AT_external    : 1
    <434>   DW_AT_declaration : 1
 <1><435>: Abbrev Number: 11 (DW_TAG_variable)
    <436>   DW_AT_name        : (indirect string, offset: 0x26e): sys_nerr
    <43a>   DW_AT_decl_file   : 10
    <43b>   DW_AT_decl_line   : 26
    <43c>   DW_AT_decl_column : 12
    <43d>   DW_AT_type        : <0x64>
    <441>   DW_AT_external    : 1
    <442>   DW_AT_declaration : 1
 <1><443>: Abbrev Number: 15 (DW_TAG_array_type)
    <444>   DW_AT_type        : <0x1d4>
    <448>   DW_AT_sibling     : <0x44e>
 <2><44c>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><44d>: Abbrev Number: 0
 <1><44e>: Abbrev Number: 3 (DW_TAG_const_type)
    <44f>   DW_AT_type        : <0x443>
 <1><453>: Abbrev Number: 11 (DW_TAG_variable)
    <454>   DW_AT_name        : (indirect string, offset: 0x629): sys_errlist
    <458>   DW_AT_decl_file   : 10
    <459>   DW_AT_decl_line   : 27
    <45a>   DW_AT_decl_column : 26
    <45b>   DW_AT_type        : <0x44e>
    <45f>   DW_AT_external    : 1
    <460>   DW_AT_declaration : 1
 <1><461>: Abbrev Number: 11 (DW_TAG_variable)
    <462>   DW_AT_name        : (indirect string, offset: 0x287): _sys_nerr
    <466>   DW_AT_decl_file   : 10
    <467>   DW_AT_decl_line   : 30
    <468>   DW_AT_decl_column : 12
    <469>   DW_AT_type        : <0x64>
    <46d>   DW_AT_external    : 1
    <46e>   DW_AT_declaration : 1
 <1><46f>: Abbrev Number: 11 (DW_TAG_variable)
    <470>   DW_AT_name        : (indirect string, offset: 0xef4): _sys_errlist
    <474>   DW_AT_decl_file   : 10
    <475>   DW_AT_decl_line   : 31
    <476>   DW_AT_decl_column : 26
    <477>   DW_AT_type        : <0x44e>
    <47b>   DW_AT_external    : 1
    <47c>   DW_AT_declaration : 1
 <1><47d>: Abbrev Number: 11 (DW_TAG_variable)
    <47e>   DW_AT_name        : (indirect string, offset: 0x719): program_invocation_name
    <482>   DW_AT_decl_file   : 11
    <483>   DW_AT_decl_line   : 45
    <484>   DW_AT_decl_column : 14
    <485>   DW_AT_type        : <0xe5>
    <489>   DW_AT_external    : 1
    <48a>   DW_AT_declaration : 1
 <1><48b>: Abbrev Number: 11 (DW_TAG_variable)
    <48c>   DW_AT_name        : (indirect string, offset: 0xc45): program_invocation_short_name
    <490>   DW_AT_decl_file   : 11
    <491>   DW_AT_decl_line   : 46
    <492>   DW_AT_decl_column : 14
    <493>   DW_AT_type        : <0xe5>
    <497>   DW_AT_external    : 1
    <498>   DW_AT_declaration : 1
 <1><499>: Abbrev Number: 15 (DW_TAG_array_type)
    <49a>   DW_AT_type        : <0xe5>
    <49e>   DW_AT_sibling     : <0x4a9>
 <2><4a2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4a3>   DW_AT_type        : <0x2b>
    <4a7>   DW_AT_upper_bound : 1
 <2><4a8>: Abbrev Number: 0
 <1><4a9>: Abbrev Number: 11 (DW_TAG_variable)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x1de): __tzname
    <4ae>   DW_AT_decl_file   : 12
    <4af>   DW_AT_decl_line   : 159
    <4b0>   DW_AT_decl_column : 14
    <4b1>   DW_AT_type        : <0x499>
    <4b5>   DW_AT_external    : 1
    <4b6>   DW_AT_declaration : 1
 <1><4b7>: Abbrev Number: 11 (DW_TAG_variable)
    <4b8>   DW_AT_name        : (indirect string, offset: 0xf52): __daylight
    <4bc>   DW_AT_decl_file   : 12
    <4bd>   DW_AT_decl_line   : 160
    <4be>   DW_AT_decl_column : 12
    <4bf>   DW_AT_type        : <0x64>
    <4c3>   DW_AT_external    : 1
    <4c4>   DW_AT_declaration : 1
 <1><4c5>: Abbrev Number: 11 (DW_TAG_variable)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x38e): __timezone
    <4ca>   DW_AT_decl_file   : 12
    <4cb>   DW_AT_decl_line   : 161
    <4cc>   DW_AT_decl_column : 17
    <4cd>   DW_AT_type        : <0x127>
    <4d1>   DW_AT_external    : 1
    <4d2>   DW_AT_declaration : 1
 <1><4d3>: Abbrev Number: 11 (DW_TAG_variable)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xa30): tzname
    <4d8>   DW_AT_decl_file   : 12
    <4d9>   DW_AT_decl_line   : 166
    <4da>   DW_AT_decl_column : 14
    <4db>   DW_AT_type        : <0x499>
    <4df>   DW_AT_external    : 1
    <4e0>   DW_AT_declaration : 1
 <1><4e1>: Abbrev Number: 11 (DW_TAG_variable)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x1140): daylight
    <4e6>   DW_AT_decl_file   : 12
    <4e7>   DW_AT_decl_line   : 174
    <4e8>   DW_AT_decl_column : 12
    <4e9>   DW_AT_type        : <0x64>
    <4ed>   DW_AT_external    : 1
    <4ee>   DW_AT_declaration : 1
 <1><4ef>: Abbrev Number: 11 (DW_TAG_variable)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x520): timezone
    <4f4>   DW_AT_decl_file   : 12
    <4f5>   DW_AT_decl_line   : 175
    <4f6>   DW_AT_decl_column : 17
    <4f7>   DW_AT_type        : <0x127>
    <4fb>   DW_AT_external    : 1
    <4fc>   DW_AT_declaration : 1
 <1><4fd>: Abbrev Number: 10 (DW_TAG_variable)
    <4fe>   DW_AT_name        : (indirect string, offset: 0xff8): getdate_err
    <502>   DW_AT_decl_file   : 12
    <503>   DW_AT_decl_line   : 274
    <505>   DW_AT_decl_column : 12
    <506>   DW_AT_type        : <0x64>
    <50a>   DW_AT_external    : 1
    <50b>   DW_AT_declaration : 1
 <1><50c>: Abbrev Number: 11 (DW_TAG_variable)
    <50d>   DW_AT_name        : (indirect string, offset: 0xa43): debug_flag
    <511>   DW_AT_decl_file   : 13
    <512>   DW_AT_decl_line   : 20
    <513>   DW_AT_decl_column : 13
    <514>   DW_AT_type        : <0x51a>
    <518>   DW_AT_external    : 1
    <519>   DW_AT_declaration : 1
 <1><51a>: Abbrev Number: 2 (DW_TAG_base_type)
    <51b>   DW_AT_byte_size   : 1
    <51c>   DW_AT_encoding    : 2	(boolean)
    <51d>   DW_AT_name        : (indirect string, offset: 0x459): _Bool
 <1><521>: Abbrev Number: 3 (DW_TAG_const_type)
    <522>   DW_AT_type        : <0x51a>
 <1><526>: Abbrev Number: 4 (DW_TAG_typedef)
    <527>   DW_AT_name        : (indirect string, offset: 0xb19): __kernel_long_t
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 14
    <52d>   DW_AT_decl_column : 19
    <52e>   DW_AT_type        : <0x88>
 <1><532>: Abbrev Number: 4 (DW_TAG_typedef)
    <533>   DW_AT_name        : (indirect string, offset: 0x609): __kernel_ulong_t
    <537>   DW_AT_decl_file   : 14
    <538>   DW_AT_decl_line   : 15
    <539>   DW_AT_decl_column : 28
    <53a>   DW_AT_type        : <0x9b>
 <1><53e>: Abbrev Number: 4 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x40d): kernel_long_t
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 16
    <545>   DW_AT_decl_column : 25
    <546>   DW_AT_type        : <0x526>
 <1><54a>: Abbrev Number: 4 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0x904): kernel_ulong_t
    <54f>   DW_AT_decl_file   : 15
    <550>   DW_AT_decl_line   : 17
    <551>   DW_AT_decl_column : 26
    <552>   DW_AT_type        : <0x532>
 <1><556>: Abbrev Number: 3 (DW_TAG_const_type)
    <557>   DW_AT_type        : <0x54a>
 <1><55b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <55c>   DW_AT_name        : (indirect string, offset: 0xc63): list_item
    <560>   DW_AT_byte_size   : 8
    <561>   DW_AT_decl_file   : 16
    <562>   DW_AT_decl_line   : 92
    <563>   DW_AT_decl_column : 8
    <564>   DW_AT_sibling     : <0x587>
 <2><568>: Abbrev Number: 9 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x1185): prev
    <56d>   DW_AT_decl_file   : 16
    <56e>   DW_AT_decl_line   : 93
    <56f>   DW_AT_decl_column : 20
    <570>   DW_AT_type        : <0x587>
    <574>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><577>: Abbrev Number: 9 (DW_TAG_member)
    <578>   DW_AT_name        : (indirect string, offset: 0x117b): next
    <57c>   DW_AT_decl_file   : 16
    <57d>   DW_AT_decl_line   : 94
    <57e>   DW_AT_decl_column : 20
    <57f>   DW_AT_type        : <0x587>
    <583>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><586>: Abbrev Number: 0
 <1><587>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <588>   DW_AT_byte_size   : 4
    <589>   DW_AT_type        : <0x55b>
 <1><58d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <58e>   DW_AT_name        : (indirect string, offset: 0x8dc): sysent
    <592>   DW_AT_byte_size   : 20
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 13
    <595>   DW_AT_decl_column : 16
    <596>   DW_AT_sibling     : <0x5e6>
 <2><59a>: Abbrev Number: 9 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x10dc): nargs
    <59f>   DW_AT_decl_file   : 17
    <5a0>   DW_AT_decl_line   : 14
    <5a1>   DW_AT_decl_column : 11
    <5a2>   DW_AT_type        : <0x2b>
    <5a6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a9>: Abbrev Number: 9 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0x9e6): sys_flags
    <5ae>   DW_AT_decl_file   : 17
    <5af>   DW_AT_decl_line   : 15
    <5b0>   DW_AT_decl_column : 6
    <5b1>   DW_AT_type        : <0x64>
    <5b5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b8>: Abbrev Number: 18 (DW_TAG_member)
    <5b9>   DW_AT_name        : sen
    <5bd>   DW_AT_decl_file   : 17
    <5be>   DW_AT_decl_line   : 16
    <5bf>   DW_AT_decl_column : 6
    <5c0>   DW_AT_type        : <0x64>
    <5c4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5c7>: Abbrev Number: 9 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0x31c): sys_func
    <5cc>   DW_AT_decl_file   : 17
    <5cd>   DW_AT_decl_line   : 17
    <5ce>   DW_AT_decl_column : 8
    <5cf>   DW_AT_type        : <0x864>
    <5d3>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5d6>: Abbrev Number: 9 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x291): sys_name
    <5db>   DW_AT_decl_file   : 17
    <5dc>   DW_AT_decl_line   : 18
    <5dd>   DW_AT_decl_column : 14
    <5de>   DW_AT_type        : <0x1ce>
    <5e2>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e5>: Abbrev Number: 0
 <1><5e6>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5e7>   DW_AT_prototyped  : 1
    <5e8>   DW_AT_type        : <0x64>
    <5ec>   DW_AT_sibling     : <0x5f6>
 <2><5f0>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5f1>   DW_AT_type        : <0x5f6>
 <2><5f5>: Abbrev Number: 0
 <1><5f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5f7>   DW_AT_byte_size   : 4
    <5f8>   DW_AT_type        : <0x601>
 <1><5fc>: Abbrev Number: 3 (DW_TAG_const_type)
    <5fd>   DW_AT_type        : <0x5f6>
 <1><601>: Abbrev Number: 21 (DW_TAG_structure_type)
    <602>   DW_AT_name        : tcb
    <606>   DW_AT_byte_size   : 304
    <608>   DW_AT_decl_file   : 18
    <609>   DW_AT_decl_line   : 262
    <60b>   DW_AT_decl_column : 8
    <60c>   DW_AT_sibling     : <0x864>
 <2><610>: Abbrev Number: 22 (DW_TAG_member)
    <611>   DW_AT_name        : (indirect string, offset: 0x52f): flags
    <615>   DW_AT_decl_file   : 18
    <616>   DW_AT_decl_line   : 263
    <618>   DW_AT_decl_column : 6
    <619>   DW_AT_type        : <0x64>
    <61d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><620>: Abbrev Number: 23 (DW_TAG_member)
    <621>   DW_AT_name        : pid
    <625>   DW_AT_decl_file   : 18
    <626>   DW_AT_decl_line   : 264
    <628>   DW_AT_decl_column : 6
    <629>   DW_AT_type        : <0x64>
    <62d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><630>: Abbrev Number: 22 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x58): qual_flg
    <635>   DW_AT_decl_file   : 18
    <636>   DW_AT_decl_line   : 265
    <638>   DW_AT_decl_column : 6
    <639>   DW_AT_type        : <0x64>
    <63d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><640>: Abbrev Number: 22 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x3c0): currpers
    <645>   DW_AT_decl_file   : 18
    <646>   DW_AT_decl_line   : 267
    <648>   DW_AT_decl_column : 15
    <649>   DW_AT_type        : <0x2b>
    <64d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><650>: Abbrev Number: 22 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0xbb6): u_error
    <655>   DW_AT_decl_file   : 18
    <656>   DW_AT_decl_line   : 269
    <658>   DW_AT_decl_column : 16
    <659>   DW_AT_type        : <0x37>
    <65d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><660>: Abbrev Number: 22 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x1be): scno
    <665>   DW_AT_decl_file   : 18
    <666>   DW_AT_decl_line   : 270
    <668>   DW_AT_decl_column : 17
    <669>   DW_AT_type        : <0x54a>
    <66d>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><670>: Abbrev Number: 22 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0xbfb): true_scno
    <675>   DW_AT_decl_file   : 18
    <676>   DW_AT_decl_line   : 271
    <678>   DW_AT_decl_column : 17
    <679>   DW_AT_type        : <0x54a>
    <67d>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><680>: Abbrev Number: 22 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x1c8): u_arg
    <685>   DW_AT_decl_file   : 18
    <686>   DW_AT_decl_line   : 272
    <688>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x994>
    <68d>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><690>: Abbrev Number: 22 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x9fd): u_rval
    <695>   DW_AT_decl_file   : 18
    <696>   DW_AT_decl_line   : 273
    <698>   DW_AT_decl_column : 16
    <699>   DW_AT_type        : <0x53e>
    <69d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6a0>: Abbrev Number: 22 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0xb35): sys_func_rval
    <6a5>   DW_AT_decl_file   : 18
    <6a6>   DW_AT_decl_line   : 274
    <6a8>   DW_AT_decl_column : 6
    <6a9>   DW_AT_type        : <0x64>
    <6ad>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6b0>: Abbrev Number: 22 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0xd7c): curcol
    <6b5>   DW_AT_decl_file   : 18
    <6b6>   DW_AT_decl_line   : 275
    <6b8>   DW_AT_decl_column : 6
    <6b9>   DW_AT_type        : <0x64>
    <6bd>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6c0>: Abbrev Number: 22 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xa0f): outf
    <6c5>   DW_AT_decl_file   : 18
    <6c6>   DW_AT_decl_line   : 276
    <6c8>   DW_AT_decl_column : 8
    <6c9>   DW_AT_type        : <0x413>
    <6cd>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xf91): staged_output_data
    <6d5>   DW_AT_decl_file   : 18
    <6d6>   DW_AT_decl_line   : 277
    <6d8>   DW_AT_decl_column : 29
    <6d9>   DW_AT_type        : <0x9aa>
    <6dd>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6e0>: Abbrev Number: 22 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xb00): auxstr
    <6e5>   DW_AT_decl_file   : 18
    <6e6>   DW_AT_decl_line   : 279
    <6e8>   DW_AT_decl_column : 14
    <6e9>   DW_AT_type        : <0x1ce>
    <6ed>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6f0>: Abbrev Number: 22 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x190): _priv_data
    <6f5>   DW_AT_decl_file   : 18
    <6f6>   DW_AT_decl_line   : 280
    <6f8>   DW_AT_decl_column : 8
    <6f9>   DW_AT_type        : <0xc6>
    <6fd>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><700>: Abbrev Number: 22 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0xc90): _free_priv_data
    <705>   DW_AT_decl_file   : 18
    <706>   DW_AT_decl_line   : 281
    <708>   DW_AT_decl_column : 9
    <709>   DW_AT_type        : <0x9bc>
    <70d>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><710>: Abbrev Number: 22 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0x1a1): s_ent
    <715>   DW_AT_decl_file   : 18
    <716>   DW_AT_decl_line   : 282
    <718>   DW_AT_decl_column : 23
    <719>   DW_AT_type        : <0x9c2>
    <71d>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><720>: Abbrev Number: 22 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <725>   DW_AT_decl_file   : 18
    <726>   DW_AT_decl_line   : 285
    <728>   DW_AT_decl_column : 23
    <729>   DW_AT_type        : <0x9c2>
    <72d>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><731>: Abbrev Number: 22 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x3b5): inject_vec
    <736>   DW_AT_decl_file   : 18
    <737>   DW_AT_decl_line   : 286
    <739>   DW_AT_decl_column : 22
    <73a>   DW_AT_type        : <0x9cd>
    <73e>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x83e): stime
    <747>   DW_AT_decl_file   : 18
    <748>   DW_AT_decl_line   : 287
    <74a>   DW_AT_decl_column : 18
    <74b>   DW_AT_type        : <0x13f>
    <74f>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><753>: Abbrev Number: 22 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x3c9): ltime
    <758>   DW_AT_decl_file   : 18
    <759>   DW_AT_decl_line   : 288
    <75b>   DW_AT_decl_column : 18
    <75c>   DW_AT_type        : <0x13f>
    <760>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><764>: Abbrev Number: 22 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x109d): atime
    <769>   DW_AT_decl_file   : 18
    <76a>   DW_AT_decl_line   : 289
    <76c>   DW_AT_decl_column : 18
    <76d>   DW_AT_type        : <0x13f>
    <771>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><775>: Abbrev Number: 22 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0x529): etime
    <77a>   DW_AT_decl_file   : 18
    <77b>   DW_AT_decl_line   : 290
    <77d>   DW_AT_decl_column : 18
    <77e>   DW_AT_type        : <0x13f>
    <782>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><786>: Abbrev Number: 22 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0xde0): delay_expiration_time
    <78b>   DW_AT_decl_file   : 18
    <78c>   DW_AT_decl_line   : 291
    <78e>   DW_AT_decl_column : 18
    <78f>   DW_AT_type        : <0x13f>
    <793>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><797>: Abbrev Number: 22 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <79c>   DW_AT_decl_file   : 18
    <79d>   DW_AT_decl_line   : 298
    <79f>   DW_AT_decl_column : 15
    <7a0>   DW_AT_type        : <0x2b>
    <7a4>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7a8>: Abbrev Number: 22 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0xfd5): last_dirfd
    <7ad>   DW_AT_decl_file   : 18
    <7ae>   DW_AT_decl_line   : 301
    <7b0>   DW_AT_decl_column : 6
    <7b1>   DW_AT_type        : <0x64>
    <7b5>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7b9>: Abbrev Number: 22 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x100d): mmap_cache
    <7be>   DW_AT_decl_file   : 18
    <7bf>   DW_AT_decl_line   : 304
    <7c1>   DW_AT_decl_column : 23
    <7c2>   DW_AT_type        : <0x9e9>
    <7c6>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ca>: Abbrev Number: 22 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xbc5): wait_data_idx
    <7cf>   DW_AT_decl_file   : 18
    <7d0>   DW_AT_decl_line   : 311
    <7d2>   DW_AT_decl_column : 9
    <7d3>   DW_AT_type        : <0x12e>
    <7d7>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7db>: Abbrev Number: 22 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xb07): delayed_wait_data
    <7e0>   DW_AT_decl_file   : 18
    <7e1>   DW_AT_decl_line   : 313
    <7e3>   DW_AT_decl_column : 24
    <7e4>   DW_AT_type        : <0x9f5>
    <7e8>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7ec>: Abbrev Number: 22 (DW_TAG_member)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xb77): wait_list
    <7f1>   DW_AT_decl_file   : 18
    <7f2>   DW_AT_decl_line   : 314
    <7f4>   DW_AT_decl_column : 19
    <7f5>   DW_AT_type        : <0x55b>
    <7f9>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><7fd>: Abbrev Number: 22 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x731): vcpu_info_list
    <802>   DW_AT_decl_file   : 18
    <803>   DW_AT_decl_line   : 318
    <805>   DW_AT_decl_column : 20
    <806>   DW_AT_type        : <0xa01>
    <80a>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0xd3f): unwind_ctx
    <813>   DW_AT_decl_file   : 18
    <814>   DW_AT_decl_line   : 322
    <816>   DW_AT_decl_column : 8
    <817>   DW_AT_type        : <0xc6>
    <81b>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><81f>: Abbrev Number: 22 (DW_TAG_member)
    <820>   DW_AT_name        : (indirect string, offset: 0x513): unwind_queue
    <824>   DW_AT_decl_file   : 18
    <825>   DW_AT_decl_line   : 323
    <827>   DW_AT_decl_column : 25
    <828>   DW_AT_type        : <0xa0d>
    <82c>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><830>: Abbrev Number: 22 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x185): comm
    <835>   DW_AT_decl_file   : 18
    <836>   DW_AT_decl_line   : 327
    <838>   DW_AT_decl_column : 7
    <839>   DW_AT_type        : <0xa13>
    <83d>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><841>: Abbrev Number: 22 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x244): start_prc
    <846>   DW_AT_decl_file   : 18
    <847>   DW_AT_decl_line   : 329
    <849>   DW_AT_decl_column : 16
    <84a>   DW_AT_type        : <0x37>
    <84e>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><852>: Abbrev Number: 22 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0x1068): pre_comm
    <857>   DW_AT_decl_file   : 18
    <858>   DW_AT_decl_line   : 330
    <85a>   DW_AT_decl_column : 7
    <85b>   DW_AT_type        : <0xa13>
    <85f>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><863>: Abbrev Number: 0
 <1><864>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <865>   DW_AT_byte_size   : 4
    <866>   DW_AT_type        : <0x5e6>
 <1><86a>: Abbrev Number: 4 (DW_TAG_typedef)
    <86b>   DW_AT_name        : (indirect string, offset: 0x5fb): struct_sysent
    <86f>   DW_AT_decl_file   : 17
    <870>   DW_AT_decl_line   : 19
    <871>   DW_AT_decl_column : 3
    <872>   DW_AT_type        : <0x58d>
 <1><876>: Abbrev Number: 3 (DW_TAG_const_type)
    <877>   DW_AT_type        : <0x86a>
 <1><87b>: Abbrev Number: 11 (DW_TAG_variable)
    <87c>   DW_AT_name        : (indirect string, offset: 0xdcc): current_personality
    <880>   DW_AT_decl_file   : 18
    <881>   DW_AT_decl_line   : 158
    <882>   DW_AT_decl_column : 17
    <883>   DW_AT_type        : <0x2b>
    <887>   DW_AT_external    : 1
    <888>   DW_AT_declaration : 1
 <1><889>: Abbrev Number: 11 (DW_TAG_variable)
    <88a>   DW_AT_name        : (indirect string, offset: 0x87e): current_wordsize
    <88e>   DW_AT_decl_file   : 18
    <88f>   DW_AT_decl_line   : 171
    <890>   DW_AT_decl_column : 17
    <891>   DW_AT_type        : <0x2b>
    <895>   DW_AT_external    : 1
    <896>   DW_AT_declaration : 1
 <1><897>: Abbrev Number: 11 (DW_TAG_variable)
    <898>   DW_AT_name        : (indirect string, offset: 0xad4): current_klongsize
    <89c>   DW_AT_decl_file   : 18
    <89d>   DW_AT_decl_line   : 176
    <89e>   DW_AT_decl_column : 17
    <89f>   DW_AT_type        : <0x2b>
    <8a3>   DW_AT_external    : 1
    <8a4>   DW_AT_declaration : 1
 <1><8a5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xd16): ioctlent
    <8aa>   DW_AT_byte_size   : 8
    <8ab>   DW_AT_decl_file   : 18
    <8ac>   DW_AT_decl_line   : 217
    <8ad>   DW_AT_decl_column : 16
    <8ae>   DW_AT_sibling     : <0x8d1>
 <2><8b2>: Abbrev Number: 9 (DW_TAG_member)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xfb9): symbol
    <8b7>   DW_AT_decl_file   : 18
    <8b8>   DW_AT_decl_line   : 218
    <8b9>   DW_AT_decl_column : 14
    <8ba>   DW_AT_type        : <0x1ce>
    <8be>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c1>: Abbrev Number: 9 (DW_TAG_member)
    <8c2>   DW_AT_name        : (indirect string, offset: 0xd95): code
    <8c6>   DW_AT_decl_file   : 18
    <8c7>   DW_AT_decl_line   : 219
    <8c8>   DW_AT_decl_column : 15
    <8c9>   DW_AT_type        : <0x2b>
    <8cd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d0>: Abbrev Number: 0
 <1><8d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d2>   DW_AT_name        : (indirect string, offset: 0xcc2): struct_ioctlent
    <8d6>   DW_AT_decl_file   : 18
    <8d7>   DW_AT_decl_line   : 220
    <8d8>   DW_AT_decl_column : 3
    <8d9>   DW_AT_type        : <0x8a5>
 <1><8dd>: Abbrev Number: 3 (DW_TAG_const_type)
    <8de>   DW_AT_type        : <0x8d1>
 <1><8e2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x872): inject_data
    <8e7>   DW_AT_byte_size   : 10
    <8e8>   DW_AT_decl_file   : 18
    <8e9>   DW_AT_decl_line   : 241
    <8ea>   DW_AT_decl_column : 8
    <8eb>   DW_AT_sibling     : <0x94a>
 <2><8ef>: Abbrev Number: 9 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x52f): flags
    <8f4>   DW_AT_decl_file   : 18
    <8f5>   DW_AT_decl_line   : 242
    <8f6>   DW_AT_decl_column : 10
    <8f7>   DW_AT_type        : <0xf7>
    <8fb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8fe>: Abbrev Number: 9 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x991): signo
    <903>   DW_AT_decl_file   : 18
    <904>   DW_AT_decl_line   : 243
    <905>   DW_AT_decl_column : 10
    <906>   DW_AT_type        : <0xf7>
    <90a>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><90d>: Abbrev Number: 9 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x117): rval_idx
    <912>   DW_AT_decl_file   : 18
    <913>   DW_AT_decl_line   : 244
    <914>   DW_AT_decl_column : 11
    <915>   DW_AT_type        : <0x103>
    <919>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><91c>: Abbrev Number: 9 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0xd6a): delay_idx
    <921>   DW_AT_decl_file   : 18
    <922>   DW_AT_decl_line   : 245
    <923>   DW_AT_decl_column : 11
    <924>   DW_AT_type        : <0x103>
    <928>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><92b>: Abbrev Number: 9 (DW_TAG_member)
    <92c>   DW_AT_name        : (indirect string, offset: 0x655): poke_idx
    <930>   DW_AT_decl_file   : 18
    <931>   DW_AT_decl_line   : 246
    <932>   DW_AT_decl_column : 11
    <933>   DW_AT_type        : <0x103>
    <937>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><93a>: Abbrev Number: 9 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0x1be): scno
    <93f>   DW_AT_decl_file   : 18
    <940>   DW_AT_decl_line   : 247
    <941>   DW_AT_decl_column : 11
    <942>   DW_AT_type        : <0x103>
    <946>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><949>: Abbrev Number: 0
 <1><94a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <94b>   DW_AT_name        : (indirect string, offset: 0xf8): inject_opts
    <94f>   DW_AT_byte_size   : 16
    <950>   DW_AT_decl_file   : 18
    <951>   DW_AT_decl_line   : 250
    <952>   DW_AT_decl_column : 8
    <953>   DW_AT_sibling     : <0x994>
 <2><957>: Abbrev Number: 9 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0xa93): first
    <95c>   DW_AT_decl_file   : 18
    <95d>   DW_AT_decl_line   : 251
    <95e>   DW_AT_decl_column : 11
    <95f>   DW_AT_type        : <0x103>
    <963>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><966>: Abbrev Number: 9 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x11ae): last
    <96b>   DW_AT_decl_file   : 18
    <96c>   DW_AT_decl_line   : 252
    <96d>   DW_AT_decl_column : 11
    <96e>   DW_AT_type        : <0x103>
    <972>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><975>: Abbrev Number: 9 (DW_TAG_member)
    <976>   DW_AT_name        : (indirect string, offset: 0x3cf): step
    <97a>   DW_AT_decl_file   : 18
    <97b>   DW_AT_decl_line   : 253
    <97c>   DW_AT_decl_column : 11
    <97d>   DW_AT_type        : <0x103>
    <981>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><984>: Abbrev Number: 9 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x1180): data
    <989>   DW_AT_decl_file   : 18
    <98a>   DW_AT_decl_line   : 254
    <98b>   DW_AT_decl_column : 21
    <98c>   DW_AT_type        : <0x8e2>
    <990>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><993>: Abbrev Number: 0
 <1><994>: Abbrev Number: 15 (DW_TAG_array_type)
    <995>   DW_AT_type        : <0x54a>
    <999>   DW_AT_sibling     : <0x9a4>
 <2><99d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <99e>   DW_AT_type        : <0x2b>
    <9a2>   DW_AT_upper_bound : 5
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9a5>   DW_AT_name        : (indirect string, offset: 0xf91): staged_output_data
    <9a9>   DW_AT_declaration : 1
 <1><9aa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ab>   DW_AT_byte_size   : 4
    <9ac>   DW_AT_type        : <0x9a4>
 <1><9b0>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b1>   DW_AT_prototyped  : 1
    <9b2>   DW_AT_sibling     : <0x9bc>
 <2><9b6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9b7>   DW_AT_type        : <0xc6>
 <2><9bb>: Abbrev Number: 0
 <1><9bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bd>   DW_AT_byte_size   : 4
    <9be>   DW_AT_type        : <0x9b0>
 <1><9c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c3>   DW_AT_byte_size   : 4
    <9c4>   DW_AT_type        : <0x876>
 <1><9c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c9>   DW_AT_type        : <0x9c2>
 <1><9cd>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ce>   DW_AT_type        : <0x9dd>
    <9d2>   DW_AT_sibling     : <0x9dd>
 <2><9d6>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9d7>   DW_AT_type        : <0x2b>
    <9db>   DW_AT_upper_bound : 2
 <2><9dc>: Abbrev Number: 0
 <1><9dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9de>   DW_AT_byte_size   : 4
    <9df>   DW_AT_type        : <0x94a>
 <1><9e3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e4>   DW_AT_name        : (indirect string, offset: 0xc4): mmap_cache_t
    <9e8>   DW_AT_declaration : 1
 <1><9e9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ea>   DW_AT_byte_size   : 4
    <9eb>   DW_AT_type        : <0x9e3>
 <1><9ef>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x3ea): tcb_wait_data
    <9f4>   DW_AT_declaration : 1
 <1><9f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f6>   DW_AT_byte_size   : 4
    <9f7>   DW_AT_type        : <0x9ef>
 <1><9fb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x17b): vcpu_info
    <a00>   DW_AT_declaration : 1
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9fb>
 <1><a07>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a08>   DW_AT_name        : (indirect string, offset: 0xf75): unwind_queue_t
    <a0c>   DW_AT_declaration : 1
 <1><a0d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0xa07>
 <1><a13>: Abbrev Number: 15 (DW_TAG_array_type)
    <a14>   DW_AT_type        : <0xeb>
    <a18>   DW_AT_sibling     : <0xa23>
 <2><a1c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a1d>   DW_AT_type        : <0x2b>
    <a21>   DW_AT_upper_bound : 15
 <2><a22>: Abbrev Number: 0
 <1><a23>: Abbrev Number: 10 (DW_TAG_variable)
    <a24>   DW_AT_name        : (indirect string, offset: 0xc0e): stub_sysent
    <a28>   DW_AT_decl_file   : 18
    <a29>   DW_AT_decl_line   : 405
    <a2b>   DW_AT_decl_column : 28
    <a2c>   DW_AT_type        : <0x876>
    <a30>   DW_AT_external    : 1
    <a31>   DW_AT_declaration : 1
 <1><a32>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a33>   DW_AT_name        : (indirect string, offset: 0x1163): xlat_type
    <a37>   DW_AT_encoding    : 7	(unsigned)
    <a38>   DW_AT_byte_size   : 4
    <a39>   DW_AT_type        : <0x2b>
    <a3d>   DW_AT_decl_file   : 19
    <a3e>   DW_AT_decl_line   : 13
    <a3f>   DW_AT_decl_column : 6
    <a40>   DW_AT_sibling     : <0xa57>
 <2><a44>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a45>   DW_AT_name        : (indirect string, offset: 0x2ec): XT_NORMAL
    <a49>   DW_AT_const_value : 0
 <2><a4a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4b>   DW_AT_name        : (indirect string, offset: 0xce5): XT_SORTED
    <a4f>   DW_AT_const_value : 1
 <2><a50>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a51>   DW_AT_name        : (indirect string, offset: 0xe64): XT_INDEXED
    <a55>   DW_AT_const_value : 2
 <2><a56>: Abbrev Number: 0
 <1><a57>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a58>   DW_AT_name        : (indirect string, offset: 0xc3a): xlat_style
    <a5c>   DW_AT_encoding    : 7	(unsigned)
    <a5d>   DW_AT_byte_size   : 4
    <a5e>   DW_AT_type        : <0x2b>
    <a62>   DW_AT_decl_file   : 19
    <a63>   DW_AT_decl_line   : 19
    <a64>   DW_AT_decl_column : 6
    <a65>   DW_AT_sibling     : <0xa94>
 <2><a69>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x104): XLAT_STYLE_DEFAULT
    <a6e>   DW_AT_const_value : 0
 <2><a6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0xc6d): XLAT_STYLE_RAW
    <a74>   DW_AT_const_value : 1
 <2><a75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x112e): XLAT_STYLE_ABBREV
    <a7a>   DW_AT_const_value : 2
 <2><a7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x309): XLAT_STYLE_VERBOSE
    <a80>   DW_AT_const_value : 3
 <2><a81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a86>   DW_AT_const_value : 0
 <2><a87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a8c>   DW_AT_const_value : 4
 <2><a8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x119d): XLAT_STYLE_FMT_D
    <a92>   DW_AT_const_value : 8
 <2><a93>: Abbrev Number: 0
 <1><a94>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a95>   DW_AT_name        : (indirect string, offset: 0x344): xlat_data
    <a99>   DW_AT_byte_size   : 16
    <a9a>   DW_AT_decl_file   : 19
    <a9b>   DW_AT_decl_line   : 51
    <a9c>   DW_AT_decl_column : 8
    <a9d>   DW_AT_sibling     : <0xac0>
 <2><aa1>: Abbrev Number: 18 (DW_TAG_member)
    <aa2>   DW_AT_name        : val
    <aa6>   DW_AT_decl_file   : 19
    <aa7>   DW_AT_decl_line   : 52
    <aa8>   DW_AT_decl_column : 11
    <aa9>   DW_AT_type        : <0x11b>
    <aad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab0>: Abbrev Number: 18 (DW_TAG_member)
    <ab1>   DW_AT_name        : str
    <ab5>   DW_AT_decl_file   : 19
    <ab6>   DW_AT_decl_line   : 53
    <ab7>   DW_AT_decl_column : 14
    <ab8>   DW_AT_type        : <0x1ce>
    <abc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><abf>: Abbrev Number: 0
 <1><ac0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac1>   DW_AT_type        : <0xa94>
 <1><ac5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aca>   DW_AT_byte_size   : 24
    <acb>   DW_AT_decl_file   : 19
    <acc>   DW_AT_decl_line   : 56
    <acd>   DW_AT_decl_column : 8
    <ace>   DW_AT_sibling     : <0xb1e>
 <2><ad2>: Abbrev Number: 9 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x1180): data
    <ad7>   DW_AT_decl_file   : 19
    <ad8>   DW_AT_decl_line   : 57
    <ad9>   DW_AT_decl_column : 26
    <ada>   DW_AT_type        : <0xb23>
    <ade>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae1>: Abbrev Number: 9 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x8d0): flags_strsz
    <ae6>   DW_AT_decl_file   : 19
    <ae7>   DW_AT_decl_line   : 58
    <ae8>   DW_AT_decl_column : 9
    <ae9>   DW_AT_type        : <0x12e>
    <aed>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af0>: Abbrev Number: 9 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0xbd3): size
    <af5>   DW_AT_decl_file   : 19
    <af6>   DW_AT_decl_line   : 59
    <af7>   DW_AT_decl_column : 11
    <af8>   DW_AT_type        : <0x10f>
    <afc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aff>: Abbrev Number: 9 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0x1c3): type
    <b04>   DW_AT_decl_file   : 19
    <b05>   DW_AT_decl_line   : 60
    <b06>   DW_AT_decl_column : 17
    <b07>   DW_AT_type        : <0xa32>
    <b0b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b0e>: Abbrev Number: 9 (DW_TAG_member)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x785): flags_mask
    <b13>   DW_AT_decl_file   : 19
    <b14>   DW_AT_decl_line   : 61
    <b15>   DW_AT_decl_column : 11
    <b16>   DW_AT_type        : <0x11b>
    <b1a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b1d>: Abbrev Number: 0
 <1><b1e>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1f>   DW_AT_type        : <0xac5>
 <1><b23>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b24>   DW_AT_byte_size   : 4
    <b25>   DW_AT_type        : <0xac0>
 <1><b29>: Abbrev Number: 15 (DW_TAG_array_type)
    <b2a>   DW_AT_type        : <0xb1e>
    <b2e>   DW_AT_sibling     : <0xb34>
 <2><b32>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b33>: Abbrev Number: 0
 <1><b34>: Abbrev Number: 3 (DW_TAG_const_type)
    <b35>   DW_AT_type        : <0xb29>
 <1><b39>: Abbrev Number: 10 (DW_TAG_variable)
    <b3a>   DW_AT_name        : (indirect string, offset: 0xed2): addrfams
    <b3e>   DW_AT_decl_file   : 18
    <b3f>   DW_AT_decl_line   : 411
    <b41>   DW_AT_decl_column : 26
    <b42>   DW_AT_type        : <0xb34>
    <b46>   DW_AT_external    : 1
    <b47>   DW_AT_declaration : 1
 <1><b48>: Abbrev Number: 10 (DW_TAG_variable)
    <b49>   DW_AT_name        : (indirect string, offset: 0xda5): arp_hardware_types
    <b4d>   DW_AT_decl_file   : 18
    <b4e>   DW_AT_decl_line   : 412
    <b50>   DW_AT_decl_column : 26
    <b51>   DW_AT_type        : <0xb34>
    <b55>   DW_AT_external    : 1
    <b56>   DW_AT_declaration : 1
 <1><b57>: Abbrev Number: 10 (DW_TAG_variable)
    <b58>   DW_AT_name        : (indirect string, offset: 0x10a3): at_flags
    <b5c>   DW_AT_decl_file   : 18
    <b5d>   DW_AT_decl_line   : 413
    <b5f>   DW_AT_decl_column : 26
    <b60>   DW_AT_type        : <0xb34>
    <b64>   DW_AT_external    : 1
    <b65>   DW_AT_declaration : 1
 <1><b66>: Abbrev Number: 10 (DW_TAG_variable)
    <b67>   DW_AT_name        : (indirect string, offset: 0x4f1): clocknames
    <b6b>   DW_AT_decl_file   : 18
    <b6c>   DW_AT_decl_line   : 414
    <b6e>   DW_AT_decl_column : 26
    <b6f>   DW_AT_type        : <0xb34>
    <b73>   DW_AT_external    : 1
    <b74>   DW_AT_declaration : 1
 <1><b75>: Abbrev Number: 10 (DW_TAG_variable)
    <b76>   DW_AT_name        : (indirect string, offset: 0x105b): dirent_types
    <b7a>   DW_AT_decl_file   : 18
    <b7b>   DW_AT_decl_line   : 415
    <b7d>   DW_AT_decl_column : 26
    <b7e>   DW_AT_type        : <0xb34>
    <b82>   DW_AT_external    : 1
    <b83>   DW_AT_declaration : 1
 <1><b84>: Abbrev Number: 10 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x921): ethernet_protocols
    <b89>   DW_AT_decl_file   : 18
    <b8a>   DW_AT_decl_line   : 416
    <b8c>   DW_AT_decl_column : 26
    <b8d>   DW_AT_type        : <0xb34>
    <b91>   DW_AT_external    : 1
    <b92>   DW_AT_declaration : 1
 <1><b93>: Abbrev Number: 10 (DW_TAG_variable)
    <b94>   DW_AT_name        : (indirect string, offset: 0x6a8): inet_protocols
    <b98>   DW_AT_decl_file   : 18
    <b99>   DW_AT_decl_line   : 417
    <b9b>   DW_AT_decl_column : 26
    <b9c>   DW_AT_type        : <0xb34>
    <ba0>   DW_AT_external    : 1
    <ba1>   DW_AT_declaration : 1
 <1><ba2>: Abbrev Number: 10 (DW_TAG_variable)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x2d9): evdev_abs
    <ba7>   DW_AT_decl_file   : 18
    <ba8>   DW_AT_decl_line   : 418
    <baa>   DW_AT_decl_column : 26
    <bab>   DW_AT_type        : <0xb34>
    <baf>   DW_AT_external    : 1
    <bb0>   DW_AT_declaration : 1
 <1><bb1>: Abbrev Number: 10 (DW_TAG_variable)
    <bb2>   DW_AT_name        : (indirect string, offset: 0x77a): audit_arch
    <bb6>   DW_AT_decl_file   : 18
    <bb7>   DW_AT_decl_line   : 419
    <bb9>   DW_AT_decl_column : 26
    <bba>   DW_AT_type        : <0xb34>
    <bbe>   DW_AT_external    : 1
    <bbf>   DW_AT_declaration : 1
 <1><bc0>: Abbrev Number: 10 (DW_TAG_variable)
    <bc1>   DW_AT_name        : (indirect string, offset: 0xb0): evdev_ev
    <bc5>   DW_AT_decl_file   : 18
    <bc6>   DW_AT_decl_line   : 420
    <bc8>   DW_AT_decl_column : 26
    <bc9>   DW_AT_type        : <0xb34>
    <bcd>   DW_AT_external    : 1
    <bce>   DW_AT_declaration : 1
 <1><bcf>: Abbrev Number: 10 (DW_TAG_variable)
    <bd0>   DW_AT_name        : (indirect string, offset: 0x4bc): iffflags
    <bd4>   DW_AT_decl_file   : 18
    <bd5>   DW_AT_decl_line   : 421
    <bd7>   DW_AT_decl_column : 26
    <bd8>   DW_AT_type        : <0xb34>
    <bdc>   DW_AT_external    : 1
    <bdd>   DW_AT_declaration : 1
 <1><bde>: Abbrev Number: 10 (DW_TAG_variable)
    <bdf>   DW_AT_name        : (indirect string, offset: 0xc7c): ip_type_of_services
    <be3>   DW_AT_decl_file   : 18
    <be4>   DW_AT_decl_line   : 422
    <be6>   DW_AT_decl_column : 26
    <be7>   DW_AT_type        : <0xb34>
    <beb>   DW_AT_external    : 1
    <bec>   DW_AT_declaration : 1
 <1><bed>: Abbrev Number: 10 (DW_TAG_variable)
    <bee>   DW_AT_name        : (indirect string, offset: 0x703): ipc_private
    <bf2>   DW_AT_decl_file   : 18
    <bf3>   DW_AT_decl_line   : 423
    <bf5>   DW_AT_decl_column : 26
    <bf6>   DW_AT_type        : <0xb34>
    <bfa>   DW_AT_external    : 1
    <bfb>   DW_AT_declaration : 1
 <1><bfc>: Abbrev Number: 10 (DW_TAG_variable)
    <bfd>   DW_AT_name        : (indirect string, offset: 0x33a): msg_flags
    <c01>   DW_AT_decl_file   : 18
    <c02>   DW_AT_decl_line   : 424
    <c04>   DW_AT_decl_column : 26
    <c05>   DW_AT_type        : <0xb34>
    <c09>   DW_AT_external    : 1
    <c0a>   DW_AT_declaration : 1
 <1><c0b>: Abbrev Number: 10 (DW_TAG_variable)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x120): netlink_protocols
    <c10>   DW_AT_decl_file   : 18
    <c11>   DW_AT_decl_line   : 425
    <c13>   DW_AT_decl_column : 26
    <c14>   DW_AT_type        : <0xb34>
    <c18>   DW_AT_external    : 1
    <c19>   DW_AT_declaration : 1
 <1><c1a>: Abbrev Number: 10 (DW_TAG_variable)
    <c1b>   DW_AT_name        : (indirect string, offset: 0xfa4): nl_bridge_vlan_flags
    <c1f>   DW_AT_decl_file   : 18
    <c20>   DW_AT_decl_line   : 426
    <c22>   DW_AT_decl_column : 26
    <c23>   DW_AT_type        : <0xb34>
    <c27>   DW_AT_external    : 1
    <c28>   DW_AT_declaration : 1
 <1><c29>: Abbrev Number: 10 (DW_TAG_variable)
    <c2a>   DW_AT_name        : (indirect string, offset: 0xe4d): nl_netfilter_msg_types
    <c2e>   DW_AT_decl_file   : 18
    <c2f>   DW_AT_decl_line   : 427
    <c31>   DW_AT_decl_column : 26
    <c32>   DW_AT_type        : <0xb34>
    <c36>   DW_AT_external    : 1
    <c37>   DW_AT_declaration : 1
 <1><c38>: Abbrev Number: 10 (DW_TAG_variable)
    <c39>   DW_AT_name        : (indirect string, offset: 0x49e): nl_route_types
    <c3d>   DW_AT_decl_file   : 18
    <c3e>   DW_AT_decl_line   : 428
    <c40>   DW_AT_decl_column : 26
    <c41>   DW_AT_type        : <0xb34>
    <c45>   DW_AT_external    : 1
    <c46>   DW_AT_declaration : 1
 <1><c47>: Abbrev Number: 10 (DW_TAG_variable)
    <c48>   DW_AT_name        : (indirect string, offset: 0xf09): open_access_modes
    <c4c>   DW_AT_decl_file   : 18
    <c4d>   DW_AT_decl_line   : 429
    <c4f>   DW_AT_decl_column : 26
    <c50>   DW_AT_type        : <0xb34>
    <c54>   DW_AT_external    : 1
    <c55>   DW_AT_declaration : 1
 <1><c56>: Abbrev Number: 10 (DW_TAG_variable)
    <c57>   DW_AT_name        : (indirect string, offset: 0x85): open_mode_flags
    <c5b>   DW_AT_decl_file   : 18
    <c5c>   DW_AT_decl_line   : 430
    <c5e>   DW_AT_decl_column : 26
    <c5f>   DW_AT_type        : <0xb34>
    <c63>   DW_AT_external    : 1
    <c64>   DW_AT_declaration : 1
 <1><c65>: Abbrev Number: 10 (DW_TAG_variable)
    <c66>   DW_AT_name        : (indirect string, offset: 0xcb5): perf_type_id
    <c6a>   DW_AT_decl_file   : 18
    <c6b>   DW_AT_decl_line   : 431
    <c6d>   DW_AT_decl_column : 26
    <c6e>   DW_AT_type        : <0xb34>
    <c72>   DW_AT_external    : 1
    <c73>   DW_AT_declaration : 1
 <1><c74>: Abbrev Number: 10 (DW_TAG_variable)
    <c75>   DW_AT_name        : (indirect string, offset: 0xedb): pollflags
    <c79>   DW_AT_decl_file   : 18
    <c7a>   DW_AT_decl_line   : 432
    <c7c>   DW_AT_decl_column : 26
    <c7d>   DW_AT_type        : <0xb34>
    <c81>   DW_AT_external    : 1
    <c82>   DW_AT_declaration : 1
 <1><c83>: Abbrev Number: 10 (DW_TAG_variable)
    <c84>   DW_AT_name        : (indirect string, offset: 0x649): ptrace_cmds
    <c88>   DW_AT_decl_file   : 18
    <c89>   DW_AT_decl_line   : 433
    <c8b>   DW_AT_decl_column : 26
    <c8c>   DW_AT_type        : <0xb34>
    <c90>   DW_AT_external    : 1
    <c91>   DW_AT_declaration : 1
 <1><c92>: Abbrev Number: 10 (DW_TAG_variable)
    <c93>   DW_AT_name        : (indirect string, offset: 0x863): resource_flags
    <c97>   DW_AT_decl_file   : 18
    <c98>   DW_AT_decl_line   : 434
    <c9a>   DW_AT_decl_column : 26
    <c9b>   DW_AT_type        : <0xb34>
    <c9f>   DW_AT_external    : 1
    <ca0>   DW_AT_declaration : 1
 <1><ca1>: Abbrev Number: 10 (DW_TAG_variable)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x2af): route_nexthop_flags
    <ca6>   DW_AT_decl_file   : 18
    <ca7>   DW_AT_decl_line   : 435
    <ca9>   DW_AT_decl_column : 26
    <caa>   DW_AT_type        : <0xb34>
    <cae>   DW_AT_external    : 1
    <caf>   DW_AT_declaration : 1
 <1><cb0>: Abbrev Number: 10 (DW_TAG_variable)
    <cb1>   DW_AT_name        : (indirect string, offset: 0xf26): routing_protocols
    <cb5>   DW_AT_decl_file   : 18
    <cb6>   DW_AT_decl_line   : 436
    <cb8>   DW_AT_decl_column : 26
    <cb9>   DW_AT_type        : <0xb34>
    <cbd>   DW_AT_external    : 1
    <cbe>   DW_AT_declaration : 1
 <1><cbf>: Abbrev Number: 10 (DW_TAG_variable)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x4ad): routing_scopes
    <cc4>   DW_AT_decl_file   : 18
    <cc5>   DW_AT_decl_line   : 437
    <cc7>   DW_AT_decl_column : 26
    <cc8>   DW_AT_type        : <0xb34>
    <ccc>   DW_AT_external    : 1
    <ccd>   DW_AT_declaration : 1
 <1><cce>: Abbrev Number: 10 (DW_TAG_variable)
    <ccf>   DW_AT_name        : (indirect string, offset: 0xe2f): routing_table_ids
    <cd3>   DW_AT_decl_file   : 18
    <cd4>   DW_AT_decl_line   : 438
    <cd6>   DW_AT_decl_column : 26
    <cd7>   DW_AT_type        : <0xb34>
    <cdb>   DW_AT_external    : 1
    <cdc>   DW_AT_declaration : 1
 <1><cdd>: Abbrev Number: 10 (DW_TAG_variable)
    <cde>   DW_AT_name        : (indirect string, offset: 0x6e0): routing_types
    <ce2>   DW_AT_decl_file   : 18
    <ce3>   DW_AT_decl_line   : 439
    <ce5>   DW_AT_decl_column : 26
    <ce6>   DW_AT_type        : <0xb34>
    <cea>   DW_AT_external    : 1
    <ceb>   DW_AT_declaration : 1
 <1><cec>: Abbrev Number: 10 (DW_TAG_variable)
    <ced>   DW_AT_name        : (indirect string, offset: 0x1e7): rwf_flags
    <cf1>   DW_AT_decl_file   : 18
    <cf2>   DW_AT_decl_line   : 440
    <cf4>   DW_AT_decl_column : 26
    <cf5>   DW_AT_type        : <0xb34>
    <cf9>   DW_AT_external    : 1
    <cfa>   DW_AT_declaration : 1
 <1><cfb>: Abbrev Number: 10 (DW_TAG_variable)
    <cfc>   DW_AT_name        : (indirect string, offset: 0x89b): seccomp_filter_flags
    <d00>   DW_AT_decl_file   : 18
    <d01>   DW_AT_decl_line   : 441
    <d03>   DW_AT_decl_column : 26
    <d04>   DW_AT_type        : <0xb34>
    <d08>   DW_AT_external    : 1
    <d09>   DW_AT_declaration : 1
 <1><d0a>: Abbrev Number: 10 (DW_TAG_variable)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x2f6): seccomp_ret_action
    <d0f>   DW_AT_decl_file   : 18
    <d10>   DW_AT_decl_line   : 442
    <d12>   DW_AT_decl_column : 26
    <d13>   DW_AT_type        : <0xb34>
    <d17>   DW_AT_external    : 1
    <d18>   DW_AT_declaration : 1
 <1><d19>: Abbrev Number: 10 (DW_TAG_variable)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x473): setns_types
    <d1e>   DW_AT_decl_file   : 18
    <d1f>   DW_AT_decl_line   : 443
    <d21>   DW_AT_decl_column : 26
    <d22>   DW_AT_type        : <0xb34>
    <d26>   DW_AT_external    : 1
    <d27>   DW_AT_declaration : 1
 <1><d28>: Abbrev Number: 10 (DW_TAG_variable)
    <d29>   DW_AT_name        : (indirect string, offset: 0xec7): sg_io_info
    <d2d>   DW_AT_decl_file   : 18
    <d2e>   DW_AT_decl_line   : 444
    <d30>   DW_AT_decl_column : 26
    <d31>   DW_AT_type        : <0xb34>
    <d35>   DW_AT_external    : 1
    <d36>   DW_AT_declaration : 1
 <1><d37>: Abbrev Number: 10 (DW_TAG_variable)
    <d38>   DW_AT_name        : (indirect string, offset: 0xc22): socketlayers
    <d3c>   DW_AT_decl_file   : 18
    <d3d>   DW_AT_decl_line   : 445
    <d3f>   DW_AT_decl_column : 26
    <d40>   DW_AT_type        : <0xb34>
    <d44>   DW_AT_external    : 1
    <d45>   DW_AT_declaration : 1
 <1><d46>: Abbrev Number: 10 (DW_TAG_variable)
    <d47>   DW_AT_name        : (indirect string, offset: 0xe19): socktypes
    <d4b>   DW_AT_decl_file   : 18
    <d4c>   DW_AT_decl_line   : 446
    <d4e>   DW_AT_decl_column : 26
    <d4f>   DW_AT_type        : <0xb34>
    <d53>   DW_AT_external    : 1
    <d54>   DW_AT_declaration : 1
 <1><d55>: Abbrev Number: 10 (DW_TAG_variable)
    <d56>   DW_AT_name        : (indirect string, offset: 0xae6): tcp_state_flags
    <d5a>   DW_AT_decl_file   : 18
    <d5b>   DW_AT_decl_line   : 447
    <d5d>   DW_AT_decl_column : 26
    <d5e>   DW_AT_type        : <0xb34>
    <d62>   DW_AT_external    : 1
    <d63>   DW_AT_declaration : 1
 <1><d64>: Abbrev Number: 10 (DW_TAG_variable)
    <d65>   DW_AT_name        : (indirect string, offset: 0x7af): tcp_states
    <d69>   DW_AT_decl_file   : 18
    <d6a>   DW_AT_decl_line   : 448
    <d6c>   DW_AT_decl_column : 26
    <d6d>   DW_AT_type        : <0xb34>
    <d71>   DW_AT_external    : 1
    <d72>   DW_AT_declaration : 1
 <1><d73>: Abbrev Number: 10 (DW_TAG_variable)
    <d74>   DW_AT_name        : (indirect string, offset: 0x1111): whence_codes
    <d78>   DW_AT_decl_file   : 18
    <d79>   DW_AT_decl_line   : 449
    <d7b>   DW_AT_decl_column : 26
    <d7c>   DW_AT_type        : <0xb34>
    <d80>   DW_AT_external    : 1
    <d81>   DW_AT_declaration : 1
 <1><d82>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d83>   DW_AT_encoding    : 7	(unsigned)
    <d84>   DW_AT_byte_size   : 4
    <d85>   DW_AT_type        : <0x2b>
    <d89>   DW_AT_decl_file   : 18
    <d8a>   DW_AT_decl_line   : 510
    <d8c>   DW_AT_decl_column : 14
    <d8d>   DW_AT_sibling     : <0xda4>
 <2><d91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0xa04): CFLAG_NONE
    <d96>   DW_AT_const_value : 0
 <2><d97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d98>   DW_AT_name        : (indirect string, offset: 0x934): CFLAG_ONLY_STATS
    <d9c>   DW_AT_const_value : 1
 <2><d9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0xc2f): CFLAG_BOTH
    <da2>   DW_AT_const_value : 2
 <2><da3>: Abbrev Number: 0
 <1><da4>: Abbrev Number: 28 (DW_TAG_typedef)
    <da5>   DW_AT_name        : (indirect string, offset: 0x11b3): cflag_t
    <da9>   DW_AT_decl_file   : 18
    <daa>   DW_AT_decl_line   : 514
    <dac>   DW_AT_decl_column : 3
    <dad>   DW_AT_type        : <0xd82>
 <1><db1>: Abbrev Number: 10 (DW_TAG_variable)
    <db2>   DW_AT_name        : (indirect string, offset: 0xd64): cflag
    <db6>   DW_AT_decl_file   : 18
    <db7>   DW_AT_decl_line   : 515
    <db9>   DW_AT_decl_column : 16
    <dba>   DW_AT_type        : <0xda4>
    <dbe>   DW_AT_external    : 1
    <dbf>   DW_AT_declaration : 1
 <1><dc0>: Abbrev Number: 10 (DW_TAG_variable)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x19b): Tflag
    <dc5>   DW_AT_decl_file   : 18
    <dc6>   DW_AT_decl_line   : 516
    <dc8>   DW_AT_decl_column : 13
    <dc9>   DW_AT_type        : <0x51a>
    <dcd>   DW_AT_external    : 1
    <dce>   DW_AT_declaration : 1
 <1><dcf>: Abbrev Number: 10 (DW_TAG_variable)
    <dd0>   DW_AT_name        : (indirect string, offset: 0x805): Tflag_scale
    <dd4>   DW_AT_decl_file   : 18
    <dd5>   DW_AT_decl_line   : 517
    <dd7>   DW_AT_decl_column : 12
    <dd8>   DW_AT_type        : <0x64>
    <ddc>   DW_AT_external    : 1
    <ddd>   DW_AT_declaration : 1
 <1><dde>: Abbrev Number: 10 (DW_TAG_variable)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x8b0): Tflag_width
    <de3>   DW_AT_decl_file   : 18
    <de4>   DW_AT_decl_line   : 518
    <de6>   DW_AT_decl_column : 12
    <de7>   DW_AT_type        : <0x64>
    <deb>   DW_AT_external    : 1
    <dec>   DW_AT_declaration : 1
 <1><ded>: Abbrev Number: 10 (DW_TAG_variable)
    <dee>   DW_AT_name        : (indirect string, offset: 0xeb9): iflag
    <df2>   DW_AT_decl_file   : 18
    <df3>   DW_AT_decl_line   : 519
    <df5>   DW_AT_decl_column : 13
    <df6>   DW_AT_type        : <0x51a>
    <dfa>   DW_AT_external    : 1
    <dfb>   DW_AT_declaration : 1
 <1><dfc>: Abbrev Number: 10 (DW_TAG_variable)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x689): count_wallclock
    <e01>   DW_AT_decl_file   : 18
    <e02>   DW_AT_decl_line   : 520
    <e04>   DW_AT_decl_column : 13
    <e05>   DW_AT_type        : <0x51a>
    <e09>   DW_AT_external    : 1
    <e0a>   DW_AT_declaration : 1
 <1><e0b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x4a): path_set_item
    <e10>   DW_AT_byte_size   : 4
    <e11>   DW_AT_decl_file   : 18
    <e12>   DW_AT_decl_line   : 522
    <e14>   DW_AT_decl_column : 8
    <e15>   DW_AT_sibling     : <0xe2a>
 <2><e19>: Abbrev Number: 22 (DW_TAG_member)
    <e1a>   DW_AT_name        : (indirect string, offset: 0xde): path
    <e1e>   DW_AT_decl_file   : 18
    <e1f>   DW_AT_decl_line   : 523
    <e21>   DW_AT_decl_column : 14
    <e22>   DW_AT_type        : <0x1ce>
    <e26>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e29>: Abbrev Number: 0
 <1><e2a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x7ba): path_set
    <e2f>   DW_AT_byte_size   : 12
    <e30>   DW_AT_decl_file   : 18
    <e31>   DW_AT_decl_line   : 527
    <e33>   DW_AT_decl_column : 15
    <e34>   DW_AT_sibling     : <0xe69>
 <2><e38>: Abbrev Number: 22 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0x748): paths_selected
    <e3d>   DW_AT_decl_file   : 18
    <e3e>   DW_AT_decl_line   : 528
    <e40>   DW_AT_decl_column : 24
    <e41>   DW_AT_type        : <0xe69>
    <e45>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e48>: Abbrev Number: 22 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x1104): num_selected
    <e4d>   DW_AT_decl_file   : 18
    <e4e>   DW_AT_decl_line   : 529
    <e50>   DW_AT_decl_column : 9
    <e51>   DW_AT_type        : <0x12e>
    <e55>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e58>: Abbrev Number: 22 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0xbd3): size
    <e5d>   DW_AT_decl_file   : 18
    <e5e>   DW_AT_decl_line   : 530
    <e60>   DW_AT_decl_column : 9
    <e61>   DW_AT_type        : <0x12e>
    <e65>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6a>   DW_AT_byte_size   : 4
    <e6b>   DW_AT_type        : <0xe0b>
 <1><e6f>: Abbrev Number: 10 (DW_TAG_variable)
    <e70>   DW_AT_name        : (indirect string, offset: 0x1153): global_path_set
    <e74>   DW_AT_decl_file   : 18
    <e75>   DW_AT_decl_line   : 531
    <e77>   DW_AT_decl_column : 3
    <e78>   DW_AT_type        : <0xe2a>
    <e7c>   DW_AT_external    : 1
    <e7d>   DW_AT_declaration : 1
 <1><e7e>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7f>   DW_AT_name        : (indirect string, offset: 0x1036): xflag_opts
    <e83>   DW_AT_encoding    : 7	(unsigned)
    <e84>   DW_AT_byte_size   : 4
    <e85>   DW_AT_type        : <0x2b>
    <e89>   DW_AT_decl_file   : 18
    <e8a>   DW_AT_decl_line   : 533
    <e8c>   DW_AT_decl_column : 6
    <e8d>   DW_AT_sibling     : <0xeb0>
 <2><e91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e92>   DW_AT_name        : (indirect string, offset: 0xa87): HEXSTR_NONE
    <e96>   DW_AT_const_value : 0
 <2><e97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e98>   DW_AT_name        : (indirect string, offset: 0x1085): HEXSTR_NON_ASCII
    <e9c>   DW_AT_const_value : 1
 <2><e9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x97c): HEXSTR_ALL
    <ea2>   DW_AT_const_value : 2
 <2><ea3>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x6c9): HEXSTR_NON_ASCII_CHARS
    <ea8>   DW_AT_const_value : 3
 <2><ea9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x111e): NUM_HEXSTR_OPTS
    <eae>   DW_AT_const_value : 4
 <2><eaf>: Abbrev Number: 0
 <1><eb0>: Abbrev Number: 10 (DW_TAG_variable)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xe93): xflag
    <eb5>   DW_AT_decl_file   : 18
    <eb6>   DW_AT_decl_line   : 546
    <eb8>   DW_AT_decl_column : 17
    <eb9>   DW_AT_type        : <0x2b>
    <ebd>   DW_AT_external    : 1
    <ebe>   DW_AT_declaration : 1
 <1><ebf>: Abbrev Number: 10 (DW_TAG_variable)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xd1f): followfork
    <ec4>   DW_AT_decl_file   : 18
    <ec5>   DW_AT_decl_line   : 547
    <ec7>   DW_AT_decl_column : 13
    <ec8>   DW_AT_type        : <0x51a>
    <ecc>   DW_AT_external    : 1
    <ecd>   DW_AT_declaration : 1
 <1><ece>: Abbrev Number: 10 (DW_TAG_variable)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x34e): output_separately
    <ed3>   DW_AT_decl_file   : 18
    <ed4>   DW_AT_decl_line   : 548
    <ed6>   DW_AT_decl_column : 13
    <ed7>   DW_AT_type        : <0x51a>
    <edb>   DW_AT_external    : 1
    <edc>   DW_AT_declaration : 1
 <1><edd>: Abbrev Number: 10 (DW_TAG_variable)
    <ede>   DW_AT_name        : (indirect string, offset: 0x24e): stack_trace_enabled
    <ee2>   DW_AT_decl_file   : 18
    <ee3>   DW_AT_decl_line   : 551
    <ee5>   DW_AT_decl_column : 13
    <ee6>   DW_AT_type        : <0x51a>
    <eea>   DW_AT_external    : 1
    <eeb>   DW_AT_declaration : 1
 <1><eec>: Abbrev Number: 10 (DW_TAG_variable)
    <eed>   DW_AT_name        : (indirect string, offset: 0x6b7): ptrace_setoptions
    <ef1>   DW_AT_decl_file   : 18
    <ef2>   DW_AT_decl_line   : 555
    <ef4>   DW_AT_decl_column : 17
    <ef5>   DW_AT_type        : <0x2b>
    <ef9>   DW_AT_external    : 1
    <efa>   DW_AT_declaration : 1
 <1><efb>: Abbrev Number: 10 (DW_TAG_variable)
    <efc>   DW_AT_name        : (indirect string, offset: 0xa7c): max_strlen
    <f00>   DW_AT_decl_file   : 18
    <f01>   DW_AT_decl_line   : 556
    <f03>   DW_AT_decl_column : 17
    <f04>   DW_AT_type        : <0x2b>
    <f08>   DW_AT_external    : 1
    <f09>   DW_AT_declaration : 1
 <1><f0a>: Abbrev Number: 10 (DW_TAG_variable)
    <f0b>   DW_AT_name        : (indirect string, offset: 0xac0): os_release
    <f0f>   DW_AT_decl_file   : 18
    <f10>   DW_AT_decl_line   : 557
    <f12>   DW_AT_decl_column : 17
    <f13>   DW_AT_type        : <0x2b>
    <f17>   DW_AT_external    : 1
    <f18>   DW_AT_declaration : 1
 <1><f19>: Abbrev Number: 10 (DW_TAG_variable)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x757): xlat_verbosity
    <f1e>   DW_AT_decl_file   : 18
    <f1f>   DW_AT_decl_line   : 919
    <f21>   DW_AT_decl_column : 24
    <f22>   DW_AT_type        : <0xa57>
    <f26>   DW_AT_external    : 1
    <f27>   DW_AT_declaration : 1
 <1><f28>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f29>   DW_AT_name        : (indirect string, offset: 0x66c): xlat_style_private_flag_bits
    <f2d>   DW_AT_encoding    : 7	(unsigned)
    <f2e>   DW_AT_byte_size   : 4
    <f2f>   DW_AT_type        : <0x2b>
    <f33>   DW_AT_decl_file   : 18
    <f34>   DW_AT_decl_line   : 939
    <f36>   DW_AT_decl_column : 6
    <f37>   DW_AT_sibling     : <0xf54>
 <2><f3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x2c3): PAF_PRINT_INDICES_BIT
    <f40>   DW_AT_const_value : 5
 <2><f41>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0xb8a): PAF_ARRAY_TRUNCATED_BIT
    <f46>   DW_AT_const_value : 6
 <2><f47>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0x433): PXF_DEFAULT_STR_BIT
    <f4c>   DW_AT_const_value : 7
 <2><f4d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xd01): SPFF_AUXSTR_MODE_BIT
    <f52>   DW_AT_const_value : 8
 <2><f53>: Abbrev Number: 0
 <1><f54>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f55>   DW_AT_name        : (indirect string, offset: 0xdb8): find_xlat_flag_bits
    <f59>   DW_AT_encoding    : 7	(unsigned)
    <f5a>   DW_AT_byte_size   : 4
    <f5b>   DW_AT_type        : <0x2b>
    <f5f>   DW_AT_decl_file   : 18
    <f60>   DW_AT_decl_line   : 1443
    <f62>   DW_AT_decl_column : 6
    <f63>   DW_AT_sibling     : <0xf6e>
 <2><f67>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f68>   DW_AT_name        : (indirect string, offset: 0x9b9): FXL_CASE_SENSITIVE_BIT
    <f6c>   DW_AT_const_value : 0
 <2><f6d>: Abbrev Number: 0
 <1><f6e>: Abbrev Number: 10 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xa58): printing_tcp
    <f73>   DW_AT_decl_file   : 18
    <f74>   DW_AT_decl_line   : 1689
    <f76>   DW_AT_decl_column : 20
    <f77>   DW_AT_type        : <0x5f6>
    <f7b>   DW_AT_external    : 1
    <f7c>   DW_AT_declaration : 1
 <1><f7d>: Abbrev Number: 10 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x620): errnoent
    <f82>   DW_AT_decl_file   : 18
    <f83>   DW_AT_decl_line   : 1887
    <f85>   DW_AT_decl_column : 26
    <f86>   DW_AT_type        : <0x44e>
    <f8a>   DW_AT_external    : 1
    <f8b>   DW_AT_declaration : 1
 <1><f8c>: Abbrev Number: 10 (DW_TAG_variable)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x8bc): signalent
    <f91>   DW_AT_decl_file   : 18
    <f92>   DW_AT_decl_line   : 1888
    <f94>   DW_AT_decl_column : 26
    <f95>   DW_AT_type        : <0x44e>
    <f99>   DW_AT_external    : 1
    <f9a>   DW_AT_declaration : 1
 <1><f9b>: Abbrev Number: 10 (DW_TAG_variable)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xf01): nerrnos
    <fa0>   DW_AT_decl_file   : 18
    <fa1>   DW_AT_decl_line   : 1889
    <fa3>   DW_AT_decl_column : 27
    <fa4>   DW_AT_type        : <0x32>
    <fa8>   DW_AT_external    : 1
    <fa9>   DW_AT_declaration : 1
 <1><faa>: Abbrev Number: 10 (DW_TAG_variable)
    <fab>   DW_AT_name        : (indirect string, offset: 0x10ed): nsignals
    <faf>   DW_AT_decl_file   : 18
    <fb0>   DW_AT_decl_line   : 1890
    <fb2>   DW_AT_decl_column : 27
    <fb3>   DW_AT_type        : <0x32>
    <fb7>   DW_AT_external    : 1
    <fb8>   DW_AT_declaration : 1
 <1><fb9>: Abbrev Number: 15 (DW_TAG_array_type)
    <fba>   DW_AT_type        : <0x876>
    <fbe>   DW_AT_sibling     : <0xfc4>
 <2><fc2>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc3>: Abbrev Number: 0
 <1><fc4>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc5>   DW_AT_type        : <0xfb9>
 <1><fc9>: Abbrev Number: 10 (DW_TAG_variable)
    <fca>   DW_AT_name        : (indirect string, offset: 0xd83): sysent0
    <fce>   DW_AT_decl_file   : 18
    <fcf>   DW_AT_decl_line   : 1892
    <fd1>   DW_AT_decl_column : 28
    <fd2>   DW_AT_type        : <0xfc4>
    <fd6>   DW_AT_external    : 1
    <fd7>   DW_AT_declaration : 1
 <1><fd8>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd9>   DW_AT_type        : <0x8dd>
    <fdd>   DW_AT_sibling     : <0xfe3>
 <2><fe1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fe2>: Abbrev Number: 0
 <1><fe3>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe4>   DW_AT_type        : <0xfd8>
 <1><fe8>: Abbrev Number: 10 (DW_TAG_variable)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x1149): ioctlent0
    <fed>   DW_AT_decl_file   : 18
    <fee>   DW_AT_decl_line   : 1893
    <ff0>   DW_AT_decl_column : 30
    <ff1>   DW_AT_type        : <0xfe3>
    <ff5>   DW_AT_external    : 1
    <ff6>   DW_AT_declaration : 1
 <1><ff7>: Abbrev Number: 10 (DW_TAG_variable)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x1041): personality_names
    <ffc>   DW_AT_decl_file   : 18
    <ffd>   DW_AT_decl_line   : 1895
    <fff>   DW_AT_decl_column : 26
    <1000>   DW_AT_type        : <0x44e>
    <1004>   DW_AT_external    : 1
    <1005>   DW_AT_declaration : 1
 <1><1006>: Abbrev Number: 10 (DW_TAG_variable)
    <1007>   DW_AT_name        : (indirect string, offset: 0x8dc): sysent
    <100b>   DW_AT_decl_file   : 18
    <100c>   DW_AT_decl_line   : 1898
    <100e>   DW_AT_decl_column : 29
    <100f>   DW_AT_type        : <0x9c2>
    <1013>   DW_AT_external    : 1
    <1014>   DW_AT_declaration : 1
 <1><1015>: Abbrev Number: 10 (DW_TAG_variable)
    <1016>   DW_AT_name        : (indirect string, offset: 0xd16): ioctlent
    <101a>   DW_AT_decl_file   : 18
    <101b>   DW_AT_decl_line   : 1899
    <101d>   DW_AT_decl_column : 31
    <101e>   DW_AT_type        : <0x1024>
    <1022>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1024>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1025>   DW_AT_byte_size   : 4
    <1026>   DW_AT_type        : <0x8dd>
 <1><102a>: Abbrev Number: 10 (DW_TAG_variable)
    <102b>   DW_AT_name        : (indirect string, offset: 0x8c6): nsyscalls
    <102f>   DW_AT_decl_file   : 18
    <1030>   DW_AT_decl_line   : 1905
    <1032>   DW_AT_decl_column : 17
    <1033>   DW_AT_type        : <0x2b>
    <1037>   DW_AT_external    : 1
    <1038>   DW_AT_declaration : 1
 <1><1039>: Abbrev Number: 10 (DW_TAG_variable)
    <103a>   DW_AT_name        : (indirect string, offset: 0xf1b): nioctlents
    <103e>   DW_AT_decl_file   : 18
    <103f>   DW_AT_decl_line   : 1906
    <1041>   DW_AT_decl_column : 17
    <1042>   DW_AT_type        : <0x2b>
    <1046>   DW_AT_external    : 1
    <1047>   DW_AT_declaration : 1
 <1><1048>: Abbrev Number: 15 (DW_TAG_array_type)
    <1049>   DW_AT_type        : <0x32>
    <104d>   DW_AT_sibling     : <0x1058>
 <2><1051>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1052>   DW_AT_type        : <0x2b>
    <1056>   DW_AT_upper_bound : 2
 <2><1057>: Abbrev Number: 0
 <1><1058>: Abbrev Number: 3 (DW_TAG_const_type)
    <1059>   DW_AT_type        : <0x1048>
 <1><105d>: Abbrev Number: 10 (DW_TAG_variable)
    <105e>   DW_AT_name        : (indirect string, offset: 0xf84): nsyscall_vec
    <1062>   DW_AT_decl_file   : 18
    <1063>   DW_AT_decl_line   : 1908
    <1065>   DW_AT_decl_column : 27
    <1066>   DW_AT_type        : <0x1058>
    <106a>   DW_AT_external    : 1
    <106b>   DW_AT_declaration : 1
 <1><106c>: Abbrev Number: 15 (DW_TAG_array_type)
    <106d>   DW_AT_type        : <0x9c8>
    <1071>   DW_AT_sibling     : <0x107c>
 <2><1075>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1076>   DW_AT_type        : <0x2b>
    <107a>   DW_AT_upper_bound : 2
 <2><107b>: Abbrev Number: 0
 <1><107c>: Abbrev Number: 3 (DW_TAG_const_type)
    <107d>   DW_AT_type        : <0x106c>
 <1><1081>: Abbrev Number: 10 (DW_TAG_variable)
    <1082>   DW_AT_name        : (indirect string, offset: 0x7f2): sysent_vec
    <1086>   DW_AT_decl_file   : 18
    <1087>   DW_AT_decl_line   : 1909
    <1089>   DW_AT_decl_column : 35
    <108a>   DW_AT_type        : <0x107c>
    <108e>   DW_AT_external    : 1
    <108f>   DW_AT_declaration : 1
 <1><1090>: Abbrev Number: 10 (DW_TAG_variable)
    <1091>   DW_AT_name        : (indirect string, offset: 0x3b5): inject_vec
    <1095>   DW_AT_decl_file   : 18
    <1096>   DW_AT_decl_line   : 1910
    <1098>   DW_AT_decl_column : 28
    <1099>   DW_AT_type        : <0x9cd>
    <109d>   DW_AT_external    : 1
    <109e>   DW_AT_declaration : 1
 <1><109f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a0>   DW_AT_name        : (indirect string, offset: 0xe0c): audit_arch_t
    <10a4>   DW_AT_byte_size   : 8
    <10a5>   DW_AT_decl_file   : 18
    <10a6>   DW_AT_decl_line   : 1912
    <10a8>   DW_AT_decl_column : 8
    <10a9>   DW_AT_sibling     : <0x10ce>
 <2><10ad>: Abbrev Number: 22 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x65e): arch
    <10b2>   DW_AT_decl_file   : 18
    <10b3>   DW_AT_decl_line   : 1913
    <10b5>   DW_AT_decl_column : 15
    <10b6>   DW_AT_type        : <0x2b>
    <10ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10bd>: Abbrev Number: 22 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0xa3e): flag
    <10c2>   DW_AT_decl_file   : 18
    <10c3>   DW_AT_decl_line   : 1914
    <10c5>   DW_AT_decl_column : 15
    <10c6>   DW_AT_type        : <0x2b>
    <10ca>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10cd>: Abbrev Number: 0
 <1><10ce>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cf>   DW_AT_type        : <0x109f>
 <1><10d3>: Abbrev Number: 15 (DW_TAG_array_type)
    <10d4>   DW_AT_type        : <0x10ce>
    <10d8>   DW_AT_sibling     : <0x10e3>
 <2><10dc>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10dd>   DW_AT_type        : <0x2b>
    <10e1>   DW_AT_upper_bound : 2
 <2><10e2>: Abbrev Number: 0
 <1><10e3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e4>   DW_AT_type        : <0x10d3>
 <1><10e8>: Abbrev Number: 10 (DW_TAG_variable)
    <10e9>   DW_AT_name        : (indirect string, offset: 0x9aa): audit_arch_vec
    <10ed>   DW_AT_decl_file   : 18
    <10ee>   DW_AT_decl_line   : 1917
    <10f0>   DW_AT_decl_column : 34
    <10f1>   DW_AT_type        : <0x10e3>
    <10f5>   DW_AT_external    : 1
    <10f6>   DW_AT_declaration : 1
 <1><10f7>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f8>   DW_AT_byte_size   : 180
    <10f9>   DW_AT_decl_file   : 20
    <10fa>   DW_AT_decl_line   : 2
    <10fb>   DW_AT_decl_column : 9
    <10fc>   DW_AT_sibling     : <0x13b1>
 <2><1100>: Abbrev Number: 9 (DW_TAG_member)
    <1101>   DW_AT_name        : (indirect string, offset: 0x1ff): block_ioctl
    <1105>   DW_AT_decl_file   : 20
    <1106>   DW_AT_decl_line   : 3
    <1107>   DW_AT_decl_column : 8
    <1108>   DW_AT_type        : <0x13cb>
    <110c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110f>: Abbrev Number: 9 (DW_TAG_member)
    <1110>   DW_AT_name        : (indirect string, offset: 0xb29): btrfs_ioctl
    <1114>   DW_AT_decl_file   : 20
    <1115>   DW_AT_decl_line   : 6
    <1116>   DW_AT_decl_column : 8
    <1117>   DW_AT_type        : <0x13cb>
    <111b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111e>: Abbrev Number: 9 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0x790): evdev_write_ioctl_mpers
    <1123>   DW_AT_decl_file   : 20
    <1124>   DW_AT_decl_line   : 9
    <1125>   DW_AT_decl_column : 8
    <1126>   DW_AT_type        : <0x13cb>
    <112a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><112d>: Abbrev Number: 9 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0x766): get_sock_fprog_size
    <1132>   DW_AT_decl_file   : 20
    <1133>   DW_AT_decl_line   : 12
    <1134>   DW_AT_decl_column : 17
    <1135>   DW_AT_type        : <0x13d7>
    <1139>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><113c>: Abbrev Number: 9 (DW_TAG_member)
    <113d>   DW_AT_name        : (indirect string, offset: 0x1ce): fetch_bpf_fprog
    <1141>   DW_AT_decl_file   : 20
    <1142>   DW_AT_decl_line   : 15
    <1143>   DW_AT_decl_column : 10
    <1144>   DW_AT_type        : <0x13f7>
    <1148>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><114b>: Abbrev Number: 9 (DW_TAG_member)
    <114c>   DW_AT_name        : (indirect string, offset: 0x997): fetch_struct_flock
    <1150>   DW_AT_decl_file   : 20
    <1151>   DW_AT_decl_line   : 18
    <1152>   DW_AT_decl_column : 10
    <1153>   DW_AT_type        : <0x13f7>
    <1157>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><115a>: Abbrev Number: 9 (DW_TAG_member)
    <115b>   DW_AT_name        : (indirect string, offset: 0xd2a): fetch_struct_flock64
