Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x16f4 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x505): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x212): mpers-mx32/struct_msghdr.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa34): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c7): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xffd): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x986): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdfa): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x496): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x886): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xedf): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8b6): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x789): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb69): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb9f): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xceb): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc60): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x413): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x45f): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x5cc): __socklen_t
    <f0>   DW_AT_decl_file   : 1
    <f1>   DW_AT_decl_line   : 209
    <f2>   DW_AT_decl_column : 23
    <f3>   DW_AT_type        : <0x2b>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x376): uint8_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 24
    <fe>   DW_AT_decl_column : 19
    <ff>   DW_AT_type        : <0x45>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xb8a): uint16_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 25
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x58>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xf87): uint32_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 26
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x70>
 <1><11b>: Abbrev Number: 4 (DW_TAG_typedef)
    <11c>   DW_AT_name        : (indirect string, offset: 0xe0a): uint64_t
    <120>   DW_AT_decl_file   : 2
    <121>   DW_AT_decl_line   : 27
    <122>   DW_AT_decl_column : 20
    <123>   DW_AT_type        : <0x8f>
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 4
    <129>   DW_AT_encoding    : 5	(signed)
    <12a>   DW_AT_name        : (indirect string, offset: 0x2e6): long int
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x32): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xb12): timespec
    <144>   DW_AT_byte_size   : 16
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x10d3): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xba>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe30): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xcd>
    <167>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xad4): long double
 <1><172>: Abbrev Number: 10 (DW_TAG_typedef)
    <173>   DW_AT_name        : (indirect string, offset: 0x11): socklen_t
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 274
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xeb>
 <1><17f>: Abbrev Number: 11 (DW_TAG_variable)
    <180>   DW_AT_name        : (indirect string, offset: 0x29d): __environ
    <184>   DW_AT_decl_file   : 5
    <185>   DW_AT_decl_line   : 543
    <187>   DW_AT_decl_column : 15
    <188>   DW_AT_type        : <0x18e>
    <18c>   DW_AT_external    : 1
    <18d>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18f>   DW_AT_byte_size   : 4
    <190>   DW_AT_type        : <0xd9>
 <1><194>: Abbrev Number: 11 (DW_TAG_variable)
    <195>   DW_AT_name        : (indirect string, offset: 0x3bf): environ
    <199>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 545
    <19c>   DW_AT_decl_column : 15
    <19d>   DW_AT_type        : <0x18e>
    <1a1>   DW_AT_external    : 1
    <1a2>   DW_AT_declaration : 1
 <1><1a3>: Abbrev Number: 12 (DW_TAG_variable)
    <1a4>   DW_AT_name        : (indirect string, offset: 0xfe7): optarg
    <1a8>   DW_AT_decl_file   : 6
    <1a9>   DW_AT_decl_line   : 36
    <1aa>   DW_AT_decl_column : 14
    <1ab>   DW_AT_type        : <0xd9>
    <1af>   DW_AT_external    : 1
    <1b0>   DW_AT_declaration : 1
 <1><1b1>: Abbrev Number: 12 (DW_TAG_variable)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x75c): optind
    <1b6>   DW_AT_decl_file   : 6
    <1b7>   DW_AT_decl_line   : 50
    <1b8>   DW_AT_decl_column : 12
    <1b9>   DW_AT_type        : <0x64>
    <1bd>   DW_AT_external    : 1
    <1be>   DW_AT_declaration : 1
 <1><1bf>: Abbrev Number: 12 (DW_TAG_variable)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xc4f): opterr
    <1c4>   DW_AT_decl_file   : 6
    <1c5>   DW_AT_decl_line   : 55
    <1c6>   DW_AT_decl_column : 12
    <1c7>   DW_AT_type        : <0x64>
    <1cb>   DW_AT_external    : 1
    <1cc>   DW_AT_declaration : 1
 <1><1cd>: Abbrev Number: 12 (DW_TAG_variable)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xb4f): optopt
    <1d2>   DW_AT_decl_file   : 6
    <1d3>   DW_AT_decl_line   : 59
    <1d4>   DW_AT_decl_column : 12
    <1d5>   DW_AT_type        : <0x64>
    <1d9>   DW_AT_external    : 1
    <1da>   DW_AT_declaration : 1
 <1><1db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1dc>   DW_AT_byte_size   : 4
    <1dd>   DW_AT_type        : <0xe6>
 <1><1e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e2>   DW_AT_type        : <0x1db>
 <1><1e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e7>   DW_AT_byte_size   : 4
    <1e8>   DW_AT_type        : <0x1ec>
 <1><1ec>: Abbrev Number: 13 (DW_TAG_const_type)
 <1><1ed>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x37e): _IO_FILE
    <1f2>   DW_AT_byte_size   : 152
    <1f3>   DW_AT_decl_file   : 7
    <1f4>   DW_AT_decl_line   : 49
    <1f5>   DW_AT_decl_column : 8
    <1f6>   DW_AT_sibling     : <0x3ae>
 <2><1fa>: Abbrev Number: 9 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0xa10): _flags
    <1ff>   DW_AT_decl_file   : 7
    <200>   DW_AT_decl_line   : 51
    <201>   DW_AT_decl_column : 7
    <202>   DW_AT_type        : <0x64>
    <206>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><209>: Abbrev Number: 9 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x4f8): _IO_read_ptr
    <20e>   DW_AT_decl_file   : 7
    <20f>   DW_AT_decl_line   : 54
    <210>   DW_AT_decl_column : 9
    <211>   DW_AT_type        : <0xd9>
    <215>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><218>: Abbrev Number: 9 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0xf34): _IO_read_end
    <21d>   DW_AT_decl_file   : 7
    <21e>   DW_AT_decl_line   : 55
    <21f>   DW_AT_decl_column : 9
    <220>   DW_AT_type        : <0xd9>
    <224>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><227>: Abbrev Number: 9 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x7c5): _IO_read_base
    <22c>   DW_AT_decl_file   : 7
    <22d>   DW_AT_decl_line   : 56
    <22e>   DW_AT_decl_column : 9
    <22f>   DW_AT_type        : <0xd9>
    <233>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><236>: Abbrev Number: 9 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <23b>   DW_AT_decl_file   : 7
    <23c>   DW_AT_decl_line   : 57
    <23d>   DW_AT_decl_column : 9
    <23e>   DW_AT_type        : <0xd9>
    <242>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><245>: Abbrev Number: 9 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x103f): _IO_write_ptr
    <24a>   DW_AT_decl_file   : 7
    <24b>   DW_AT_decl_line   : 58
    <24c>   DW_AT_decl_column : 9
    <24d>   DW_AT_type        : <0xd9>
    <251>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><254>: Abbrev Number: 9 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x8fe): _IO_write_end
    <259>   DW_AT_decl_file   : 7
    <25a>   DW_AT_decl_line   : 59
    <25b>   DW_AT_decl_column : 9
    <25c>   DW_AT_type        : <0xd9>
    <260>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><263>: Abbrev Number: 9 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x96f): _IO_buf_base
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 60
    <26a>   DW_AT_decl_column : 9
    <26b>   DW_AT_type        : <0xd9>
    <26f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><272>: Abbrev Number: 9 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0xd92): _IO_buf_end
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 61
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0xd9>
    <27e>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><281>: Abbrev Number: 9 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x1c8): _IO_save_base
    <286>   DW_AT_decl_file   : 7
    <287>   DW_AT_decl_line   : 64
    <288>   DW_AT_decl_column : 9
    <289>   DW_AT_type        : <0xd9>
    <28d>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><290>: Abbrev Number: 9 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xcb2): _IO_backup_base
    <295>   DW_AT_decl_file   : 7
    <296>   DW_AT_decl_line   : 65
    <297>   DW_AT_decl_column : 9
    <298>   DW_AT_type        : <0xd9>
    <29c>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29f>: Abbrev Number: 9 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0xbf): _IO_save_end
    <2a4>   DW_AT_decl_file   : 7
    <2a5>   DW_AT_decl_line   : 66
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_type        : <0xd9>
    <2ab>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ae>: Abbrev Number: 9 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x621): _markers
    <2b3>   DW_AT_decl_file   : 7
    <2b4>   DW_AT_decl_line   : 68
    <2b5>   DW_AT_decl_column : 22
    <2b6>   DW_AT_type        : <0x3c8>
    <2ba>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bd>: Abbrev Number: 9 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2c2>   DW_AT_decl_file   : 7
    <2c3>   DW_AT_decl_line   : 70
    <2c4>   DW_AT_decl_column : 20
    <2c5>   DW_AT_type        : <0x3ce>
    <2c9>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2cc>: Abbrev Number: 9 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xfad): _fileno
    <2d1>   DW_AT_decl_file   : 7
    <2d2>   DW_AT_decl_line   : 72
    <2d3>   DW_AT_decl_column : 7
    <2d4>   DW_AT_type        : <0x64>
    <2d8>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2db>: Abbrev Number: 9 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x7b1): _flags2
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 73
    <2e2>   DW_AT_decl_column : 7
    <2e3>   DW_AT_type        : <0x64>
    <2e7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2ea>: Abbrev Number: 9 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x832): _old_offset
    <2ef>   DW_AT_decl_file   : 7
    <2f0>   DW_AT_decl_line   : 74
    <2f1>   DW_AT_decl_column : 11
    <2f2>   DW_AT_type        : <0xa2>
    <2f6>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f9>: Abbrev Number: 9 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x254): _cur_column
    <2fe>   DW_AT_decl_file   : 7
    <2ff>   DW_AT_decl_line   : 77
    <300>   DW_AT_decl_column : 18
    <301>   DW_AT_type        : <0x24>
    <305>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><308>: Abbrev Number: 9 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0xe56): _vtable_offset
    <30d>   DW_AT_decl_file   : 7
    <30e>   DW_AT_decl_line   : 78
    <30f>   DW_AT_decl_column : 15
    <310>   DW_AT_type        : <0x3e>
    <314>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><317>: Abbrev Number: 9 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0xcc2): _shortbuf
    <31c>   DW_AT_decl_file   : 7
    <31d>   DW_AT_decl_line   : 79
    <31e>   DW_AT_decl_column : 8
    <31f>   DW_AT_type        : <0x3d4>
    <323>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><326>: Abbrev Number: 9 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <32b>   DW_AT_decl_file   : 7
    <32c>   DW_AT_decl_line   : 81
    <32d>   DW_AT_decl_column : 15
    <32e>   DW_AT_type        : <0x3e4>
    <332>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><335>: Abbrev Number: 9 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x6f4): _offset
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 89
    <33c>   DW_AT_decl_column : 13
    <33d>   DW_AT_type        : <0xae>
    <341>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><344>: Abbrev Number: 9 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0xa66): _codecvt
    <349>   DW_AT_decl_file   : 7
    <34a>   DW_AT_decl_line   : 91
    <34b>   DW_AT_decl_column : 23
    <34c>   DW_AT_type        : <0x3f0>
    <350>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><353>: Abbrev Number: 9 (DW_TAG_member)
    <354>   DW_AT_name        : (indirect string, offset: 0xfcb): _wide_data
    <358>   DW_AT_decl_file   : 7
    <359>   DW_AT_decl_line   : 92
    <35a>   DW_AT_decl_column : 25
    <35b>   DW_AT_type        : <0x3fc>
    <35f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><362>: Abbrev Number: 9 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x3e3): _freeres_list
    <367>   DW_AT_decl_file   : 7
    <368>   DW_AT_decl_line   : 93
    <369>   DW_AT_decl_column : 20
    <36a>   DW_AT_type        : <0x3ce>
    <36e>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><371>: Abbrev Number: 9 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0xc25): _freeres_buf
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 94
    <378>   DW_AT_decl_column : 9
    <379>   DW_AT_type        : <0xc6>
    <37d>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><380>: Abbrev Number: 9 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x9c4): __pad5
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 95
    <387>   DW_AT_decl_column : 10
    <388>   DW_AT_type        : <0x12e>
    <38c>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38f>: Abbrev Number: 9 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x273): _mode
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 96
    <396>   DW_AT_decl_column : 7
    <397>   DW_AT_type        : <0x64>
    <39b>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39e>: Abbrev Number: 9 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x7df): _unused2
    <3a3>   DW_AT_decl_file   : 7
    <3a4>   DW_AT_decl_line   : 98
    <3a5>   DW_AT_decl_column : 8
    <3a6>   DW_AT_type        : <0x402>
    <3aa>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3ad>: Abbrev Number: 0
 <1><3ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <3af>   DW_AT_name        : (indirect string, offset: 0xaf4): FILE
    <3b3>   DW_AT_decl_file   : 8
    <3b4>   DW_AT_decl_line   : 7
    <3b5>   DW_AT_decl_column : 25
    <3b6>   DW_AT_type        : <0x1ed>
 <1><3ba>: Abbrev Number: 14 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x48b): _IO_lock_t
    <3bf>   DW_AT_decl_file   : 7
    <3c0>   DW_AT_decl_line   : 43
    <3c1>   DW_AT_decl_column : 14
 <1><3c2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x328): _IO_marker
    <3c7>   DW_AT_declaration : 1
 <1><3c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c9>   DW_AT_byte_size   : 4
    <3ca>   DW_AT_type        : <0x3c2>
 <1><3ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 4
    <3d0>   DW_AT_type        : <0x1ed>
 <1><3d4>: Abbrev Number: 16 (DW_TAG_array_type)
    <3d5>   DW_AT_type        : <0xdf>
    <3d9>   DW_AT_sibling     : <0x3e4>
 <2><3dd>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <3de>   DW_AT_type        : <0x2b>
    <3e2>   DW_AT_upper_bound : 0
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e5>   DW_AT_byte_size   : 4
    <3e6>   DW_AT_type        : <0x3ba>
 <1><3ea>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x82): _IO_codecvt
    <3ef>   DW_AT_declaration : 1
 <1><3f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x3ea>
 <1><3f6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x392): _IO_wide_data
    <3fb>   DW_AT_declaration : 1
 <1><3fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fd>   DW_AT_byte_size   : 4
    <3fe>   DW_AT_type        : <0x3f6>
 <1><402>: Abbrev Number: 16 (DW_TAG_array_type)
    <403>   DW_AT_type        : <0xdf>
    <407>   DW_AT_sibling     : <0x412>
 <2><40b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <40c>   DW_AT_type        : <0x2b>
    <410>   DW_AT_upper_bound : 39
 <2><411>: Abbrev Number: 0
 <1><412>: Abbrev Number: 12 (DW_TAG_variable)
    <413>   DW_AT_name        : (indirect string, offset: 0x5d8): stdin
    <417>   DW_AT_decl_file   : 9
    <418>   DW_AT_decl_line   : 137
    <419>   DW_AT_decl_column : 14
    <41a>   DW_AT_type        : <0x420>
    <41e>   DW_AT_external    : 1
    <41f>   DW_AT_declaration : 1
 <1><420>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <421>   DW_AT_byte_size   : 4
    <422>   DW_AT_type        : <0x3ae>
 <1><426>: Abbrev Number: 12 (DW_TAG_variable)
    <427>   DW_AT_name        : (indirect string, offset: 0x1010): stdout
    <42b>   DW_AT_decl_file   : 9
    <42c>   DW_AT_decl_line   : 138
    <42d>   DW_AT_decl_column : 14
    <42e>   DW_AT_type        : <0x420>
    <432>   DW_AT_external    : 1
    <433>   DW_AT_declaration : 1
 <1><434>: Abbrev Number: 12 (DW_TAG_variable)
    <435>   DW_AT_name        : (indirect string, offset: 0xdf3): stderr
    <439>   DW_AT_decl_file   : 9
    <43a>   DW_AT_decl_line   : 139
    <43b>   DW_AT_decl_column : 14
    <43c>   DW_AT_type        : <0x420>
    <440>   DW_AT_external    : 1
    <441>   DW_AT_declaration : 1
 <1><442>: Abbrev Number: 12 (DW_TAG_variable)
    <443>   DW_AT_name        : (indirect string, offset: 0x260): sys_nerr
    <447>   DW_AT_decl_file   : 10
    <448>   DW_AT_decl_line   : 26
    <449>   DW_AT_decl_column : 12
    <44a>   DW_AT_type        : <0x64>
    <44e>   DW_AT_external    : 1
    <44f>   DW_AT_declaration : 1
 <1><450>: Abbrev Number: 16 (DW_TAG_array_type)
    <451>   DW_AT_type        : <0x1e1>
    <455>   DW_AT_sibling     : <0x45b>
 <2><459>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><45a>: Abbrev Number: 0
 <1><45b>: Abbrev Number: 3 (DW_TAG_const_type)
    <45c>   DW_AT_type        : <0x450>
 <1><460>: Abbrev Number: 12 (DW_TAG_variable)
    <461>   DW_AT_name        : (indirect string, offset: 0x5e7): sys_errlist
    <465>   DW_AT_decl_file   : 10
    <466>   DW_AT_decl_line   : 27
    <467>   DW_AT_decl_column : 26
    <468>   DW_AT_type        : <0x45b>
    <46c>   DW_AT_external    : 1
    <46d>   DW_AT_declaration : 1
 <1><46e>: Abbrev Number: 12 (DW_TAG_variable)
    <46f>   DW_AT_name        : (indirect string, offset: 0x28a): _sys_nerr
    <473>   DW_AT_decl_file   : 10
    <474>   DW_AT_decl_line   : 30
    <475>   DW_AT_decl_column : 12
    <476>   DW_AT_type        : <0x64>
    <47a>   DW_AT_external    : 1
    <47b>   DW_AT_declaration : 1
 <1><47c>: Abbrev Number: 12 (DW_TAG_variable)
    <47d>   DW_AT_name        : (indirect string, offset: 0xe65): _sys_errlist
    <481>   DW_AT_decl_file   : 10
    <482>   DW_AT_decl_line   : 31
    <483>   DW_AT_decl_column : 26
    <484>   DW_AT_type        : <0x45b>
    <488>   DW_AT_external    : 1
    <489>   DW_AT_declaration : 1
 <1><48a>: Abbrev Number: 12 (DW_TAG_variable)
    <48b>   DW_AT_name        : (indirect string, offset: 0x6cd): program_invocation_name
    <48f>   DW_AT_decl_file   : 11
    <490>   DW_AT_decl_line   : 45
    <491>   DW_AT_decl_column : 14
    <492>   DW_AT_type        : <0xd9>
    <496>   DW_AT_external    : 1
    <497>   DW_AT_declaration : 1
 <1><498>: Abbrev Number: 12 (DW_TAG_variable)
    <499>   DW_AT_name        : (indirect string, offset: 0xbca): program_invocation_short_name
    <49d>   DW_AT_decl_file   : 11
    <49e>   DW_AT_decl_line   : 46
    <49f>   DW_AT_decl_column : 14
    <4a0>   DW_AT_type        : <0xd9>
    <4a4>   DW_AT_external    : 1
    <4a5>   DW_AT_declaration : 1
 <1><4a6>: Abbrev Number: 16 (DW_TAG_array_type)
    <4a7>   DW_AT_type        : <0xd9>
    <4ab>   DW_AT_sibling     : <0x4b6>
 <2><4af>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <4b0>   DW_AT_type        : <0x2b>
    <4b4>   DW_AT_upper_bound : 1
 <2><4b5>: Abbrev Number: 0
 <1><4b6>: Abbrev Number: 12 (DW_TAG_variable)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x1b5): __tzname
    <4bb>   DW_AT_decl_file   : 12
    <4bc>   DW_AT_decl_line   : 159
    <4bd>   DW_AT_decl_column : 14
    <4be>   DW_AT_type        : <0x4a6>
    <4c2>   DW_AT_external    : 1
    <4c3>   DW_AT_declaration : 1
 <1><4c4>: Abbrev Number: 12 (DW_TAG_variable)
    <4c5>   DW_AT_name        : (indirect string, offset: 0xec6): __daylight
    <4c9>   DW_AT_decl_file   : 12
    <4ca>   DW_AT_decl_line   : 160
    <4cb>   DW_AT_decl_column : 12
    <4cc>   DW_AT_type        : <0x64>
    <4d0>   DW_AT_external    : 1
    <4d1>   DW_AT_declaration : 1
 <1><4d2>: Abbrev Number: 12 (DW_TAG_variable)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x387): __timezone
    <4d7>   DW_AT_decl_file   : 12
    <4d8>   DW_AT_decl_line   : 161
    <4d9>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0x127>
    <4de>   DW_AT_external    : 1
    <4df>   DW_AT_declaration : 1
 <1><4e0>: Abbrev Number: 12 (DW_TAG_variable)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x9bd): tzname
    <4e5>   DW_AT_decl_file   : 12
    <4e6>   DW_AT_decl_line   : 166
    <4e7>   DW_AT_decl_column : 14
    <4e8>   DW_AT_type        : <0x4a6>
    <4ec>   DW_AT_external    : 1
    <4ed>   DW_AT_declaration : 1
 <1><4ee>: Abbrev Number: 12 (DW_TAG_variable)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x1089): daylight
    <4f3>   DW_AT_decl_file   : 12
    <4f4>   DW_AT_decl_line   : 174
    <4f5>   DW_AT_decl_column : 12
    <4f6>   DW_AT_type        : <0x64>
    <4fa>   DW_AT_external    : 1
    <4fb>   DW_AT_declaration : 1
 <1><4fc>: Abbrev Number: 12 (DW_TAG_variable)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x4d7): timezone
    <501>   DW_AT_decl_file   : 12
    <502>   DW_AT_decl_line   : 175
    <503>   DW_AT_decl_column : 17
    <504>   DW_AT_type        : <0x127>
    <508>   DW_AT_external    : 1
    <509>   DW_AT_declaration : 1
 <1><50a>: Abbrev Number: 11 (DW_TAG_variable)
    <50b>   DW_AT_name        : (indirect string, offset: 0xf5b): getdate_err
    <50f>   DW_AT_decl_file   : 12
    <510>   DW_AT_decl_line   : 274
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0x64>
    <517>   DW_AT_external    : 1
    <518>   DW_AT_declaration : 1
 <1><519>: Abbrev Number: 12 (DW_TAG_variable)
    <51a>   DW_AT_name        : (indirect string, offset: 0x9d0): debug_flag
    <51e>   DW_AT_decl_file   : 13
    <51f>   DW_AT_decl_line   : 20
    <520>   DW_AT_decl_column : 13
    <521>   DW_AT_type        : <0x527>
    <525>   DW_AT_external    : 1
    <526>   DW_AT_declaration : 1
 <1><527>: Abbrev Number: 2 (DW_TAG_base_type)
    <528>   DW_AT_byte_size   : 1
    <529>   DW_AT_encoding    : 2	(boolean)
    <52a>   DW_AT_name        : (indirect string, offset: 0x425): _Bool
 <1><52e>: Abbrev Number: 3 (DW_TAG_const_type)
    <52f>   DW_AT_type        : <0x527>
 <1><533>: Abbrev Number: 4 (DW_TAG_typedef)
    <534>   DW_AT_name        : (indirect string, offset: 0xaaa): __kernel_long_t
    <538>   DW_AT_decl_file   : 14
    <539>   DW_AT_decl_line   : 14
    <53a>   DW_AT_decl_column : 19
    <53b>   DW_AT_type        : <0x88>
 <1><53f>: Abbrev Number: 4 (DW_TAG_typedef)
    <540>   DW_AT_name        : (indirect string, offset: 0x42): __kernel_ulong_t
    <544>   DW_AT_decl_file   : 14
    <545>   DW_AT_decl_line   : 15
    <546>   DW_AT_decl_column : 28
    <547>   DW_AT_type        : <0x9b>
 <1><54b>: Abbrev Number: 4 (DW_TAG_typedef)
    <54c>   DW_AT_name        : (indirect string, offset: 0x3f1): kernel_long_t
    <550>   DW_AT_decl_file   : 15
    <551>   DW_AT_decl_line   : 16
    <552>   DW_AT_decl_column : 25
    <553>   DW_AT_type        : <0x533>
 <1><557>: Abbrev Number: 4 (DW_TAG_typedef)
    <558>   DW_AT_name        : (indirect string, offset: 0x8a7): kernel_ulong_t
    <55c>   DW_AT_decl_file   : 15
    <55d>   DW_AT_decl_line   : 17
    <55e>   DW_AT_decl_column : 26
    <55f>   DW_AT_type        : <0x53f>
 <1><563>: Abbrev Number: 3 (DW_TAG_const_type)
    <564>   DW_AT_type        : <0x557>
 <1><568>: Abbrev Number: 8 (DW_TAG_structure_type)
    <569>   DW_AT_name        : (indirect string, offset: 0xbe8): list_item
    <56d>   DW_AT_byte_size   : 8
    <56e>   DW_AT_decl_file   : 16
    <56f>   DW_AT_decl_line   : 92
    <570>   DW_AT_decl_column : 8
    <571>   DW_AT_sibling     : <0x594>
 <2><575>: Abbrev Number: 9 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0x10ce): prev
    <57a>   DW_AT_decl_file   : 16
    <57b>   DW_AT_decl_line   : 93
    <57c>   DW_AT_decl_column : 20
    <57d>   DW_AT_type        : <0x594>
    <581>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><584>: Abbrev Number: 9 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x10c4): next
    <589>   DW_AT_decl_file   : 16
    <58a>   DW_AT_decl_line   : 94
    <58b>   DW_AT_decl_column : 20
    <58c>   DW_AT_type        : <0x594>
    <590>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><593>: Abbrev Number: 0
 <1><594>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <595>   DW_AT_byte_size   : 4
    <596>   DW_AT_type        : <0x568>
 <1><59a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <59b>   DW_AT_name        : (indirect string, offset: 0x87f): sysent
    <59f>   DW_AT_byte_size   : 20
    <5a0>   DW_AT_decl_file   : 17
    <5a1>   DW_AT_decl_line   : 13
    <5a2>   DW_AT_decl_column : 16
    <5a3>   DW_AT_sibling     : <0x5f3>
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x1027): nargs
    <5ac>   DW_AT_decl_file   : 17
    <5ad>   DW_AT_decl_line   : 14
    <5ae>   DW_AT_decl_column : 11
    <5af>   DW_AT_type        : <0x2b>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b6>: Abbrev Number: 9 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x97c): sys_flags
    <5bb>   DW_AT_decl_file   : 17
    <5bc>   DW_AT_decl_line   : 15
    <5bd>   DW_AT_decl_column : 6
    <5be>   DW_AT_type        : <0x64>
    <5c2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c5>: Abbrev Number: 19 (DW_TAG_member)
    <5c6>   DW_AT_name        : sen
    <5ca>   DW_AT_decl_file   : 17
    <5cb>   DW_AT_decl_line   : 16
    <5cc>   DW_AT_decl_column : 6
    <5cd>   DW_AT_type        : <0x64>
    <5d1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d4>: Abbrev Number: 9 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x31f): sys_func
    <5d9>   DW_AT_decl_file   : 17
    <5da>   DW_AT_decl_line   : 17
    <5db>   DW_AT_decl_column : 8
    <5dc>   DW_AT_type        : <0x871>
    <5e0>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e3>: Abbrev Number: 9 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x294): sys_name
    <5e8>   DW_AT_decl_file   : 17
    <5e9>   DW_AT_decl_line   : 18
    <5ea>   DW_AT_decl_column : 14
    <5eb>   DW_AT_type        : <0x1db>
    <5ef>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5f4>   DW_AT_prototyped  : 1
    <5f5>   DW_AT_type        : <0x64>
    <5f9>   DW_AT_sibling     : <0x603>
 <2><5fd>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5fe>   DW_AT_type        : <0x603>
 <2><602>: Abbrev Number: 0
 <1><603>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <604>   DW_AT_byte_size   : 4
    <605>   DW_AT_type        : <0x60e>
 <1><609>: Abbrev Number: 3 (DW_TAG_const_type)
    <60a>   DW_AT_type        : <0x603>
 <1><60e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <60f>   DW_AT_name        : tcb
    <613>   DW_AT_byte_size   : 304
    <615>   DW_AT_decl_file   : 18
    <616>   DW_AT_decl_line   : 262
    <618>   DW_AT_decl_column : 8
    <619>   DW_AT_sibling     : <0x871>
 <2><61d>: Abbrev Number: 23 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x4f2): flags
    <622>   DW_AT_decl_file   : 18
    <623>   DW_AT_decl_line   : 263
    <625>   DW_AT_decl_column : 6
    <626>   DW_AT_type        : <0x64>
    <62a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><62d>: Abbrev Number: 24 (DW_TAG_member)
    <62e>   DW_AT_name        : pid
    <632>   DW_AT_decl_file   : 18
    <633>   DW_AT_decl_line   : 264
    <635>   DW_AT_decl_column : 6
    <636>   DW_AT_type        : <0x64>
    <63a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><63d>: Abbrev Number: 23 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x61): qual_flg
    <642>   DW_AT_decl_file   : 18
    <643>   DW_AT_decl_line   : 265
    <645>   DW_AT_decl_column : 6
    <646>   DW_AT_type        : <0x64>
    <64a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><64d>: Abbrev Number: 23 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x3ab): currpers
    <652>   DW_AT_decl_file   : 18
    <653>   DW_AT_decl_line   : 267
    <655>   DW_AT_decl_column : 15
    <656>   DW_AT_type        : <0x2b>
    <65a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><65d>: Abbrev Number: 23 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0xb47): u_error
    <662>   DW_AT_decl_file   : 18
    <663>   DW_AT_decl_line   : 269
    <665>   DW_AT_decl_column : 16
    <666>   DW_AT_type        : <0x37>
    <66a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><66d>: Abbrev Number: 23 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <672>   DW_AT_decl_file   : 18
    <673>   DW_AT_decl_line   : 270
    <675>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0x557>
    <67a>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67d>: Abbrev Number: 23 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0xb80): true_scno
    <682>   DW_AT_decl_file   : 18
    <683>   DW_AT_decl_line   : 271
    <685>   DW_AT_decl_column : 17
    <686>   DW_AT_type        : <0x557>
    <68a>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><68d>: Abbrev Number: 23 (DW_TAG_member)
    <68e>   DW_AT_name        : (indirect string, offset: 0x19f): u_arg
    <692>   DW_AT_decl_file   : 18
    <693>   DW_AT_decl_line   : 272
    <695>   DW_AT_decl_column : 17
    <696>   DW_AT_type        : <0x9a1>
    <69a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><69d>: Abbrev Number: 23 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x993): u_rval
    <6a2>   DW_AT_decl_file   : 18
    <6a3>   DW_AT_decl_line   : 273
    <6a5>   DW_AT_decl_column : 16
    <6a6>   DW_AT_type        : <0x54b>
    <6aa>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6ad>: Abbrev Number: 23 (DW_TAG_member)
    <6ae>   DW_AT_name        : (indirect string, offset: 0xac6): sys_func_rval
    <6b2>   DW_AT_decl_file   : 18
    <6b3>   DW_AT_decl_line   : 274
    <6b5>   DW_AT_decl_column : 6
    <6b6>   DW_AT_type        : <0x64>
    <6ba>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6bd>: Abbrev Number: 23 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0xcdc): curcol
    <6c2>   DW_AT_decl_file   : 18
    <6c3>   DW_AT_decl_line   : 275
    <6c5>   DW_AT_decl_column : 6
    <6c6>   DW_AT_type        : <0x64>
    <6ca>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6cd>: Abbrev Number: 23 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x9a5): outf
    <6d2>   DW_AT_decl_file   : 18
    <6d3>   DW_AT_decl_line   : 276
    <6d5>   DW_AT_decl_column : 8
    <6d6>   DW_AT_type        : <0x420>
    <6da>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6dd>: Abbrev Number: 23 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0xf05): staged_output_data
    <6e2>   DW_AT_decl_file   : 18
    <6e3>   DW_AT_decl_line   : 277
    <6e5>   DW_AT_decl_column : 29
    <6e6>   DW_AT_type        : <0x9b7>
    <6ea>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6ed>: Abbrev Number: 23 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xa91): auxstr
    <6f2>   DW_AT_decl_file   : 18
    <6f3>   DW_AT_decl_line   : 279
    <6f5>   DW_AT_decl_column : 14
    <6f6>   DW_AT_type        : <0x1db>
    <6fa>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6fd>: Abbrev Number: 23 (DW_TAG_member)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <702>   DW_AT_decl_file   : 18
    <703>   DW_AT_decl_line   : 280
    <705>   DW_AT_decl_column : 8
    <706>   DW_AT_type        : <0xc6>
    <70a>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><70d>: Abbrev Number: 23 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0xc15): _free_priv_data
    <712>   DW_AT_decl_file   : 18
    <713>   DW_AT_decl_line   : 281
    <715>   DW_AT_decl_column : 9
    <716>   DW_AT_type        : <0x9c9>
    <71a>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><71d>: Abbrev Number: 23 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <722>   DW_AT_decl_file   : 18
    <723>   DW_AT_decl_line   : 282
    <725>   DW_AT_decl_column : 23
    <726>   DW_AT_type        : <0x9cf>
    <72a>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><72d>: Abbrev Number: 23 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0x20): s_prev_ent
    <732>   DW_AT_decl_file   : 18
    <733>   DW_AT_decl_line   : 285
    <735>   DW_AT_decl_column : 23
    <736>   DW_AT_type        : <0x9cf>
    <73a>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><73e>: Abbrev Number: 23 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x3a0): inject_vec
    <743>   DW_AT_decl_file   : 18
    <744>   DW_AT_decl_line   : 286
    <746>   DW_AT_decl_column : 22
    <747>   DW_AT_type        : <0x9da>
    <74b>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x7f0): stime
    <754>   DW_AT_decl_file   : 18
    <755>   DW_AT_decl_line   : 287
    <757>   DW_AT_decl_column : 18
    <758>   DW_AT_type        : <0x13f>
    <75c>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><760>: Abbrev Number: 23 (DW_TAG_member)
    <761>   DW_AT_name        : (indirect string, offset: 0x3b4): ltime
    <765>   DW_AT_decl_file   : 18
    <766>   DW_AT_decl_line   : 288
    <768>   DW_AT_decl_column : 18
    <769>   DW_AT_type        : <0x13f>
    <76d>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><771>: Abbrev Number: 23 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0xfee): atime
    <776>   DW_AT_decl_file   : 18
    <777>   DW_AT_decl_line   : 289
    <779>   DW_AT_decl_column : 18
    <77a>   DW_AT_type        : <0x13f>
    <77e>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><782>: Abbrev Number: 23 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4ec): etime
    <787>   DW_AT_decl_file   : 18
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x13f>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><793>: Abbrev Number: 23 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd40): delay_expiration_time
    <798>   DW_AT_decl_file   : 18
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x13f>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7a4>: Abbrev Number: 23 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x2b): pid_ns
    <7a9>   DW_AT_decl_file   : 18
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7b5>: Abbrev Number: 23 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xf41): last_dirfd
    <7ba>   DW_AT_decl_file   : 18
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7c6>: Abbrev Number: 23 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf67): mmap_cache
    <7cb>   DW_AT_decl_file   : 18
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9f6>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7d7>: Abbrev Number: 23 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb56): wait_data_idx
    <7dc>   DW_AT_decl_file   : 18
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x12e>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7e8>: Abbrev Number: 23 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa98): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 18
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0xa02>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f9>: Abbrev Number: 23 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xb08): wait_list
    <7fe>   DW_AT_decl_file   : 18
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x568>
    <806>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><80a>: Abbrev Number: 23 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6e5): vcpu_info_list
    <80f>   DW_AT_decl_file   : 18
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0xa0e>
    <817>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><81b>: Abbrev Number: 23 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xca7): unwind_ctx
    <820>   DW_AT_decl_file   : 18
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xc6>
    <828>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><82c>: Abbrev Number: 23 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x4ca): unwind_queue
    <831>   DW_AT_decl_file   : 18
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0xa1a>
    <839>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><83d>: Abbrev Number: 23 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <842>   DW_AT_decl_file   : 18
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0xa20>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><84e>: Abbrev Number: 23 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x236): start_prc
    <853>   DW_AT_decl_file   : 18
    <854>   DW_AT_decl_line   : 329
    <856>   DW_AT_decl_column : 16
    <857>   DW_AT_type        : <0x37>
    <85b>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><85f>: Abbrev Number: 23 (DW_TAG_member)
    <860>   DW_AT_name        : (indirect string, offset: 0xfc2): pre_comm
    <864>   DW_AT_decl_file   : 18
    <865>   DW_AT_decl_line   : 330
    <867>   DW_AT_decl_column : 7
    <868>   DW_AT_type        : <0xa20>
    <86c>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><870>: Abbrev Number: 0
 <1><871>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <872>   DW_AT_byte_size   : 4
    <873>   DW_AT_type        : <0x5f3>
 <1><877>: Abbrev Number: 4 (DW_TAG_typedef)
    <878>   DW_AT_name        : (indirect string, offset: 0x5be): struct_sysent
    <87c>   DW_AT_decl_file   : 17
    <87d>   DW_AT_decl_line   : 19
    <87e>   DW_AT_decl_column : 3
    <87f>   DW_AT_type        : <0x59a>
 <1><883>: Abbrev Number: 3 (DW_TAG_const_type)
    <884>   DW_AT_type        : <0x877>
 <1><888>: Abbrev Number: 12 (DW_TAG_variable)
    <889>   DW_AT_name        : (indirect string, offset: 0xd2c): current_personality
    <88d>   DW_AT_decl_file   : 18
    <88e>   DW_AT_decl_line   : 158
    <88f>   DW_AT_decl_column : 17
    <890>   DW_AT_type        : <0x2b>
    <894>   DW_AT_external    : 1
    <895>   DW_AT_declaration : 1
 <1><896>: Abbrev Number: 12 (DW_TAG_variable)
    <897>   DW_AT_name        : (indirect string, offset: 0x821): current_wordsize
    <89b>   DW_AT_decl_file   : 18
    <89c>   DW_AT_decl_line   : 171
    <89d>   DW_AT_decl_column : 17
    <89e>   DW_AT_type        : <0x2b>
    <8a2>   DW_AT_external    : 1
    <8a3>   DW_AT_declaration : 1
 <1><8a4>: Abbrev Number: 12 (DW_TAG_variable)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xa6f): current_klongsize
    <8a9>   DW_AT_decl_file   : 18
    <8aa>   DW_AT_decl_line   : 176
    <8ab>   DW_AT_decl_column : 17
    <8ac>   DW_AT_type        : <0x2b>
    <8b0>   DW_AT_external    : 1
    <8b1>   DW_AT_declaration : 1
 <1><8b2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xc7e): ioctlent
    <8b7>   DW_AT_byte_size   : 8
    <8b8>   DW_AT_decl_file   : 18
    <8b9>   DW_AT_decl_line   : 217
    <8ba>   DW_AT_decl_column : 16
    <8bb>   DW_AT_sibling     : <0x8de>
 <2><8bf>: Abbrev Number: 9 (DW_TAG_member)
    <8c0>   DW_AT_name        : (indirect string, offset: 0xf2d): symbol
    <8c4>   DW_AT_decl_file   : 18
    <8c5>   DW_AT_decl_line   : 218
    <8c6>   DW_AT_decl_column : 14
    <8c7>   DW_AT_type        : <0x1db>
    <8cb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ce>: Abbrev Number: 9 (DW_TAG_member)
    <8cf>   DW_AT_name        : (indirect string, offset: 0xcf5): code
    <8d3>   DW_AT_decl_file   : 18
    <8d4>   DW_AT_decl_line   : 219
    <8d5>   DW_AT_decl_column : 15
    <8d6>   DW_AT_type        : <0x2b>
    <8da>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8dd>: Abbrev Number: 0
 <1><8de>: Abbrev Number: 4 (DW_TAG_typedef)
    <8df>   DW_AT_name        : (indirect string, offset: 0xc3f): struct_ioctlent
    <8e3>   DW_AT_decl_file   : 18
    <8e4>   DW_AT_decl_line   : 220
    <8e5>   DW_AT_decl_column : 3
    <8e6>   DW_AT_type        : <0x8b2>
 <1><8ea>: Abbrev Number: 3 (DW_TAG_const_type)
    <8eb>   DW_AT_type        : <0x8de>
 <1><8ef>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x815): inject_data
    <8f4>   DW_AT_byte_size   : 10
    <8f5>   DW_AT_decl_file   : 18
    <8f6>   DW_AT_decl_line   : 241
    <8f7>   DW_AT_decl_column : 8
    <8f8>   DW_AT_sibling     : <0x957>
 <2><8fc>: Abbrev Number: 9 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x4f2): flags
    <901>   DW_AT_decl_file   : 18
    <902>   DW_AT_decl_line   : 242
    <903>   DW_AT_decl_column : 10
    <904>   DW_AT_type        : <0xf7>
    <908>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90b>: Abbrev Number: 9 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0x930): signo
    <910>   DW_AT_decl_file   : 18
    <911>   DW_AT_decl_line   : 243
    <912>   DW_AT_decl_column : 10
    <913>   DW_AT_type        : <0xf7>
    <917>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><91a>: Abbrev Number: 9 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <91f>   DW_AT_decl_file   : 18
    <920>   DW_AT_decl_line   : 244
    <921>   DW_AT_decl_column : 11
    <922>   DW_AT_type        : <0x103>
    <926>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><929>: Abbrev Number: 9 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0xcd2): delay_idx
    <92e>   DW_AT_decl_file   : 18
    <92f>   DW_AT_decl_line   : 245
    <930>   DW_AT_decl_column : 11
    <931>   DW_AT_type        : <0x103>
    <935>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><938>: Abbrev Number: 9 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x613): poke_idx
    <93d>   DW_AT_decl_file   : 18
    <93e>   DW_AT_decl_line   : 246
    <93f>   DW_AT_decl_column : 11
    <940>   DW_AT_type        : <0x103>
    <944>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><947>: Abbrev Number: 9 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <94c>   DW_AT_decl_file   : 18
    <94d>   DW_AT_decl_line   : 247
    <94e>   DW_AT_decl_column : 11
    <94f>   DW_AT_type        : <0x103>
    <953>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><956>: Abbrev Number: 0
 <1><957>: Abbrev Number: 8 (DW_TAG_structure_type)
    <958>   DW_AT_name        : (indirect string, offset: 0xe6): inject_opts
    <95c>   DW_AT_byte_size   : 16
    <95d>   DW_AT_decl_file   : 18
    <95e>   DW_AT_decl_line   : 250
    <95f>   DW_AT_decl_column : 8
    <960>   DW_AT_sibling     : <0x9a1>
 <2><964>: Abbrev Number: 9 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0xa2e): first
    <969>   DW_AT_decl_file   : 18
    <96a>   DW_AT_decl_line   : 251
    <96b>   DW_AT_decl_column : 11
    <96c>   DW_AT_type        : <0x103>
    <970>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><973>: Abbrev Number: 9 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x10f7): last
    <978>   DW_AT_decl_file   : 18
    <979>   DW_AT_decl_line   : 252
    <97a>   DW_AT_decl_column : 11
    <97b>   DW_AT_type        : <0x103>
    <97f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><982>: Abbrev Number: 9 (DW_TAG_member)
    <983>   DW_AT_name        : (indirect string, offset: 0x3ba): step
    <987>   DW_AT_decl_file   : 18
    <988>   DW_AT_decl_line   : 253
    <989>   DW_AT_decl_column : 11
    <98a>   DW_AT_type        : <0x103>
    <98e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><991>: Abbrev Number: 9 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x10c9): data
    <996>   DW_AT_decl_file   : 18
    <997>   DW_AT_decl_line   : 254
    <998>   DW_AT_decl_column : 21
    <999>   DW_AT_type        : <0x8ef>
    <99d>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a0>: Abbrev Number: 0
 <1><9a1>: Abbrev Number: 16 (DW_TAG_array_type)
    <9a2>   DW_AT_type        : <0x557>
    <9a6>   DW_AT_sibling     : <0x9b1>
 <2><9aa>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9ab>   DW_AT_type        : <0x2b>
    <9af>   DW_AT_upper_bound : 5
 <2><9b0>: Abbrev Number: 0
 <1><9b1>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9b2>   DW_AT_name        : (indirect string, offset: 0xf05): staged_output_data
    <9b6>   DW_AT_declaration : 1
 <1><9b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b8>   DW_AT_byte_size   : 4
    <9b9>   DW_AT_type        : <0x9b1>
 <1><9bd>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9be>   DW_AT_prototyped  : 1
    <9bf>   DW_AT_sibling     : <0x9c9>
 <2><9c3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9c4>   DW_AT_type        : <0xc6>
 <2><9c8>: Abbrev Number: 0
 <1><9c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ca>   DW_AT_byte_size   : 4
    <9cb>   DW_AT_type        : <0x9bd>
 <1><9cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d0>   DW_AT_byte_size   : 4
    <9d1>   DW_AT_type        : <0x883>
 <1><9d5>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d6>   DW_AT_type        : <0x9cf>
 <1><9da>: Abbrev Number: 16 (DW_TAG_array_type)
    <9db>   DW_AT_type        : <0x9ea>
    <9df>   DW_AT_sibling     : <0x9ea>
 <2><9e3>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9e4>   DW_AT_type        : <0x2b>
    <9e8>   DW_AT_upper_bound : 2
 <2><9e9>: Abbrev Number: 0
 <1><9ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9eb>   DW_AT_byte_size   : 4
    <9ec>   DW_AT_type        : <0x957>
 <1><9f0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xb2): mmap_cache_t
    <9f5>   DW_AT_declaration : 1
 <1><9f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f7>   DW_AT_byte_size   : 4
    <9f8>   DW_AT_type        : <0x9f0>
 <1><9fc>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x3d5): tcb_wait_data
    <a01>   DW_AT_declaration : 1
 <1><a02>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a03>   DW_AT_byte_size   : 4
    <a04>   DW_AT_type        : <0x9fc>
 <1><a08>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a09>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <a0d>   DW_AT_declaration : 1
 <1><a0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0f>   DW_AT_byte_size   : 4
    <a10>   DW_AT_type        : <0xa08>
 <1><a14>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a15>   DW_AT_name        : (indirect string, offset: 0xee9): unwind_queue_t
    <a19>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0xa14>
 <1><a20>: Abbrev Number: 16 (DW_TAG_array_type)
    <a21>   DW_AT_type        : <0xdf>
    <a25>   DW_AT_sibling     : <0xa30>
 <2><a29>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a2a>   DW_AT_type        : <0x2b>
    <a2e>   DW_AT_upper_bound : 15
 <2><a2f>: Abbrev Number: 0
 <1><a30>: Abbrev Number: 11 (DW_TAG_variable)
    <a31>   DW_AT_name        : (indirect string, offset: 0xb93): stub_sysent
    <a35>   DW_AT_decl_file   : 18
    <a36>   DW_AT_decl_line   : 405
    <a38>   DW_AT_decl_column : 28
    <a39>   DW_AT_type        : <0x883>
    <a3d>   DW_AT_external    : 1
    <a3e>   DW_AT_declaration : 1
 <1><a3f>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a40>   DW_AT_name        : (indirect string, offset: 0x10ac): xlat_type
    <a44>   DW_AT_encoding    : 7	(unsigned)
    <a45>   DW_AT_byte_size   : 4
    <a46>   DW_AT_type        : <0x2b>
    <a4a>   DW_AT_decl_file   : 19
    <a4b>   DW_AT_decl_line   : 13
    <a4c>   DW_AT_decl_column : 6
    <a4d>   DW_AT_sibling     : <0xa64>
 <2><a51>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a52>   DW_AT_name        : (indirect string, offset: 0x2ef): XT_NORMAL
    <a56>   DW_AT_const_value : 0
 <2><a57>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0xc56): XT_SORTED
    <a5c>   DW_AT_const_value : 1
 <2><a5d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xdd2): XT_INDEXED
    <a62>   DW_AT_const_value : 2
 <2><a63>: Abbrev Number: 0
 <1><a64>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a65>   DW_AT_name        : (indirect string, offset: 0xbbf): xlat_style
    <a69>   DW_AT_encoding    : 7	(unsigned)
    <a6a>   DW_AT_byte_size   : 4
    <a6b>   DW_AT_type        : <0x2b>
    <a6f>   DW_AT_decl_file   : 19
    <a70>   DW_AT_decl_line   : 19
    <a71>   DW_AT_decl_column : 6
    <a72>   DW_AT_sibling     : <0xaa1>
 <2><a76>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a77>   DW_AT_name        : (indirect string, offset: 0xf2): XLAT_STYLE_DEFAULT
    <a7b>   DW_AT_const_value : 0
 <2><a7c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0xbf2): XLAT_STYLE_RAW
    <a81>   DW_AT_const_value : 1
 <2><a82>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0x1077): XLAT_STYLE_ABBREV
    <a87>   DW_AT_const_value : 2
 <2><a88>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0x30c): XLAT_STYLE_VERBOSE
    <a8d>   DW_AT_const_value : 3
 <2><a8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x279): XLAT_STYLE_FMT_X
    <a93>   DW_AT_const_value : 0
 <2><a94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a99>   DW_AT_const_value : 4
 <2><a9a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x10e6): XLAT_STYLE_FMT_D
    <a9f>   DW_AT_const_value : 8
 <2><aa0>: Abbrev Number: 0
 <1><aa1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x33d): xlat_data
    <aa6>   DW_AT_byte_size   : 16
    <aa7>   DW_AT_decl_file   : 19
    <aa8>   DW_AT_decl_line   : 51
    <aa9>   DW_AT_decl_column : 8
    <aaa>   DW_AT_sibling     : <0xacd>
 <2><aae>: Abbrev Number: 19 (DW_TAG_member)
    <aaf>   DW_AT_name        : val
    <ab3>   DW_AT_decl_file   : 19
    <ab4>   DW_AT_decl_line   : 52
    <ab5>   DW_AT_decl_column : 11
    <ab6>   DW_AT_type        : <0x11b>
    <aba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><abd>: Abbrev Number: 19 (DW_TAG_member)
    <abe>   DW_AT_name        : str
    <ac2>   DW_AT_decl_file   : 19
    <ac3>   DW_AT_decl_line   : 53
    <ac4>   DW_AT_decl_column : 14
    <ac5>   DW_AT_type        : <0x1db>
    <ac9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><acc>: Abbrev Number: 0
 <1><acd>: Abbrev Number: 3 (DW_TAG_const_type)
    <ace>   DW_AT_type        : <0xaa1>
 <1><ad2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x1b): xlat
    <ad7>   DW_AT_byte_size   : 24
    <ad8>   DW_AT_decl_file   : 19
    <ad9>   DW_AT_decl_line   : 56
    <ada>   DW_AT_decl_column : 8
    <adb>   DW_AT_sibling     : <0xb2b>
 <2><adf>: Abbrev Number: 9 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x10c9): data
    <ae4>   DW_AT_decl_file   : 19
    <ae5>   DW_AT_decl_line   : 57
    <ae6>   DW_AT_decl_column : 26
    <ae7>   DW_AT_type        : <0xb30>
    <aeb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aee>: Abbrev Number: 9 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x873): flags_strsz
    <af3>   DW_AT_decl_file   : 19
    <af4>   DW_AT_decl_line   : 58
    <af5>   DW_AT_decl_column : 9
    <af6>   DW_AT_type        : <0x12e>
    <afa>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><afd>: Abbrev Number: 9 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0xb64): size
    <b02>   DW_AT_decl_file   : 19
    <b03>   DW_AT_decl_line   : 59
    <b04>   DW_AT_decl_column : 11
    <b05>   DW_AT_type        : <0x10f>
    <b09>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b0c>: Abbrev Number: 9 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x19a): type
    <b11>   DW_AT_decl_file   : 19
    <b12>   DW_AT_decl_line   : 60
    <b13>   DW_AT_decl_column : 17
    <b14>   DW_AT_type        : <0xa3f>
    <b18>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b1b>: Abbrev Number: 9 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x739): flags_mask
    <b20>   DW_AT_decl_file   : 19
    <b21>   DW_AT_decl_line   : 61
    <b22>   DW_AT_decl_column : 11
    <b23>   DW_AT_type        : <0x11b>
    <b27>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b2a>: Abbrev Number: 0
 <1><b2b>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2c>   DW_AT_type        : <0xad2>
 <1><b30>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b31>   DW_AT_byte_size   : 4
    <b32>   DW_AT_type        : <0xacd>
 <1><b36>: Abbrev Number: 16 (DW_TAG_array_type)
    <b37>   DW_AT_type        : <0xb2b>
    <b3b>   DW_AT_sibling     : <0xb41>
 <2><b3f>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b40>: Abbrev Number: 0
 <1><b41>: Abbrev Number: 3 (DW_TAG_const_type)
    <b42>   DW_AT_type        : <0xb36>
 <1><b46>: Abbrev Number: 11 (DW_TAG_variable)
    <b47>   DW_AT_name        : (indirect string, offset: 0xe43): addrfams
    <b4b>   DW_AT_decl_file   : 18
    <b4c>   DW_AT_decl_line   : 411
    <b4e>   DW_AT_decl_column : 26
    <b4f>   DW_AT_type        : <0xb41>
    <b53>   DW_AT_external    : 1
    <b54>   DW_AT_declaration : 1
 <1><b55>: Abbrev Number: 11 (DW_TAG_variable)
    <b56>   DW_AT_name        : (indirect string, offset: 0xd05): arp_hardware_types
    <b5a>   DW_AT_decl_file   : 18
    <b5b>   DW_AT_decl_line   : 412
    <b5d>   DW_AT_decl_column : 26
    <b5e>   DW_AT_type        : <0xb41>
    <b62>   DW_AT_external    : 1
    <b63>   DW_AT_declaration : 1
 <1><b64>: Abbrev Number: 11 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0xff4): at_flags
    <b69>   DW_AT_decl_file   : 18
    <b6a>   DW_AT_decl_line   : 413
    <b6c>   DW_AT_decl_column : 26
    <b6d>   DW_AT_type        : <0xb41>
    <b71>   DW_AT_external    : 1
    <b72>   DW_AT_declaration : 1
 <1><b73>: Abbrev Number: 11 (DW_TAG_variable)
    <b74>   DW_AT_name        : (indirect string, offset: 0x4a1): clocknames
    <b78>   DW_AT_decl_file   : 18
    <b79>   DW_AT_decl_line   : 414
    <b7b>   DW_AT_decl_column : 26
    <b7c>   DW_AT_type        : <0xb41>
    <b80>   DW_AT_external    : 1
    <b81>   DW_AT_declaration : 1
 <1><b82>: Abbrev Number: 11 (DW_TAG_variable)
    <b83>   DW_AT_name        : (indirect string, offset: 0xfb5): dirent_types
    <b87>   DW_AT_decl_file   : 18
    <b88>   DW_AT_decl_line   : 415
    <b8a>   DW_AT_decl_column : 26
    <b8b>   DW_AT_type        : <0xb41>
    <b8f>   DW_AT_external    : 1
    <b90>   DW_AT_declaration : 1
 <1><b91>: Abbrev Number: 11 (DW_TAG_variable)
    <b92>   DW_AT_name        : (indirect string, offset: 0x8c4): ethernet_protocols
    <b96>   DW_AT_decl_file   : 18
    <b97>   DW_AT_decl_line   : 416
    <b99>   DW_AT_decl_column : 26
    <b9a>   DW_AT_type        : <0xb41>
    <b9e>   DW_AT_external    : 1
    <b9f>   DW_AT_declaration : 1
 <1><ba0>: Abbrev Number: 11 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x666): inet_protocols
    <ba5>   DW_AT_decl_file   : 18
    <ba6>   DW_AT_decl_line   : 417
    <ba8>   DW_AT_decl_column : 26
    <ba9>   DW_AT_type        : <0xb41>
    <bad>   DW_AT_external    : 1
    <bae>   DW_AT_declaration : 1
 <1><baf>: Abbrev Number: 11 (DW_TAG_variable)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x2dc): evdev_abs
    <bb4>   DW_AT_decl_file   : 18
    <bb5>   DW_AT_decl_line   : 418
    <bb7>   DW_AT_decl_column : 26
    <bb8>   DW_AT_type        : <0xb41>
    <bbc>   DW_AT_external    : 1
    <bbd>   DW_AT_declaration : 1
 <1><bbe>: Abbrev Number: 11 (DW_TAG_variable)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x72e): audit_arch
    <bc3>   DW_AT_decl_file   : 18
    <bc4>   DW_AT_decl_line   : 419
    <bc6>   DW_AT_decl_column : 26
    <bc7>   DW_AT_type        : <0xb41>
    <bcb>   DW_AT_external    : 1
    <bcc>   DW_AT_declaration : 1
 <1><bcd>: Abbrev Number: 11 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0x9e): evdev_ev
    <bd2>   DW_AT_decl_file   : 18
    <bd3>   DW_AT_decl_line   : 420
    <bd5>   DW_AT_decl_column : 26
    <bd6>   DW_AT_type        : <0xb41>
    <bda>   DW_AT_external    : 1
    <bdb>   DW_AT_declaration : 1
 <1><bdc>: Abbrev Number: 11 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x482): iffflags
    <be1>   DW_AT_decl_file   : 18
    <be2>   DW_AT_decl_line   : 421
    <be4>   DW_AT_decl_column : 26
    <be5>   DW_AT_type        : <0xb41>
    <be9>   DW_AT_external    : 1
    <bea>   DW_AT_declaration : 1
 <1><beb>: Abbrev Number: 11 (DW_TAG_variable)
    <bec>   DW_AT_name        : (indirect string, offset: 0xc01): ip_type_of_services
    <bf0>   DW_AT_decl_file   : 18
    <bf1>   DW_AT_decl_line   : 422
    <bf3>   DW_AT_decl_column : 26
    <bf4>   DW_AT_type        : <0xb41>
    <bf8>   DW_AT_external    : 1
    <bf9>   DW_AT_declaration : 1
 <1><bfa>: Abbrev Number: 11 (DW_TAG_variable)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x6c1): ipc_private
    <bff>   DW_AT_decl_file   : 18
    <c00>   DW_AT_decl_line   : 423
    <c02>   DW_AT_decl_column : 26
    <c03>   DW_AT_type        : <0xb41>
    <c07>   DW_AT_external    : 1
    <c08>   DW_AT_declaration : 1
 <1><c09>: Abbrev Number: 11 (DW_TAG_variable)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x333): msg_flags
    <c0e>   DW_AT_decl_file   : 18
    <c0f>   DW_AT_decl_line   : 424
    <c11>   DW_AT_decl_column : 26
    <c12>   DW_AT_type        : <0xb41>
    <c16>   DW_AT_external    : 1
    <c17>   DW_AT_declaration : 1
 <1><c18>: Abbrev Number: 11 (DW_TAG_variable)
    <c19>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c1d>   DW_AT_decl_file   : 18
    <c1e>   DW_AT_decl_line   : 425
    <c20>   DW_AT_decl_column : 26
    <c21>   DW_AT_type        : <0xb41>
    <c25>   DW_AT_external    : 1
    <c26>   DW_AT_declaration : 1
 <1><c27>: Abbrev Number: 11 (DW_TAG_variable)
    <c28>   DW_AT_name        : (indirect string, offset: 0xf18): nl_bridge_vlan_flags
    <c2c>   DW_AT_decl_file   : 18
    <c2d>   DW_AT_decl_line   : 426
    <c2f>   DW_AT_decl_column : 26
    <c30>   DW_AT_type        : <0xb41>
    <c34>   DW_AT_external    : 1
    <c35>   DW_AT_declaration : 1
 <1><c36>: Abbrev Number: 11 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0xdbb): nl_netfilter_msg_types
    <c3b>   DW_AT_decl_file   : 18
    <c3c>   DW_AT_decl_line   : 427
    <c3e>   DW_AT_decl_column : 26
    <c3f>   DW_AT_type        : <0xb41>
    <c43>   DW_AT_external    : 1
    <c44>   DW_AT_declaration : 1
 <1><c45>: Abbrev Number: 11 (DW_TAG_variable)
    <c46>   DW_AT_name        : (indirect string, offset: 0x464): nl_route_types
    <c4a>   DW_AT_decl_file   : 18
    <c4b>   DW_AT_decl_line   : 428
    <c4d>   DW_AT_decl_column : 26
    <c4e>   DW_AT_type        : <0xb41>
    <c52>   DW_AT_external    : 1
    <c53>   DW_AT_declaration : 1
 <1><c54>: Abbrev Number: 11 (DW_TAG_variable)
    <c55>   DW_AT_name        : (indirect string, offset: 0xe7a): open_access_modes
    <c59>   DW_AT_decl_file   : 18
    <c5a>   DW_AT_decl_line   : 429
    <c5c>   DW_AT_decl_column : 26
    <c5d>   DW_AT_type        : <0xb41>
    <c61>   DW_AT_external    : 1
    <c62>   DW_AT_declaration : 1
 <1><c63>: Abbrev Number: 11 (DW_TAG_variable)
    <c64>   DW_AT_name        : (indirect string, offset: 0x8e): open_mode_flags
    <c68>   DW_AT_decl_file   : 18
    <c69>   DW_AT_decl_line   : 430
    <c6b>   DW_AT_decl_column : 26
    <c6c>   DW_AT_type        : <0xb41>
    <c70>   DW_AT_external    : 1
    <c71>   DW_AT_declaration : 1
 <1><c72>: Abbrev Number: 11 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0xc32): perf_type_id
    <c77>   DW_AT_decl_file   : 18
    <c78>   DW_AT_decl_line   : 431
    <c7a>   DW_AT_decl_column : 26
    <c7b>   DW_AT_type        : <0xb41>
    <c7f>   DW_AT_external    : 1
    <c80>   DW_AT_declaration : 1
 <1><c81>: Abbrev Number: 11 (DW_TAG_variable)
    <c82>   DW_AT_name        : (indirect string, offset: 0xe4c): pollflags
    <c86>   DW_AT_decl_file   : 18
    <c87>   DW_AT_decl_line   : 432
    <c89>   DW_AT_decl_column : 26
    <c8a>   DW_AT_type        : <0xb41>
    <c8e>   DW_AT_external    : 1
    <c8f>   DW_AT_declaration : 1
 <1><c90>: Abbrev Number: 11 (DW_TAG_variable)
    <c91>   DW_AT_name        : (indirect string, offset: 0x607): ptrace_cmds
    <c95>   DW_AT_decl_file   : 18
    <c96>   DW_AT_decl_line   : 433
    <c98>   DW_AT_decl_column : 26
    <c99>   DW_AT_type        : <0xb41>
    <c9d>   DW_AT_external    : 1
    <c9e>   DW_AT_declaration : 1
 <1><c9f>: Abbrev Number: 11 (DW_TAG_variable)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x806): resource_flags
    <ca4>   DW_AT_decl_file   : 18
    <ca5>   DW_AT_decl_line   : 434
    <ca7>   DW_AT_decl_column : 26
    <ca8>   DW_AT_type        : <0xb41>
    <cac>   DW_AT_external    : 1
    <cad>   DW_AT_declaration : 1
 <1><cae>: Abbrev Number: 11 (DW_TAG_variable)
    <caf>   DW_AT_name        : (indirect string, offset: 0x2b2): route_nexthop_flags
    <cb3>   DW_AT_decl_file   : 18
    <cb4>   DW_AT_decl_line   : 435
    <cb6>   DW_AT_decl_column : 26
    <cb7>   DW_AT_type        : <0xb41>
    <cbb>   DW_AT_external    : 1
    <cbc>   DW_AT_declaration : 1
 <1><cbd>: Abbrev Number: 11 (DW_TAG_variable)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xea3): routing_protocols
    <cc2>   DW_AT_decl_file   : 18
    <cc3>   DW_AT_decl_line   : 436
    <cc5>   DW_AT_decl_column : 26
    <cc6>   DW_AT_type        : <0xb41>
    <cca>   DW_AT_external    : 1
    <ccb>   DW_AT_declaration : 1
 <1><ccc>: Abbrev Number: 11 (DW_TAG_variable)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x473): routing_scopes
    <cd1>   DW_AT_decl_file   : 18
    <cd2>   DW_AT_decl_line   : 437
    <cd4>   DW_AT_decl_column : 26
    <cd5>   DW_AT_type        : <0xb41>
    <cd9>   DW_AT_external    : 1
    <cda>   DW_AT_declaration : 1
 <1><cdb>: Abbrev Number: 11 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xda9): routing_table_ids
    <ce0>   DW_AT_decl_file   : 18
    <ce1>   DW_AT_decl_line   : 438
    <ce3>   DW_AT_decl_column : 26
    <ce4>   DW_AT_type        : <0xb41>
    <ce8>   DW_AT_external    : 1
    <ce9>   DW_AT_declaration : 1
 <1><cea>: Abbrev Number: 11 (DW_TAG_variable)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x69e): routing_types
    <cef>   DW_AT_decl_file   : 18
    <cf0>   DW_AT_decl_line   : 439
    <cf2>   DW_AT_decl_column : 26
    <cf3>   DW_AT_type        : <0xb41>
    <cf7>   DW_AT_external    : 1
    <cf8>   DW_AT_declaration : 1
 <1><cf9>: Abbrev Number: 11 (DW_TAG_variable)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x1be): rwf_flags
    <cfe>   DW_AT_decl_file   : 18
    <cff>   DW_AT_decl_line   : 440
    <d01>   DW_AT_decl_column : 26
    <d02>   DW_AT_type        : <0xb41>
    <d06>   DW_AT_external    : 1
    <d07>   DW_AT_declaration : 1
 <1><d08>: Abbrev Number: 11 (DW_TAG_variable)
    <d09>   DW_AT_name        : (indirect string, offset: 0x83e): seccomp_filter_flags
    <d0d>   DW_AT_decl_file   : 18
    <d0e>   DW_AT_decl_line   : 441
    <d10>   DW_AT_decl_column : 26
    <d11>   DW_AT_type        : <0xb41>
    <d15>   DW_AT_external    : 1
    <d16>   DW_AT_declaration : 1
 <1><d17>: Abbrev Number: 11 (DW_TAG_variable)
    <d18>   DW_AT_name        : (indirect string, offset: 0x2f9): seccomp_ret_action
    <d1c>   DW_AT_decl_file   : 18
    <d1d>   DW_AT_decl_line   : 442
    <d1f>   DW_AT_decl_column : 26
    <d20>   DW_AT_type        : <0xb41>
    <d24>   DW_AT_external    : 1
    <d25>   DW_AT_declaration : 1
 <1><d26>: Abbrev Number: 11 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0x43f): setns_types
    <d2b>   DW_AT_decl_file   : 18
    <d2c>   DW_AT_decl_line   : 443
    <d2e>   DW_AT_decl_column : 26
    <d2f>   DW_AT_type        : <0xb41>
    <d33>   DW_AT_external    : 1
    <d34>   DW_AT_declaration : 1
 <1><d35>: Abbrev Number: 11 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0xe38): sg_io_info
    <d3a>   DW_AT_decl_file   : 18
    <d3b>   DW_AT_decl_line   : 444
    <d3d>   DW_AT_decl_column : 26
    <d3e>   DW_AT_type        : <0xb41>
    <d42>   DW_AT_external    : 1
    <d43>   DW_AT_declaration : 1
 <1><d44>: Abbrev Number: 11 (DW_TAG_variable)
    <d45>   DW_AT_name        : (indirect string, offset: 0xba7): socketlayers
    <d49>   DW_AT_decl_file   : 18
    <d4a>   DW_AT_decl_line   : 445
    <d4c>   DW_AT_decl_column : 26
    <d4d>   DW_AT_type        : <0xb41>
    <d51>   DW_AT_external    : 1
    <d52>   DW_AT_declaration : 1
 <1><d53>: Abbrev Number: 11 (DW_TAG_variable)
    <d54>   DW_AT_name        : (indirect string, offset: 0xd79): socktypes
    <d58>   DW_AT_decl_file   : 18
    <d59>   DW_AT_decl_line   : 446
    <d5b>   DW_AT_decl_column : 26
    <d5c>   DW_AT_type        : <0xb41>
    <d60>   DW_AT_external    : 1
    <d61>   DW_AT_declaration : 1
 <1><d62>: Abbrev Number: 11 (DW_TAG_variable)
    <d63>   DW_AT_name        : (indirect string, offset: 0xa81): tcp_state_flags
    <d67>   DW_AT_decl_file   : 18
    <d68>   DW_AT_decl_line   : 447
    <d6a>   DW_AT_decl_column : 26
    <d6b>   DW_AT_type        : <0xb41>
    <d6f>   DW_AT_external    : 1
    <d70>   DW_AT_declaration : 1
 <1><d71>: Abbrev Number: 11 (DW_TAG_variable)
    <d72>   DW_AT_name        : (indirect string, offset: 0x763): tcp_states
    <d76>   DW_AT_decl_file   : 18
    <d77>   DW_AT_decl_line   : 448
    <d79>   DW_AT_decl_column : 26
    <d7a>   DW_AT_type        : <0xb41>
    <d7e>   DW_AT_external    : 1
    <d7f>   DW_AT_declaration : 1
 <1><d80>: Abbrev Number: 11 (DW_TAG_variable)
    <d81>   DW_AT_name        : (indirect string, offset: 0x105a): whence_codes
    <d85>   DW_AT_decl_file   : 18
    <d86>   DW_AT_decl_line   : 449
    <d88>   DW_AT_decl_column : 26
    <d89>   DW_AT_type        : <0xb41>
    <d8d>   DW_AT_external    : 1
    <d8e>   DW_AT_declaration : 1
 <1><d8f>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d90>   DW_AT_encoding    : 7	(unsigned)
    <d91>   DW_AT_byte_size   : 4
    <d92>   DW_AT_type        : <0x2b>
    <d96>   DW_AT_decl_file   : 18
    <d97>   DW_AT_decl_line   : 510
    <d99>   DW_AT_decl_column : 14
    <d9a>   DW_AT_sibling     : <0xdb1>
 <2><d9e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d9f>   DW_AT_name        : (indirect string, offset: 0x99a): CFLAG_NONE
    <da3>   DW_AT_const_value : 0
 <2><da4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0x8d7): CFLAG_ONLY_STATS
    <da9>   DW_AT_const_value : 1
 <2><daa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0xbb4): CFLAG_BOTH
    <daf>   DW_AT_const_value : 2
 <2><db0>: Abbrev Number: 0
 <1><db1>: Abbrev Number: 10 (DW_TAG_typedef)
    <db2>   DW_AT_name        : (indirect string, offset: 0x10fc): cflag_t
    <db6>   DW_AT_decl_file   : 18
    <db7>   DW_AT_decl_line   : 514
    <db9>   DW_AT_decl_column : 3
    <dba>   DW_AT_type        : <0xd8f>
 <1><dbe>: Abbrev Number: 11 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xccc): cflag
    <dc3>   DW_AT_decl_file   : 18
    <dc4>   DW_AT_decl_line   : 515
    <dc6>   DW_AT_decl_column : 16
    <dc7>   DW_AT_type        : <0xdb1>
    <dcb>   DW_AT_external    : 1
    <dcc>   DW_AT_declaration : 1
 <1><dcd>: Abbrev Number: 11 (DW_TAG_variable)
    <dce>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dd2>   DW_AT_decl_file   : 18
    <dd3>   DW_AT_decl_line   : 516
    <dd5>   DW_AT_decl_column : 13
    <dd6>   DW_AT_type        : <0x527>
    <dda>   DW_AT_external    : 1
    <ddb>   DW_AT_declaration : 1
 <1><ddc>: Abbrev Number: 11 (DW_TAG_variable)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x7b9): Tflag_scale
    <de1>   DW_AT_decl_file   : 18
    <de2>   DW_AT_decl_line   : 517
    <de4>   DW_AT_decl_column : 12
    <de5>   DW_AT_type        : <0x64>
    <de9>   DW_AT_external    : 1
    <dea>   DW_AT_declaration : 1
 <1><deb>: Abbrev Number: 11 (DW_TAG_variable)
    <dec>   DW_AT_name        : (indirect string, offset: 0x853): Tflag_width
    <df0>   DW_AT_decl_file   : 18
    <df1>   DW_AT_decl_line   : 518
    <df3>   DW_AT_decl_column : 12
    <df4>   DW_AT_type        : <0x64>
    <df8>   DW_AT_external    : 1
    <df9>   DW_AT_declaration : 1
 <1><dfa>: Abbrev Number: 11 (DW_TAG_variable)
    <dfb>   DW_AT_name        : (indirect string, offset: 0xe2a): iflag
    <dff>   DW_AT_decl_file   : 18
    <e00>   DW_AT_decl_line   : 519
    <e02>   DW_AT_decl_column : 13
    <e03>   DW_AT_type        : <0x527>
    <e07>   DW_AT_external    : 1
    <e08>   DW_AT_declaration : 1
 <1><e09>: Abbrev Number: 11 (DW_TAG_variable)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x647): count_wallclock
    <e0e>   DW_AT_decl_file   : 18
    <e0f>   DW_AT_decl_line   : 520
    <e11>   DW_AT_decl_column : 13
    <e12>   DW_AT_type        : <0x527>
    <e16>   DW_AT_external    : 1
    <e17>   DW_AT_declaration : 1
 <1><e18>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e19>   DW_AT_name        : (indirect string, offset: 0x53): path_set_item
    <e1d>   DW_AT_byte_size   : 4
    <e1e>   DW_AT_decl_file   : 18
    <e1f>   DW_AT_decl_line   : 522
    <e21>   DW_AT_decl_column : 8
    <e22>   DW_AT_sibling     : <0xe37>
 <2><e26>: Abbrev Number: 23 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0xcc): path
    <e2b>   DW_AT_decl_file   : 18
    <e2c>   DW_AT_decl_line   : 523
    <e2e>   DW_AT_decl_column : 14
    <e2f>   DW_AT_type        : <0x1db>
    <e33>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e36>: Abbrev Number: 0
 <1><e37>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e38>   DW_AT_name        : (indirect string, offset: 0x76e): path_set
    <e3c>   DW_AT_byte_size   : 12
    <e3d>   DW_AT_decl_file   : 18
    <e3e>   DW_AT_decl_line   : 527
    <e40>   DW_AT_decl_column : 15
    <e41>   DW_AT_sibling     : <0xe76>
 <2><e45>: Abbrev Number: 23 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x6fc): paths_selected
    <e4a>   DW_AT_decl_file   : 18
    <e4b>   DW_AT_decl_line   : 528
    <e4d>   DW_AT_decl_column : 24
    <e4e>   DW_AT_type        : <0xe76>
    <e52>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e55>: Abbrev Number: 23 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0x104d): num_selected
    <e5a>   DW_AT_decl_file   : 18
    <e5b>   DW_AT_decl_line   : 529
    <e5d>   DW_AT_decl_column : 9
    <e5e>   DW_AT_type        : <0x12e>
    <e62>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e65>: Abbrev Number: 23 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0xb64): size
    <e6a>   DW_AT_decl_file   : 18
    <e6b>   DW_AT_decl_line   : 530
    <e6d>   DW_AT_decl_column : 9
    <e6e>   DW_AT_type        : <0x12e>
    <e72>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e75>: Abbrev Number: 0
 <1><e76>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e77>   DW_AT_byte_size   : 4
    <e78>   DW_AT_type        : <0xe18>
 <1><e7c>: Abbrev Number: 11 (DW_TAG_variable)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x109c): global_path_set
    <e81>   DW_AT_decl_file   : 18
    <e82>   DW_AT_decl_line   : 531
    <e84>   DW_AT_decl_column : 3
    <e85>   DW_AT_type        : <0xe37>
    <e89>   DW_AT_external    : 1
    <e8a>   DW_AT_declaration : 1
 <1><e8b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e8c>   DW_AT_name        : (indirect string, offset: 0xf90): xflag_opts
    <e90>   DW_AT_encoding    : 7	(unsigned)
    <e91>   DW_AT_byte_size   : 4
    <e92>   DW_AT_type        : <0x2b>
    <e96>   DW_AT_decl_file   : 18
    <e97>   DW_AT_decl_line   : 533
    <e99>   DW_AT_decl_column : 6
    <e9a>   DW_AT_sibling     : <0xebd>
 <2><e9e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e9f>   DW_AT_name        : (indirect string, offset: 0xa22): HEXSTR_NONE
    <ea3>   DW_AT_const_value : 0
 <2><ea4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xfd6): HEXSTR_NON_ASCII
    <ea9>   DW_AT_const_value : 1
 <2><eaa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eab>   DW_AT_name        : (indirect string, offset: 0x91b): HEXSTR_ALL
    <eaf>   DW_AT_const_value : 2
 <2><eb0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x687): HEXSTR_NON_ASCII_CHARS
    <eb5>   DW_AT_const_value : 3
 <2><eb6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x1067): NUM_HEXSTR_OPTS
    <ebb>   DW_AT_const_value : 4
 <2><ebc>: Abbrev Number: 0
 <1><ebd>: Abbrev Number: 11 (DW_TAG_variable)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xe04): xflag
    <ec2>   DW_AT_decl_file   : 18
    <ec3>   DW_AT_decl_line   : 546
    <ec5>   DW_AT_decl_column : 17
    <ec6>   DW_AT_type        : <0x2b>
    <eca>   DW_AT_external    : 1
    <ecb>   DW_AT_declaration : 1
 <1><ecc>: Abbrev Number: 11 (DW_TAG_variable)
    <ecd>   DW_AT_name        : (indirect string, offset: 0xc87): followfork
    <ed1>   DW_AT_decl_file   : 18
    <ed2>   DW_AT_decl_line   : 547
    <ed4>   DW_AT_decl_column : 13
    <ed5>   DW_AT_type        : <0x527>
    <ed9>   DW_AT_external    : 1
    <eda>   DW_AT_declaration : 1
 <1><edb>: Abbrev Number: 11 (DW_TAG_variable)
    <edc>   DW_AT_name        : (indirect string, offset: 0x347): output_separately
    <ee0>   DW_AT_decl_file   : 18
    <ee1>   DW_AT_decl_line   : 548
    <ee3>   DW_AT_decl_column : 13
    <ee4>   DW_AT_type        : <0x527>
    <ee8>   DW_AT_external    : 1
    <ee9>   DW_AT_declaration : 1
 <1><eea>: Abbrev Number: 11 (DW_TAG_variable)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x240): stack_trace_enabled
    <eef>   DW_AT_decl_file   : 18
    <ef0>   DW_AT_decl_line   : 551
    <ef2>   DW_AT_decl_column : 13
    <ef3>   DW_AT_type        : <0x527>
    <ef7>   DW_AT_external    : 1
    <ef8>   DW_AT_declaration : 1
 <1><ef9>: Abbrev Number: 11 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0x675): ptrace_setoptions
    <efe>   DW_AT_decl_file   : 18
    <eff>   DW_AT_decl_line   : 555
    <f01>   DW_AT_decl_column : 17
    <f02>   DW_AT_type        : <0x2b>
    <f06>   DW_AT_external    : 1
    <f07>   DW_AT_declaration : 1
 <1><f08>: Abbrev Number: 11 (DW_TAG_variable)
    <f09>   DW_AT_name        : (indirect string, offset: 0xa17): max_strlen
    <f0d>   DW_AT_decl_file   : 18
    <f0e>   DW_AT_decl_line   : 556
    <f10>   DW_AT_decl_column : 17
    <f11>   DW_AT_type        : <0x2b>
    <f15>   DW_AT_external    : 1
    <f16>   DW_AT_declaration : 1
 <1><f17>: Abbrev Number: 11 (DW_TAG_variable)
    <f18>   DW_AT_name        : (indirect string, offset: 0xa5b): os_release
    <f1c>   DW_AT_decl_file   : 18
    <f1d>   DW_AT_decl_line   : 557
    <f1f>   DW_AT_decl_column : 17
    <f20>   DW_AT_type        : <0x2b>
    <f24>   DW_AT_external    : 1
    <f25>   DW_AT_declaration : 1
 <1><f26>: Abbrev Number: 11 (DW_TAG_variable)
    <f27>   DW_AT_name        : (indirect string, offset: 0x70b): xlat_verbosity
    <f2b>   DW_AT_decl_file   : 18
    <f2c>   DW_AT_decl_line   : 919
    <f2e>   DW_AT_decl_column : 24
    <f2f>   DW_AT_type        : <0xa64>
    <f33>   DW_AT_external    : 1
    <f34>   DW_AT_declaration : 1
 <1><f35>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f36>   DW_AT_name        : (indirect string, offset: 0x62a): xlat_style_private_flag_bits
    <f3a>   DW_AT_encoding    : 7	(unsigned)
    <f3b>   DW_AT_byte_size   : 4
    <f3c>   DW_AT_type        : <0x2b>
    <f40>   DW_AT_decl_file   : 18
    <f41>   DW_AT_decl_line   : 939
    <f43>   DW_AT_decl_column : 6
    <f44>   DW_AT_sibling     : <0xf61>
 <2><f48>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x2c6): PAF_PRINT_INDICES_BIT
    <f4d>   DW_AT_const_value : 5
 <2><f4e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xb1b): PAF_ARRAY_TRUNCATED_BIT
    <f53>   DW_AT_const_value : 6
 <2><f54>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0x3ff): PXF_DEFAULT_STR_BIT
    <f59>   DW_AT_const_value : 7
 <2><f5a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0xc69): SPFF_AUXSTR_MODE_BIT
    <f5f>   DW_AT_const_value : 8
 <2><f60>: Abbrev Number: 0
 <1><f61>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f62>   DW_AT_name        : (indirect string, offset: 0xd18): find_xlat_flag_bits
    <f66>   DW_AT_encoding    : 7	(unsigned)
    <f67>   DW_AT_byte_size   : 4
    <f68>   DW_AT_type        : <0x2b>
    <f6c>   DW_AT_decl_file   : 18
    <f6d>   DW_AT_decl_line   : 1443
    <f6f>   DW_AT_decl_column : 6
    <f70>   DW_AT_sibling     : <0xf7b>
 <2><f74>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f75>   DW_AT_name        : (indirect string, offset: 0x958): FXL_CASE_SENSITIVE_BIT
    <f79>   DW_AT_const_value : 0
 <2><f7a>: Abbrev Number: 0
 <1><f7b>: Abbrev Number: 11 (DW_TAG_variable)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x9e5): printing_tcp
    <f80>   DW_AT_decl_file   : 18
    <f81>   DW_AT_decl_line   : 1689
    <f83>   DW_AT_decl_column : 20
    <f84>   DW_AT_type        : <0x603>
    <f88>   DW_AT_external    : 1
    <f89>   DW_AT_declaration : 1
 <1><f8a>: Abbrev Number: 11 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x5de): errnoent
    <f8f>   DW_AT_decl_file   : 18
    <f90>   DW_AT_decl_line   : 1887
    <f92>   DW_AT_decl_column : 26
    <f93>   DW_AT_type        : <0x45b>
    <f97>   DW_AT_external    : 1
    <f98>   DW_AT_declaration : 1
 <1><f99>: Abbrev Number: 11 (DW_TAG_variable)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x85f): signalent
    <f9e>   DW_AT_decl_file   : 18
    <f9f>   DW_AT_decl_line   : 1888
    <fa1>   DW_AT_decl_column : 26
    <fa2>   DW_AT_type        : <0x45b>
    <fa6>   DW_AT_external    : 1
    <fa7>   DW_AT_declaration : 1
 <1><fa8>: Abbrev Number: 11 (DW_TAG_variable)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xe72): nerrnos
    <fad>   DW_AT_decl_file   : 18
    <fae>   DW_AT_decl_line   : 1889
    <fb0>   DW_AT_decl_column : 27
    <fb1>   DW_AT_type        : <0x32>
    <fb5>   DW_AT_external    : 1
    <fb6>   DW_AT_declaration : 1
 <1><fb7>: Abbrev Number: 11 (DW_TAG_variable)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x1036): nsignals
    <fbc>   DW_AT_decl_file   : 18
    <fbd>   DW_AT_decl_line   : 1890
    <fbf>   DW_AT_decl_column : 27
    <fc0>   DW_AT_type        : <0x32>
    <fc4>   DW_AT_external    : 1
    <fc5>   DW_AT_declaration : 1
 <1><fc6>: Abbrev Number: 16 (DW_TAG_array_type)
    <fc7>   DW_AT_type        : <0x883>
    <fcb>   DW_AT_sibling     : <0xfd1>
 <2><fcf>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fd0>: Abbrev Number: 0
 <1><fd1>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd2>   DW_AT_type        : <0xfc6>
 <1><fd6>: Abbrev Number: 11 (DW_TAG_variable)
    <fd7>   DW_AT_name        : (indirect string, offset: 0xce3): sysent0
    <fdb>   DW_AT_decl_file   : 18
    <fdc>   DW_AT_decl_line   : 1892
    <fde>   DW_AT_decl_column : 28
    <fdf>   DW_AT_type        : <0xfd1>
    <fe3>   DW_AT_external    : 1
    <fe4>   DW_AT_declaration : 1
 <1><fe5>: Abbrev Number: 16 (DW_TAG_array_type)
    <fe6>   DW_AT_type        : <0x8ea>
    <fea>   DW_AT_sibling     : <0xff0>
 <2><fee>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fef>: Abbrev Number: 0
 <1><ff0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff1>   DW_AT_type        : <0xfe5>
 <1><ff5>: Abbrev Number: 11 (DW_TAG_variable)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x1092): ioctlent0
    <ffa>   DW_AT_decl_file   : 18
    <ffb>   DW_AT_decl_line   : 1893
    <ffd>   DW_AT_decl_column : 30
    <ffe>   DW_AT_type        : <0xff0>
    <1002>   DW_AT_external    : 1
    <1003>   DW_AT_declaration : 1
 <1><1004>: Abbrev Number: 11 (DW_TAG_variable)
    <1005>   DW_AT_name        : (indirect string, offset: 0xf9b): personality_names
    <1009>   DW_AT_decl_file   : 18
    <100a>   DW_AT_decl_line   : 1895
    <100c>   DW_AT_decl_column : 26
    <100d>   DW_AT_type        : <0x45b>
    <1011>   DW_AT_external    : 1
    <1012>   DW_AT_declaration : 1
 <1><1013>: Abbrev Number: 11 (DW_TAG_variable)
    <1014>   DW_AT_name        : (indirect string, offset: 0x87f): sysent
    <1018>   DW_AT_decl_file   : 18
    <1019>   DW_AT_decl_line   : 1898
    <101b>   DW_AT_decl_column : 29
    <101c>   DW_AT_type        : <0x9cf>
    <1020>   DW_AT_external    : 1
    <1021>   DW_AT_declaration : 1
 <1><1022>: Abbrev Number: 11 (DW_TAG_variable)
    <1023>   DW_AT_name        : (indirect string, offset: 0xc7e): ioctlent
    <1027>   DW_AT_decl_file   : 18
    <1028>   DW_AT_decl_line   : 1899
    <102a>   DW_AT_decl_column : 31
    <102b>   DW_AT_type        : <0x1031>
    <102f>   DW_AT_external    : 1
    <1030>   DW_AT_declaration : 1
 <1><1031>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1032>   DW_AT_byte_size   : 4
    <1033>   DW_AT_type        : <0x8ea>
 <1><1037>: Abbrev Number: 11 (DW_TAG_variable)
    <1038>   DW_AT_name        : (indirect string, offset: 0x869): nsyscalls
    <103c>   DW_AT_decl_file   : 18
    <103d>   DW_AT_decl_line   : 1905
    <103f>   DW_AT_decl_column : 17
    <1040>   DW_AT_type        : <0x2b>
    <1044>   DW_AT_external    : 1
    <1045>   DW_AT_declaration : 1
 <1><1046>: Abbrev Number: 11 (DW_TAG_variable)
    <1047>   DW_AT_name        : (indirect string, offset: 0xe98): nioctlents
    <104b>   DW_AT_decl_file   : 18
    <104c>   DW_AT_decl_line   : 1906
    <104e>   DW_AT_decl_column : 17
    <104f>   DW_AT_type        : <0x2b>
    <1053>   DW_AT_external    : 1
    <1054>   DW_AT_declaration : 1
 <1><1055>: Abbrev Number: 16 (DW_TAG_array_type)
    <1056>   DW_AT_type        : <0x32>
    <105a>   DW_AT_sibling     : <0x1065>
 <2><105e>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <105f>   DW_AT_type        : <0x2b>
    <1063>   DW_AT_upper_bound : 2
 <2><1064>: Abbrev Number: 0
 <1><1065>: Abbrev Number: 3 (DW_TAG_const_type)
    <1066>   DW_AT_type        : <0x1055>
 <1><106a>: Abbrev Number: 11 (DW_TAG_variable)
    <106b>   DW_AT_name        : (indirect string, offset: 0xef8): nsyscall_vec
    <106f>   DW_AT_decl_file   : 18
    <1070>   DW_AT_decl_line   : 1908
    <1072>   DW_AT_decl_column : 27
    <1073>   DW_AT_type        : <0x1065>
    <1077>   DW_AT_external    : 1
    <1078>   DW_AT_declaration : 1
 <1><1079>: Abbrev Number: 16 (DW_TAG_array_type)
    <107a>   DW_AT_type        : <0x9d5>
    <107e>   DW_AT_sibling     : <0x1089>
 <2><1082>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1083>   DW_AT_type        : <0x2b>
    <1087>   DW_AT_upper_bound : 2
 <2><1088>: Abbrev Number: 0
 <1><1089>: Abbrev Number: 3 (DW_TAG_const_type)
    <108a>   DW_AT_type        : <0x1079>
 <1><108e>: Abbrev Number: 11 (DW_TAG_variable)
    <108f>   DW_AT_name        : (indirect string, offset: 0x7a6): sysent_vec
    <1093>   DW_AT_decl_file   : 18
    <1094>   DW_AT_decl_line   : 1909
    <1096>   DW_AT_decl_column : 35
    <1097>   DW_AT_type        : <0x1089>
    <109b>   DW_AT_external    : 1
    <109c>   DW_AT_declaration : 1
 <1><109d>: Abbrev Number: 11 (DW_TAG_variable)
    <109e>   DW_AT_name        : (indirect string, offset: 0x3a0): inject_vec
    <10a2>   DW_AT_decl_file   : 18
    <10a3>   DW_AT_decl_line   : 1910
    <10a5>   DW_AT_decl_column : 28
    <10a6>   DW_AT_type        : <0x9da>
    <10aa>   DW_AT_external    : 1
    <10ab>   DW_AT_declaration : 1
 <1><10ac>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xd6c): audit_arch_t
    <10b1>   DW_AT_byte_size   : 8
    <10b2>   DW_AT_decl_file   : 18
    <10b3>   DW_AT_decl_line   : 1912
    <10b5>   DW_AT_decl_column : 8
    <10b6>   DW_AT_sibling     : <0x10db>
 <2><10ba>: Abbrev Number: 23 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x61c): arch
    <10bf>   DW_AT_decl_file   : 18
    <10c0>   DW_AT_decl_line   : 1913
    <10c2>   DW_AT_decl_column : 15
    <10c3>   DW_AT_type        : <0x2b>
    <10c7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ca>: Abbrev Number: 23 (DW_TAG_member)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x9cb): flag
    <10cf>   DW_AT_decl_file   : 18
    <10d0>   DW_AT_decl_line   : 1914
    <10d2>   DW_AT_decl_column : 15
    <10d3>   DW_AT_type        : <0x2b>
    <10d7>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10da>: Abbrev Number: 0
 <1><10db>: Abbrev Number: 3 (DW_TAG_const_type)
    <10dc>   DW_AT_type        : <0x10ac>
 <1><10e0>: Abbrev Number: 16 (DW_TAG_array_type)
    <10e1>   DW_AT_type        : <0x10db>
    <10e5>   DW_AT_sibling     : <0x10f0>
 <2><10e9>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <10ea>   DW_AT_type        : <0x2b>
    <10ee>   DW_AT_upper_bound : 2
 <2><10ef>: Abbrev Number: 0
 <1><10f0>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f1>   DW_AT_type        : <0x10e0>
 <1><10f5>: Abbrev Number: 11 (DW_TAG_variable)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x949): audit_arch_vec
    <10fa>   DW_AT_decl_file   : 18
    <10fb>   DW_AT_decl_line   : 1917
    <10fd>   DW_AT_decl_column : 34
    <10fe>   DW_AT_type        : <0x10f0>
    <1102>   DW_AT_external    : 1
    <1103>   DW_AT_declaration : 1
 <1><1104>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1105>   DW_AT_byte_size   : 180
    <1106>   DW_AT_decl_file   : 20
    <1107>   DW_AT_decl_line   : 2
    <1108>   DW_AT_decl_column : 9
    <1109>   DW_AT_sibling     : <0x13be>
 <2><110d>: Abbrev Number: 9 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x1d6): block_ioctl
    <1112>   DW_AT_decl_file   : 20
    <1113>   DW_AT_decl_line   : 3
    <1114>   DW_AT_decl_column : 8
    <1115>   DW_AT_type        : <0x13d8>
    <1119>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><111c>: Abbrev Number: 9 (DW_TAG_member)
    <111d>   DW_AT_name        : (indirect string, offset: 0xaba): btrfs_ioctl
    <1121>   DW_AT_decl_file   : 20
    <1122>   DW_AT_decl_line   : 6
    <1123>   DW_AT_decl_column : 8
    <1124>   DW_AT_type        : <0x13d8>
    <1128>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><112b>: Abbrev Number: 9 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x744): evdev_write_ioctl_mpers
    <1130>   DW_AT_decl_file   : 20
    <1131>   DW_AT_decl_line   : 9
    <1132>   DW_AT_decl_column : 8
    <1133>   DW_AT_type        : <0x13d8>
    <1137>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><113a>: Abbrev Number: 9 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x71a): get_sock_fprog_size
    <113f>   DW_AT_decl_file   : 20
    <1140>   DW_AT_decl_line   : 12
    <1141>   DW_AT_decl_column : 17
    <1142>   DW_AT_type        : <0x13e4>
    <1146>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1149>: Abbrev Number: 9 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0x1a5): fetch_bpf_fprog
    <114e>   DW_AT_decl_file   : 20
    <114f>   DW_AT_decl_line   : 15
    <1150>   DW_AT_decl_column : 10
    <1151>   DW_AT_type        : <0x1404>
    <1155>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1158>: Abbrev Number: 9 (DW_TAG_member)
    <1159>   DW_AT_name        : (indirect string, offset: 0x936): fetch_struct_flock
    <115d>   DW_AT_decl_file   : 20
    <115e>   DW_AT_decl_line   : 18
    <115f>   DW_AT_decl_column : 10
