Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x19a4 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x52d): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc66): mpers-mx32/struct_rt_sigframe.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa84): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3ef): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10d1): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9d5): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x385): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x289): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xea2): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4c3): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8bf): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xfa0): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8ef): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7ca): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbdd): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xc13): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xd8c): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xd01): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x43b): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x487): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x39e): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xbfe): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x105b): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xeb2): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2f5): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x53): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xf53): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x1198): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x169): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xb7e): timespec
    <179>   DW_AT_byte_size   : 16
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x11ad): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xba>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xed8): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xcd>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 16
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xb29): long double
 <1><1a7>: Abbrev Number: 13 (DW_TAG_variable)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x2ac): __environ
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 543
    <1af>   DW_AT_decl_column : 15
    <1b0>   DW_AT_type        : <0x1b6>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1b7>   DW_AT_byte_size   : 4
    <1b8>   DW_AT_type        : <0xd9>
 <1><1bc>: Abbrev Number: 13 (DW_TAG_variable)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x3e7): environ
    <1c1>   DW_AT_decl_file   : 7
    <1c2>   DW_AT_decl_line   : 545
    <1c4>   DW_AT_decl_column : 15
    <1c5>   DW_AT_type        : <0x1b6>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 14 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x10bb): optarg
    <1d0>   DW_AT_decl_file   : 8
    <1d1>   DW_AT_decl_line   : 36
    <1d2>   DW_AT_decl_column : 14
    <1d3>   DW_AT_type        : <0xd9>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 14 (DW_TAG_variable)
    <1da>   DW_AT_name        : (indirect string, offset: 0x79d): optind
    <1de>   DW_AT_decl_file   : 8
    <1df>   DW_AT_decl_line   : 50
    <1e0>   DW_AT_decl_column : 12
    <1e1>   DW_AT_type        : <0x64>
    <1e5>   DW_AT_external    : 1
    <1e6>   DW_AT_declaration : 1
 <1><1e7>: Abbrev Number: 14 (DW_TAG_variable)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xcf0): opterr
    <1ec>   DW_AT_decl_file   : 8
    <1ed>   DW_AT_decl_line   : 55
    <1ee>   DW_AT_decl_column : 12
    <1ef>   DW_AT_type        : <0x64>
    <1f3>   DW_AT_external    : 1
    <1f4>   DW_AT_declaration : 1
 <1><1f5>: Abbrev Number: 14 (DW_TAG_variable)
    <1f6>   DW_AT_name        : (indirect string, offset: 0xbc3): optopt
    <1fa>   DW_AT_decl_file   : 8
    <1fb>   DW_AT_decl_line   : 59
    <1fc>   DW_AT_decl_column : 12
    <1fd>   DW_AT_type        : <0x64>
    <201>   DW_AT_external    : 1
    <202>   DW_AT_declaration : 1
 <1><203>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <204>   DW_AT_byte_size   : 4
    <205>   DW_AT_type        : <0xe6>
 <1><209>: Abbrev Number: 3 (DW_TAG_const_type)
    <20a>   DW_AT_type        : <0x203>
 <1><20e>: Abbrev Number: 10 (DW_TAG_array_type)
    <20f>   DW_AT_type        : <0x24>
    <213>   DW_AT_sibling     : <0x21e>
 <2><217>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <218>   DW_AT_type        : <0x2b>
    <21c>   DW_AT_upper_bound : 2
 <2><21d>: Abbrev Number: 0
 <1><21e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <21f>   DW_AT_byte_size   : 4
    <220>   DW_AT_type        : <0x224>
 <1><224>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><225>: Abbrev Number: 12 (DW_TAG_structure_type)
    <226>   DW_AT_name        : (indirect string, offset: 0x3a6): _IO_FILE
    <22a>   DW_AT_byte_size   : 152
    <22b>   DW_AT_decl_file   : 9
    <22c>   DW_AT_decl_line   : 49
    <22d>   DW_AT_decl_column : 8
    <22e>   DW_AT_sibling     : <0x3e6>
 <2><232>: Abbrev Number: 9 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0xa60): _flags
    <237>   DW_AT_decl_file   : 9
    <238>   DW_AT_decl_line   : 51
    <239>   DW_AT_decl_column : 7
    <23a>   DW_AT_type        : <0x64>
    <23e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><241>: Abbrev Number: 9 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x520): _IO_read_ptr
    <246>   DW_AT_decl_file   : 9
    <247>   DW_AT_decl_line   : 54
    <248>   DW_AT_decl_column : 9
    <249>   DW_AT_type        : <0xd9>
    <24d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><250>: Abbrev Number: 9 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x1008): _IO_read_end
    <255>   DW_AT_decl_file   : 9
    <256>   DW_AT_decl_line   : 55
    <257>   DW_AT_decl_column : 9
    <258>   DW_AT_type        : <0xd9>
    <25c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><25f>: Abbrev Number: 9 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x806): _IO_read_base
    <264>   DW_AT_decl_file   : 9
    <265>   DW_AT_decl_line   : 56
    <266>   DW_AT_decl_column : 9
    <267>   DW_AT_type        : <0xd9>
    <26b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><26e>: Abbrev Number: 9 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0xa41): _IO_write_base
    <273>   DW_AT_decl_file   : 9
    <274>   DW_AT_decl_line   : 57
    <275>   DW_AT_decl_column : 9
    <276>   DW_AT_type        : <0xd9>
    <27a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><27d>: Abbrev Number: 9 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x110a): _IO_write_ptr
    <282>   DW_AT_decl_file   : 9
    <283>   DW_AT_decl_line   : 58
    <284>   DW_AT_decl_column : 9
    <285>   DW_AT_type        : <0xd9>
    <289>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><28c>: Abbrev Number: 9 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0x939): _IO_write_end
    <291>   DW_AT_decl_file   : 9
    <292>   DW_AT_decl_line   : 59
    <293>   DW_AT_decl_column : 9
    <294>   DW_AT_type        : <0xd9>
    <298>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><29b>: Abbrev Number: 9 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0x9b6): _IO_buf_base
    <2a0>   DW_AT_decl_file   : 9
    <2a1>   DW_AT_decl_line   : 60
    <2a2>   DW_AT_decl_column : 9
    <2a3>   DW_AT_type        : <0xd9>
    <2a7>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><2aa>: Abbrev Number: 9 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0xe3a): _IO_buf_end
    <2af>   DW_AT_decl_file   : 9
    <2b0>   DW_AT_decl_line   : 61
    <2b1>   DW_AT_decl_column : 9
    <2b2>   DW_AT_type        : <0xd9>
    <2b6>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2b9>: Abbrev Number: 9 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x203): _IO_save_base
    <2be>   DW_AT_decl_file   : 9
    <2bf>   DW_AT_decl_line   : 64
    <2c0>   DW_AT_decl_column : 9
    <2c1>   DW_AT_type        : <0xd9>
    <2c5>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2c8>: Abbrev Number: 9 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0xd53): _IO_backup_base
    <2cd>   DW_AT_decl_file   : 9
    <2ce>   DW_AT_decl_line   : 65
    <2cf>   DW_AT_decl_column : 9
    <2d0>   DW_AT_type        : <0xd9>
    <2d4>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2d7>: Abbrev Number: 9 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0xe4): _IO_save_end
    <2dc>   DW_AT_decl_file   : 9
    <2dd>   DW_AT_decl_line   : 66
    <2de>   DW_AT_decl_column : 9
    <2df>   DW_AT_type        : <0xd9>
    <2e3>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2e6>: Abbrev Number: 9 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x659): _markers
    <2eb>   DW_AT_decl_file   : 9
    <2ec>   DW_AT_decl_line   : 68
    <2ed>   DW_AT_decl_column : 22
    <2ee>   DW_AT_type        : <0x400>
    <2f2>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : (indirect string, offset: 0x246): _chain
    <2fa>   DW_AT_decl_file   : 9
    <2fb>   DW_AT_decl_line   : 70
    <2fc>   DW_AT_decl_column : 20
    <2fd>   DW_AT_type        : <0x406>
    <301>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><304>: Abbrev Number: 9 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0x1081): _fileno
    <309>   DW_AT_decl_file   : 9
    <30a>   DW_AT_decl_line   : 72
    <30b>   DW_AT_decl_column : 7
    <30c>   DW_AT_type        : <0x64>
    <310>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><313>: Abbrev Number: 9 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0x7f2): _flags2
    <318>   DW_AT_decl_file   : 9
    <319>   DW_AT_decl_line   : 73
    <31a>   DW_AT_decl_column : 7
    <31b>   DW_AT_type        : <0x64>
    <31f>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><322>: Abbrev Number: 9 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0x86b): _old_offset
    <327>   DW_AT_decl_file   : 9
    <328>   DW_AT_decl_line   : 74
    <329>   DW_AT_decl_column : 11
    <32a>   DW_AT_type        : <0xa2>
    <32e>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><331>: Abbrev Number: 9 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x274): _cur_column
    <336>   DW_AT_decl_file   : 9
    <337>   DW_AT_decl_line   : 77
    <338>   DW_AT_decl_column : 18
    <339>   DW_AT_type        : <0x24>
    <33d>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><340>: Abbrev Number: 9 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0xf10): _vtable_offset
    <345>   DW_AT_decl_file   : 9
    <346>   DW_AT_decl_line   : 78
    <347>   DW_AT_decl_column : 15
    <348>   DW_AT_type        : <0x3e>
    <34c>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><34f>: Abbrev Number: 9 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0xd63): _shortbuf
    <354>   DW_AT_decl_file   : 9
    <355>   DW_AT_decl_line   : 79
    <356>   DW_AT_decl_column : 8
    <357>   DW_AT_type        : <0x40c>
    <35b>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><35e>: Abbrev Number: 9 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x1a4): _lock
    <363>   DW_AT_decl_file   : 9
    <364>   DW_AT_decl_line   : 81
    <365>   DW_AT_decl_column : 15
    <366>   DW_AT_type        : <0x41c>
    <36a>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><36d>: Abbrev Number: 9 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x735): _offset
    <372>   DW_AT_decl_file   : 9
    <373>   DW_AT_decl_line   : 89
    <374>   DW_AT_decl_column : 13
    <375>   DW_AT_type        : <0xae>
    <379>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><37c>: Abbrev Number: 9 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xab6): _codecvt
    <381>   DW_AT_decl_file   : 9
    <382>   DW_AT_decl_line   : 91
    <383>   DW_AT_decl_column : 23
    <384>   DW_AT_type        : <0x428>
    <388>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><38b>: Abbrev Number: 9 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0x109f): _wide_data
    <390>   DW_AT_decl_file   : 9
    <391>   DW_AT_decl_line   : 92
    <392>   DW_AT_decl_column : 25
    <393>   DW_AT_type        : <0x434>
    <397>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0x40b): _freeres_list
    <39f>   DW_AT_decl_file   : 9
    <3a0>   DW_AT_decl_line   : 93
    <3a1>   DW_AT_decl_column : 20
    <3a2>   DW_AT_type        : <0x406>
    <3a6>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><3a9>: Abbrev Number: 9 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0xcb9): _freeres_buf
    <3ae>   DW_AT_decl_file   : 9
    <3af>   DW_AT_decl_line   : 94
    <3b0>   DW_AT_decl_column : 9
    <3b1>   DW_AT_type        : <0xc6>
    <3b5>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3b8>: Abbrev Number: 9 (DW_TAG_member)
    <3b9>   DW_AT_name        : (indirect string, offset: 0xa13): __pad5
    <3bd>   DW_AT_decl_file   : 9
    <3be>   DW_AT_decl_line   : 95
    <3bf>   DW_AT_decl_column : 10
    <3c0>   DW_AT_type        : <0x122>
    <3c4>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3c7>: Abbrev Number: 9 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x293): _mode
    <3cc>   DW_AT_decl_file   : 9
    <3cd>   DW_AT_decl_line   : 96
    <3ce>   DW_AT_decl_column : 7
    <3cf>   DW_AT_type        : <0x64>
    <3d3>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3d6>: Abbrev Number: 9 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x820): _unused2
    <3db>   DW_AT_decl_file   : 9
    <3dc>   DW_AT_decl_line   : 98
    <3dd>   DW_AT_decl_column : 8
    <3de>   DW_AT_type        : <0x43a>
    <3e2>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3e5>: Abbrev Number: 0
 <1><3e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <3e7>   DW_AT_name        : (indirect string, offset: 0xb60): FILE
    <3eb>   DW_AT_decl_file   : 10
    <3ec>   DW_AT_decl_line   : 7
    <3ed>   DW_AT_decl_column : 25
    <3ee>   DW_AT_type        : <0x225>
 <1><3f2>: Abbrev Number: 16 (DW_TAG_typedef)
    <3f3>   DW_AT_name        : (indirect string, offset: 0x4b8): _IO_lock_t
    <3f7>   DW_AT_decl_file   : 9
    <3f8>   DW_AT_decl_line   : 43
    <3f9>   DW_AT_decl_column : 14
 <1><3fa>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x337): _IO_marker
    <3ff>   DW_AT_declaration : 1
 <1><400>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <401>   DW_AT_byte_size   : 4
    <402>   DW_AT_type        : <0x3fa>
 <1><406>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <407>   DW_AT_byte_size   : 4
    <408>   DW_AT_type        : <0x225>
 <1><40c>: Abbrev Number: 10 (DW_TAG_array_type)
    <40d>   DW_AT_type        : <0xdf>
    <411>   DW_AT_sibling     : <0x41c>
 <2><415>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <416>   DW_AT_type        : <0x2b>
    <41a>   DW_AT_upper_bound : 0
 <2><41b>: Abbrev Number: 0
 <1><41c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41d>   DW_AT_byte_size   : 4
    <41e>   DW_AT_type        : <0x3f2>
 <1><422>: Abbrev Number: 17 (DW_TAG_structure_type)
    <423>   DW_AT_name        : (indirect string, offset: 0xa7): _IO_codecvt
    <427>   DW_AT_declaration : 1
 <1><428>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <429>   DW_AT_byte_size   : 4
    <42a>   DW_AT_type        : <0x422>
 <1><42e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <42f>   DW_AT_name        : (indirect string, offset: 0x3ba): _IO_wide_data
    <433>   DW_AT_declaration : 1
 <1><434>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <435>   DW_AT_byte_size   : 4
    <436>   DW_AT_type        : <0x42e>
 <1><43a>: Abbrev Number: 10 (DW_TAG_array_type)
    <43b>   DW_AT_type        : <0xdf>
    <43f>   DW_AT_sibling     : <0x44a>
 <2><443>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <444>   DW_AT_type        : <0x2b>
    <448>   DW_AT_upper_bound : 39
 <2><449>: Abbrev Number: 0
 <1><44a>: Abbrev Number: 14 (DW_TAG_variable)
    <44b>   DW_AT_name        : (indirect string, offset: 0x610): stdin
    <44f>   DW_AT_decl_file   : 11
    <450>   DW_AT_decl_line   : 137
    <451>   DW_AT_decl_column : 14
    <452>   DW_AT_type        : <0x458>
    <456>   DW_AT_external    : 1
    <457>   DW_AT_declaration : 1
 <1><458>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <459>   DW_AT_byte_size   : 4
    <45a>   DW_AT_type        : <0x3e6>
 <1><45e>: Abbrev Number: 14 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x10e4): stdout
    <463>   DW_AT_decl_file   : 11
    <464>   DW_AT_decl_line   : 138
    <465>   DW_AT_decl_column : 14
    <466>   DW_AT_type        : <0x458>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 14 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0xe9b): stderr
    <471>   DW_AT_decl_file   : 11
    <472>   DW_AT_decl_line   : 139
    <473>   DW_AT_decl_column : 14
    <474>   DW_AT_type        : <0x458>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 14 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0x280): sys_nerr
    <47f>   DW_AT_decl_file   : 12
    <480>   DW_AT_decl_line   : 26
    <481>   DW_AT_decl_column : 12
    <482>   DW_AT_type        : <0x64>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 10 (DW_TAG_array_type)
    <489>   DW_AT_type        : <0x209>
    <48d>   DW_AT_sibling     : <0x493>
 <2><491>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><492>: Abbrev Number: 0
 <1><493>: Abbrev Number: 3 (DW_TAG_const_type)
    <494>   DW_AT_type        : <0x488>
 <1><498>: Abbrev Number: 14 (DW_TAG_variable)
    <499>   DW_AT_name        : (indirect string, offset: 0x61f): sys_errlist
    <49d>   DW_AT_decl_file   : 12
    <49e>   DW_AT_decl_line   : 27
    <49f>   DW_AT_decl_column : 26
    <4a0>   DW_AT_type        : <0x493>
    <4a4>   DW_AT_external    : 1
    <4a5>   DW_AT_declaration : 1
 <1><4a6>: Abbrev Number: 14 (DW_TAG_variable)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x299): _sys_nerr
    <4ab>   DW_AT_decl_file   : 12
    <4ac>   DW_AT_decl_line   : 30
    <4ad>   DW_AT_decl_column : 12
    <4ae>   DW_AT_type        : <0x64>
    <4b2>   DW_AT_external    : 1
    <4b3>   DW_AT_declaration : 1
 <1><4b4>: Abbrev Number: 14 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0xf1f): _sys_errlist
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 31
    <4bb>   DW_AT_decl_column : 26
    <4bc>   DW_AT_type        : <0x493>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 14 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x70e): program_invocation_name
    <4c7>   DW_AT_decl_file   : 13
    <4c8>   DW_AT_decl_line   : 45
    <4c9>   DW_AT_decl_column : 14
    <4ca>   DW_AT_type        : <0xd9>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 14 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0xc3e): program_invocation_short_name
    <4d5>   DW_AT_decl_file   : 13
    <4d6>   DW_AT_decl_line   : 46
    <4d7>   DW_AT_decl_column : 14
    <4d8>   DW_AT_type        : <0xd9>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 10 (DW_TAG_array_type)
    <4df>   DW_AT_type        : <0xd9>
    <4e3>   DW_AT_sibling     : <0x4ee>
 <2><4e7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4e8>   DW_AT_type        : <0x2b>
    <4ec>   DW_AT_upper_bound : 1
 <2><4ed>: Abbrev Number: 0
 <1><4ee>: Abbrev Number: 14 (DW_TAG_variable)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x1f0): __tzname
    <4f3>   DW_AT_decl_file   : 14
    <4f4>   DW_AT_decl_line   : 159
    <4f5>   DW_AT_decl_column : 14
    <4f6>   DW_AT_type        : <0x4de>
    <4fa>   DW_AT_external    : 1
    <4fb>   DW_AT_declaration : 1
 <1><4fc>: Abbrev Number: 14 (DW_TAG_variable)
    <4fd>   DW_AT_name        : (indirect string, offset: 0xf87): __daylight
    <501>   DW_AT_decl_file   : 14
    <502>   DW_AT_decl_line   : 160
    <503>   DW_AT_decl_column : 12
    <504>   DW_AT_type        : <0x64>
    <508>   DW_AT_external    : 1
    <509>   DW_AT_declaration : 1
 <1><50a>: Abbrev Number: 14 (DW_TAG_variable)
    <50b>   DW_AT_name        : (indirect string, offset: 0x3af): __timezone
    <50f>   DW_AT_decl_file   : 14
    <510>   DW_AT_decl_line   : 161
    <511>   DW_AT_decl_column : 17
    <512>   DW_AT_type        : <0x11b>
    <516>   DW_AT_external    : 1
    <517>   DW_AT_declaration : 1
 <1><518>: Abbrev Number: 14 (DW_TAG_variable)
    <519>   DW_AT_name        : (indirect string, offset: 0xa0c): tzname
    <51d>   DW_AT_decl_file   : 14
    <51e>   DW_AT_decl_line   : 166
    <51f>   DW_AT_decl_column : 14
    <520>   DW_AT_type        : <0x4de>
    <524>   DW_AT_external    : 1
    <525>   DW_AT_declaration : 1
 <1><526>: Abbrev Number: 14 (DW_TAG_variable)
    <527>   DW_AT_name        : (indirect string, offset: 0x1154): daylight
    <52b>   DW_AT_decl_file   : 14
    <52c>   DW_AT_decl_line   : 174
    <52d>   DW_AT_decl_column : 12
    <52e>   DW_AT_type        : <0x64>
    <532>   DW_AT_external    : 1
    <533>   DW_AT_declaration : 1
 <1><534>: Abbrev Number: 14 (DW_TAG_variable)
    <535>   DW_AT_name        : (indirect string, offset: 0x4fd): timezone
    <539>   DW_AT_decl_file   : 14
    <53a>   DW_AT_decl_line   : 175
    <53b>   DW_AT_decl_column : 17
    <53c>   DW_AT_type        : <0x11b>
    <540>   DW_AT_external    : 1
    <541>   DW_AT_declaration : 1
 <1><542>: Abbrev Number: 13 (DW_TAG_variable)
    <543>   DW_AT_name        : (indirect string, offset: 0x102f): getdate_err
    <547>   DW_AT_decl_file   : 14
    <548>   DW_AT_decl_line   : 274
    <54a>   DW_AT_decl_column : 12
    <54b>   DW_AT_type        : <0x64>
    <54f>   DW_AT_external    : 1
    <550>   DW_AT_declaration : 1
 <1><551>: Abbrev Number: 14 (DW_TAG_variable)
    <552>   DW_AT_name        : (indirect string, offset: 0xa1f): debug_flag
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 20
    <558>   DW_AT_decl_column : 13
    <559>   DW_AT_type        : <0x55f>
    <55d>   DW_AT_external    : 1
    <55e>   DW_AT_declaration : 1
 <1><55f>: Abbrev Number: 2 (DW_TAG_base_type)
    <560>   DW_AT_byte_size   : 1
    <561>   DW_AT_encoding    : 2	(boolean)
    <562>   DW_AT_name        : (indirect string, offset: 0x44d): _Bool
 <1><566>: Abbrev Number: 3 (DW_TAG_const_type)
    <567>   DW_AT_type        : <0x55f>
 <1><56b>: Abbrev Number: 4 (DW_TAG_typedef)
    <56c>   DW_AT_name        : (indirect string, offset: 0xafa): __kernel_long_t
    <570>   DW_AT_decl_file   : 16
    <571>   DW_AT_decl_line   : 14
    <572>   DW_AT_decl_column : 19
    <573>   DW_AT_type        : <0x88>
 <1><577>: Abbrev Number: 4 (DW_TAG_typedef)
    <578>   DW_AT_name        : (indirect string, offset: 0x5ff): __kernel_ulong_t
    <57c>   DW_AT_decl_file   : 16
    <57d>   DW_AT_decl_line   : 15
    <57e>   DW_AT_decl_column : 28
    <57f>   DW_AT_type        : <0x9b>
 <1><583>: Abbrev Number: 4 (DW_TAG_typedef)
    <584>   DW_AT_name        : (indirect string, offset: 0x419): kernel_long_t
    <588>   DW_AT_decl_file   : 17
    <589>   DW_AT_decl_line   : 16
    <58a>   DW_AT_decl_column : 25
    <58b>   DW_AT_type        : <0x56b>
 <1><58f>: Abbrev Number: 4 (DW_TAG_typedef)
    <590>   DW_AT_name        : (indirect string, offset: 0x8e0): kernel_ulong_t
    <594>   DW_AT_decl_file   : 17
    <595>   DW_AT_decl_line   : 17
    <596>   DW_AT_decl_column : 26
    <597>   DW_AT_type        : <0x577>
 <1><59b>: Abbrev Number: 3 (DW_TAG_const_type)
    <59c>   DW_AT_type        : <0x58f>
 <1><5a0>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0xc5c): list_item
    <5a5>   DW_AT_byte_size   : 8
    <5a6>   DW_AT_decl_file   : 18
    <5a7>   DW_AT_decl_line   : 92
    <5a8>   DW_AT_decl_column : 8
    <5a9>   DW_AT_sibling     : <0x5cc>
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0x11a8): prev
    <5b2>   DW_AT_decl_file   : 18
    <5b3>   DW_AT_decl_line   : 93
    <5b4>   DW_AT_decl_column : 20
    <5b5>   DW_AT_type        : <0x5cc>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0xb0a): next
    <5c1>   DW_AT_decl_file   : 18
    <5c2>   DW_AT_decl_line   : 94
    <5c3>   DW_AT_decl_column : 20
    <5c4>   DW_AT_type        : <0x5cc>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cb>: Abbrev Number: 0
 <1><5cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5cd>   DW_AT_byte_size   : 4
    <5ce>   DW_AT_type        : <0x5a0>
 <1><5d2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5d3>   DW_AT_name        : (indirect string, offset: 0x8b8): sysent
    <5d7>   DW_AT_byte_size   : 20
    <5d8>   DW_AT_decl_file   : 19
    <5d9>   DW_AT_decl_line   : 13
    <5da>   DW_AT_decl_column : 16
    <5db>   DW_AT_sibling     : <0x62b>
 <2><5df>: Abbrev Number: 9 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x10fb): nargs
    <5e4>   DW_AT_decl_file   : 19
    <5e5>   DW_AT_decl_line   : 14
    <5e6>   DW_AT_decl_column : 11
    <5e7>   DW_AT_type        : <0x2b>
    <5eb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5ee>: Abbrev Number: 9 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x9cb): sys_flags
    <5f3>   DW_AT_decl_file   : 19
    <5f4>   DW_AT_decl_line   : 15
    <5f5>   DW_AT_decl_column : 6
    <5f6>   DW_AT_type        : <0x64>
    <5fa>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5fd>: Abbrev Number: 19 (DW_TAG_member)
    <5fe>   DW_AT_name        : sen
    <602>   DW_AT_decl_file   : 19
    <603>   DW_AT_decl_line   : 16
    <604>   DW_AT_decl_column : 6
    <605>   DW_AT_type        : <0x64>
    <609>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><60c>: Abbrev Number: 9 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x32e): sys_func
    <611>   DW_AT_decl_file   : 19
    <612>   DW_AT_decl_line   : 17
    <613>   DW_AT_decl_column : 8
    <614>   DW_AT_type        : <0x8a9>
    <618>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><61b>: Abbrev Number: 9 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0x2a3): sys_name
    <620>   DW_AT_decl_file   : 19
    <621>   DW_AT_decl_line   : 18
    <622>   DW_AT_decl_column : 14
    <623>   DW_AT_type        : <0x203>
    <627>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><62a>: Abbrev Number: 0
 <1><62b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <62c>   DW_AT_prototyped  : 1
    <62d>   DW_AT_type        : <0x64>
    <631>   DW_AT_sibling     : <0x63b>
 <2><635>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <636>   DW_AT_type        : <0x63b>
 <2><63a>: Abbrev Number: 0
 <1><63b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <63c>   DW_AT_byte_size   : 4
    <63d>   DW_AT_type        : <0x646>
 <1><641>: Abbrev Number: 3 (DW_TAG_const_type)
    <642>   DW_AT_type        : <0x63b>
 <1><646>: Abbrev Number: 22 (DW_TAG_structure_type)
    <647>   DW_AT_name        : tcb
    <64b>   DW_AT_byte_size   : 304
    <64d>   DW_AT_decl_file   : 20
    <64e>   DW_AT_decl_line   : 262
    <650>   DW_AT_decl_column : 8
    <651>   DW_AT_sibling     : <0x8a9>
 <2><655>: Abbrev Number: 23 (DW_TAG_member)
    <656>   DW_AT_name        : (indirect string, offset: 0x50c): flags
    <65a>   DW_AT_decl_file   : 20
    <65b>   DW_AT_decl_line   : 263
    <65d>   DW_AT_decl_column : 6
    <65e>   DW_AT_type        : <0x64>
    <662>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><665>: Abbrev Number: 24 (DW_TAG_member)
    <666>   DW_AT_name        : pid
    <66a>   DW_AT_decl_file   : 20
    <66b>   DW_AT_decl_line   : 264
    <66d>   DW_AT_decl_column : 6
    <66e>   DW_AT_type        : <0x64>
    <672>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><675>: Abbrev Number: 23 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x86): qual_flg
    <67a>   DW_AT_decl_file   : 20
    <67b>   DW_AT_decl_line   : 265
    <67d>   DW_AT_decl_column : 6
    <67e>   DW_AT_type        : <0x64>
    <682>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><685>: Abbrev Number: 23 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0x3d3): currpers
    <68a>   DW_AT_decl_file   : 20
    <68b>   DW_AT_decl_line   : 267
    <68d>   DW_AT_decl_column : 15
    <68e>   DW_AT_type        : <0x2b>
    <692>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><695>: Abbrev Number: 23 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0xbbb): u_error
    <69a>   DW_AT_decl_file   : 20
    <69b>   DW_AT_decl_line   : 269
    <69d>   DW_AT_decl_column : 16
    <69e>   DW_AT_type        : <0x37>
    <6a2>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><6a5>: Abbrev Number: 23 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x1d0): scno
    <6aa>   DW_AT_decl_file   : 20
    <6ab>   DW_AT_decl_line   : 270
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0x58f>
    <6b2>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6b5>: Abbrev Number: 23 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0xbf4): true_scno
    <6ba>   DW_AT_decl_file   : 20
    <6bb>   DW_AT_decl_line   : 271
    <6bd>   DW_AT_decl_column : 17
    <6be>   DW_AT_type        : <0x58f>
    <6c2>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6c5>: Abbrev Number: 23 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x1da): u_arg
    <6ca>   DW_AT_decl_file   : 20
    <6cb>   DW_AT_decl_line   : 272
    <6cd>   DW_AT_decl_column : 17
    <6ce>   DW_AT_type        : <0x9d9>
    <6d2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6d5>: Abbrev Number: 23 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x9e2): u_rval
    <6da>   DW_AT_decl_file   : 20
    <6db>   DW_AT_decl_line   : 273
    <6dd>   DW_AT_decl_column : 16
    <6de>   DW_AT_type        : <0x583>
    <6e2>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6e5>: Abbrev Number: 23 (DW_TAG_member)
    <6e6>   DW_AT_name        : (indirect string, offset: 0xb1b): sys_func_rval
    <6ea>   DW_AT_decl_file   : 20
    <6eb>   DW_AT_decl_line   : 274
    <6ed>   DW_AT_decl_column : 6
    <6ee>   DW_AT_type        : <0x64>
    <6f2>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6f5>: Abbrev Number: 23 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xd7d): curcol
    <6fa>   DW_AT_decl_file   : 20
    <6fb>   DW_AT_decl_line   : 275
    <6fd>   DW_AT_decl_column : 6
    <6fe>   DW_AT_type        : <0x64>
    <702>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><705>: Abbrev Number: 23 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0x9f4): outf
    <70a>   DW_AT_decl_file   : 20
    <70b>   DW_AT_decl_line   : 276
    <70d>   DW_AT_decl_column : 8
    <70e>   DW_AT_type        : <0x458>
    <712>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><715>: Abbrev Number: 23 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0xfc6): staged_output_data
    <71a>   DW_AT_decl_file   : 20
    <71b>   DW_AT_decl_line   : 277
    <71d>   DW_AT_decl_column : 29
    <71e>   DW_AT_type        : <0x9ef>
    <722>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><725>: Abbrev Number: 23 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0xae1): auxstr
    <72a>   DW_AT_decl_file   : 20
    <72b>   DW_AT_decl_line   : 279
    <72d>   DW_AT_decl_column : 14
    <72e>   DW_AT_type        : <0x203>
    <732>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><735>: Abbrev Number: 23 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0x1aa): _priv_data
    <73a>   DW_AT_decl_file   : 20
    <73b>   DW_AT_decl_line   : 280
    <73d>   DW_AT_decl_column : 8
    <73e>   DW_AT_type        : <0xc6>
    <742>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><745>: Abbrev Number: 23 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0xca9): _free_priv_data
    <74a>   DW_AT_decl_file   : 20
    <74b>   DW_AT_decl_line   : 281
    <74d>   DW_AT_decl_column : 9
    <74e>   DW_AT_type        : <0xa01>
    <752>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><755>: Abbrev Number: 23 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x1ca): s_ent
    <75a>   DW_AT_decl_file   : 20
    <75b>   DW_AT_decl_line   : 282
    <75d>   DW_AT_decl_column : 23
    <75e>   DW_AT_type        : <0xa07>
    <762>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><765>: Abbrev Number: 23 (DW_TAG_member)
    <766>   DW_AT_name        : (indirect string, offset: 0x34): s_prev_ent
    <76a>   DW_AT_decl_file   : 20
    <76b>   DW_AT_decl_line   : 285
    <76d>   DW_AT_decl_column : 23
    <76e>   DW_AT_type        : <0xa07>
    <772>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><776>: Abbrev Number: 23 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x3c8): inject_vec
    <77b>   DW_AT_decl_file   : 20
    <77c>   DW_AT_decl_line   : 286
    <77e>   DW_AT_decl_column : 22
    <77f>   DW_AT_type        : <0xa12>
    <783>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><787>: Abbrev Number: 23 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x829): stime
    <78c>   DW_AT_decl_file   : 20
    <78d>   DW_AT_decl_line   : 287
    <78f>   DW_AT_decl_column : 18
    <790>   DW_AT_type        : <0x174>
    <794>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><798>: Abbrev Number: 23 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0x3dc): ltime
    <79d>   DW_AT_decl_file   : 20
    <79e>   DW_AT_decl_line   : 288
    <7a0>   DW_AT_decl_column : 18
    <7a1>   DW_AT_type        : <0x174>
    <7a5>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7a9>: Abbrev Number: 23 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x10c2): atime
    <7ae>   DW_AT_decl_file   : 20
    <7af>   DW_AT_decl_line   : 289
    <7b1>   DW_AT_decl_column : 18
    <7b2>   DW_AT_type        : <0x174>
    <7b6>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><7ba>: Abbrev Number: 23 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x506): etime
    <7bf>   DW_AT_decl_file   : 20
    <7c0>   DW_AT_decl_line   : 290
    <7c2>   DW_AT_decl_column : 18
    <7c3>   DW_AT_type        : <0x174>
    <7c7>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7cb>: Abbrev Number: 23 (DW_TAG_member)
    <7cc>   DW_AT_name        : (indirect string, offset: 0xdf7): delay_expiration_time
    <7d0>   DW_AT_decl_file   : 20
    <7d1>   DW_AT_decl_line   : 291
    <7d3>   DW_AT_decl_column : 18
    <7d4>   DW_AT_type        : <0x174>
    <7d8>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7dc>: Abbrev Number: 23 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x4c): pid_ns
    <7e1>   DW_AT_decl_file   : 20
    <7e2>   DW_AT_decl_line   : 298
    <7e4>   DW_AT_decl_column : 15
    <7e5>   DW_AT_type        : <0x2b>
    <7e9>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7ed>: Abbrev Number: 23 (DW_TAG_member)
    <7ee>   DW_AT_name        : (indirect string, offset: 0x1015): last_dirfd
    <7f2>   DW_AT_decl_file   : 20
    <7f3>   DW_AT_decl_line   : 301
    <7f5>   DW_AT_decl_column : 6
    <7f6>   DW_AT_type        : <0x64>
    <7fa>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7fe>: Abbrev Number: 23 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x103b): mmap_cache
    <803>   DW_AT_decl_file   : 20
    <804>   DW_AT_decl_line   : 304
    <806>   DW_AT_decl_column : 23
    <807>   DW_AT_type        : <0xa2e>
    <80b>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><80f>: Abbrev Number: 23 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0xbca): wait_data_idx
    <814>   DW_AT_decl_file   : 20
    <815>   DW_AT_decl_line   : 311
    <817>   DW_AT_decl_column : 9
    <818>   DW_AT_type        : <0x122>
    <81c>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><820>: Abbrev Number: 23 (DW_TAG_member)
    <821>   DW_AT_name        : (indirect string, offset: 0xae8): delayed_wait_data
    <825>   DW_AT_decl_file   : 20
    <826>   DW_AT_decl_line   : 313
    <828>   DW_AT_decl_column : 24
    <829>   DW_AT_type        : <0xa3a>
    <82d>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><831>: Abbrev Number: 23 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0xb74): wait_list
    <836>   DW_AT_decl_file   : 20
    <837>   DW_AT_decl_line   : 314
    <839>   DW_AT_decl_column : 19
    <83a>   DW_AT_type        : <0x5a0>
    <83e>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><842>: Abbrev Number: 23 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x726): vcpu_info_list
    <847>   DW_AT_decl_file   : 20
    <848>   DW_AT_decl_line   : 318
    <84a>   DW_AT_decl_column : 20
    <84b>   DW_AT_type        : <0xa46>
    <84f>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><853>: Abbrev Number: 23 (DW_TAG_member)
    <854>   DW_AT_name        : (indirect string, offset: 0xd48): unwind_ctx
    <858>   DW_AT_decl_file   : 20
    <859>   DW_AT_decl_line   : 322
    <85b>   DW_AT_decl_column : 8
    <85c>   DW_AT_type        : <0xc6>
    <860>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><864>: Abbrev Number: 23 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0x4f0): unwind_queue
    <869>   DW_AT_decl_file   : 20
    <86a>   DW_AT_decl_line   : 323
    <86c>   DW_AT_decl_column : 25
    <86d>   DW_AT_type        : <0xa52>
    <871>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><875>: Abbrev Number: 23 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0x19f): comm
    <87a>   DW_AT_decl_file   : 20
    <87b>   DW_AT_decl_line   : 327
    <87d>   DW_AT_decl_column : 7
    <87e>   DW_AT_type        : <0xa58>
    <882>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><886>: Abbrev Number: 23 (DW_TAG_member)
    <887>   DW_AT_name        : (indirect string, offset: 0x256): start_prc
    <88b>   DW_AT_decl_file   : 20
    <88c>   DW_AT_decl_line   : 329
    <88e>   DW_AT_decl_column : 16
    <88f>   DW_AT_type        : <0x37>
    <893>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><897>: Abbrev Number: 23 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x1096): pre_comm
    <89c>   DW_AT_decl_file   : 20
    <89d>   DW_AT_decl_line   : 330
    <89f>   DW_AT_decl_column : 7
    <8a0>   DW_AT_type        : <0xa58>
    <8a4>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><8a8>: Abbrev Number: 0
 <1><8a9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8aa>   DW_AT_byte_size   : 4
    <8ab>   DW_AT_type        : <0x62b>
 <1><8af>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x5f1): struct_sysent
    <8b4>   DW_AT_decl_file   : 19
    <8b5>   DW_AT_decl_line   : 19
    <8b6>   DW_AT_decl_column : 3
    <8b7>   DW_AT_type        : <0x5d2>
 <1><8bb>: Abbrev Number: 3 (DW_TAG_const_type)
    <8bc>   DW_AT_type        : <0x8af>
 <1><8c0>: Abbrev Number: 14 (DW_TAG_variable)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xdd9): current_personality
    <8c5>   DW_AT_decl_file   : 20
    <8c6>   DW_AT_decl_line   : 158
    <8c7>   DW_AT_decl_column : 17
    <8c8>   DW_AT_type        : <0x2b>
    <8cc>   DW_AT_external    : 1
    <8cd>   DW_AT_declaration : 1
 <1><8ce>: Abbrev Number: 14 (DW_TAG_variable)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x85a): current_wordsize
    <8d3>   DW_AT_decl_file   : 20
    <8d4>   DW_AT_decl_line   : 171
    <8d5>   DW_AT_decl_column : 17
    <8d6>   DW_AT_type        : <0x2b>
    <8da>   DW_AT_external    : 1
    <8db>   DW_AT_declaration : 1
 <1><8dc>: Abbrev Number: 14 (DW_TAG_variable)
    <8dd>   DW_AT_name        : (indirect string, offset: 0xabf): current_klongsize
    <8e1>   DW_AT_decl_file   : 20
    <8e2>   DW_AT_decl_line   : 176
    <8e3>   DW_AT_decl_column : 17
    <8e4>   DW_AT_type        : <0x2b>
    <8e8>   DW_AT_external    : 1
    <8e9>   DW_AT_declaration : 1
 <1><8ea>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xd1f): ioctlent
    <8ef>   DW_AT_byte_size   : 8
    <8f0>   DW_AT_decl_file   : 20
    <8f1>   DW_AT_decl_line   : 217
    <8f2>   DW_AT_decl_column : 16
    <8f3>   DW_AT_sibling     : <0x916>
 <2><8f7>: Abbrev Number: 9 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x1001): symbol
    <8fc>   DW_AT_decl_file   : 20
    <8fd>   DW_AT_decl_line   : 218
    <8fe>   DW_AT_decl_column : 14
    <8ff>   DW_AT_type        : <0x203>
    <903>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><906>: Abbrev Number: 9 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0xd96): code
    <90b>   DW_AT_decl_file   : 20
    <90c>   DW_AT_decl_line   : 219
    <90d>   DW_AT_decl_column : 15
    <90e>   DW_AT_type        : <0x2b>
    <912>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 4 (DW_TAG_typedef)
    <917>   DW_AT_name        : (indirect string, offset: 0xce0): struct_ioctlent
    <91b>   DW_AT_decl_file   : 20
    <91c>   DW_AT_decl_line   : 220
    <91d>   DW_AT_decl_column : 3
    <91e>   DW_AT_type        : <0x8ea>
 <1><922>: Abbrev Number: 3 (DW_TAG_const_type)
    <923>   DW_AT_type        : <0x916>
 <1><927>: Abbrev Number: 12 (DW_TAG_structure_type)
    <928>   DW_AT_name        : (indirect string, offset: 0x84e): inject_data
    <92c>   DW_AT_byte_size   : 10
    <92d>   DW_AT_decl_file   : 20
    <92e>   DW_AT_decl_line   : 241
    <92f>   DW_AT_decl_column : 8
    <930>   DW_AT_sibling     : <0x98f>
 <2><934>: Abbrev Number: 9 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0x50c): flags
    <939>   DW_AT_decl_file   : 20
    <93a>   DW_AT_decl_line   : 242
    <93b>   DW_AT_decl_column : 10
    <93c>   DW_AT_type        : <0xeb>
    <940>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><943>: Abbrev Number: 9 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0x96b): signo
    <948>   DW_AT_decl_file   : 20
    <949>   DW_AT_decl_line   : 243
    <94a>   DW_AT_decl_column : 10
    <94b>   DW_AT_type        : <0xeb>
    <94f>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><952>: Abbrev Number: 9 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0x137): rval_idx
    <957>   DW_AT_decl_file   : 20
    <958>   DW_AT_decl_line   : 244
    <959>   DW_AT_decl_column : 11
    <95a>   DW_AT_type        : <0xf7>
    <95e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><961>: Abbrev Number: 9 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0xd73): delay_idx
    <966>   DW_AT_decl_file   : 20
    <967>   DW_AT_decl_line   : 245
    <968>   DW_AT_decl_column : 11
    <969>   DW_AT_type        : <0xf7>
    <96d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><970>: Abbrev Number: 9 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x64b): poke_idx
    <975>   DW_AT_decl_file   : 20
    <976>   DW_AT_decl_line   : 246
    <977>   DW_AT_decl_column : 11
    <978>   DW_AT_type        : <0xf7>
    <97c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><97f>: Abbrev Number: 9 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0x1d0): scno
    <984>   DW_AT_decl_file   : 20
    <985>   DW_AT_decl_line   : 247
    <986>   DW_AT_decl_column : 11
    <987>   DW_AT_type        : <0xf7>
    <98b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <990>   DW_AT_name        : (indirect string, offset: 0x10b): inject_opts
    <994>   DW_AT_byte_size   : 16
    <995>   DW_AT_decl_file   : 20
    <996>   DW_AT_decl_line   : 250
    <997>   DW_AT_decl_column : 8
    <998>   DW_AT_sibling     : <0x9d9>
 <2><99c>: Abbrev Number: 9 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0xa7e): first
    <9a1>   DW_AT_decl_file   : 20
    <9a2>   DW_AT_decl_line   : 251
    <9a3>   DW_AT_decl_column : 11
    <9a4>   DW_AT_type        : <0xf7>
    <9a8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><9ab>: Abbrev Number: 9 (DW_TAG_member)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x11d7): last
    <9b0>   DW_AT_decl_file   : 20
    <9b1>   DW_AT_decl_line   : 252
    <9b2>   DW_AT_decl_column : 11
    <9b3>   DW_AT_type        : <0xf7>
    <9b7>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><9ba>: Abbrev Number: 9 (DW_TAG_member)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x3e2): step
    <9bf>   DW_AT_decl_file   : 20
    <9c0>   DW_AT_decl_line   : 253
    <9c1>   DW_AT_decl_column : 11
    <9c2>   DW_AT_type        : <0xf7>
    <9c6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9c9>: Abbrev Number: 9 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x11a3): data
    <9ce>   DW_AT_decl_file   : 20
    <9cf>   DW_AT_decl_line   : 254
    <9d0>   DW_AT_decl_column : 21
    <9d1>   DW_AT_type        : <0x927>
    <9d5>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 10 (DW_TAG_array_type)
    <9da>   DW_AT_type        : <0x58f>
    <9de>   DW_AT_sibling     : <0x9e9>
 <2><9e2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9e3>   DW_AT_type        : <0x2b>
    <9e7>   DW_AT_upper_bound : 5
 <2><9e8>: Abbrev Number: 0
 <1><9e9>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9ea>   DW_AT_name        : (indirect string, offset: 0xfc6): staged_output_data
    <9ee>   DW_AT_declaration : 1
 <1><9ef>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f0>   DW_AT_byte_size   : 4
    <9f1>   DW_AT_type        : <0x9e9>
 <1><9f5>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9f6>   DW_AT_prototyped  : 1
    <9f7>   DW_AT_sibling     : <0xa01>
 <2><9fb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9fc>   DW_AT_type        : <0xc6>
 <2><a00>: Abbrev Number: 0
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9f5>
 <1><a07>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a08>   DW_AT_byte_size   : 4
    <a09>   DW_AT_type        : <0x8bb>
 <1><a0d>: Abbrev Number: 3 (DW_TAG_const_type)
    <a0e>   DW_AT_type        : <0xa07>
 <1><a12>: Abbrev Number: 10 (DW_TAG_array_type)
    <a13>   DW_AT_type        : <0xa22>
    <a17>   DW_AT_sibling     : <0xa22>
 <2><a1b>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a1c>   DW_AT_type        : <0x2b>
    <a20>   DW_AT_upper_bound : 2
 <2><a21>: Abbrev Number: 0
 <1><a22>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a23>   DW_AT_byte_size   : 4
    <a24>   DW_AT_type        : <0x98f>
 <1><a28>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a29>   DW_AT_name        : (indirect string, offset: 0xd7): mmap_cache_t
    <a2d>   DW_AT_declaration : 1
 <1><a2e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a2f>   DW_AT_byte_size   : 4
    <a30>   DW_AT_type        : <0xa28>
 <1><a34>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a35>   DW_AT_name        : (indirect string, offset: 0x3fd): tcb_wait_data
    <a39>   DW_AT_declaration : 1
 <1><a3a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a3b>   DW_AT_byte_size   : 4
    <a3c>   DW_AT_type        : <0xa34>
 <1><a40>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a41>   DW_AT_name        : (indirect string, offset: 0x195): vcpu_info
    <a45>   DW_AT_declaration : 1
 <1><a46>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a47>   DW_AT_byte_size   : 4
    <a48>   DW_AT_type        : <0xa40>
 <1><a4c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a4d>   DW_AT_name        : (indirect string, offset: 0xfaa): unwind_queue_t
    <a51>   DW_AT_declaration : 1
 <1><a52>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a53>   DW_AT_byte_size   : 4
    <a54>   DW_AT_type        : <0xa4c>
 <1><a58>: Abbrev Number: 10 (DW_TAG_array_type)
    <a59>   DW_AT_type        : <0xdf>
    <a5d>   DW_AT_sibling     : <0xa68>
 <2><a61>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a62>   DW_AT_type        : <0x2b>
    <a66>   DW_AT_upper_bound : 15
 <2><a67>: Abbrev Number: 0
 <1><a68>: Abbrev Number: 13 (DW_TAG_variable)
    <a69>   DW_AT_name        : (indirect string, offset: 0xc07): stub_sysent
    <a6d>   DW_AT_decl_file   : 20
    <a6e>   DW_AT_decl_line   : 405
    <a70>   DW_AT_decl_column : 28
    <a71>   DW_AT_type        : <0x8bb>
    <a75>   DW_AT_external    : 1
    <a76>   DW_AT_declaration : 1
 <1><a77>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a78>   DW_AT_name        : (indirect string, offset: 0x1177): xlat_type
    <a7c>   DW_AT_encoding    : 7	(unsigned)
    <a7d>   DW_AT_byte_size   : 4
    <a7e>   DW_AT_type        : <0x2b>
    <a82>   DW_AT_decl_file   : 21
    <a83>   DW_AT_decl_line   : 13
    <a84>   DW_AT_decl_column : 6
    <a85>   DW_AT_sibling     : <0xa9c>
 <2><a89>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x2fe): XT_NORMAL
    <a8e>   DW_AT_const_value : 0
 <2><a8f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0xcf7): XT_SORTED
    <a94>   DW_AT_const_value : 1
 <2><a95>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0xe7a): XT_INDEXED
    <a9a>   DW_AT_const_value : 2
 <2><a9b>: Abbrev Number: 0
 <1><a9c>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a9d>   DW_AT_name        : (indirect string, offset: 0xc33): xlat_style
    <aa1>   DW_AT_encoding    : 7	(unsigned)
    <aa2>   DW_AT_byte_size   : 4
    <aa3>   DW_AT_type        : <0x2b>
    <aa7>   DW_AT_decl_file   : 21
    <aa8>   DW_AT_decl_line   : 19
    <aa9>   DW_AT_decl_column : 6
    <aaa>   DW_AT_sibling     : <0xad9>
 <2><aae>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x117): XLAT_STYLE_DEFAULT
    <ab3>   DW_AT_const_value : 0
 <2><ab4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab5>   DW_AT_name        : (indirect string, offset: 0xc86): XLAT_STYLE_RAW
    <ab9>   DW_AT_const_value : 1
 <2><aba>: Abbrev Number: 27 (DW_TAG_enumerator)
    <abb>   DW_AT_name        : (indirect string, offset: 0x1142): XLAT_STYLE_ABBREV
    <abf>   DW_AT_const_value : 2
 <2><ac0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x31b): XLAT_STYLE_VERBOSE
    <ac5>   DW_AT_const_value : 3
 <2><ac6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x1e): XLAT_STYLE_FMT_X
    <acb>   DW_AT_const_value : 0
 <2><acc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <acd>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ad1>   DW_AT_const_value : 4
 <2><ad2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x11c6): XLAT_STYLE_FMT_D
    <ad7>   DW_AT_const_value : 8
 <2><ad8>: Abbrev Number: 0
 <1><ad9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ada>   DW_AT_name        : (indirect string, offset: 0x358): xlat_data
    <ade>   DW_AT_byte_size   : 16
    <adf>   DW_AT_decl_file   : 21
    <ae0>   DW_AT_decl_line   : 51
    <ae1>   DW_AT_decl_column : 8
    <ae2>   DW_AT_sibling     : <0xb05>
 <2><ae6>: Abbrev Number: 19 (DW_TAG_member)
    <ae7>   DW_AT_name        : val
    <aeb>   DW_AT_decl_file   : 21
    <aec>   DW_AT_decl_line   : 52
    <aed>   DW_AT_decl_column : 11
    <aee>   DW_AT_type        : <0x10f>
    <af2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af5>: Abbrev Number: 19 (DW_TAG_member)
    <af6>   DW_AT_name        : str
    <afa>   DW_AT_decl_file   : 21
    <afb>   DW_AT_decl_line   : 53
    <afc>   DW_AT_decl_column : 14
    <afd>   DW_AT_type        : <0x203>
    <b01>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b04>: Abbrev Number: 0
 <1><b05>: Abbrev Number: 3 (DW_TAG_const_type)
    <b06>   DW_AT_type        : <0xad9>
 <1><b0a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x2f): xlat
    <b0f>   DW_AT_byte_size   : 24
    <b10>   DW_AT_decl_file   : 21
    <b11>   DW_AT_decl_line   : 56
    <b12>   DW_AT_decl_column : 8
    <b13>   DW_AT_sibling     : <0xb63>
 <2><b17>: Abbrev Number: 9 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x11a3): data
    <b1c>   DW_AT_decl_file   : 21
    <b1d>   DW_AT_decl_line   : 57
    <b1e>   DW_AT_decl_column : 26
    <b1f>   DW_AT_type        : <0xb68>
    <b23>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b26>: Abbrev Number: 9 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0x8ac): flags_strsz
    <b2b>   DW_AT_decl_file   : 21
    <b2c>   DW_AT_decl_line   : 58
    <b2d>   DW_AT_decl_column : 9
    <b2e>   DW_AT_type        : <0x122>
    <b32>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b35>: Abbrev Number: 9 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0xbd8): size
    <b3a>   DW_AT_decl_file   : 21
    <b3b>   DW_AT_decl_line   : 59
    <b3c>   DW_AT_decl_column : 11
    <b3d>   DW_AT_type        : <0x103>
    <b41>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b44>: Abbrev Number: 9 (DW_TAG_member)
    <b45>   DW_AT_name        : (indirect string, offset: 0x1d5): type
    <b49>   DW_AT_decl_file   : 21
    <b4a>   DW_AT_decl_line   : 60
    <b4b>   DW_AT_decl_column : 17
    <b4c>   DW_AT_type        : <0xa77>
    <b50>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b53>: Abbrev Number: 9 (DW_TAG_member)
    <b54>   DW_AT_name        : (indirect string, offset: 0x77a): flags_mask
    <b58>   DW_AT_decl_file   : 21
    <b59>   DW_AT_decl_line   : 61
    <b5a>   DW_AT_decl_column : 11
    <b5b>   DW_AT_type        : <0x10f>
    <b5f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b62>: Abbrev Number: 0
 <1><b63>: Abbrev Number: 3 (DW_TAG_const_type)
    <b64>   DW_AT_type        : <0xb0a>
 <1><b68>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b69>   DW_AT_byte_size   : 4
    <b6a>   DW_AT_type        : <0xb05>
 <1><b6e>: Abbrev Number: 10 (DW_TAG_array_type)
    <b6f>   DW_AT_type        : <0xb63>
    <b73>   DW_AT_sibling     : <0xb79>
 <2><b77>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b78>: Abbrev Number: 0
 <1><b79>: Abbrev Number: 3 (DW_TAG_const_type)
    <b7a>   DW_AT_type        : <0xb6e>
 <1><b7e>: Abbrev Number: 13 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0xeeb): addrfams
    <b83>   DW_AT_decl_file   : 20
    <b84>   DW_AT_decl_line   : 411
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb79>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 13 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0xda6): arp_hardware_types
    <b92>   DW_AT_decl_file   : 20
    <b93>   DW_AT_decl_line   : 412
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb79>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 13 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x10c8): at_flags
    <ba1>   DW_AT_decl_file   : 20
    <ba2>   DW_AT_decl_line   : 413
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb79>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 13 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x4ce): clocknames
    <bb0>   DW_AT_decl_file   : 20
    <bb1>   DW_AT_decl_line   : 414
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb79>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 13 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x1089): dirent_types
    <bbf>   DW_AT_decl_file   : 20
    <bc0>   DW_AT_decl_line   : 415
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb79>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 13 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0x8fd): ethernet_protocols
    <bce>   DW_AT_decl_file   : 20
    <bcf>   DW_AT_decl_line   : 416
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb79>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 13 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x69e): inet_protocols
    <bdd>   DW_AT_decl_file   : 20
    <bde>   DW_AT_decl_line   : 417
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb79>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 13 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x2eb): evdev_abs
    <bec>   DW_AT_decl_file   : 20
    <bed>   DW_AT_decl_line   : 418
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb79>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 13 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x76f): audit_arch
    <bfb>   DW_AT_decl_file   : 20
    <bfc>   DW_AT_decl_line   : 419
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb79>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 13 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0xc3): evdev_ev
    <c0a>   DW_AT_decl_file   : 20
    <c0b>   DW_AT_decl_line   : 420
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb79>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 13 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0x4aa): iffflags
    <c19>   DW_AT_decl_file   : 20
    <c1a>   DW_AT_decl_line   : 421
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb79>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 13 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0xc95): ip_type_of_services
    <c28>   DW_AT_decl_file   : 20
    <c29>   DW_AT_decl_line   : 422
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb79>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 13 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0x702): ipc_private
    <c37>   DW_AT_decl_file   : 20
    <c38>   DW_AT_decl_line   : 423
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb79>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 13 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0x34e): msg_flags
    <c46>   DW_AT_decl_file   : 20
    <c47>   DW_AT_decl_line   : 424
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb79>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 13 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0x140): netlink_protocols
    <c55>   DW_AT_decl_file   : 20
    <c56>   DW_AT_decl_line   : 425
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb79>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 13 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xfec): nl_bridge_vlan_flags
    <c64>   DW_AT_decl_file   : 20
    <c65>   DW_AT_decl_line   : 426
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb79>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 13 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0xe63): nl_netfilter_msg_types
    <c73>   DW_AT_decl_file   : 20
    <c74>   DW_AT_decl_line   : 427
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb79>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 13 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x48c): nl_route_types
    <c82>   DW_AT_decl_file   : 20
    <c83>   DW_AT_decl_line   : 428
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb79>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 13 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xf41): open_access_modes
    <c91>   DW_AT_decl_file   : 20
    <c92>   DW_AT_decl_line   : 429
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb79>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 13 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xb3): open_mode_flags
    <ca0>   DW_AT_decl_file   : 20
    <ca1>   DW_AT_decl_line   : 430
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb79>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 13 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0xcc6): perf_type_id
    <caf>   DW_AT_decl_file   : 20
    <cb0>   DW_AT_decl_line   : 431
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb79>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 13 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0xef4): pollflags
    <cbe>   DW_AT_decl_file   : 20
    <cbf>   DW_AT_decl_line   : 432
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb79>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 13 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x63f): ptrace_cmds
    <ccd>   DW_AT_decl_file   : 20
    <cce>   DW_AT_decl_line   : 433
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb79>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 13 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x83f): resource_flags
    <cdc>   DW_AT_decl_file   : 20
    <cdd>   DW_AT_decl_line   : 434
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb79>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 13 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x2c1): route_nexthop_flags
    <ceb>   DW_AT_decl_file   : 20
    <cec>   DW_AT_decl_line   : 435
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb79>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 13 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0xf64): routing_protocols
    <cfa>   DW_AT_decl_file   : 20
    <cfb>   DW_AT_decl_line   : 436
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb79>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 13 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x49b): routing_scopes
    <d09>   DW_AT_decl_file   : 20
    <d0a>   DW_AT_decl_line   : 437
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb79>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 13 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0xe46): routing_table_ids
    <d18>   DW_AT_decl_file   : 20
    <d19>   DW_AT_decl_line   : 438
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb79>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 13 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0x6df): routing_types
    <d27>   DW_AT_decl_file   : 20
    <d28>   DW_AT_decl_line   : 439
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb79>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 13 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0x1f9): rwf_flags
    <d36>   DW_AT_decl_file   : 20
    <d37>   DW_AT_decl_line   : 440
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb79>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 13 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0x877): seccomp_filter_flags
    <d45>   DW_AT_decl_file   : 20
    <d46>   DW_AT_decl_line   : 441
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb79>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 13 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0x308): seccomp_ret_action
    <d54>   DW_AT_decl_file   : 20
    <d55>   DW_AT_decl_line   : 442
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb79>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 13 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x467): setns_types
    <d63>   DW_AT_decl_file   : 20
    <d64>   DW_AT_decl_line   : 443
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb79>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 13 (DW_TAG_variable)
    <d6e>   DW_AT_name        : (indirect string, offset: 0xee0): sg_io_info
    <d72>   DW_AT_decl_file   : 20
    <d73>   DW_AT_decl_line   : 444
    <d75>   DW_AT_decl_column : 26
    <d76>   DW_AT_type        : <0xb79>
    <d7a>   DW_AT_external    : 1
    <d7b>   DW_AT_declaration : 1
 <1><d7c>: Abbrev Number: 13 (DW_TAG_variable)
    <d7d>   DW_AT_name        : (indirect string, offset: 0xc1b): socketlayers
    <d81>   DW_AT_decl_file   : 20
    <d82>   DW_AT_decl_line   : 445
    <d84>   DW_AT_decl_column : 26
    <d85>   DW_AT_type        : <0xb79>
    <d89>   DW_AT_external    : 1
    <d8a>   DW_AT_declaration : 1
 <1><d8b>: Abbrev Number: 13 (DW_TAG_variable)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xe30): socktypes
    <d90>   DW_AT_decl_file   : 20
    <d91>   DW_AT_decl_line   : 446
    <d93>   DW_AT_decl_column : 26
    <d94>   DW_AT_type        : <0xb79>
    <d98>   DW_AT_external    : 1
    <d99>   DW_AT_declaration : 1
 <1><d9a>: Abbrev Number: 13 (DW_TAG_variable)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xad1): tcp_state_flags
    <d9f>   DW_AT_decl_file   : 20
    <da0>   DW_AT_decl_line   : 447
    <da2>   DW_AT_decl_column : 26
    <da3>   DW_AT_type        : <0xb79>
    <da7>   DW_AT_external    : 1
    <da8>   DW_AT_declaration : 1
 <1><da9>: Abbrev Number: 13 (DW_TAG_variable)
    <daa>   DW_AT_name        : (indirect string, offset: 0x7a4): tcp_states
    <dae>   DW_AT_decl_file   : 20
    <daf>   DW_AT_decl_line   : 448
    <db1>   DW_AT_decl_column : 26
    <db2>   DW_AT_type        : <0xb79>
    <db6>   DW_AT_external    : 1
    <db7>   DW_AT_declaration : 1
 <1><db8>: Abbrev Number: 13 (DW_TAG_variable)
    <db9>   DW_AT_name        : (indirect string, offset: 0x1125): whence_codes
    <dbd>   DW_AT_decl_file   : 20
    <dbe>   DW_AT_decl_line   : 449
    <dc0>   DW_AT_decl_column : 26
    <dc1>   DW_AT_type        : <0xb79>
    <dc5>   DW_AT_external    : 1
    <dc6>   DW_AT_declaration : 1
 <1><dc7>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <dc8>   DW_AT_encoding    : 7	(unsigned)
    <dc9>   DW_AT_byte_size   : 4
    <dca>   DW_AT_type        : <0x2b>
    <dce>   DW_AT_decl_file   : 20
    <dcf>   DW_AT_decl_line   : 510
    <dd1>   DW_AT_decl_column : 14
    <dd2>   DW_AT_sibling     : <0xde9>
 <2><dd6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x9e9): CFLAG_NONE
    <ddb>   DW_AT_const_value : 0
 <2><ddc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x910): CFLAG_ONLY_STATS
    <de1>   DW_AT_const_value : 1
 <2><de2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <de3>   DW_AT_name        : (indirect string, offset: 0xc28): CFLAG_BOTH
    <de7>   DW_AT_const_value : 2
 <2><de8>: Abbrev Number: 0
 <1><de9>: Abbrev Number: 29 (DW_TAG_typedef)
    <dea>   DW_AT_name        : (indirect string, offset: 0x11e5): cflag_t
    <dee>   DW_AT_decl_file   : 20
    <def>   DW_AT_decl_line   : 514
    <df1>   DW_AT_decl_column : 3
    <df2>   DW_AT_type        : <0xdc7>
 <1><df6>: Abbrev Number: 13 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0xd6d): cflag
    <dfb>   DW_AT_decl_file   : 20
    <dfc>   DW_AT_decl_line   : 515
    <dfe>   DW_AT_decl_column : 16
    <dff>   DW_AT_type        : <0xde9>
    <e03>   DW_AT_external    : 1
    <e04>   DW_AT_declaration : 1
 <1><e05>: Abbrev Number: 13 (DW_TAG_variable)
    <e06>   DW_AT_name        : (indirect string, offset: 0x1b5): Tflag
    <e0a>   DW_AT_decl_file   : 20
    <e0b>   DW_AT_decl_line   : 516
    <e0d>   DW_AT_decl_column : 13
    <e0e>   DW_AT_type        : <0x55f>
    <e12>   DW_AT_external    : 1
    <e13>   DW_AT_declaration : 1
 <1><e14>: Abbrev Number: 13 (DW_TAG_variable)
    <e15>   DW_AT_name        : (indirect string, offset: 0x7fa): Tflag_scale
    <e19>   DW_AT_decl_file   : 20
    <e1a>   DW_AT_decl_line   : 517
    <e1c>   DW_AT_decl_column : 12
    <e1d>   DW_AT_type        : <0x64>
    <e21>   DW_AT_external    : 1
    <e22>   DW_AT_declaration : 1
 <1><e23>: Abbrev Number: 13 (DW_TAG_variable)
    <e24>   DW_AT_name        : (indirect string, offset: 0x88c): Tflag_width
    <e28>   DW_AT_decl_file   : 20
    <e29>   DW_AT_decl_line   : 518
    <e2b>   DW_AT_decl_column : 12
    <e2c>   DW_AT_type        : <0x64>
    <e30>   DW_AT_external    : 1
    <e31>   DW_AT_declaration : 1
 <1><e32>: Abbrev Number: 13 (DW_TAG_variable)
    <e33>   DW_AT_name        : (indirect string, offset: 0xed2): iflag
    <e37>   DW_AT_decl_file   : 20
    <e38>   DW_AT_decl_line   : 519
    <e3a>   DW_AT_decl_column : 13
    <e3b>   DW_AT_type        : <0x55f>
    <e3f>   DW_AT_external    : 1
    <e40>   DW_AT_declaration : 1
 <1><e41>: Abbrev Number: 13 (DW_TAG_variable)
    <e42>   DW_AT_name        : (indirect string, offset: 0x67f): count_wallclock
    <e46>   DW_AT_decl_file   : 20
    <e47>   DW_AT_decl_line   : 520
    <e49>   DW_AT_decl_column : 13
    <e4a>   DW_AT_type        : <0x55f>
    <e4e>   DW_AT_external    : 1
    <e4f>   DW_AT_declaration : 1
 <1><e50>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e51>   DW_AT_name        : (indirect string, offset: 0x78): path_set_item
    <e55>   DW_AT_byte_size   : 4
    <e56>   DW_AT_decl_file   : 20
    <e57>   DW_AT_decl_line   : 522
    <e59>   DW_AT_decl_column : 8
    <e5a>   DW_AT_sibling     : <0xe6f>
 <2><e5e>: Abbrev Number: 23 (DW_TAG_member)
    <e5f>   DW_AT_name        : (indirect string, offset: 0xf1): path
    <e63>   DW_AT_decl_file   : 20
    <e64>   DW_AT_decl_line   : 523
    <e66>   DW_AT_decl_column : 14
    <e67>   DW_AT_type        : <0x203>
    <e6b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e6e>: Abbrev Number: 0
 <1><e6f>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e70>   DW_AT_name        : (indirect string, offset: 0x7af): path_set
    <e74>   DW_AT_byte_size   : 12
    <e75>   DW_AT_decl_file   : 20
    <e76>   DW_AT_decl_line   : 527
    <e78>   DW_AT_decl_column : 15
    <e79>   DW_AT_sibling     : <0xeae>
 <2><e7d>: Abbrev Number: 23 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x73d): paths_selected
    <e82>   DW_AT_decl_file   : 20
    <e83>   DW_AT_decl_line   : 528
    <e85>   DW_AT_decl_column : 24
    <e86>   DW_AT_type        : <0xeae>
    <e8a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e8d>: Abbrev Number: 23 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x1118): num_selected
    <e92>   DW_AT_decl_file   : 20
    <e93>   DW_AT_decl_line   : 529
    <e95>   DW_AT_decl_column : 9
    <e96>   DW_AT_type        : <0x122>
    <e9a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e9d>: Abbrev Number: 23 (DW_TAG_member)
    <e9e>   DW_AT_name        : (indirect string, offset: 0xbd8): size
    <ea2>   DW_AT_decl_file   : 20
    <ea3>   DW_AT_decl_line   : 530
    <ea5>   DW_AT_decl_column : 9
    <ea6>   DW_AT_type        : <0x122>
    <eaa>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ead>: Abbrev Number: 0
 <1><eae>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <eaf>   DW_AT_byte_size   : 4
    <eb0>   DW_AT_type        : <0xe50>
 <1><eb4>: Abbrev Number: 13 (DW_TAG_variable)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x1167): global_path_set
    <eb9>   DW_AT_decl_file   : 20
    <eba>   DW_AT_decl_line   : 531
    <ebc>   DW_AT_decl_column : 3
    <ebd>   DW_AT_type        : <0xe6f>
    <ec1>   DW_AT_external    : 1
    <ec2>   DW_AT_declaration : 1
 <1><ec3>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x1064): xflag_opts
    <ec8>   DW_AT_encoding    : 7	(unsigned)
    <ec9>   DW_AT_byte_size   : 4
    <eca>   DW_AT_type        : <0x2b>
    <ece>   DW_AT_decl_file   : 20
    <ecf>   DW_AT_decl_line   : 533
    <ed1>   DW_AT_decl_column : 6
    <ed2>   DW_AT_sibling     : <0xef5>
 <2><ed6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ed7>   DW_AT_name        : (indirect string, offset: 0xa72): HEXSTR_NONE
    <edb>   DW_AT_const_value : 0
 <2><edc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <edd>   DW_AT_name        : (indirect string, offset: 0x10aa): HEXSTR_NON_ASCII
    <ee1>   DW_AT_const_value : 1
 <2><ee2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x956): HEXSTR_ALL
    <ee7>   DW_AT_const_value : 2
 <2><ee8>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x6c8): HEXSTR_NON_ASCII_CHARS
    <eed>   DW_AT_const_value : 3
 <2><eee>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eef>   DW_AT_name        : (indirect string, offset: 0x1132): NUM_HEXSTR_OPTS
    <ef3>   DW_AT_const_value : 4
 <2><ef4>: Abbrev Number: 0
 <1><ef5>: Abbrev Number: 13 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xeac): xflag
    <efa>   DW_AT_decl_file   : 20
    <efb>   DW_AT_decl_line   : 546
    <efd>   DW_AT_decl_column : 17
    <efe>   DW_AT_type        : <0x2b>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 13 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0xd28): followfork
    <f09>   DW_AT_decl_file   : 20
    <f0a>   DW_AT_decl_line   : 547
    <f0c>   DW_AT_decl_column : 13
    <f0d>   DW_AT_type        : <0x55f>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 13 (DW_TAG_variable)
    <f14>   DW_AT_name        : (indirect string, offset: 0x362): output_separately
    <f18>   DW_AT_decl_file   : 20
    <f19>   DW_AT_decl_line   : 548
    <f1b>   DW_AT_decl_column : 13
    <f1c>   DW_AT_type        : <0x55f>
    <f20>   DW_AT_external    : 1
    <f21>   DW_AT_declaration : 1
 <1><f22>: Abbrev Number: 13 (DW_TAG_variable)
    <f23>   DW_AT_name        : (indirect string, offset: 0x260): stack_trace_enabled
    <f27>   DW_AT_decl_file   : 20
    <f28>   DW_AT_decl_line   : 551
    <f2a>   DW_AT_decl_column : 13
    <f2b>   DW_AT_type        : <0x55f>
    <f2f>   DW_AT_external    : 1
    <f30>   DW_AT_declaration : 1
 <1><f31>: Abbrev Number: 13 (DW_TAG_variable)
    <f32>   DW_AT_name        : (indirect string, offset: 0x6ad): ptrace_setoptions
    <f36>   DW_AT_decl_file   : 20
    <f37>   DW_AT_decl_line   : 555
    <f39>   DW_AT_decl_column : 17
    <f3a>   DW_AT_type        : <0x2b>
    <f3e>   DW_AT_external    : 1
    <f3f>   DW_AT_declaration : 1
 <1><f40>: Abbrev Number: 13 (DW_TAG_variable)
    <f41>   DW_AT_name        : (indirect string, offset: 0xa67): max_strlen
    <f45>   DW_AT_decl_file   : 20
    <f46>   DW_AT_decl_line   : 556
    <f48>   DW_AT_decl_column : 17
    <f49>   DW_AT_type        : <0x2b>
    <f4d>   DW_AT_external    : 1
    <f4e>   DW_AT_declaration : 1
 <1><f4f>: Abbrev Number: 13 (DW_TAG_variable)
    <f50>   DW_AT_name        : (indirect string, offset: 0xaab): os_release
    <f54>   DW_AT_decl_file   : 20
    <f55>   DW_AT_decl_line   : 557
    <f57>   DW_AT_decl_column : 17
    <f58>   DW_AT_type        : <0x2b>
    <f5c>   DW_AT_external    : 1
    <f5d>   DW_AT_declaration : 1
 <1><f5e>: Abbrev Number: 13 (DW_TAG_variable)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x74c): xlat_verbosity
    <f63>   DW_AT_decl_file   : 20
    <f64>   DW_AT_decl_line   : 919
    <f66>   DW_AT_decl_column : 24
    <f67>   DW_AT_type        : <0xa9c>
    <f6b>   DW_AT_external    : 1
    <f6c>   DW_AT_declaration : 1
 <1><f6d>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x662): xlat_style_private_flag_bits
    <f72>   DW_AT_encoding    : 7	(unsigned)
    <f73>   DW_AT_byte_size   : 4
    <f74>   DW_AT_type        : <0x2b>
    <f78>   DW_AT_decl_file   : 20
    <f79>   DW_AT_decl_line   : 939
    <f7b>   DW_AT_decl_column : 6
    <f7c>   DW_AT_sibling     : <0xf99>
 <2><f80>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f81>   DW_AT_name        : (indirect string, offset: 0x2d5): PAF_PRINT_INDICES_BIT
    <f85>   DW_AT_const_value : 5
 <2><f86>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f87>   DW_AT_name        : (indirect string, offset: 0xb87): PAF_ARRAY_TRUNCATED_BIT
    <f8b>   DW_AT_const_value : 6
 <2><f8c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x427): PXF_DEFAULT_STR_BIT
    <f91>   DW_AT_const_value : 7
 <2><f92>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f93>   DW_AT_name        : (indirect string, offset: 0xd0a): SPFF_AUXSTR_MODE_BIT
    <f97>   DW_AT_const_value : 8
 <2><f98>: Abbrev Number: 0
 <1><f99>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f9a>   DW_AT_name        : (indirect string, offset: 0xdc5): find_xlat_flag_bits
    <f9e>   DW_AT_encoding    : 7	(unsigned)
    <f9f>   DW_AT_byte_size   : 4
    <fa0>   DW_AT_type        : <0x2b>
    <fa4>   DW_AT_decl_file   : 20
    <fa5>   DW_AT_decl_line   : 1443
    <fa7>   DW_AT_decl_column : 6
    <fa8>   DW_AT_sibling     : <0xfb3>
 <2><fac>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fad>   DW_AT_name        : (indirect string, offset: 0x99f): FXL_CASE_SENSITIVE_BIT
    <fb1>   DW_AT_const_value : 0
 <2><fb2>: Abbrev Number: 0
 <1><fb3>: Abbrev Number: 13 (DW_TAG_variable)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xa34): printing_tcp
    <fb8>   DW_AT_decl_file   : 20
    <fb9>   DW_AT_decl_line   : 1689
    <fbb>   DW_AT_decl_column : 20
    <fbc>   DW_AT_type        : <0x63b>
    <fc0>   DW_AT_external    : 1
    <fc1>   DW_AT_declaration : 1
 <1><fc2>: Abbrev Number: 13 (DW_TAG_variable)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x616): errnoent
    <fc7>   DW_AT_decl_file   : 20
    <fc8>   DW_AT_decl_line   : 1887
    <fca>   DW_AT_decl_column : 26
    <fcb>   DW_AT_type        : <0x493>
    <fcf>   DW_AT_external    : 1
    <fd0>   DW_AT_declaration : 1
 <1><fd1>: Abbrev Number: 13 (DW_TAG_variable)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x898): signalent
    <fd6>   DW_AT_decl_file   : 20
    <fd7>   DW_AT_decl_line   : 1888
    <fd9>   DW_AT_decl_column : 26
    <fda>   DW_AT_type        : <0x493>
    <fde>   DW_AT_external    : 1
    <fdf>   DW_AT_declaration : 1
 <1><fe0>: Abbrev Number: 13 (DW_TAG_variable)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xf39): nerrnos
    <fe5>   DW_AT_decl_file   : 20
    <fe6>   DW_AT_decl_line   : 1889
    <fe8>   DW_AT_decl_column : 27
    <fe9>   DW_AT_type        : <0x32>
    <fed>   DW_AT_external    : 1
    <fee>   DW_AT_declaration : 1
 <1><fef>: Abbrev Number: 13 (DW_TAG_variable)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x1101): nsignals
    <ff4>   DW_AT_decl_file   : 20
    <ff5>   DW_AT_decl_line   : 1890
    <ff7>   DW_AT_decl_column : 27
    <ff8>   DW_AT_type        : <0x32>
    <ffc>   DW_AT_external    : 1
    <ffd>   DW_AT_declaration : 1
 <1><ffe>: Abbrev Number: 10 (DW_TAG_array_type)
    <fff>   DW_AT_type        : <0x8bb>
    <1003>   DW_AT_sibling     : <0x1009>
 <2><1007>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><1008>: Abbrev Number: 0
 <1><1009>: Abbrev Number: 3 (DW_TAG_const_type)
    <100a>   DW_AT_type        : <0xffe>
 <1><100e>: Abbrev Number: 13 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0xd84): sysent0
    <1013>   DW_AT_decl_file   : 20
    <1014>   DW_AT_decl_line   : 1892
    <1016>   DW_AT_decl_column : 28
    <1017>   DW_AT_type        : <0x1009>
    <101b>   DW_AT_external    : 1
    <101c>   DW_AT_declaration : 1
 <1><101d>: Abbrev Number: 10 (DW_TAG_array_type)
    <101e>   DW_AT_type        : <0x922>
    <1022>   DW_AT_sibling     : <0x1028>
 <2><1026>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><1027>: Abbrev Number: 0
 <1><1028>: Abbrev Number: 3 (DW_TAG_const_type)
    <1029>   DW_AT_type        : <0x101d>
 <1><102d>: Abbrev Number: 13 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0x115d): ioctlent0
    <1032>   DW_AT_decl_file   : 20
    <1033>   DW_AT_decl_line   : 1893
    <1035>   DW_AT_decl_column : 30
    <1036>   DW_AT_type        : <0x1028>
    <103a>   DW_AT_external    : 1
    <103b>   DW_AT_declaration : 1
 <1><103c>: Abbrev Number: 13 (DW_TAG_variable)
    <103d>   DW_AT_name        : (indirect string, offset: 0x106f): personality_names
    <1041>   DW_AT_decl_file   : 20
    <1042>   DW_AT_decl_line   : 1895
    <1044>   DW_AT_decl_column : 26
    <1045>   DW_AT_type        : <0x493>
    <1049>   DW_AT_external    : 1
    <104a>   DW_AT_declaration : 1
 <1><104b>: Abbrev Number: 13 (DW_TAG_variable)
    <104c>   DW_AT_name        : (indirect string, offset: 0x8b8): sysent
    <1050>   DW_AT_decl_file   : 20
    <1051>   DW_AT_decl_line   : 1898
    <1053>   DW_AT_decl_column : 29
    <1054>   DW_AT_type        : <0xa07>
    <1058>   DW_AT_external    : 1
    <1059>   DW_AT_declaration : 1
 <1><105a>: Abbrev Number: 13 (DW_TAG_variable)
    <105b>   DW_AT_name        : (indirect string, offset: 0xd1f): ioctlent
    <105f>   DW_AT_decl_file   : 20
    <1060>   DW_AT_decl_line   : 1899
    <1062>   DW_AT_decl_column : 31
    <1063>   DW_AT_type        : <0x1069>
    <1067>   DW_AT_external    : 1
    <1068>   DW_AT_declaration : 1
 <1><1069>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <106a>   DW_AT_byte_size   : 4
    <106b>   DW_AT_type        : <0x922>
 <1><106f>: Abbrev Number: 13 (DW_TAG_variable)
    <1070>   DW_AT_name        : (indirect string, offset: 0x8a2): nsyscalls
    <1074>   DW_AT_decl_file   : 20
    <1075>   DW_AT_decl_line   : 1905
    <1077>   DW_AT_decl_column : 17
    <1078>   DW_AT_type        : <0x2b>
    <107c>   DW_AT_external    : 1
    <107d>   DW_AT_declaration : 1
 <1><107e>: Abbrev Number: 13 (DW_TAG_variable)
    <107f>   DW_AT_name        : (indirect string, offset: 0xf59): nioctlents
    <1083>   DW_AT_decl_file   : 20
    <1084>   DW_AT_decl_line   : 1906
    <1086>   DW_AT_decl_column : 17
    <1087>   DW_AT_type        : <0x2b>
    <108b>   DW_AT_external    : 1
    <108c>   DW_AT_declaration : 1
 <1><108d>: Abbrev Number: 10 (DW_TAG_array_type)
    <108e>   DW_AT_type        : <0x32>
    <1092>   DW_AT_sibling     : <0x109d>
 <2><1096>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1097>   DW_AT_type        : <0x2b>
    <109b>   DW_AT_upper_bound : 2
 <2><109c>: Abbrev Number: 0
 <1><109d>: Abbrev Number: 3 (DW_TAG_const_type)
    <109e>   DW_AT_type        : <0x108d>
 <1><10a2>: Abbrev Number: 13 (DW_TAG_variable)
    <10a3>   DW_AT_name        : (indirect string, offset: 0xfb9): nsyscall_vec
    <10a7>   DW_AT_decl_file   : 20
    <10a8>   DW_AT_decl_line   : 1908
    <10aa>   DW_AT_decl_column : 27
    <10ab>   DW_AT_type        : <0x109d>
    <10af>   DW_AT_external    : 1
    <10b0>   DW_AT_declaration : 1
 <1><10b1>: Abbrev Number: 10 (DW_TAG_array_type)
    <10b2>   DW_AT_type        : <0xa0d>
    <10b6>   DW_AT_sibling     : <0x10c1>
 <2><10ba>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10bb>   DW_AT_type        : <0x2b>
    <10bf>   DW_AT_upper_bound : 2
 <2><10c0>: Abbrev Number: 0
 <1><10c1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c2>   DW_AT_type        : <0x10b1>
 <1><10c6>: Abbrev Number: 13 (DW_TAG_variable)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x7e7): sysent_vec
    <10cb>   DW_AT_decl_file   : 20
    <10cc>   DW_AT_decl_line   : 1909
    <10ce>   DW_AT_decl_column : 35
    <10cf>   DW_AT_type        : <0x10c1>
    <10d3>   DW_AT_external    : 1
    <10d4>   DW_AT_declaration : 1
 <1><10d5>: Abbrev Number: 13 (DW_TAG_variable)
    <10d6>   DW_AT_name        : (indirect string, offset: 0x3c8): inject_vec
    <10da>   DW_AT_decl_file   : 20
    <10db>   DW_AT_decl_line   : 1910
    <10dd>   DW_AT_decl_column : 28
    <10de>   DW_AT_type        : <0xa12>
    <10e2>   DW_AT_external    : 1
    <10e3>   DW_AT_declaration : 1
 <1><10e4>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10e5>   DW_AT_name        : (indirect string, offset: 0xe23): audit_arch_t
    <10e9>   DW_AT_byte_size   : 8
    <10ea>   DW_AT_decl_file   : 20
    <10eb>   DW_AT_decl_line   : 1912
    <10ed>   DW_AT_decl_column : 8
    <10ee>   DW_AT_sibling     : <0x1113>
 <2><10f2>: Abbrev Number: 23 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x654): arch
    <10f7>   DW_AT_decl_file   : 20
    <10f8>   DW_AT_decl_line   : 1913
    <10fa>   DW_AT_decl_column : 15
    <10fb>   DW_AT_type        : <0x2b>
    <10ff>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1102>: Abbrev Number: 23 (DW_TAG_member)
    <1103>   DW_AT_name        : (indirect string, offset: 0xa1a): flag
    <1107>   DW_AT_decl_file   : 20
    <1108>   DW_AT_decl_line   : 1914
    <110a>   DW_AT_decl_column : 15
    <110b>   DW_AT_type        : <0x2b>
    <110f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1112>: Abbrev Number: 0
 <1><1113>: Abbrev Number: 3 (DW_TAG_const_type)
    <1114>   DW_AT_type        : <0x10e4>
 <1><1118>: Abbrev Number: 10 (DW_TAG_array_type)
    <1119>   DW_AT_type        : <0x1113>
    <111d>   DW_AT_sibling     : <0x1128>
 <2><1121>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1122>   DW_AT_type        : <0x2b>
    <1126>   DW_AT_upper_bound : 2
 <2><1127>: Abbrev Number: 0
 <1><1128>: Abbrev Number: 3 (DW_TAG_const_type)
    <1129>   DW_AT_type        : <0x1118>
 <1><112d>: Abbrev Number: 13 (DW_TAG_variable)
    <112e>   DW_AT_name        : (indirect string, offset: 0x990): audit_arch_vec
    <1132>   DW_AT_decl_file   : 20
    <1133>   DW_AT_decl_line   : 1917
    <1135>   DW_AT_decl_column : 34
    <1136>   DW_AT_type        : <0x1128>
    <113a>   DW_AT_external    : 1
    <113b>   DW_AT_declaration : 1
 <1><113c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <113d>   DW_AT_byte_size   : 180
    <113e>   DW_AT_decl_file   : 22
    <113f>   DW_AT_decl_line   : 2
    <1140>   DW_AT_decl_column : 9
    <1141>   DW_AT_sibling     : <0x13f6>
 <2><1145>: Abbrev Number: 9 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0x211): block_ioctl
    <114a>   DW_AT_decl_file   : 22
    <114b>   DW_AT_decl_line   : 3
    <114c>   DW_AT_decl_column : 8
    <114d>   DW_AT_type        : <0x1410>
    <1151>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1154>: Abbrev Number: 9 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0xb0f): btrfs_ioctl
