Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1677 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4c8): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1bd): mpers-mx32/struct_sigset_addr_size.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb0d): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x39a): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xf96): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x94c): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x33d): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x253): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xda9): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x46c): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x852): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe93): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x882): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x751): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb3a): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb70): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xcbc): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc31): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x3e6): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x432): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x349): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xb5b): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xf3b): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xdb9): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2b9): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe46): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x106c): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x124): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xad0): timespec
    <179>   DW_AT_byte_size   : 16
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x1081): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xba>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xdea): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xcd>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 16
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xa92): long double
 <1><1a7>: Abbrev Number: 13 (DW_TAG_variable)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x270): __environ
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 543
    <1af>   DW_AT_decl_column : 15
    <1b0>   DW_AT_type        : <0x1b6>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1b7>   DW_AT_byte_size   : 4
    <1b8>   DW_AT_type        : <0xd9>
 <1><1bc>: Abbrev Number: 13 (DW_TAG_variable)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x392): environ
    <1c1>   DW_AT_decl_file   : 7
    <1c2>   DW_AT_decl_line   : 545
    <1c4>   DW_AT_decl_column : 15
    <1c5>   DW_AT_type        : <0x1b6>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 14 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xf80): optarg
    <1d0>   DW_AT_decl_file   : 8
    <1d1>   DW_AT_decl_line   : 36
    <1d2>   DW_AT_decl_column : 14
    <1d3>   DW_AT_type        : <0xd9>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 14 (DW_TAG_variable)
    <1da>   DW_AT_name        : (indirect string, offset: 0x724): optind
    <1de>   DW_AT_decl_file   : 8
    <1df>   DW_AT_decl_line   : 50
    <1e0>   DW_AT_decl_column : 12
    <1e1>   DW_AT_type        : <0x64>
    <1e5>   DW_AT_external    : 1
    <1e6>   DW_AT_declaration : 1
 <1><1e7>: Abbrev Number: 14 (DW_TAG_variable)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xc20): opterr
    <1ec>   DW_AT_decl_file   : 8
    <1ed>   DW_AT_decl_line   : 55
    <1ee>   DW_AT_decl_column : 12
    <1ef>   DW_AT_type        : <0x64>
    <1f3>   DW_AT_external    : 1
    <1f4>   DW_AT_declaration : 1
 <1><1f5>: Abbrev Number: 14 (DW_TAG_variable)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x1094): optopt
    <1fa>   DW_AT_decl_file   : 8
    <1fb>   DW_AT_decl_line   : 59
    <1fc>   DW_AT_decl_column : 12
    <1fd>   DW_AT_type        : <0x64>
    <201>   DW_AT_external    : 1
    <202>   DW_AT_declaration : 1
 <1><203>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <204>   DW_AT_byte_size   : 4
    <205>   DW_AT_type        : <0xe6>
 <1><209>: Abbrev Number: 3 (DW_TAG_const_type)
    <20a>   DW_AT_type        : <0x203>
 <1><20e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <20f>   DW_AT_byte_size   : 4
    <210>   DW_AT_type        : <0x214>
 <1><214>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><215>: Abbrev Number: 12 (DW_TAG_structure_type)
    <216>   DW_AT_name        : (indirect string, offset: 0x351): _IO_FILE
    <21a>   DW_AT_byte_size   : 152
    <21b>   DW_AT_decl_file   : 9
    <21c>   DW_AT_decl_line   : 49
    <21d>   DW_AT_decl_column : 8
    <21e>   DW_AT_sibling     : <0x3d6>
 <2><222>: Abbrev Number: 9 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x9df): _flags
    <227>   DW_AT_decl_file   : 9
    <228>   DW_AT_decl_line   : 51
    <229>   DW_AT_decl_column : 7
    <22a>   DW_AT_type        : <0x64>
    <22e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><231>: Abbrev Number: 9 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x4bb): _IO_read_ptr
    <236>   DW_AT_decl_file   : 9
    <237>   DW_AT_decl_line   : 54
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0xd9>
    <23d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><240>: Abbrev Number: 9 (DW_TAG_member)
    <241>   DW_AT_name        : (indirect string, offset: 0xee8): _IO_read_end
    <245>   DW_AT_decl_file   : 9
    <246>   DW_AT_decl_line   : 55
    <247>   DW_AT_decl_column : 9
    <248>   DW_AT_type        : <0xd9>
    <24c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><24f>: Abbrev Number: 9 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x78d): _IO_read_base
    <254>   DW_AT_decl_file   : 9
    <255>   DW_AT_decl_line   : 56
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0xd9>
    <25b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><25e>: Abbrev Number: 9 (DW_TAG_member)
    <25f>   DW_AT_name        : (indirect string, offset: 0x9c0): _IO_write_base
    <263>   DW_AT_decl_file   : 9
    <264>   DW_AT_decl_line   : 57
    <265>   DW_AT_decl_column : 9
    <266>   DW_AT_type        : <0xd9>
    <26a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><26d>: Abbrev Number: 9 (DW_TAG_member)
    <26e>   DW_AT_name        : (indirect string, offset: 0xfcf): _IO_write_ptr
    <272>   DW_AT_decl_file   : 9
    <273>   DW_AT_decl_line   : 58
    <274>   DW_AT_decl_column : 9
    <275>   DW_AT_type        : <0xd9>
    <279>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><27c>: Abbrev Number: 9 (DW_TAG_member)
    <27d>   DW_AT_name        : (indirect string, offset: 0x8c4): _IO_write_end
    <281>   DW_AT_decl_file   : 9
    <282>   DW_AT_decl_line   : 59
    <283>   DW_AT_decl_column : 9
    <284>   DW_AT_type        : <0xd9>
    <288>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><28b>: Abbrev Number: 9 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x935): _IO_buf_base
    <290>   DW_AT_decl_file   : 9
    <291>   DW_AT_decl_line   : 60
    <292>   DW_AT_decl_column : 9
    <293>   DW_AT_type        : <0xd9>
    <297>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><29a>: Abbrev Number: 9 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0xd54): _IO_buf_end
    <29f>   DW_AT_decl_file   : 9
    <2a0>   DW_AT_decl_line   : 61
    <2a1>   DW_AT_decl_column : 9
    <2a2>   DW_AT_type        : <0xd9>
    <2a6>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2a9>: Abbrev Number: 9 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x1af): _IO_save_base
    <2ae>   DW_AT_decl_file   : 9
    <2af>   DW_AT_decl_line   : 64
    <2b0>   DW_AT_decl_column : 9
    <2b1>   DW_AT_type        : <0xd9>
    <2b5>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2b8>: Abbrev Number: 9 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0xc83): _IO_backup_base
    <2bd>   DW_AT_decl_file   : 9
    <2be>   DW_AT_decl_line   : 65
    <2bf>   DW_AT_decl_column : 9
    <2c0>   DW_AT_type        : <0xd9>
    <2c4>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2c7>: Abbrev Number: 9 (DW_TAG_member)
    <2c8>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2cc>   DW_AT_decl_file   : 9
    <2cd>   DW_AT_decl_line   : 66
    <2ce>   DW_AT_decl_column : 9
    <2cf>   DW_AT_type        : <0xd9>
    <2d3>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2d6>: Abbrev Number: 9 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x5e9): _markers
    <2db>   DW_AT_decl_file   : 9
    <2dc>   DW_AT_decl_line   : 68
    <2dd>   DW_AT_decl_column : 22
    <2de>   DW_AT_type        : <0x3f0>
    <2e2>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2e5>: Abbrev Number: 9 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2ea>   DW_AT_decl_file   : 9
    <2eb>   DW_AT_decl_line   : 70
    <2ec>   DW_AT_decl_column : 20
    <2ed>   DW_AT_type        : <0x3f6>
    <2f1>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2f4>: Abbrev Number: 9 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0xf4f): _fileno
    <2f9>   DW_AT_decl_file   : 9
    <2fa>   DW_AT_decl_line   : 72
    <2fb>   DW_AT_decl_column : 7
    <2fc>   DW_AT_type        : <0x64>
    <300>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><303>: Abbrev Number: 9 (DW_TAG_member)
    <304>   DW_AT_name        : (indirect string, offset: 0x779): _flags2
    <308>   DW_AT_decl_file   : 9
    <309>   DW_AT_decl_line   : 73
    <30a>   DW_AT_decl_column : 7
    <30b>   DW_AT_type        : <0x64>
    <30f>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><312>: Abbrev Number: 9 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0x7f2): _old_offset
    <317>   DW_AT_decl_file   : 9
    <318>   DW_AT_decl_line   : 74
    <319>   DW_AT_decl_column : 11
    <31a>   DW_AT_type        : <0xa2>
    <31e>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><321>: Abbrev Number: 9 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x23e): _cur_column
    <326>   DW_AT_decl_file   : 9
    <327>   DW_AT_decl_line   : 77
    <328>   DW_AT_decl_column : 18
    <329>   DW_AT_type        : <0x24>
    <32d>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><330>: Abbrev Number: 9 (DW_TAG_member)
    <331>   DW_AT_name        : (indirect string, offset: 0xe10): _vtable_offset
    <335>   DW_AT_decl_file   : 9
    <336>   DW_AT_decl_line   : 78
    <337>   DW_AT_decl_column : 15
    <338>   DW_AT_type        : <0x3e>
    <33c>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><33f>: Abbrev Number: 9 (DW_TAG_member)
    <340>   DW_AT_name        : (indirect string, offset: 0xc93): _shortbuf
    <344>   DW_AT_decl_file   : 9
    <345>   DW_AT_decl_line   : 79
    <346>   DW_AT_decl_column : 8
    <347>   DW_AT_type        : <0x3fc>
    <34b>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><34e>: Abbrev Number: 9 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x15f): _lock
    <353>   DW_AT_decl_file   : 9
    <354>   DW_AT_decl_line   : 81
    <355>   DW_AT_decl_column : 15
    <356>   DW_AT_type        : <0x40c>
    <35a>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><35d>: Abbrev Number: 9 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0x6bc): _offset
    <362>   DW_AT_decl_file   : 9
    <363>   DW_AT_decl_line   : 89
    <364>   DW_AT_decl_column : 13
    <365>   DW_AT_type        : <0xae>
    <369>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><36c>: Abbrev Number: 9 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xa1f): _codecvt
    <371>   DW_AT_decl_file   : 9
    <372>   DW_AT_decl_line   : 91
    <373>   DW_AT_decl_column : 23
    <374>   DW_AT_type        : <0x418>
    <378>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><37b>: Abbrev Number: 9 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0xf64): _wide_data
    <380>   DW_AT_decl_file   : 9
    <381>   DW_AT_decl_line   : 92
    <382>   DW_AT_decl_column : 25
    <383>   DW_AT_type        : <0x424>
    <387>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><38a>: Abbrev Number: 9 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x3b6): _freeres_list
    <38f>   DW_AT_decl_file   : 9
    <390>   DW_AT_decl_line   : 93
    <391>   DW_AT_decl_column : 20
    <392>   DW_AT_type        : <0x3f6>
    <396>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><399>: Abbrev Number: 9 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0xbf6): _freeres_buf
    <39e>   DW_AT_decl_file   : 9
    <39f>   DW_AT_decl_line   : 94
    <3a0>   DW_AT_decl_column : 9
    <3a1>   DW_AT_type        : <0xc6>
    <3a5>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3a8>: Abbrev Number: 9 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x992): __pad5
    <3ad>   DW_AT_decl_file   : 9
    <3ae>   DW_AT_decl_line   : 95
    <3af>   DW_AT_decl_column : 10
    <3b0>   DW_AT_type        : <0x122>
    <3b4>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3b7>: Abbrev Number: 9 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0xa03): _mode
    <3bc>   DW_AT_decl_file   : 9
    <3bd>   DW_AT_decl_line   : 96
    <3be>   DW_AT_decl_column : 7
    <3bf>   DW_AT_type        : <0x64>
    <3c3>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3c6>: Abbrev Number: 9 (DW_TAG_member)
    <3c7>   DW_AT_name        : (indirect string, offset: 0x7a7): _unused2
    <3cb>   DW_AT_decl_file   : 9
    <3cc>   DW_AT_decl_line   : 98
    <3cd>   DW_AT_decl_column : 8
    <3ce>   DW_AT_type        : <0x42a>
    <3d2>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3d5>: Abbrev Number: 0
 <1><3d6>: Abbrev Number: 4 (DW_TAG_typedef)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xab2): FILE
    <3db>   DW_AT_decl_file   : 10
    <3dc>   DW_AT_decl_line   : 7
    <3dd>   DW_AT_decl_column : 25
    <3de>   DW_AT_type        : <0x215>
 <1><3e2>: Abbrev Number: 16 (DW_TAG_typedef)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x461): _IO_lock_t
    <3e7>   DW_AT_decl_file   : 9
    <3e8>   DW_AT_decl_line   : 43
    <3e9>   DW_AT_decl_column : 14
 <1><3ea>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x2fb): _IO_marker
    <3ef>   DW_AT_declaration : 1
 <1><3f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x3ea>
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x215>
 <1><3fc>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fd>   DW_AT_type        : <0xdf>
    <401>   DW_AT_sibling     : <0x40c>
 <2><405>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <406>   DW_AT_type        : <0x2b>
    <40a>   DW_AT_upper_bound : 0
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40d>   DW_AT_byte_size   : 4
    <40e>   DW_AT_type        : <0x3e2>
 <1><412>: Abbrev Number: 17 (DW_TAG_structure_type)
    <413>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <417>   DW_AT_declaration : 1
 <1><418>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <419>   DW_AT_byte_size   : 4
    <41a>   DW_AT_type        : <0x412>
 <1><41e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <41f>   DW_AT_name        : (indirect string, offset: 0x365): _IO_wide_data
    <423>   DW_AT_declaration : 1
 <1><424>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <425>   DW_AT_byte_size   : 4
    <426>   DW_AT_type        : <0x41e>
 <1><42a>: Abbrev Number: 10 (DW_TAG_array_type)
    <42b>   DW_AT_type        : <0xdf>
    <42f>   DW_AT_sibling     : <0x43a>
 <2><433>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <434>   DW_AT_type        : <0x2b>
    <438>   DW_AT_upper_bound : 39
 <2><439>: Abbrev Number: 0
 <1><43a>: Abbrev Number: 14 (DW_TAG_variable)
    <43b>   DW_AT_name        : (indirect string, offset: 0x5a0): stdin
    <43f>   DW_AT_decl_file   : 11
    <440>   DW_AT_decl_line   : 137
    <441>   DW_AT_decl_column : 14
    <442>   DW_AT_type        : <0x448>
    <446>   DW_AT_external    : 1
    <447>   DW_AT_declaration : 1
 <1><448>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <449>   DW_AT_byte_size   : 4
    <44a>   DW_AT_type        : <0x3d6>
 <1><44e>: Abbrev Number: 14 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0xfa9): stdout
    <453>   DW_AT_decl_file   : 11
    <454>   DW_AT_decl_line   : 138
    <455>   DW_AT_decl_column : 14
    <456>   DW_AT_type        : <0x448>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 14 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0xda2): stderr
    <461>   DW_AT_decl_file   : 11
    <462>   DW_AT_decl_line   : 139
    <463>   DW_AT_decl_column : 14
    <464>   DW_AT_type        : <0x448>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 14 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0x24a): sys_nerr
    <46f>   DW_AT_decl_file   : 12
    <470>   DW_AT_decl_line   : 26
    <471>   DW_AT_decl_column : 12
    <472>   DW_AT_type        : <0x64>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 10 (DW_TAG_array_type)
    <479>   DW_AT_type        : <0x209>
    <47d>   DW_AT_sibling     : <0x483>
 <2><481>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><482>: Abbrev Number: 0
 <1><483>: Abbrev Number: 3 (DW_TAG_const_type)
    <484>   DW_AT_type        : <0x478>
 <1><488>: Abbrev Number: 14 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x5af): sys_errlist
    <48d>   DW_AT_decl_file   : 12
    <48e>   DW_AT_decl_line   : 27
    <48f>   DW_AT_decl_column : 26
    <490>   DW_AT_type        : <0x483>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 14 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0x25d): _sys_nerr
    <49b>   DW_AT_decl_file   : 12
    <49c>   DW_AT_decl_line   : 30
    <49d>   DW_AT_decl_column : 12
    <49e>   DW_AT_type        : <0x64>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 14 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe1f): _sys_errlist
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 31
    <4ab>   DW_AT_decl_column : 26
    <4ac>   DW_AT_type        : <0x483>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 14 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x695): program_invocation_name
    <4b7>   DW_AT_decl_file   : 13
    <4b8>   DW_AT_decl_line   : 45
    <4b9>   DW_AT_decl_column : 14
    <4ba>   DW_AT_type        : <0xd9>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 14 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0xb9b): program_invocation_short_name
    <4c5>   DW_AT_decl_file   : 13
    <4c6>   DW_AT_decl_line   : 46
    <4c7>   DW_AT_decl_column : 14
    <4c8>   DW_AT_type        : <0xd9>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 10 (DW_TAG_array_type)
    <4cf>   DW_AT_type        : <0xd9>
    <4d3>   DW_AT_sibling     : <0x4de>
 <2><4d7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4d8>   DW_AT_type        : <0x2b>
    <4dc>   DW_AT_upper_bound : 1
 <2><4dd>: Abbrev Number: 0
 <1><4de>: Abbrev Number: 14 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x19c): __tzname
    <4e3>   DW_AT_decl_file   : 14
    <4e4>   DW_AT_decl_line   : 159
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4ce>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 14 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0xe7a): __daylight
    <4f1>   DW_AT_decl_file   : 14
    <4f2>   DW_AT_decl_line   : 160
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 14 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x35a): __timezone
    <4ff>   DW_AT_decl_file   : 14
    <500>   DW_AT_decl_line   : 161
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0x11b>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 14 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0x98b): tzname
    <50d>   DW_AT_decl_file   : 14
    <50e>   DW_AT_decl_line   : 166
    <50f>   DW_AT_decl_column : 14
    <510>   DW_AT_type        : <0x4ce>
    <514>   DW_AT_external    : 1
    <515>   DW_AT_declaration : 1
 <1><516>: Abbrev Number: 14 (DW_TAG_variable)
    <517>   DW_AT_name        : (indirect string, offset: 0x1019): daylight
    <51b>   DW_AT_decl_file   : 14
    <51c>   DW_AT_decl_line   : 174
    <51d>   DW_AT_decl_column : 12
    <51e>   DW_AT_type        : <0x64>
    <522>   DW_AT_external    : 1
    <523>   DW_AT_declaration : 1
 <1><524>: Abbrev Number: 14 (DW_TAG_variable)
    <525>   DW_AT_name        : (indirect string, offset: 0x4a6): timezone
    <529>   DW_AT_decl_file   : 14
    <52a>   DW_AT_decl_line   : 175
    <52b>   DW_AT_decl_column : 17
    <52c>   DW_AT_type        : <0x11b>
    <530>   DW_AT_external    : 1
    <531>   DW_AT_declaration : 1
 <1><532>: Abbrev Number: 13 (DW_TAG_variable)
    <533>   DW_AT_name        : (indirect string, offset: 0xf0f): getdate_err
    <537>   DW_AT_decl_file   : 14
    <538>   DW_AT_decl_line   : 274
    <53a>   DW_AT_decl_column : 12
    <53b>   DW_AT_type        : <0x64>
    <53f>   DW_AT_external    : 1
    <540>   DW_AT_declaration : 1
 <1><541>: Abbrev Number: 14 (DW_TAG_variable)
    <542>   DW_AT_name        : (indirect string, offset: 0x99e): debug_flag
    <546>   DW_AT_decl_file   : 15
    <547>   DW_AT_decl_line   : 20
    <548>   DW_AT_decl_column : 13
    <549>   DW_AT_type        : <0x54f>
    <54d>   DW_AT_external    : 1
    <54e>   DW_AT_declaration : 1
 <1><54f>: Abbrev Number: 2 (DW_TAG_base_type)
    <550>   DW_AT_byte_size   : 1
    <551>   DW_AT_encoding    : 2	(boolean)
    <552>   DW_AT_name        : (indirect string, offset: 0x3f8): _Bool
 <1><556>: Abbrev Number: 3 (DW_TAG_const_type)
    <557>   DW_AT_type        : <0x54f>
 <1><55b>: Abbrev Number: 4 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xa63): __kernel_long_t
    <560>   DW_AT_decl_file   : 16
    <561>   DW_AT_decl_line   : 14
    <562>   DW_AT_decl_column : 19
    <563>   DW_AT_type        : <0x88>
 <1><567>: Abbrev Number: 4 (DW_TAG_typedef)
    <568>   DW_AT_name        : (indirect string, offset: 0x58f): __kernel_ulong_t
    <56c>   DW_AT_decl_file   : 16
    <56d>   DW_AT_decl_line   : 15
    <56e>   DW_AT_decl_column : 28
    <56f>   DW_AT_type        : <0x9b>
 <1><573>: Abbrev Number: 4 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x3c4): kernel_long_t
    <578>   DW_AT_decl_file   : 17
    <579>   DW_AT_decl_line   : 16
    <57a>   DW_AT_decl_column : 25
    <57b>   DW_AT_type        : <0x55b>
 <1><57f>: Abbrev Number: 4 (DW_TAG_typedef)
    <580>   DW_AT_name        : (indirect string, offset: 0x873): kernel_ulong_t
    <584>   DW_AT_decl_file   : 17
    <585>   DW_AT_decl_line   : 17
    <586>   DW_AT_decl_column : 26
    <587>   DW_AT_type        : <0x567>
 <1><58b>: Abbrev Number: 3 (DW_TAG_const_type)
    <58c>   DW_AT_type        : <0x57f>
 <1><590>: Abbrev Number: 12 (DW_TAG_structure_type)
    <591>   DW_AT_name        : (indirect string, offset: 0xbb9): list_item
    <595>   DW_AT_byte_size   : 8
    <596>   DW_AT_decl_file   : 18
    <597>   DW_AT_decl_line   : 92
    <598>   DW_AT_decl_column : 8
    <599>   DW_AT_sibling     : <0x5bc>
 <2><59d>: Abbrev Number: 9 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x107c): prev
    <5a2>   DW_AT_decl_file   : 18
    <5a3>   DW_AT_decl_line   : 93
    <5a4>   DW_AT_decl_column : 20
    <5a5>   DW_AT_type        : <0x5bc>
    <5a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5ac>: Abbrev Number: 9 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xa73): next
    <5b1>   DW_AT_decl_file   : 18
    <5b2>   DW_AT_decl_line   : 94
    <5b3>   DW_AT_decl_column : 20
    <5b4>   DW_AT_type        : <0x5bc>
    <5b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5bb>: Abbrev Number: 0
 <1><5bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5bd>   DW_AT_byte_size   : 4
    <5be>   DW_AT_type        : <0x590>
 <1><5c2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x83f): sysent
    <5c7>   DW_AT_byte_size   : 20
    <5c8>   DW_AT_decl_file   : 19
    <5c9>   DW_AT_decl_line   : 13
    <5ca>   DW_AT_decl_column : 16
    <5cb>   DW_AT_sibling     : <0x61b>
 <2><5cf>: Abbrev Number: 9 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0xfc0): nargs
    <5d4>   DW_AT_decl_file   : 19
    <5d5>   DW_AT_decl_line   : 14
    <5d6>   DW_AT_decl_column : 11
    <5d7>   DW_AT_type        : <0x2b>
    <5db>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5de>: Abbrev Number: 9 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x942): sys_flags
    <5e3>   DW_AT_decl_file   : 19
    <5e4>   DW_AT_decl_line   : 15
    <5e5>   DW_AT_decl_column : 6
    <5e6>   DW_AT_type        : <0x64>
    <5ea>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5ed>: Abbrev Number: 19 (DW_TAG_member)
    <5ee>   DW_AT_name        : sen
    <5f2>   DW_AT_decl_file   : 19
    <5f3>   DW_AT_decl_line   : 16
    <5f4>   DW_AT_decl_column : 6
    <5f5>   DW_AT_type        : <0x64>
    <5f9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5fc>: Abbrev Number: 9 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x2f2): sys_func
    <601>   DW_AT_decl_file   : 19
    <602>   DW_AT_decl_line   : 17
    <603>   DW_AT_decl_column : 8
    <604>   DW_AT_type        : <0x877>
    <608>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><60b>: Abbrev Number: 9 (DW_TAG_member)
    <60c>   DW_AT_name        : (indirect string, offset: 0x267): sys_name
    <610>   DW_AT_decl_file   : 19
    <611>   DW_AT_decl_line   : 18
    <612>   DW_AT_decl_column : 14
    <613>   DW_AT_type        : <0x203>
    <617>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <61c>   DW_AT_prototyped  : 1
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_sibling     : <0x62b>
 <2><625>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <626>   DW_AT_type        : <0x62b>
 <2><62a>: Abbrev Number: 0
 <1><62b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <62c>   DW_AT_byte_size   : 4
    <62d>   DW_AT_type        : <0x636>
 <1><631>: Abbrev Number: 3 (DW_TAG_const_type)
    <632>   DW_AT_type        : <0x62b>
 <1><636>: Abbrev Number: 22 (DW_TAG_structure_type)
    <637>   DW_AT_name        : tcb
    <63b>   DW_AT_byte_size   : 280
    <63d>   DW_AT_decl_file   : 20
    <63e>   DW_AT_decl_line   : 262
    <640>   DW_AT_decl_column : 8
    <641>   DW_AT_sibling     : <0x877>
 <2><645>: Abbrev Number: 23 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0x4b5): flags
    <64a>   DW_AT_decl_file   : 20
    <64b>   DW_AT_decl_line   : 263
    <64d>   DW_AT_decl_column : 6
    <64e>   DW_AT_type        : <0x64>
    <652>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><655>: Abbrev Number: 24 (DW_TAG_member)
    <656>   DW_AT_name        : pid
    <65a>   DW_AT_decl_file   : 20
    <65b>   DW_AT_decl_line   : 264
    <65d>   DW_AT_decl_column : 6
    <65e>   DW_AT_type        : <0x64>
    <662>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><665>: Abbrev Number: 23 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <66a>   DW_AT_decl_file   : 20
    <66b>   DW_AT_decl_line   : 265
    <66d>   DW_AT_decl_column : 6
    <66e>   DW_AT_type        : <0x64>
    <672>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><675>: Abbrev Number: 23 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x37e): currpers
    <67a>   DW_AT_decl_file   : 20
    <67b>   DW_AT_decl_line   : 267
    <67d>   DW_AT_decl_column : 15
    <67e>   DW_AT_type        : <0x2b>
    <682>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><685>: Abbrev Number: 23 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0xb05): u_error
    <68a>   DW_AT_decl_file   : 20
    <68b>   DW_AT_decl_line   : 269
    <68d>   DW_AT_decl_column : 16
    <68e>   DW_AT_type        : <0x37>
    <692>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><695>: Abbrev Number: 23 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <69a>   DW_AT_decl_file   : 20
    <69b>   DW_AT_decl_line   : 270
    <69d>   DW_AT_decl_column : 17
    <69e>   DW_AT_type        : <0x57f>
    <6a2>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6a5>: Abbrev Number: 23 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0xb51): true_scno
    <6aa>   DW_AT_decl_file   : 20
    <6ab>   DW_AT_decl_line   : 271
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0x57f>
    <6b2>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6b5>: Abbrev Number: 23 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x186): u_arg
    <6ba>   DW_AT_decl_file   : 20
    <6bb>   DW_AT_decl_line   : 272
    <6bd>   DW_AT_decl_column : 17
    <6be>   DW_AT_type        : <0x9a7>
    <6c2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6c5>: Abbrev Number: 23 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x959): u_rval
    <6ca>   DW_AT_decl_file   : 20
    <6cb>   DW_AT_decl_line   : 273
    <6cd>   DW_AT_decl_column : 16
    <6ce>   DW_AT_type        : <0x573>
    <6d2>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6d5>: Abbrev Number: 23 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0xa84): sys_func_rval
    <6da>   DW_AT_decl_file   : 20
    <6db>   DW_AT_decl_line   : 274
    <6dd>   DW_AT_decl_column : 6
    <6de>   DW_AT_type        : <0x64>
    <6e2>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6e5>: Abbrev Number: 23 (DW_TAG_member)
    <6e6>   DW_AT_name        : (indirect string, offset: 0xcad): curcol
    <6ea>   DW_AT_decl_file   : 20
    <6eb>   DW_AT_decl_line   : 275
    <6ed>   DW_AT_decl_column : 6
    <6ee>   DW_AT_type        : <0x64>
    <6f2>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6f5>: Abbrev Number: 23 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x96b): outf
    <6fa>   DW_AT_decl_file   : 20
    <6fb>   DW_AT_decl_line   : 276
    <6fd>   DW_AT_decl_column : 8
    <6fe>   DW_AT_type        : <0x448>
    <702>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><705>: Abbrev Number: 23 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0xeb9): staged_output_data
    <70a>   DW_AT_decl_file   : 20
    <70b>   DW_AT_decl_line   : 277
    <70d>   DW_AT_decl_column : 29
    <70e>   DW_AT_type        : <0x9bd>
    <712>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><715>: Abbrev Number: 23 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0xa4a): auxstr
    <71a>   DW_AT_decl_file   : 20
    <71b>   DW_AT_decl_line   : 279
    <71d>   DW_AT_decl_column : 14
    <71e>   DW_AT_type        : <0x203>
    <722>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><725>: Abbrev Number: 23 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x165): _priv_data
    <72a>   DW_AT_decl_file   : 20
    <72b>   DW_AT_decl_line   : 280
    <72d>   DW_AT_decl_column : 8
    <72e>   DW_AT_type        : <0xc6>
    <732>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><735>: Abbrev Number: 23 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0xbe6): _free_priv_data
    <73a>   DW_AT_decl_file   : 20
    <73b>   DW_AT_decl_line   : 281
    <73d>   DW_AT_decl_column : 9
    <73e>   DW_AT_type        : <0x9cf>
    <742>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><745>: Abbrev Number: 23 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0x176): s_ent
    <74a>   DW_AT_decl_file   : 20
    <74b>   DW_AT_decl_line   : 282
    <74d>   DW_AT_decl_column : 23
    <74e>   DW_AT_type        : <0x9d5>
    <752>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><755>: Abbrev Number: 23 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <75a>   DW_AT_decl_file   : 20
    <75b>   DW_AT_decl_line   : 285
    <75d>   DW_AT_decl_column : 23
    <75e>   DW_AT_type        : <0x9d5>
    <762>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><766>: Abbrev Number: 23 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x373): inject_vec
    <76b>   DW_AT_decl_file   : 20
    <76c>   DW_AT_decl_line   : 286
    <76e>   DW_AT_decl_column : 22
    <76f>   DW_AT_type        : <0x9e0>
    <773>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><777>: Abbrev Number: 23 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x7b0): stime
    <77c>   DW_AT_decl_file   : 20
    <77d>   DW_AT_decl_line   : 287
    <77f>   DW_AT_decl_column : 18
    <780>   DW_AT_type        : <0x174>
    <784>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><788>: Abbrev Number: 23 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x387): ltime
    <78d>   DW_AT_decl_file   : 20
    <78e>   DW_AT_decl_line   : 288
    <790>   DW_AT_decl_column : 18
    <791>   DW_AT_type        : <0x174>
    <795>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><799>: Abbrev Number: 23 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0xf87): atime
    <79e>   DW_AT_decl_file   : 20
    <79f>   DW_AT_decl_line   : 289
    <7a1>   DW_AT_decl_column : 18
    <7a2>   DW_AT_type        : <0x174>
    <7a6>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><7aa>: Abbrev Number: 23 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x4af): etime
    <7af>   DW_AT_decl_file   : 20
    <7b0>   DW_AT_decl_line   : 290
    <7b2>   DW_AT_decl_column : 18
    <7b3>   DW_AT_type        : <0x174>
    <7b7>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7bb>: Abbrev Number: 23 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xd11): delay_expiration_time
    <7c0>   DW_AT_decl_file   : 20
    <7c1>   DW_AT_decl_line   : 291
    <7c3>   DW_AT_decl_column : 18
    <7c4>   DW_AT_type        : <0x174>
    <7c8>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7cc>: Abbrev Number: 23 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7d1>   DW_AT_decl_file   : 20
    <7d2>   DW_AT_decl_line   : 298
    <7d4>   DW_AT_decl_column : 15
    <7d5>   DW_AT_type        : <0x2b>
    <7d9>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7dd>: Abbrev Number: 23 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xef5): last_dirfd
    <7e2>   DW_AT_decl_file   : 20
    <7e3>   DW_AT_decl_line   : 301
    <7e5>   DW_AT_decl_column : 6
    <7e6>   DW_AT_type        : <0x64>
    <7ea>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7ee>: Abbrev Number: 23 (DW_TAG_member)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xf1b): mmap_cache
    <7f3>   DW_AT_decl_file   : 20
    <7f4>   DW_AT_decl_line   : 304
    <7f6>   DW_AT_decl_column : 23
    <7f7>   DW_AT_type        : <0x9fc>
    <7fb>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ff>: Abbrev Number: 23 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0xb27): wait_data_idx
    <804>   DW_AT_decl_file   : 20
    <805>   DW_AT_decl_line   : 311
    <807>   DW_AT_decl_column : 9
    <808>   DW_AT_type        : <0x122>
    <80c>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><810>: Abbrev Number: 23 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0xa51): delayed_wait_data
    <815>   DW_AT_decl_file   : 20
    <816>   DW_AT_decl_line   : 313
    <818>   DW_AT_decl_column : 24
    <819>   DW_AT_type        : <0xa08>
    <81d>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><821>: Abbrev Number: 23 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0xac6): wait_list
    <826>   DW_AT_decl_file   : 20
    <827>   DW_AT_decl_line   : 314
    <829>   DW_AT_decl_column : 19
    <82a>   DW_AT_type        : <0x590>
    <82e>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><832>: Abbrev Number: 23 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0x6ad): vcpu_info_list
    <837>   DW_AT_decl_file   : 20
    <838>   DW_AT_decl_line   : 318
    <83a>   DW_AT_decl_column : 20
    <83b>   DW_AT_type        : <0xa14>
    <83f>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><843>: Abbrev Number: 23 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0xc78): unwind_ctx
    <848>   DW_AT_decl_file   : 20
    <849>   DW_AT_decl_line   : 322
    <84b>   DW_AT_decl_column : 8
    <84c>   DW_AT_type        : <0xc6>
    <850>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><854>: Abbrev Number: 23 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x499): unwind_queue
    <859>   DW_AT_decl_file   : 20
    <85a>   DW_AT_decl_line   : 323
    <85c>   DW_AT_decl_column : 25
    <85d>   DW_AT_type        : <0xa20>
    <861>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><865>: Abbrev Number: 23 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x15a): comm
    <86a>   DW_AT_decl_file   : 20
    <86b>   DW_AT_decl_line   : 327
    <86d>   DW_AT_decl_column : 7
    <86e>   DW_AT_type        : <0xa26>
    <872>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><876>: Abbrev Number: 0
 <1><877>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <878>   DW_AT_byte_size   : 4
    <879>   DW_AT_type        : <0x61b>
 <1><87d>: Abbrev Number: 4 (DW_TAG_typedef)
    <87e>   DW_AT_name        : (indirect string, offset: 0x581): struct_sysent
    <882>   DW_AT_decl_file   : 19
    <883>   DW_AT_decl_line   : 19
    <884>   DW_AT_decl_column : 3
    <885>   DW_AT_type        : <0x5c2>
 <1><889>: Abbrev Number: 3 (DW_TAG_const_type)
    <88a>   DW_AT_type        : <0x87d>
 <1><88e>: Abbrev Number: 14 (DW_TAG_variable)
    <88f>   DW_AT_name        : (indirect string, offset: 0xcfd): current_personality
    <893>   DW_AT_decl_file   : 20
    <894>   DW_AT_decl_line   : 158
    <895>   DW_AT_decl_column : 17
    <896>   DW_AT_type        : <0x2b>
    <89a>   DW_AT_external    : 1
    <89b>   DW_AT_declaration : 1
 <1><89c>: Abbrev Number: 14 (DW_TAG_variable)
    <89d>   DW_AT_name        : (indirect string, offset: 0x7e1): current_wordsize
    <8a1>   DW_AT_decl_file   : 20
    <8a2>   DW_AT_decl_line   : 171
    <8a3>   DW_AT_decl_column : 17
    <8a4>   DW_AT_type        : <0x2b>
    <8a8>   DW_AT_external    : 1
    <8a9>   DW_AT_declaration : 1
 <1><8aa>: Abbrev Number: 14 (DW_TAG_variable)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xa28): current_klongsize
    <8af>   DW_AT_decl_file   : 20
    <8b0>   DW_AT_decl_line   : 176
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x2b>
    <8b6>   DW_AT_external    : 1
    <8b7>   DW_AT_declaration : 1
 <1><8b8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xc4f): ioctlent
    <8bd>   DW_AT_byte_size   : 8
    <8be>   DW_AT_decl_file   : 20
    <8bf>   DW_AT_decl_line   : 217
    <8c0>   DW_AT_decl_column : 16
    <8c1>   DW_AT_sibling     : <0x8e4>
 <2><8c5>: Abbrev Number: 9 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0xee1): symbol
    <8ca>   DW_AT_decl_file   : 20
    <8cb>   DW_AT_decl_line   : 218
    <8cc>   DW_AT_decl_column : 14
    <8cd>   DW_AT_type        : <0x203>
    <8d1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d4>: Abbrev Number: 9 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xcc6): code
    <8d9>   DW_AT_decl_file   : 20
    <8da>   DW_AT_decl_line   : 219
    <8db>   DW_AT_decl_column : 15
    <8dc>   DW_AT_type        : <0x2b>
    <8e0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e3>: Abbrev Number: 0
 <1><8e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xc10): struct_ioctlent
    <8e9>   DW_AT_decl_file   : 20
    <8ea>   DW_AT_decl_line   : 220
    <8eb>   DW_AT_decl_column : 3
    <8ec>   DW_AT_type        : <0x8b8>
 <1><8f0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f1>   DW_AT_type        : <0x8e4>
 <1><8f5>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x7d5): inject_data
    <8fa>   DW_AT_byte_size   : 10
    <8fb>   DW_AT_decl_file   : 20
    <8fc>   DW_AT_decl_line   : 241
    <8fd>   DW_AT_decl_column : 8
    <8fe>   DW_AT_sibling     : <0x95d>
 <2><902>: Abbrev Number: 9 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x4b5): flags
    <907>   DW_AT_decl_file   : 20
    <908>   DW_AT_decl_line   : 242
    <909>   DW_AT_decl_column : 10
    <90a>   DW_AT_type        : <0xeb>
    <90e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><911>: Abbrev Number: 9 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x8f6): signo
    <916>   DW_AT_decl_file   : 20
    <917>   DW_AT_decl_line   : 243
    <918>   DW_AT_decl_column : 10
    <919>   DW_AT_type        : <0xeb>
    <91d>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><920>: Abbrev Number: 9 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <925>   DW_AT_decl_file   : 20
    <926>   DW_AT_decl_line   : 244
    <927>   DW_AT_decl_column : 11
    <928>   DW_AT_type        : <0xf7>
    <92c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><92f>: Abbrev Number: 9 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0xca3): delay_idx
    <934>   DW_AT_decl_file   : 20
    <935>   DW_AT_decl_line   : 245
    <936>   DW_AT_decl_column : 11
    <937>   DW_AT_type        : <0xf7>
    <93b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><93e>: Abbrev Number: 9 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x5db): poke_idx
    <943>   DW_AT_decl_file   : 20
    <944>   DW_AT_decl_line   : 246
    <945>   DW_AT_decl_column : 11
    <946>   DW_AT_type        : <0xf7>
    <94a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><94d>: Abbrev Number: 9 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <952>   DW_AT_decl_file   : 20
    <953>   DW_AT_decl_line   : 247
    <954>   DW_AT_decl_column : 11
    <955>   DW_AT_type        : <0xf7>
    <959>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><95c>: Abbrev Number: 0
 <1><95d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <95e>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <962>   DW_AT_byte_size   : 16
    <963>   DW_AT_decl_file   : 20
    <964>   DW_AT_decl_line   : 250
    <965>   DW_AT_decl_column : 8
    <966>   DW_AT_sibling     : <0x9a7>
 <2><96a>: Abbrev Number: 9 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x9fd): first
    <96f>   DW_AT_decl_file   : 20
    <970>   DW_AT_decl_line   : 251
    <971>   DW_AT_decl_column : 11
    <972>   DW_AT_type        : <0xf7>
    <976>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><979>: Abbrev Number: 9 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x10ac): last
    <97e>   DW_AT_decl_file   : 20
    <97f>   DW_AT_decl_line   : 252
    <980>   DW_AT_decl_column : 11
    <981>   DW_AT_type        : <0xf7>
    <985>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><988>: Abbrev Number: 9 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x38d): step
    <98d>   DW_AT_decl_file   : 20
    <98e>   DW_AT_decl_line   : 253
    <98f>   DW_AT_decl_column : 11
    <990>   DW_AT_type        : <0xf7>
    <994>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><997>: Abbrev Number: 9 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0x1077): data
    <99c>   DW_AT_decl_file   : 20
    <99d>   DW_AT_decl_line   : 254
    <99e>   DW_AT_decl_column : 21
    <99f>   DW_AT_type        : <0x8f5>
    <9a3>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 10 (DW_TAG_array_type)
    <9a8>   DW_AT_type        : <0x57f>
    <9ac>   DW_AT_sibling     : <0x9b7>
 <2><9b0>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9b1>   DW_AT_type        : <0x2b>
    <9b5>   DW_AT_upper_bound : 5
 <2><9b6>: Abbrev Number: 0
 <1><9b7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xeb9): staged_output_data
    <9bc>   DW_AT_declaration : 1
 <1><9bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9be>   DW_AT_byte_size   : 4
    <9bf>   DW_AT_type        : <0x9b7>
 <1><9c3>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9c4>   DW_AT_prototyped  : 1
    <9c5>   DW_AT_sibling     : <0x9cf>
 <2><9c9>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9ca>   DW_AT_type        : <0xc6>
 <2><9ce>: Abbrev Number: 0
 <1><9cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d0>   DW_AT_byte_size   : 4
    <9d1>   DW_AT_type        : <0x9c3>
 <1><9d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d6>   DW_AT_byte_size   : 4
    <9d7>   DW_AT_type        : <0x889>
 <1><9db>: Abbrev Number: 3 (DW_TAG_const_type)
    <9dc>   DW_AT_type        : <0x9d5>
 <1><9e0>: Abbrev Number: 10 (DW_TAG_array_type)
    <9e1>   DW_AT_type        : <0x9f0>
    <9e5>   DW_AT_sibling     : <0x9f0>
 <2><9e9>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9ea>   DW_AT_type        : <0x2b>
    <9ee>   DW_AT_upper_bound : 2
 <2><9ef>: Abbrev Number: 0
 <1><9f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f1>   DW_AT_byte_size   : 4
    <9f2>   DW_AT_type        : <0x95d>
 <1><9f6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9fb>   DW_AT_declaration : 1
 <1><9fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x9f6>
 <1><a02>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a03>   DW_AT_name        : (indirect string, offset: 0x3a8): tcb_wait_data
    <a07>   DW_AT_declaration : 1
 <1><a08>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a09>   DW_AT_byte_size   : 4
    <a0a>   DW_AT_type        : <0xa02>
 <1><a0e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x150): vcpu_info
    <a13>   DW_AT_declaration : 1
 <1><a14>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a15>   DW_AT_byte_size   : 4
    <a16>   DW_AT_type        : <0xa0e>
 <1><a1a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xe9d): unwind_queue_t
    <a1f>   DW_AT_declaration : 1
 <1><a20>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a21>   DW_AT_byte_size   : 4
    <a22>   DW_AT_type        : <0xa1a>
 <1><a26>: Abbrev Number: 10 (DW_TAG_array_type)
    <a27>   DW_AT_type        : <0xdf>
    <a2b>   DW_AT_sibling     : <0xa36>
 <2><a2f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a30>   DW_AT_type        : <0x2b>
    <a34>   DW_AT_upper_bound : 15
 <2><a35>: Abbrev Number: 0
 <1><a36>: Abbrev Number: 13 (DW_TAG_variable)
    <a37>   DW_AT_name        : (indirect string, offset: 0xb64): stub_sysent
    <a3b>   DW_AT_decl_file   : 20
    <a3c>   DW_AT_decl_line   : 400
    <a3e>   DW_AT_decl_column : 28
    <a3f>   DW_AT_type        : <0x889>
    <a43>   DW_AT_external    : 1
    <a44>   DW_AT_declaration : 1
 <1><a45>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a46>   DW_AT_name        : (indirect string, offset: 0x1054): xlat_type
    <a4a>   DW_AT_encoding    : 7	(unsigned)
    <a4b>   DW_AT_byte_size   : 4
    <a4c>   DW_AT_type        : <0x2b>
    <a50>   DW_AT_decl_file   : 21
    <a51>   DW_AT_decl_line   : 13
    <a52>   DW_AT_decl_column : 6
    <a53>   DW_AT_sibling     : <0xa6a>
 <2><a57>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0x2c2): XT_NORMAL
    <a5c>   DW_AT_const_value : 0
 <2><a5d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xc27): XT_SORTED
    <a62>   DW_AT_const_value : 1
 <2><a63>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0xd89): XT_INDEXED
    <a68>   DW_AT_const_value : 2
 <2><a69>: Abbrev Number: 0
 <1><a6a>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xb90): xlat_style
    <a6f>   DW_AT_encoding    : 7	(unsigned)
    <a70>   DW_AT_byte_size   : 4
    <a71>   DW_AT_type        : <0x2b>
    <a75>   DW_AT_decl_file   : 21
    <a76>   DW_AT_decl_line   : 19
    <a77>   DW_AT_decl_column : 6
    <a78>   DW_AT_sibling     : <0xaa7>
 <2><a7c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a81>   DW_AT_const_value : 0
 <2><a82>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0xbc3): XLAT_STYLE_RAW
    <a87>   DW_AT_const_value : 1
 <2><a88>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0x1007): XLAT_STYLE_ABBREV
    <a8d>   DW_AT_const_value : 2
 <2><a8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x2df): XLAT_STYLE_VERBOSE
    <a93>   DW_AT_const_value : 3
 <2><a94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a99>   DW_AT_const_value : 0
 <2><a9a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a9f>   DW_AT_const_value : 4
 <2><aa0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x109b): XLAT_STYLE_FMT_D
    <aa5>   DW_AT_const_value : 8
 <2><aa6>: Abbrev Number: 0
 <1><aa7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x310): xlat_data
    <aac>   DW_AT_byte_size   : 16
    <aad>   DW_AT_decl_file   : 21
    <aae>   DW_AT_decl_line   : 51
    <aaf>   DW_AT_decl_column : 8
    <ab0>   DW_AT_sibling     : <0xad3>
 <2><ab4>: Abbrev Number: 19 (DW_TAG_member)
    <ab5>   DW_AT_name        : val
    <ab9>   DW_AT_decl_file   : 21
    <aba>   DW_AT_decl_line   : 52
    <abb>   DW_AT_decl_column : 11
    <abc>   DW_AT_type        : <0x10f>
    <ac0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac3>: Abbrev Number: 19 (DW_TAG_member)
    <ac4>   DW_AT_name        : str
    <ac8>   DW_AT_decl_file   : 21
    <ac9>   DW_AT_decl_line   : 53
    <aca>   DW_AT_decl_column : 14
    <acb>   DW_AT_type        : <0x203>
    <acf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad2>: Abbrev Number: 0
 <1><ad3>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad4>   DW_AT_type        : <0xaa7>
 <1><ad8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <add>   DW_AT_byte_size   : 24
    <ade>   DW_AT_decl_file   : 21
    <adf>   DW_AT_decl_line   : 56
    <ae0>   DW_AT_decl_column : 8
    <ae1>   DW_AT_sibling     : <0xb31>
 <2><ae5>: Abbrev Number: 9 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x1077): data
    <aea>   DW_AT_decl_file   : 21
    <aeb>   DW_AT_decl_line   : 57
    <aec>   DW_AT_decl_column : 26
    <aed>   DW_AT_type        : <0xb36>
    <af1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af4>: Abbrev Number: 9 (DW_TAG_member)
    <af5>   DW_AT_name        : (indirect string, offset: 0x833): flags_strsz
    <af9>   DW_AT_decl_file   : 21
    <afa>   DW_AT_decl_line   : 58
    <afb>   DW_AT_decl_column : 9
    <afc>   DW_AT_type        : <0x122>
    <b00>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b03>: Abbrev Number: 9 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0xb35): size
    <b08>   DW_AT_decl_file   : 21
    <b09>   DW_AT_decl_line   : 59
    <b0a>   DW_AT_decl_column : 11
    <b0b>   DW_AT_type        : <0x103>
    <b0f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b12>: Abbrev Number: 9 (DW_TAG_member)
    <b13>   DW_AT_name        : (indirect string, offset: 0x181): type
    <b17>   DW_AT_decl_file   : 21
    <b18>   DW_AT_decl_line   : 60
    <b19>   DW_AT_decl_column : 17
    <b1a>   DW_AT_type        : <0xa45>
    <b1e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b21>: Abbrev Number: 9 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0x701): flags_mask
    <b26>   DW_AT_decl_file   : 21
    <b27>   DW_AT_decl_line   : 61
    <b28>   DW_AT_decl_column : 11
    <b29>   DW_AT_type        : <0x10f>
    <b2d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b30>: Abbrev Number: 0
 <1><b31>: Abbrev Number: 3 (DW_TAG_const_type)
    <b32>   DW_AT_type        : <0xad8>
 <1><b36>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b37>   DW_AT_byte_size   : 4
    <b38>   DW_AT_type        : <0xad3>
 <1><b3c>: Abbrev Number: 10 (DW_TAG_array_type)
    <b3d>   DW_AT_type        : <0xb31>
    <b41>   DW_AT_sibling     : <0xb47>
 <2><b45>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b46>: Abbrev Number: 0
 <1><b47>: Abbrev Number: 3 (DW_TAG_const_type)
    <b48>   DW_AT_type        : <0xb3c>
 <1><b4c>: Abbrev Number: 13 (DW_TAG_variable)
    <b4d>   DW_AT_name        : (indirect string, offset: 0xdfd): addrfams
    <b51>   DW_AT_decl_file   : 20
    <b52>   DW_AT_decl_line   : 406
    <b54>   DW_AT_decl_column : 26
    <b55>   DW_AT_type        : <0xb47>
    <b59>   DW_AT_external    : 1
    <b5a>   DW_AT_declaration : 1
 <1><b5b>: Abbrev Number: 13 (DW_TAG_variable)
    <b5c>   DW_AT_name        : (indirect string, offset: 0xcd6): arp_hardware_types
    <b60>   DW_AT_decl_file   : 20
    <b61>   DW_AT_decl_line   : 407
    <b63>   DW_AT_decl_column : 26
    <b64>   DW_AT_type        : <0xb47>
    <b68>   DW_AT_external    : 1
    <b69>   DW_AT_declaration : 1
 <1><b6a>: Abbrev Number: 13 (DW_TAG_variable)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xf8d): at_flags
    <b6f>   DW_AT_decl_file   : 20
    <b70>   DW_AT_decl_line   : 408
    <b72>   DW_AT_decl_column : 26
    <b73>   DW_AT_type        : <0xb47>
    <b77>   DW_AT_external    : 1
    <b78>   DW_AT_declaration : 1
 <1><b79>: Abbrev Number: 13 (DW_TAG_variable)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x477): clocknames
    <b7e>   DW_AT_decl_file   : 20
    <b7f>   DW_AT_decl_line   : 409
    <b81>   DW_AT_decl_column : 26
    <b82>   DW_AT_type        : <0xb47>
    <b86>   DW_AT_external    : 1
    <b87>   DW_AT_declaration : 1
 <1><b88>: Abbrev Number: 13 (DW_TAG_variable)
    <b89>   DW_AT_name        : (indirect string, offset: 0xf57): dirent_types
    <b8d>   DW_AT_decl_file   : 20
    <b8e>   DW_AT_decl_line   : 410
    <b90>   DW_AT_decl_column : 26
    <b91>   DW_AT_type        : <0xb47>
    <b95>   DW_AT_external    : 1
    <b96>   DW_AT_declaration : 1
 <1><b97>: Abbrev Number: 13 (DW_TAG_variable)
    <b98>   DW_AT_name        : (indirect string, offset: 0x890): ethernet_protocols
    <b9c>   DW_AT_decl_file   : 20
    <b9d>   DW_AT_decl_line   : 411
    <b9f>   DW_AT_decl_column : 26
    <ba0>   DW_AT_type        : <0xb47>
    <ba4>   DW_AT_external    : 1
    <ba5>   DW_AT_declaration : 1
 <1><ba6>: Abbrev Number: 13 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x62e): inet_protocols
    <bab>   DW_AT_decl_file   : 20
    <bac>   DW_AT_decl_line   : 412
    <bae>   DW_AT_decl_column : 26
    <baf>   DW_AT_type        : <0xb47>
    <bb3>   DW_AT_external    : 1
    <bb4>   DW_AT_declaration : 1
 <1><bb5>: Abbrev Number: 13 (DW_TAG_variable)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x2af): evdev_abs
    <bba>   DW_AT_decl_file   : 20
    <bbb>   DW_AT_decl_line   : 413
    <bbd>   DW_AT_decl_column : 26
    <bbe>   DW_AT_type        : <0xb47>
    <bc2>   DW_AT_external    : 1
    <bc3>   DW_AT_declaration : 1
 <1><bc4>: Abbrev Number: 13 (DW_TAG_variable)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x6f6): audit_arch
    <bc9>   DW_AT_decl_file   : 20
    <bca>   DW_AT_decl_line   : 414
    <bcc>   DW_AT_decl_column : 26
    <bcd>   DW_AT_type        : <0xb47>
    <bd1>   DW_AT_external    : 1
    <bd2>   DW_AT_declaration : 1
 <1><bd3>: Abbrev Number: 13 (DW_TAG_variable)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bd8>   DW_AT_decl_file   : 20
    <bd9>   DW_AT_decl_line   : 415
    <bdb>   DW_AT_decl_column : 26
    <bdc>   DW_AT_type        : <0xb47>
    <be0>   DW_AT_external    : 1
    <be1>   DW_AT_declaration : 1
 <1><be2>: Abbrev Number: 13 (DW_TAG_variable)
    <be3>   DW_AT_name        : (indirect string, offset: 0x458): iffflags
    <be7>   DW_AT_decl_file   : 20
    <be8>   DW_AT_decl_line   : 416
    <bea>   DW_AT_decl_column : 26
    <beb>   DW_AT_type        : <0xb47>
    <bef>   DW_AT_external    : 1
    <bf0>   DW_AT_declaration : 1
 <1><bf1>: Abbrev Number: 13 (DW_TAG_variable)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xbd2): ip_type_of_services
    <bf6>   DW_AT_decl_file   : 20
    <bf7>   DW_AT_decl_line   : 417
    <bf9>   DW_AT_decl_column : 26
    <bfa>   DW_AT_type        : <0xb47>
    <bfe>   DW_AT_external    : 1
    <bff>   DW_AT_declaration : 1
 <1><c00>: Abbrev Number: 13 (DW_TAG_variable)
    <c01>   DW_AT_name        : (indirect string, offset: 0x689): ipc_private
    <c05>   DW_AT_decl_file   : 20
    <c06>   DW_AT_decl_line   : 418
    <c08>   DW_AT_decl_column : 26
    <c09>   DW_AT_type        : <0xb47>
    <c0d>   DW_AT_external    : 1
    <c0e>   DW_AT_declaration : 1
 <1><c0f>: Abbrev Number: 13 (DW_TAG_variable)
    <c10>   DW_AT_name        : (indirect string, offset: 0x306): msg_flags
    <c14>   DW_AT_decl_file   : 20
    <c15>   DW_AT_decl_line   : 419
    <c17>   DW_AT_decl_column : 26
    <c18>   DW_AT_type        : <0xb47>
    <c1c>   DW_AT_external    : 1
    <c1d>   DW_AT_declaration : 1
 <1><c1e>: Abbrev Number: 13 (DW_TAG_variable)
    <c1f>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c23>   DW_AT_decl_file   : 20
    <c24>   DW_AT_decl_line   : 420
    <c26>   DW_AT_decl_column : 26
    <c27>   DW_AT_type        : <0xb47>
    <c2b>   DW_AT_external    : 1
    <c2c>   DW_AT_declaration : 1
 <1><c2d>: Abbrev Number: 13 (DW_TAG_variable)
    <c2e>   DW_AT_name        : (indirect string, offset: 0xecc): nl_bridge_vlan_flags
    <c32>   DW_AT_decl_file   : 20
    <c33>   DW_AT_decl_line   : 421
    <c35>   DW_AT_decl_column : 26
    <c36>   DW_AT_type        : <0xb47>
    <c3a>   DW_AT_external    : 1
    <c3b>   DW_AT_declaration : 1
 <1><c3c>: Abbrev Number: 13 (DW_TAG_variable)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xd72): nl_netfilter_msg_types
    <c41>   DW_AT_decl_file   : 20
    <c42>   DW_AT_decl_line   : 422
    <c44>   DW_AT_decl_column : 26
    <c45>   DW_AT_type        : <0xb47>
    <c49>   DW_AT_external    : 1
    <c4a>   DW_AT_declaration : 1
 <1><c4b>: Abbrev Number: 13 (DW_TAG_variable)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x21b): nl_route_types
    <c50>   DW_AT_decl_file   : 20
    <c51>   DW_AT_decl_line   : 423
    <c53>   DW_AT_decl_column : 26
    <c54>   DW_AT_type        : <0xb47>
    <c58>   DW_AT_external    : 1
    <c59>   DW_AT_declaration : 1
 <1><c5a>: Abbrev Number: 13 (DW_TAG_variable)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xe34): open_access_modes
    <c5f>   DW_AT_decl_file   : 20
    <c60>   DW_AT_decl_line   : 424
    <c62>   DW_AT_decl_column : 26
    <c63>   DW_AT_type        : <0xb47>
    <c67>   DW_AT_external    : 1
    <c68>   DW_AT_declaration : 1
 <1><c69>: Abbrev Number: 13 (DW_TAG_variable)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c6e>   DW_AT_decl_file   : 20
    <c6f>   DW_AT_decl_line   : 425
    <c71>   DW_AT_decl_column : 26
    <c72>   DW_AT_type        : <0xb47>
    <c76>   DW_AT_external    : 1
    <c77>   DW_AT_declaration : 1
 <1><c78>: Abbrev Number: 13 (DW_TAG_variable)
    <c79>   DW_AT_name        : (indirect string, offset: 0xc03): perf_type_id
    <c7d>   DW_AT_decl_file   : 20
    <c7e>   DW_AT_decl_line   : 426
    <c80>   DW_AT_decl_column : 26
    <c81>   DW_AT_type        : <0xb47>
    <c85>   DW_AT_external    : 1
    <c86>   DW_AT_declaration : 1
 <1><c87>: Abbrev Number: 13 (DW_TAG_variable)
    <c88>   DW_AT_name        : (indirect string, offset: 0xe06): pollflags
    <c8c>   DW_AT_decl_file   : 20
    <c8d>   DW_AT_decl_line   : 427
    <c8f>   DW_AT_decl_column : 26
    <c90>   DW_AT_type        : <0xb47>
    <c94>   DW_AT_external    : 1
    <c95>   DW_AT_declaration : 1
 <1><c96>: Abbrev Number: 13 (DW_TAG_variable)
    <c97>   DW_AT_name        : (indirect string, offset: 0x5cf): ptrace_cmds
    <c9b>   DW_AT_decl_file   : 20
    <c9c>   DW_AT_decl_line   : 428
    <c9e>   DW_AT_decl_column : 26
    <c9f>   DW_AT_type        : <0xb47>
    <ca3>   DW_AT_external    : 1
    <ca4>   DW_AT_declaration : 1
 <1><ca5>: Abbrev Number: 13 (DW_TAG_variable)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x7c6): resource_flags
    <caa>   DW_AT_decl_file   : 20
    <cab>   DW_AT_decl_line   : 429
    <cad>   DW_AT_decl_column : 26
    <cae>   DW_AT_type        : <0xb47>
    <cb2>   DW_AT_external    : 1
    <cb3>   DW_AT_declaration : 1
 <1><cb4>: Abbrev Number: 13 (DW_TAG_variable)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x285): route_nexthop_flags
    <cb9>   DW_AT_decl_file   : 20
    <cba>   DW_AT_decl_line   : 430
    <cbc>   DW_AT_decl_column : 26
    <cbd>   DW_AT_type        : <0xb47>
    <cc1>   DW_AT_external    : 1
    <cc2>   DW_AT_declaration : 1
 <1><cc3>: Abbrev Number: 13 (DW_TAG_variable)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xe57): routing_protocols
    <cc8>   DW_AT_decl_file   : 20
    <cc9>   DW_AT_decl_line   : 431
    <ccb>   DW_AT_decl_column : 26
    <ccc>   DW_AT_type        : <0xb47>
    <cd0>   DW_AT_external    : 1
    <cd1>   DW_AT_declaration : 1
 <1><cd2>: Abbrev Number: 13 (DW_TAG_variable)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x449): routing_scopes
    <cd7>   DW_AT_decl_file   : 20
    <cd8>   DW_AT_decl_line   : 432
    <cda>   DW_AT_decl_column : 26
    <cdb>   DW_AT_type        : <0xb47>
    <cdf>   DW_AT_external    : 1
    <ce0>   DW_AT_declaration : 1
 <1><ce1>: Abbrev Number: 13 (DW_TAG_variable)
    <ce2>   DW_AT_name        : (indirect string, offset: 0xd60): routing_table_ids
    <ce6>   DW_AT_decl_file   : 20
    <ce7>   DW_AT_decl_line   : 433
    <ce9>   DW_AT_decl_column : 26
    <cea>   DW_AT_type        : <0xb47>
    <cee>   DW_AT_external    : 1
    <cef>   DW_AT_declaration : 1
 <1><cf0>: Abbrev Number: 13 (DW_TAG_variable)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x666): routing_types
    <cf5>   DW_AT_decl_file   : 20
    <cf6>   DW_AT_decl_line   : 434
    <cf8>   DW_AT_decl_column : 26
    <cf9>   DW_AT_type        : <0xb47>
    <cfd>   DW_AT_external    : 1
    <cfe>   DW_AT_declaration : 1
 <1><cff>: Abbrev Number: 13 (DW_TAG_variable)
    <d00>   DW_AT_name        : (indirect string, offset: 0x1a5): rwf_flags
    <d04>   DW_AT_decl_file   : 20
    <d05>   DW_AT_decl_line   : 435
    <d07>   DW_AT_decl_column : 26
    <d08>   DW_AT_type        : <0xb47>
    <d0c>   DW_AT_external    : 1
    <d0d>   DW_AT_declaration : 1
 <1><d0e>: Abbrev Number: 13 (DW_TAG_variable)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x7fe): seccomp_filter_flags
    <d13>   DW_AT_decl_file   : 20
    <d14>   DW_AT_decl_line   : 436
    <d16>   DW_AT_decl_column : 26
    <d17>   DW_AT_type        : <0xb47>
    <d1b>   DW_AT_external    : 1
    <d1c>   DW_AT_declaration : 1
 <1><d1d>: Abbrev Number: 13 (DW_TAG_variable)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x2cc): seccomp_ret_action
    <d22>   DW_AT_decl_file   : 20
    <d23>   DW_AT_decl_line   : 437
    <d25>   DW_AT_decl_column : 26
    <d26>   DW_AT_type        : <0xb47>
    <d2a>   DW_AT_external    : 1
    <d2b>   DW_AT_declaration : 1
 <1><d2c>: Abbrev Number: 13 (DW_TAG_variable)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x412): setns_types
    <d31>   DW_AT_decl_file   : 20
    <d32>   DW_AT_decl_line   : 438
    <d34>   DW_AT_decl_column : 26
    <d35>   DW_AT_type        : <0xb47>
    <d39>   DW_AT_external    : 1
    <d3a>   DW_AT_declaration : 1
 <1><d3b>: Abbrev Number: 13 (DW_TAG_variable)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xdf2): sg_io_info
    <d40>   DW_AT_decl_file   : 20
    <d41>   DW_AT_decl_line   : 439
    <d43>   DW_AT_decl_column : 26
    <d44>   DW_AT_type        : <0xb47>
    <d48>   DW_AT_external    : 1
    <d49>   DW_AT_declaration : 1
 <1><d4a>: Abbrev Number: 13 (DW_TAG_variable)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xb78): socketlayers
    <d4f>   DW_AT_decl_file   : 20
    <d50>   DW_AT_decl_line   : 440
    <d52>   DW_AT_decl_column : 26
    <d53>   DW_AT_type        : <0xb47>
    <d57>   DW_AT_external    : 1
    <d58>   DW_AT_declaration : 1
 <1><d59>: Abbrev Number: 13 (DW_TAG_variable)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xd4a): socktypes
    <d5e>   DW_AT_decl_file   : 20
    <d5f>   DW_AT_decl_line   : 441
    <d61>   DW_AT_decl_column : 26
    <d62>   DW_AT_type        : <0xb47>
    <d66>   DW_AT_external    : 1
    <d67>   DW_AT_declaration : 1
 <1><d68>: Abbrev Number: 13 (DW_TAG_variable)
    <d69>   DW_AT_name        : (indirect string, offset: 0xa3a): tcp_state_flags
    <d6d>   DW_AT_decl_file   : 20
    <d6e>   DW_AT_decl_line   : 442
    <d70>   DW_AT_decl_column : 26
    <d71>   DW_AT_type        : <0xb47>
    <d75>   DW_AT_external    : 1
    <d76>   DW_AT_declaration : 1
 <1><d77>: Abbrev Number: 13 (DW_TAG_variable)
    <d78>   DW_AT_name        : (indirect string, offset: 0x72b): tcp_states
    <d7c>   DW_AT_decl_file   : 20
    <d7d>   DW_AT_decl_line   : 443
    <d7f>   DW_AT_decl_column : 26
    <d80>   DW_AT_type        : <0xb47>
    <d84>   DW_AT_external    : 1
    <d85>   DW_AT_declaration : 1
 <1><d86>: Abbrev Number: 13 (DW_TAG_variable)
    <d87>   DW_AT_name        : (indirect string, offset: 0xfea): whence_codes
    <d8b>   DW_AT_decl_file   : 20
    <d8c>   DW_AT_decl_line   : 444
    <d8e>   DW_AT_decl_column : 26
    <d8f>   DW_AT_type        : <0xb47>
    <d93>   DW_AT_external    : 1
    <d94>   DW_AT_declaration : 1
 <1><d95>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d96>   DW_AT_encoding    : 7	(unsigned)
    <d97>   DW_AT_byte_size   : 4
    <d98>   DW_AT_type        : <0x2b>
    <d9c>   DW_AT_decl_file   : 20
    <d9d>   DW_AT_decl_line   : 505
    <d9f>   DW_AT_decl_column : 14
    <da0>   DW_AT_sibling     : <0xdb7>
 <2><da4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0x960): CFLAG_NONE
    <da9>   DW_AT_const_value : 0
 <2><daa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0x8a3): CFLAG_ONLY_STATS
    <daf>   DW_AT_const_value : 1
 <2><db0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0xb85): CFLAG_BOTH
    <db5>   DW_AT_const_value : 2
 <2><db6>: Abbrev Number: 0
 <1><db7>: Abbrev Number: 29 (DW_TAG_typedef)
    <db8>   DW_AT_name        : (indirect string, offset: 0x10b1): cflag_t
    <dbc>   DW_AT_decl_file   : 20
    <dbd>   DW_AT_decl_line   : 509
    <dbf>   DW_AT_decl_column : 3
    <dc0>   DW_AT_type        : <0xd95>
 <1><dc4>: Abbrev Number: 13 (DW_TAG_variable)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xc9d): cflag
    <dc9>   DW_AT_decl_file   : 20
    <dca>   DW_AT_decl_line   : 510
    <dcc>   DW_AT_decl_column : 16
    <dcd>   DW_AT_type        : <0xdb7>
    <dd1>   DW_AT_external    : 1
    <dd2>   DW_AT_declaration : 1
 <1><dd3>: Abbrev Number: 13 (DW_TAG_variable)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x170): Tflag
    <dd8>   DW_AT_decl_file   : 20
    <dd9>   DW_AT_decl_line   : 511
    <ddb>   DW_AT_decl_column : 13
    <ddc>   DW_AT_type        : <0x54f>
    <de0>   DW_AT_external    : 1
    <de1>   DW_AT_declaration : 1
 <1><de2>: Abbrev Number: 13 (DW_TAG_variable)
    <de3>   DW_AT_name        : (indirect string, offset: 0x781): Tflag_scale
    <de7>   DW_AT_decl_file   : 20
    <de8>   DW_AT_decl_line   : 512
    <dea>   DW_AT_decl_column : 12
    <deb>   DW_AT_type        : <0x64>
    <def>   DW_AT_external    : 1
    <df0>   DW_AT_declaration : 1
 <1><df1>: Abbrev Number: 13 (DW_TAG_variable)
    <df2>   DW_AT_name        : (indirect string, offset: 0x813): Tflag_width
    <df6>   DW_AT_decl_file   : 20
    <df7>   DW_AT_decl_line   : 513
    <df9>   DW_AT_decl_column : 12
    <dfa>   DW_AT_type        : <0x64>
    <dfe>   DW_AT_external    : 1
    <dff>   DW_AT_declaration : 1
 <1><e00>: Abbrev Number: 13 (DW_TAG_variable)
    <e01>   DW_AT_name        : (indirect string, offset: 0xde4): iflag
    <e05>   DW_AT_decl_file   : 20
    <e06>   DW_AT_decl_line   : 514
    <e08>   DW_AT_decl_column : 13
    <e09>   DW_AT_type        : <0x54f>
    <e0d>   DW_AT_external    : 1
    <e0e>   DW_AT_declaration : 1
 <1><e0f>: Abbrev Number: 13 (DW_TAG_variable)
    <e10>   DW_AT_name        : (indirect string, offset: 0x60f): count_wallclock
    <e14>   DW_AT_decl_file   : 20
    <e15>   DW_AT_decl_line   : 515
    <e17>   DW_AT_decl_column : 13
    <e18>   DW_AT_type        : <0x54f>
    <e1c>   DW_AT_external    : 1
    <e1d>   DW_AT_declaration : 1
 <1><e1e>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e23>   DW_AT_byte_size   : 4
    <e24>   DW_AT_decl_file   : 20
    <e25>   DW_AT_decl_line   : 517
    <e27>   DW_AT_decl_column : 8
    <e28>   DW_AT_sibling     : <0xe3d>
 <2><e2c>: Abbrev Number: 23 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e31>   DW_AT_decl_file   : 20
    <e32>   DW_AT_decl_line   : 518
    <e34>   DW_AT_decl_column : 14
    <e35>   DW_AT_type        : <0x203>
    <e39>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3c>: Abbrev Number: 0
 <1><e3d>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x736): path_set
    <e42>   DW_AT_byte_size   : 12
    <e43>   DW_AT_decl_file   : 20
    <e44>   DW_AT_decl_line   : 522
    <e46>   DW_AT_decl_column : 15
    <e47>   DW_AT_sibling     : <0xe7c>
 <2><e4b>: Abbrev Number: 23 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x6c4): paths_selected
    <e50>   DW_AT_decl_file   : 20
    <e51>   DW_AT_decl_line   : 523
    <e53>   DW_AT_decl_column : 24
    <e54>   DW_AT_type        : <0xe7c>
    <e58>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e5b>: Abbrev Number: 23 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0xfdd): num_selected
    <e60>   DW_AT_decl_file   : 20
    <e61>   DW_AT_decl_line   : 524
    <e63>   DW_AT_decl_column : 9
    <e64>   DW_AT_type        : <0x122>
    <e68>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e6b>: Abbrev Number: 23 (DW_TAG_member)
    <e6c>   DW_AT_name        : (indirect string, offset: 0xb35): size
    <e70>   DW_AT_decl_file   : 20
    <e71>   DW_AT_decl_line   : 525
    <e73>   DW_AT_decl_column : 9
    <e74>   DW_AT_type        : <0x122>
    <e78>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e7b>: Abbrev Number: 0
 <1><e7c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7d>   DW_AT_byte_size   : 4
    <e7e>   DW_AT_type        : <0xe1e>
 <1><e82>: Abbrev Number: 13 (DW_TAG_variable)
    <e83>   DW_AT_name        : (indirect string, offset: 0x102c): global_path_set
    <e87>   DW_AT_decl_file   : 20
    <e88>   DW_AT_decl_line   : 526
    <e8a>   DW_AT_decl_column : 3
    <e8b>   DW_AT_type        : <0xe3d>
    <e8f>   DW_AT_external    : 1
    <e90>   DW_AT_declaration : 1
 <1><e91>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e92>   DW_AT_name        : (indirect string, offset: 0xf44): xflag_opts
    <e96>   DW_AT_encoding    : 7	(unsigned)
    <e97>   DW_AT_byte_size   : 4
    <e98>   DW_AT_type        : <0x2b>
    <e9c>   DW_AT_decl_file   : 20
    <e9d>   DW_AT_decl_line   : 528
    <e9f>   DW_AT_decl_column : 6
    <ea0>   DW_AT_sibling     : <0xec3>
 <2><ea4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x9f1): HEXSTR_NONE
    <ea9>   DW_AT_const_value : 0
 <2><eaa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eab>   DW_AT_name        : (indirect string, offset: 0xf6f): HEXSTR_NON_ASCII
    <eaf>   DW_AT_const_value : 1
 <2><eb0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x8e1): HEXSTR_ALL
    <eb5>   DW_AT_const_value : 2
 <2><eb6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x64f): HEXSTR_NON_ASCII_CHARS
    <ebb>   DW_AT_const_value : 3
 <2><ebc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xff7): NUM_HEXSTR_OPTS
    <ec1>   DW_AT_const_value : 4
 <2><ec2>: Abbrev Number: 0
 <1><ec3>: Abbrev Number: 13 (DW_TAG_variable)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xdb3): xflag
    <ec8>   DW_AT_decl_file   : 20
    <ec9>   DW_AT_decl_line   : 541
    <ecb>   DW_AT_decl_column : 17
    <ecc>   DW_AT_type        : <0x2b>
    <ed0>   DW_AT_external    : 1
    <ed1>   DW_AT_declaration : 1
 <1><ed2>: Abbrev Number: 13 (DW_TAG_variable)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xc58): followfork
    <ed7>   DW_AT_decl_file   : 20
    <ed8>   DW_AT_decl_line   : 542
    <eda>   DW_AT_decl_column : 13
    <edb>   DW_AT_type        : <0x54f>
    <edf>   DW_AT_external    : 1
    <ee0>   DW_AT_declaration : 1
 <1><ee1>: Abbrev Number: 13 (DW_TAG_variable)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x31a): output_separately
    <ee6>   DW_AT_decl_file   : 20
    <ee7>   DW_AT_decl_line   : 543
    <ee9>   DW_AT_decl_column : 13
    <eea>   DW_AT_type        : <0x54f>
    <eee>   DW_AT_external    : 1
    <eef>   DW_AT_declaration : 1
 <1><ef0>: Abbrev Number: 13 (DW_TAG_variable)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x22a): stack_trace_enabled
    <ef5>   DW_AT_decl_file   : 20
    <ef6>   DW_AT_decl_line   : 546
    <ef8>   DW_AT_decl_column : 13
    <ef9>   DW_AT_type        : <0x54f>
    <efd>   DW_AT_external    : 1
    <efe>   DW_AT_declaration : 1
 <1><eff>: Abbrev Number: 13 (DW_TAG_variable)
    <f00>   DW_AT_name        : (indirect string, offset: 0x63d): ptrace_setoptions
    <f04>   DW_AT_decl_file   : 20
    <f05>   DW_AT_decl_line   : 550
    <f07>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0x2b>
    <f0c>   DW_AT_external    : 1
    <f0d>   DW_AT_declaration : 1
 <1><f0e>: Abbrev Number: 13 (DW_TAG_variable)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x9e6): max_strlen
    <f13>   DW_AT_decl_file   : 20
    <f14>   DW_AT_decl_line   : 551
    <f16>   DW_AT_decl_column : 17
    <f17>   DW_AT_type        : <0x2b>
    <f1b>   DW_AT_external    : 1
    <f1c>   DW_AT_declaration : 1
 <1><f1d>: Abbrev Number: 13 (DW_TAG_variable)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xa14): os_release
    <f22>   DW_AT_decl_file   : 20
    <f23>   DW_AT_decl_line   : 552
    <f25>   DW_AT_decl_column : 17
    <f26>   DW_AT_type        : <0x2b>
    <f2a>   DW_AT_external    : 1
    <f2b>   DW_AT_declaration : 1
 <1><f2c>: Abbrev Number: 13 (DW_TAG_variable)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x6d3): xlat_verbosity
    <f31>   DW_AT_decl_file   : 20
    <f32>   DW_AT_decl_line   : 914
    <f34>   DW_AT_decl_column : 24
    <f35>   DW_AT_type        : <0xa6a>
    <f39>   DW_AT_external    : 1
    <f3a>   DW_AT_declaration : 1
 <1><f3b>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x5f2): xlat_style_private_flag_bits
    <f40>   DW_AT_encoding    : 7	(unsigned)
    <f41>   DW_AT_byte_size   : 4
    <f42>   DW_AT_type        : <0x2b>
    <f46>   DW_AT_decl_file   : 20
    <f47>   DW_AT_decl_line   : 934
    <f49>   DW_AT_decl_column : 6
    <f4a>   DW_AT_sibling     : <0xf67>
 <2><f4e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x299): PAF_PRINT_INDICES_BIT
    <f53>   DW_AT_const_value : 5
 <2><f54>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0xad9): PAF_ARRAY_TRUNCATED_BIT
    <f59>   DW_AT_const_value : 6
 <2><f5a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x3d2): PXF_DEFAULT_STR_BIT
    <f5f>   DW_AT_const_value : 7
 <2><f60>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0xc3a): SPFF_AUXSTR_MODE_BIT
    <f65>   DW_AT_const_value : 8
 <2><f66>: Abbrev Number: 0
 <1><f67>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f68>   DW_AT_name        : (indirect string, offset: 0xce9): find_xlat_flag_bits
    <f6c>   DW_AT_encoding    : 7	(unsigned)
    <f6d>   DW_AT_byte_size   : 4
    <f6e>   DW_AT_type        : <0x2b>
    <f72>   DW_AT_decl_file   : 20
    <f73>   DW_AT_decl_line   : 1438
    <f75>   DW_AT_decl_column : 6
    <f76>   DW_AT_sibling     : <0xf81>
 <2><f7a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x91e): FXL_CASE_SENSITIVE_BIT
    <f7f>   DW_AT_const_value : 0
 <2><f80>: Abbrev Number: 0
 <1><f81>: Abbrev Number: 13 (DW_TAG_variable)
    <f82>   DW_AT_name        : (indirect string, offset: 0x9b3): printing_tcp
    <f86>   DW_AT_decl_file   : 20
    <f87>   DW_AT_decl_line   : 1684
    <f89>   DW_AT_decl_column : 20
    <f8a>   DW_AT_type        : <0x62b>
    <f8e>   DW_AT_external    : 1
    <f8f>   DW_AT_declaration : 1
 <1><f90>: Abbrev Number: 13 (DW_TAG_variable)
    <f91>   DW_AT_name        : (indirect string, offset: 0x5a6): errnoent
    <f95>   DW_AT_decl_file   : 20
    <f96>   DW_AT_decl_line   : 1882
    <f98>   DW_AT_decl_column : 26
    <f99>   DW_AT_type        : <0x483>
    <f9d>   DW_AT_external    : 1
    <f9e>   DW_AT_declaration : 1
 <1><f9f>: Abbrev Number: 13 (DW_TAG_variable)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x81f): signalent
    <fa4>   DW_AT_decl_file   : 20
    <fa5>   DW_AT_decl_line   : 1883
    <fa7>   DW_AT_decl_column : 26
    <fa8>   DW_AT_type        : <0x483>
    <fac>   DW_AT_external    : 1
    <fad>   DW_AT_declaration : 1
 <1><fae>: Abbrev Number: 13 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0xe2c): nerrnos
    <fb3>   DW_AT_decl_file   : 20
    <fb4>   DW_AT_decl_line   : 1884
    <fb6>   DW_AT_decl_column : 27
    <fb7>   DW_AT_type        : <0x32>
    <fbb>   DW_AT_external    : 1
    <fbc>   DW_AT_declaration : 1
 <1><fbd>: Abbrev Number: 13 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0xfc6): nsignals
    <fc2>   DW_AT_decl_file   : 20
    <fc3>   DW_AT_decl_line   : 1885
    <fc5>   DW_AT_decl_column : 27
    <fc6>   DW_AT_type        : <0x32>
    <fca>   DW_AT_external    : 1
    <fcb>   DW_AT_declaration : 1
 <1><fcc>: Abbrev Number: 10 (DW_TAG_array_type)
    <fcd>   DW_AT_type        : <0x889>
    <fd1>   DW_AT_sibling     : <0xfd7>
 <2><fd5>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fd6>: Abbrev Number: 0
 <1><fd7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd8>   DW_AT_type        : <0xfcc>
 <1><fdc>: Abbrev Number: 13 (DW_TAG_variable)
    <fdd>   DW_AT_name        : (indirect string, offset: 0xcb4): sysent0
    <fe1>   DW_AT_decl_file   : 20
    <fe2>   DW_AT_decl_line   : 1887
    <fe4>   DW_AT_decl_column : 28
    <fe5>   DW_AT_type        : <0xfd7>
    <fe9>   DW_AT_external    : 1
    <fea>   DW_AT_declaration : 1
 <1><feb>: Abbrev Number: 10 (DW_TAG_array_type)
    <fec>   DW_AT_type        : <0x8f0>
    <ff0>   DW_AT_sibling     : <0xff6>
 <2><ff4>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><ff5>: Abbrev Number: 0
 <1><ff6>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff7>   DW_AT_type        : <0xfeb>
 <1><ffb>: Abbrev Number: 13 (DW_TAG_variable)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x1022): ioctlent0
    <1000>   DW_AT_decl_file   : 20
    <1001>   DW_AT_decl_line   : 1888
    <1003>   DW_AT_decl_column : 30
    <1004>   DW_AT_type        : <0xff6>
    <1008>   DW_AT_external    : 1
    <1009>   DW_AT_declaration : 1
 <1><100a>: Abbrev Number: 13 (DW_TAG_variable)
    <100b>   DW_AT_name        : (indirect string, offset: 0x437): personality_names
    <100f>   DW_AT_decl_file   : 20
    <1010>   DW_AT_decl_line   : 1890
    <1012>   DW_AT_decl_column : 26
    <1013>   DW_AT_type        : <0x483>
    <1017>   DW_AT_external    : 1
    <1018>   DW_AT_declaration : 1
 <1><1019>: Abbrev Number: 13 (DW_TAG_variable)
    <101a>   DW_AT_name        : (indirect string, offset: 0x83f): sysent
    <101e>   DW_AT_decl_file   : 20
    <101f>   DW_AT_decl_line   : 1893
    <1021>   DW_AT_decl_column : 29
    <1022>   DW_AT_type        : <0x9d5>
    <1026>   DW_AT_external    : 1
    <1027>   DW_AT_declaration : 1
 <1><1028>: Abbrev Number: 13 (DW_TAG_variable)
    <1029>   DW_AT_name        : (indirect string, offset: 0xc4f): ioctlent
    <102d>   DW_AT_decl_file   : 20
    <102e>   DW_AT_decl_line   : 1894
    <1030>   DW_AT_decl_column : 31
    <1031>   DW_AT_type        : <0x1037>
    <1035>   DW_AT_external    : 1
    <1036>   DW_AT_declaration : 1
 <1><1037>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1038>   DW_AT_byte_size   : 4
    <1039>   DW_AT_type        : <0x8f0>
 <1><103d>: Abbrev Number: 13 (DW_TAG_variable)
    <103e>   DW_AT_name        : (indirect string, offset: 0x829): nsyscalls
    <1042>   DW_AT_decl_file   : 20
    <1043>   DW_AT_decl_line   : 1900
    <1045>   DW_AT_decl_column : 17
    <1046>   DW_AT_type        : <0x2b>
    <104a>   DW_AT_external    : 1
    <104b>   DW_AT_declaration : 1
 <1><104c>: Abbrev Number: 13 (DW_TAG_variable)
    <104d>   DW_AT_name        : (indirect string, offset: 0xe4c): nioctlents
    <1051>   DW_AT_decl_file   : 20
    <1052>   DW_AT_decl_line   : 1901
    <1054>   DW_AT_decl_column : 17
    <1055>   DW_AT_type        : <0x2b>
    <1059>   DW_AT_external    : 1
    <105a>   DW_AT_declaration : 1
 <1><105b>: Abbrev Number: 10 (DW_TAG_array_type)
    <105c>   DW_AT_type        : <0x32>
    <1060>   DW_AT_sibling     : <0x106b>
 <2><1064>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1065>   DW_AT_type        : <0x2b>
    <1069>   DW_AT_upper_bound : 2
 <2><106a>: Abbrev Number: 0
 <1><106b>: Abbrev Number: 3 (DW_TAG_const_type)
    <106c>   DW_AT_type        : <0x105b>
 <1><1070>: Abbrev Number: 13 (DW_TAG_variable)
    <1071>   DW_AT_name        : (indirect string, offset: 0xeac): nsyscall_vec
    <1075>   DW_AT_decl_file   : 20
    <1076>   DW_AT_decl_line   : 1903
    <1078>   DW_AT_decl_column : 27
    <1079>   DW_AT_type        : <0x106b>
    <107d>   DW_AT_external    : 1
    <107e>   DW_AT_declaration : 1
 <1><107f>: Abbrev Number: 10 (DW_TAG_array_type)
    <1080>   DW_AT_type        : <0x9db>
    <1084>   DW_AT_sibling     : <0x108f>
 <2><1088>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1089>   DW_AT_type        : <0x2b>
    <108d>   DW_AT_upper_bound : 2
 <2><108e>: Abbrev Number: 0
 <1><108f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1090>   DW_AT_type        : <0x107f>
 <1><1094>: Abbrev Number: 13 (DW_TAG_variable)
    <1095>   DW_AT_name        : (indirect string, offset: 0x76e): sysent_vec
    <1099>   DW_AT_decl_file   : 20
    <109a>   DW_AT_decl_line   : 1904
    <109c>   DW_AT_decl_column : 35
    <109d>   DW_AT_type        : <0x108f>
    <10a1>   DW_AT_external    : 1
    <10a2>   DW_AT_declaration : 1
 <1><10a3>: Abbrev Number: 13 (DW_TAG_variable)
    <10a4>   DW_AT_name        : (indirect string, offset: 0x373): inject_vec
    <10a8>   DW_AT_decl_file   : 20
    <10a9>   DW_AT_decl_line   : 1905
    <10ab>   DW_AT_decl_column : 28
    <10ac>   DW_AT_type        : <0x9e0>
    <10b0>   DW_AT_external    : 1
    <10b1>   DW_AT_declaration : 1
 <1><10b2>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10b3>   DW_AT_name        : (indirect string, offset: 0xd3d): audit_arch_t
    <10b7>   DW_AT_byte_size   : 8
    <10b8>   DW_AT_decl_file   : 20
    <10b9>   DW_AT_decl_line   : 1907
    <10bb>   DW_AT_decl_column : 8
    <10bc>   DW_AT_sibling     : <0x10e1>
 <2><10c0>: Abbrev Number: 23 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x5e4): arch
    <10c5>   DW_AT_decl_file   : 20
    <10c6>   DW_AT_decl_line   : 1908
    <10c8>   DW_AT_decl_column : 15
    <10c9>   DW_AT_type        : <0x2b>
    <10cd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d0>: Abbrev Number: 23 (DW_TAG_member)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x999): flag
    <10d5>   DW_AT_decl_file   : 20
    <10d6>   DW_AT_decl_line   : 1909
    <10d8>   DW_AT_decl_column : 15
    <10d9>   DW_AT_type        : <0x2b>
    <10dd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e0>: Abbrev Number: 0
 <1><10e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e2>   DW_AT_type        : <0x10b2>
 <1><10e6>: Abbrev Number: 10 (DW_TAG_array_type)
    <10e7>   DW_AT_type        : <0x10e1>
    <10eb>   DW_AT_sibling     : <0x10f6>
 <2><10ef>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10f0>   DW_AT_type        : <0x2b>
    <10f4>   DW_AT_upper_bound : 2
 <2><10f5>: Abbrev Number: 0
 <1><10f6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f7>   DW_AT_type        : <0x10e6>
 <1><10fb>: Abbrev Number: 13 (DW_TAG_variable)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x90f): audit_arch_vec
    <1100>   DW_AT_decl_file   : 20
    <1101>   DW_AT_decl_line   : 1912
    <1103>   DW_AT_decl_column : 34
    <1104>   DW_AT_type        : <0x10f6>
    <1108>   DW_AT_external    : 1
    <1109>   DW_AT_declaration : 1
 <1><110a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <110b>   DW_AT_byte_size   : 180
    <110c>   DW_AT_decl_file   : 22
    <110d>   DW_AT_decl_line   : 2
    <110e>   DW_AT_decl_column : 9
    <110f>   DW_AT_sibling     : <0x13c4>
 <2><1113>: Abbrev Number: 9 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0x846): block_ioctl
    <1118>   DW_AT_decl_file   : 22
    <1119>   DW_AT_decl_line   : 3
    <111a>   DW_AT_decl_column : 8
    <111b>   DW_AT_type        : <0x13de>
    <111f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1122>: Abbrev Number: 9 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0xa78): btrfs_ioctl
    <1127>   DW_AT_decl_file   : 22
    <1128>   DW_AT_decl_line   : 6
    <1129>   DW_AT_decl_column : 8
    <112a>   DW_AT_type        : <0x13de>
    <112e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1131>: Abbrev Number: 9 (DW_TAG_member)
    <1132>   DW_AT_name        : (indirect string, offset: 0x70c): evdev_write_ioctl_mpers
    <1136>   DW_AT_decl_file   : 22
    <1137>   DW_AT_decl_line   : 9
    <1138>   DW_AT_decl_column : 8
    <1139>   DW_AT_type        : <0x13de>
    <113d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1140>: Abbrev Number: 9 (DW_TAG_member)
    <1141>   DW_AT_name        : (indirect string, offset: 0x6e2): get_sock_fprog_size
    <1145>   DW_AT_decl_file   : 22
    <1146>   DW_AT_decl_line   : 12
    <1147>   DW_AT_decl_column : 17
    <1148>   DW_AT_type        : <0x13ea>
    <114c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><114f>: Abbrev Number: 9 (DW_TAG_member)
