Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1755 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x523): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc54): mpers-mx32/struct_blk_user_trace_setup.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xac0): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c8): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1104): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0xa20): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x365): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x258): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xef5): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4bd): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ee): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xfdd): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x92d): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7e1): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xc16): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xc4c): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xdf1): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xd66): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x42a): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x486): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x371): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xc37): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x1085): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xf05): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2c4): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xbad): timespec
    <138>   DW_AT_byte_size   : 16
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x120a): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xba>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xf2b): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xcd>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xdf>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 31
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 16
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xb6f): long double
 <1><176>: Abbrev Number: 12 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x27b): __environ
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 543
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x185>
    <183>   DW_AT_external    : 1
    <184>   DW_AT_declaration : 1
 <1><185>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 4
    <187>   DW_AT_type        : <0xd9>
 <1><18b>: Abbrev Number: 12 (DW_TAG_variable)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3c0): environ
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 545
    <193>   DW_AT_decl_column : 15
    <194>   DW_AT_type        : <0x185>
    <198>   DW_AT_external    : 1
    <199>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 13 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0x10e5): optarg
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 36
    <1a1>   DW_AT_decl_column : 14
    <1a2>   DW_AT_type        : <0xd9>
    <1a6>   DW_AT_external    : 1
    <1a7>   DW_AT_declaration : 1
 <1><1a8>: Abbrev Number: 13 (DW_TAG_variable)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x7a4): optind
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 50
    <1af>   DW_AT_decl_column : 12
    <1b0>   DW_AT_type        : <0x64>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 13 (DW_TAG_variable)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xd41): opterr
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 55
    <1bd>   DW_AT_decl_column : 12
    <1be>   DW_AT_type        : <0x64>
    <1c2>   DW_AT_external    : 1
    <1c3>   DW_AT_declaration : 1
 <1><1c4>: Abbrev Number: 13 (DW_TAG_variable)
    <1c5>   DW_AT_name        : (indirect string, offset: 0xbfc): optopt
    <1c9>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 59
    <1cb>   DW_AT_decl_column : 12
    <1cc>   DW_AT_type        : <0x64>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d3>   DW_AT_byte_size   : 4
    <1d4>   DW_AT_type        : <0xe6>
 <1><1d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d9>   DW_AT_type        : <0x1d2>
 <1><1dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1e4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x379): _IO_FILE
    <1e9>   DW_AT_byte_size   : 152
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 49
    <1ec>   DW_AT_decl_column : 8
    <1ed>   DW_AT_sibling     : <0x3a5>
 <2><1f1>: Abbrev Number: 9 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0xa9c): _flags
    <1f6>   DW_AT_decl_file   : 7
    <1f7>   DW_AT_decl_line   : 51
    <1f8>   DW_AT_decl_column : 7
    <1f9>   DW_AT_type        : <0x64>
    <1fd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x516): _IO_read_ptr
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 54
    <207>   DW_AT_decl_column : 9
    <208>   DW_AT_type        : <0xd9>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x1032): _IO_read_end
    <214>   DW_AT_decl_file   : 7
    <215>   DW_AT_decl_line   : 55
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xd9>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x826): _IO_read_base
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xd9>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x13b): _IO_write_base
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 57
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xd9>
    <239>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x113d): _IO_write_ptr
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 58
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xd9>
    <248>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x985): _IO_write_end
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 59
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xd9>
    <257>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xa09): _IO_buf_base
    <25f>   DW_AT_decl_file   : 7
    <260>   DW_AT_decl_line   : 60
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xd9>
    <266>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xe89): _IO_buf_end
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 61
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xd9>
    <275>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x1cc): _IO_save_base
    <27d>   DW_AT_decl_file   : 7
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xd9>
    <284>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xdb8): _IO_backup_base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 65
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xd9>
    <293>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 66
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xd9>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x64c): _markers
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 68
    <2ac>   DW_AT_decl_column : 22
    <2ad>   DW_AT_type        : <0x3bf>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x20f): _chain
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 70
    <2bb>   DW_AT_decl_column : 20
    <2bc>   DW_AT_type        : <0x3c5>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x10ab): _fileno
    <2c8>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 72
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x64>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x812): _flags2
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 73
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x89a): _old_offset
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 74
    <2e8>   DW_AT_decl_column : 11
    <2e9>   DW_AT_type        : <0xa2>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x23d): _cur_column
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 77
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x24>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xf60): _vtable_offset
    <304>   DW_AT_decl_file   : 7
    <305>   DW_AT_decl_line   : 78
    <306>   DW_AT_decl_column : 15
    <307>   DW_AT_type        : <0x3e>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xdc8): _shortbuf
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 79
    <315>   DW_AT_decl_column : 8
    <316>   DW_AT_type        : <0x3cb>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x17c): _lock
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 81
    <324>   DW_AT_decl_column : 15
    <325>   DW_AT_type        : <0x3db>
    <329>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x73c): _offset
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 89
    <333>   DW_AT_decl_column : 13
    <334>   DW_AT_type        : <0xae>
    <338>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xaf2): _codecvt
    <340>   DW_AT_decl_file   : 7
    <341>   DW_AT_decl_line   : 91
    <342>   DW_AT_decl_column : 23
    <343>   DW_AT_type        : <0x3e7>
    <347>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0x10c9): _wide_data
    <34f>   DW_AT_decl_file   : 7
    <350>   DW_AT_decl_line   : 92
    <351>   DW_AT_decl_column : 25
    <352>   DW_AT_type        : <0x3f3>
    <356>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x3e4): _freeres_list
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 93
    <360>   DW_AT_decl_column : 20
    <361>   DW_AT_type        : <0x3c5>
    <365>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xd17): _freeres_buf
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 94
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_type        : <0xc6>
    <374>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0xa5e): __pad5
    <37c>   DW_AT_decl_file   : 7
    <37d>   DW_AT_decl_line   : 95
    <37e>   DW_AT_decl_column : 10
    <37f>   DW_AT_type        : <0x122>
    <383>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x262): _mode
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 96
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x64>
    <392>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x84f): _unused2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 98
    <39c>   DW_AT_decl_column : 8
    <39d>   DW_AT_type        : <0x3f9>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xb8f): FILE
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 7
    <3ac>   DW_AT_decl_column : 25
    <3ad>   DW_AT_type        : <0x1e4>
 <1><3b1>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x4b2): _IO_lock_t
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 43
    <3b8>   DW_AT_decl_column : 14
 <1><3b9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x315): _IO_marker
    <3be>   DW_AT_declaration : 1
 <1><3bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c1>   DW_AT_type        : <0x3b9>
 <1><3c5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c6>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x1e4>
 <1><3cb>: Abbrev Number: 10 (DW_TAG_array_type)
    <3cc>   DW_AT_type        : <0xdf>
    <3d0>   DW_AT_sibling     : <0x3db>
 <2><3d4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3d5>   DW_AT_type        : <0x2b>
    <3d9>   DW_AT_upper_bound : 0
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3b1>
 <1><3e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3e6>   DW_AT_declaration : 1
 <1><3e7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e8>   DW_AT_byte_size   : 4
    <3e9>   DW_AT_type        : <0x3e1>
 <1><3ed>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x38d): _IO_wide_data
    <3f2>   DW_AT_declaration : 1
 <1><3f3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f4>   DW_AT_byte_size   : 4
    <3f5>   DW_AT_type        : <0x3ed>
 <1><3f9>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fa>   DW_AT_type        : <0xdf>
    <3fe>   DW_AT_sibling     : <0x409>
 <2><402>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <403>   DW_AT_type        : <0x2b>
    <407>   DW_AT_upper_bound : 39
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 13 (DW_TAG_variable)
    <40a>   DW_AT_name        : (indirect string, offset: 0x5fb): stdin
    <40e>   DW_AT_decl_file   : 9
    <40f>   DW_AT_decl_line   : 137
    <410>   DW_AT_decl_column : 14
    <411>   DW_AT_type        : <0x417>
    <415>   DW_AT_external    : 1
    <416>   DW_AT_declaration : 1
 <1><417>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <418>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3a5>
 <1><41d>: Abbrev Number: 13 (DW_TAG_variable)
    <41e>   DW_AT_name        : (indirect string, offset: 0x1117): stdout
    <422>   DW_AT_decl_file   : 9
    <423>   DW_AT_decl_line   : 138
    <424>   DW_AT_decl_column : 14
    <425>   DW_AT_type        : <0x417>
    <429>   DW_AT_external    : 1
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 13 (DW_TAG_variable)
    <42c>   DW_AT_name        : (indirect string, offset: 0xeee): stderr
    <430>   DW_AT_decl_file   : 9
    <431>   DW_AT_decl_line   : 139
    <432>   DW_AT_decl_column : 14
    <433>   DW_AT_type        : <0x417>
    <437>   DW_AT_external    : 1
    <438>   DW_AT_declaration : 1
 <1><439>: Abbrev Number: 13 (DW_TAG_variable)
    <43a>   DW_AT_name        : (indirect string, offset: 0x24f): sys_nerr
    <43e>   DW_AT_decl_file   : 10
    <43f>   DW_AT_decl_line   : 26
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0x64>
    <445>   DW_AT_external    : 1
    <446>   DW_AT_declaration : 1
 <1><447>: Abbrev Number: 10 (DW_TAG_array_type)
    <448>   DW_AT_type        : <0x1d8>
    <44c>   DW_AT_sibling     : <0x452>
 <2><450>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 3 (DW_TAG_const_type)
    <453>   DW_AT_type        : <0x447>
 <1><457>: Abbrev Number: 13 (DW_TAG_variable)
    <458>   DW_AT_name        : (indirect string, offset: 0x612): sys_errlist
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 27
    <45e>   DW_AT_decl_column : 26
    <45f>   DW_AT_type        : <0x452>
    <463>   DW_AT_external    : 1
    <464>   DW_AT_declaration : 1
 <1><465>: Abbrev Number: 13 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x268): _sys_nerr
    <46a>   DW_AT_decl_file   : 10
    <46b>   DW_AT_decl_line   : 30
    <46c>   DW_AT_decl_column : 12
    <46d>   DW_AT_type        : <0x64>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 13 (DW_TAG_variable)
    <474>   DW_AT_name        : (indirect string, offset: 0xf6f): _sys_errlist
    <478>   DW_AT_decl_file   : 10
    <479>   DW_AT_decl_line   : 31
    <47a>   DW_AT_decl_column : 26
    <47b>   DW_AT_type        : <0x452>
    <47f>   DW_AT_external    : 1
    <480>   DW_AT_declaration : 1
 <1><481>: Abbrev Number: 13 (DW_TAG_variable)
    <482>   DW_AT_name        : (indirect string, offset: 0x715): program_invocation_name
    <486>   DW_AT_decl_file   : 11
    <487>   DW_AT_decl_line   : 45
    <488>   DW_AT_decl_column : 14
    <489>   DW_AT_type        : <0xd9>
    <48d>   DW_AT_external    : 1
    <48e>   DW_AT_declaration : 1
 <1><48f>: Abbrev Number: 13 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0xca0): program_invocation_short_name
    <494>   DW_AT_decl_file   : 11
    <495>   DW_AT_decl_line   : 46
    <496>   DW_AT_decl_column : 14
    <497>   DW_AT_type        : <0xd9>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 10 (DW_TAG_array_type)
    <49e>   DW_AT_type        : <0xd9>
    <4a2>   DW_AT_sibling     : <0x4ad>
 <2><4a6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4a7>   DW_AT_type        : <0x2b>
    <4ab>   DW_AT_upper_bound : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 13 (DW_TAG_variable)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x1b9): __tzname
    <4b2>   DW_AT_decl_file   : 12
    <4b3>   DW_AT_decl_line   : 159
    <4b4>   DW_AT_decl_column : 14
    <4b5>   DW_AT_type        : <0x49d>
    <4b9>   DW_AT_external    : 1
    <4ba>   DW_AT_declaration : 1
 <1><4bb>: Abbrev Number: 13 (DW_TAG_variable)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xfc4): __daylight
    <4c0>   DW_AT_decl_file   : 12
    <4c1>   DW_AT_decl_line   : 160
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x64>
    <4c7>   DW_AT_external    : 1
    <4c8>   DW_AT_declaration : 1
 <1><4c9>: Abbrev Number: 13 (DW_TAG_variable)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x382): __timezone
    <4ce>   DW_AT_decl_file   : 12
    <4cf>   DW_AT_decl_line   : 161
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0x11b>
    <4d5>   DW_AT_external    : 1
    <4d6>   DW_AT_declaration : 1
 <1><4d7>: Abbrev Number: 13 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0xa57): tzname
    <4dc>   DW_AT_decl_file   : 12
    <4dd>   DW_AT_decl_line   : 166
    <4de>   DW_AT_decl_column : 14
    <4df>   DW_AT_type        : <0x49d>
    <4e3>   DW_AT_external    : 1
    <4e4>   DW_AT_declaration : 1
 <1><4e5>: Abbrev Number: 13 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x1187): daylight
    <4ea>   DW_AT_decl_file   : 12
    <4eb>   DW_AT_decl_line   : 174
    <4ec>   DW_AT_decl_column : 12
    <4ed>   DW_AT_type        : <0x64>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 13 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x501): timezone
    <4f8>   DW_AT_decl_file   : 12
    <4f9>   DW_AT_decl_line   : 175
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x11b>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 12 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0x1059): getdate_err
    <506>   DW_AT_decl_file   : 12
    <507>   DW_AT_decl_line   : 274
    <509>   DW_AT_decl_column : 12
    <50a>   DW_AT_type        : <0x64>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 13 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0xa6a): debug_flag
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 20
    <517>   DW_AT_decl_column : 13
    <518>   DW_AT_type        : <0x51e>
    <51c>   DW_AT_external    : 1
    <51d>   DW_AT_declaration : 1
 <1><51e>: Abbrev Number: 2 (DW_TAG_base_type)
    <51f>   DW_AT_byte_size   : 1
    <520>   DW_AT_encoding    : 2	(boolean)
    <521>   DW_AT_name        : (indirect string, offset: 0x43c): _Bool
 <1><525>: Abbrev Number: 3 (DW_TAG_const_type)
    <526>   DW_AT_type        : <0x51e>
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0xb45): __kernel_long_t
    <52f>   DW_AT_decl_file   : 14
    <530>   DW_AT_decl_line   : 14
    <531>   DW_AT_decl_column : 19
    <532>   DW_AT_type        : <0x88>
 <1><536>: Abbrev Number: 4 (DW_TAG_typedef)
    <537>   DW_AT_name        : (indirect string, offset: 0x5ea): __kernel_ulong_t
    <53b>   DW_AT_decl_file   : 14
    <53c>   DW_AT_decl_line   : 15
    <53d>   DW_AT_decl_column : 28
    <53e>   DW_AT_type        : <0x9b>
 <1><542>: Abbrev Number: 4 (DW_TAG_typedef)
    <543>   DW_AT_name        : (indirect string, offset: 0x3f2): kernel_long_t
    <547>   DW_AT_decl_file   : 15
    <548>   DW_AT_decl_line   : 16
    <549>   DW_AT_decl_column : 25
    <54a>   DW_AT_type        : <0x52a>
 <1><54e>: Abbrev Number: 4 (DW_TAG_typedef)
    <54f>   DW_AT_name        : (indirect string, offset: 0x91e): kernel_ulong_t
    <553>   DW_AT_decl_file   : 15
    <554>   DW_AT_decl_line   : 17
    <555>   DW_AT_decl_column : 26
    <556>   DW_AT_type        : <0x536>
 <1><55a>: Abbrev Number: 3 (DW_TAG_const_type)
    <55b>   DW_AT_type        : <0x54e>
 <1><55f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <560>   DW_AT_name        : (indirect string, offset: 0xcbe): list_item
    <564>   DW_AT_byte_size   : 8
    <565>   DW_AT_decl_file   : 16
    <566>   DW_AT_decl_line   : 92
    <567>   DW_AT_decl_column : 8
    <568>   DW_AT_sibling     : <0x58b>
 <2><56c>: Abbrev Number: 9 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x1205): prev
    <571>   DW_AT_decl_file   : 16
    <572>   DW_AT_decl_line   : 93
    <573>   DW_AT_decl_column : 20
    <574>   DW_AT_type        : <0x58b>
    <578>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x11e6): next
    <580>   DW_AT_decl_file   : 16
    <581>   DW_AT_decl_line   : 94
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x58b>
    <587>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><58a>: Abbrev Number: 0
 <1><58b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <58c>   DW_AT_byte_size   : 4
    <58d>   DW_AT_type        : <0x55f>
 <1><591>: Abbrev Number: 8 (DW_TAG_structure_type)
    <592>   DW_AT_name        : (indirect string, offset: 0x8e7): sysent
    <596>   DW_AT_byte_size   : 20
    <597>   DW_AT_decl_file   : 17
    <598>   DW_AT_decl_line   : 13
    <599>   DW_AT_decl_column : 16
    <59a>   DW_AT_sibling     : <0x5ea>
 <2><59e>: Abbrev Number: 9 (DW_TAG_member)
    <59f>   DW_AT_name        : (indirect string, offset: 0x112e): nargs
    <5a3>   DW_AT_decl_file   : 17
    <5a4>   DW_AT_decl_line   : 14
    <5a5>   DW_AT_decl_column : 11
    <5a6>   DW_AT_type        : <0x2b>
    <5aa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xa16): sys_flags
    <5b2>   DW_AT_decl_file   : 17
    <5b3>   DW_AT_decl_line   : 15
    <5b4>   DW_AT_decl_column : 6
    <5b5>   DW_AT_type        : <0x64>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5bc>: Abbrev Number: 18 (DW_TAG_member)
    <5bd>   DW_AT_name        : sen
    <5c1>   DW_AT_decl_file   : 17
    <5c2>   DW_AT_decl_line   : 16
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x64>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5cb>: Abbrev Number: 9 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x2fd): sys_func
    <5d0>   DW_AT_decl_file   : 17
    <5d1>   DW_AT_decl_line   : 17
    <5d2>   DW_AT_decl_column : 8
    <5d3>   DW_AT_type        : <0x868>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x272): sys_name
    <5df>   DW_AT_decl_file   : 17
    <5e0>   DW_AT_decl_line   : 18
    <5e1>   DW_AT_decl_column : 14
    <5e2>   DW_AT_type        : <0x1d2>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5eb>   DW_AT_prototyped  : 1
    <5ec>   DW_AT_type        : <0x64>
    <5f0>   DW_AT_sibling     : <0x5fa>
 <2><5f4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5f5>   DW_AT_type        : <0x5fa>
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5fb>   DW_AT_byte_size   : 4
    <5fc>   DW_AT_type        : <0x605>
 <1><600>: Abbrev Number: 3 (DW_TAG_const_type)
    <601>   DW_AT_type        : <0x5fa>
 <1><605>: Abbrev Number: 21 (DW_TAG_structure_type)
    <606>   DW_AT_name        : tcb
    <60a>   DW_AT_byte_size   : 304
    <60c>   DW_AT_decl_file   : 18
    <60d>   DW_AT_decl_line   : 262
    <60f>   DW_AT_decl_column : 8
    <610>   DW_AT_sibling     : <0x868>
 <2><614>: Abbrev Number: 22 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x510): flags
    <619>   DW_AT_decl_file   : 18
    <61a>   DW_AT_decl_line   : 263
    <61c>   DW_AT_decl_column : 6
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><624>: Abbrev Number: 23 (DW_TAG_member)
    <625>   DW_AT_name        : pid
    <629>   DW_AT_decl_file   : 18
    <62a>   DW_AT_decl_line   : 264
    <62c>   DW_AT_decl_column : 6
    <62d>   DW_AT_type        : <0x64>
    <631>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><634>: Abbrev Number: 22 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <639>   DW_AT_decl_file   : 18
    <63a>   DW_AT_decl_line   : 265
    <63c>   DW_AT_decl_column : 6
    <63d>   DW_AT_type        : <0x64>
    <641>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><644>: Abbrev Number: 22 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x3ac): currpers
    <649>   DW_AT_decl_file   : 18
    <64a>   DW_AT_decl_line   : 267
    <64c>   DW_AT_decl_column : 15
    <64d>   DW_AT_type        : <0x2b>
    <651>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><654>: Abbrev Number: 22 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0xbe2): u_error
    <659>   DW_AT_decl_file   : 18
    <65a>   DW_AT_decl_line   : 269
    <65c>   DW_AT_decl_column : 16
    <65d>   DW_AT_type        : <0x37>
    <661>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><664>: Abbrev Number: 22 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x199): scno
    <669>   DW_AT_decl_file   : 18
    <66a>   DW_AT_decl_line   : 270
    <66c>   DW_AT_decl_column : 17
    <66d>   DW_AT_type        : <0x54e>
    <671>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><674>: Abbrev Number: 22 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0xc2d): true_scno
    <679>   DW_AT_decl_file   : 18
    <67a>   DW_AT_decl_line   : 271
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x54e>
    <681>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><684>: Abbrev Number: 22 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x1a3): u_arg
    <689>   DW_AT_decl_file   : 18
    <68a>   DW_AT_decl_line   : 272
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x998>
    <691>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><694>: Abbrev Number: 22 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0xa2d): u_rval
    <699>   DW_AT_decl_file   : 18
    <69a>   DW_AT_decl_line   : 273
    <69c>   DW_AT_decl_column : 16
    <69d>   DW_AT_type        : <0x542>
    <6a1>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6a4>: Abbrev Number: 22 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0xb61): sys_func_rval
    <6a9>   DW_AT_decl_file   : 18
    <6aa>   DW_AT_decl_line   : 274
    <6ac>   DW_AT_decl_column : 6
    <6ad>   DW_AT_type        : <0x64>
    <6b1>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6b4>: Abbrev Number: 22 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0xde2): curcol
    <6b9>   DW_AT_decl_file   : 18
    <6ba>   DW_AT_decl_line   : 275
    <6bc>   DW_AT_decl_column : 6
    <6bd>   DW_AT_type        : <0x64>
    <6c1>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6c4>: Abbrev Number: 22 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0xa3f): outf
    <6c9>   DW_AT_decl_file   : 18
    <6ca>   DW_AT_decl_line   : 276
    <6cc>   DW_AT_decl_column : 8
    <6cd>   DW_AT_type        : <0x417>
    <6d1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><6d4>: Abbrev Number: 22 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x1003): staged_output_data
    <6d9>   DW_AT_decl_file   : 18
    <6da>   DW_AT_decl_line   : 277
    <6dc>   DW_AT_decl_column : 29
    <6dd>   DW_AT_type        : <0x9ae>
    <6e1>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><6e4>: Abbrev Number: 22 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0xb1d): auxstr
    <6e9>   DW_AT_decl_file   : 18
    <6ea>   DW_AT_decl_line   : 279
    <6ec>   DW_AT_decl_column : 14
    <6ed>   DW_AT_type        : <0x1d2>
    <6f1>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><6f4>: Abbrev Number: 22 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x182): _priv_data
    <6f9>   DW_AT_decl_file   : 18
    <6fa>   DW_AT_decl_line   : 280
    <6fc>   DW_AT_decl_column : 8
    <6fd>   DW_AT_type        : <0xc6>
    <701>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><704>: Abbrev Number: 22 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xceb): _free_priv_data
    <709>   DW_AT_decl_file   : 18
    <70a>   DW_AT_decl_line   : 281
    <70c>   DW_AT_decl_column : 9
    <70d>   DW_AT_type        : <0x9c0>
    <711>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><714>: Abbrev Number: 22 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x193): s_ent
    <719>   DW_AT_decl_file   : 18
    <71a>   DW_AT_decl_line   : 282
    <71c>   DW_AT_decl_column : 23
    <71d>   DW_AT_type        : <0x9c6>
    <721>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><724>: Abbrev Number: 22 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <729>   DW_AT_decl_file   : 18
    <72a>   DW_AT_decl_line   : 285
    <72c>   DW_AT_decl_column : 23
    <72d>   DW_AT_type        : <0x9c6>
    <731>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><735>: Abbrev Number: 22 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0x3a1): inject_vec
    <73a>   DW_AT_decl_file   : 18
    <73b>   DW_AT_decl_line   : 286
    <73d>   DW_AT_decl_column : 22
    <73e>   DW_AT_type        : <0x9d1>
    <742>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><746>: Abbrev Number: 22 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x858): stime
    <74b>   DW_AT_decl_file   : 18
    <74c>   DW_AT_decl_line   : 287
    <74e>   DW_AT_decl_column : 18
    <74f>   DW_AT_type        : <0x133>
    <753>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><757>: Abbrev Number: 22 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x3b5): ltime
    <75c>   DW_AT_decl_file   : 18
    <75d>   DW_AT_decl_line   : 288
    <75f>   DW_AT_decl_column : 18
    <760>   DW_AT_type        : <0x133>
    <764>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><768>: Abbrev Number: 22 (DW_TAG_member)
    <769>   DW_AT_name        : (indirect string, offset: 0x10ec): atime
    <76d>   DW_AT_decl_file   : 18
    <76e>   DW_AT_decl_line   : 289
    <770>   DW_AT_decl_column : 18
    <771>   DW_AT_type        : <0x133>
    <775>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><779>: Abbrev Number: 22 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x50a): etime
    <77e>   DW_AT_decl_file   : 18
    <77f>   DW_AT_decl_line   : 290
    <781>   DW_AT_decl_column : 18
    <782>   DW_AT_type        : <0x133>
    <786>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><78a>: Abbrev Number: 22 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0xe46): delay_expiration_time
    <78f>   DW_AT_decl_file   : 18
    <790>   DW_AT_decl_line   : 291
    <792>   DW_AT_decl_column : 18
    <793>   DW_AT_type        : <0x133>
    <797>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><79b>: Abbrev Number: 22 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a0>   DW_AT_decl_file   : 18
    <7a1>   DW_AT_decl_line   : 298
    <7a3>   DW_AT_decl_column : 15
    <7a4>   DW_AT_type        : <0x2b>
    <7a8>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7ac>: Abbrev Number: 22 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x103f): last_dirfd
    <7b1>   DW_AT_decl_file   : 18
    <7b2>   DW_AT_decl_line   : 301
    <7b4>   DW_AT_decl_column : 6
    <7b5>   DW_AT_type        : <0x64>
    <7b9>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7bd>: Abbrev Number: 22 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x1065): mmap_cache
    <7c2>   DW_AT_decl_file   : 18
    <7c3>   DW_AT_decl_line   : 304
    <7c5>   DW_AT_decl_column : 23
    <7c6>   DW_AT_type        : <0x9ed>
    <7ca>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ce>: Abbrev Number: 22 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0xc03): wait_data_idx
    <7d3>   DW_AT_decl_file   : 18
    <7d4>   DW_AT_decl_line   : 311
    <7d6>   DW_AT_decl_column : 9
    <7d7>   DW_AT_type        : <0x122>
    <7db>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><7df>: Abbrev Number: 22 (DW_TAG_member)
    <7e0>   DW_AT_name        : (indirect string, offset: 0xb24): delayed_wait_data
    <7e4>   DW_AT_decl_file   : 18
    <7e5>   DW_AT_decl_line   : 313
    <7e7>   DW_AT_decl_column : 24
    <7e8>   DW_AT_type        : <0x9f9>
    <7ec>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><7f0>: Abbrev Number: 22 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0xba3): wait_list
    <7f5>   DW_AT_decl_file   : 18
    <7f6>   DW_AT_decl_line   : 314
    <7f8>   DW_AT_decl_column : 19
    <7f9>   DW_AT_type        : <0x55f>
    <7fd>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><801>: Abbrev Number: 22 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0x72d): vcpu_info_list
    <806>   DW_AT_decl_file   : 18
    <807>   DW_AT_decl_line   : 318
    <809>   DW_AT_decl_column : 20
    <80a>   DW_AT_type        : <0xa05>
    <80e>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><812>: Abbrev Number: 22 (DW_TAG_member)
    <813>   DW_AT_name        : (indirect string, offset: 0xdad): unwind_ctx
    <817>   DW_AT_decl_file   : 18
    <818>   DW_AT_decl_line   : 322
    <81a>   DW_AT_decl_column : 8
    <81b>   DW_AT_type        : <0xc6>
    <81f>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><823>: Abbrev Number: 22 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x4f4): unwind_queue
    <828>   DW_AT_decl_file   : 18
    <829>   DW_AT_decl_line   : 323
    <82b>   DW_AT_decl_column : 25
    <82c>   DW_AT_type        : <0xa11>
    <830>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><834>: Abbrev Number: 22 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x177): comm
    <839>   DW_AT_decl_file   : 18
    <83a>   DW_AT_decl_line   : 327
    <83c>   DW_AT_decl_column : 7
    <83d>   DW_AT_type        : <0xa17>
    <841>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><845>: Abbrev Number: 22 (DW_TAG_member)
    <846>   DW_AT_name        : (indirect string, offset: 0x21f): start_prc
    <84a>   DW_AT_decl_file   : 18
    <84b>   DW_AT_decl_line   : 329
    <84d>   DW_AT_decl_column : 16
    <84e>   DW_AT_type        : <0x37>
    <852>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><856>: Abbrev Number: 22 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x10c0): pre_comm
    <85b>   DW_AT_decl_file   : 18
    <85c>   DW_AT_decl_line   : 330
    <85e>   DW_AT_decl_column : 7
    <85f>   DW_AT_type        : <0xa17>
    <863>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><867>: Abbrev Number: 0
 <1><868>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <869>   DW_AT_byte_size   : 4
    <86a>   DW_AT_type        : <0x5ea>
 <1><86e>: Abbrev Number: 4 (DW_TAG_typedef)
    <86f>   DW_AT_name        : (indirect string, offset: 0x5dc): struct_sysent
    <873>   DW_AT_decl_file   : 17
    <874>   DW_AT_decl_line   : 19
    <875>   DW_AT_decl_column : 3
    <876>   DW_AT_type        : <0x591>
 <1><87a>: Abbrev Number: 3 (DW_TAG_const_type)
    <87b>   DW_AT_type        : <0x86e>
 <1><87f>: Abbrev Number: 13 (DW_TAG_variable)
    <880>   DW_AT_name        : (indirect string, offset: 0xe32): current_personality
    <884>   DW_AT_decl_file   : 18
    <885>   DW_AT_decl_line   : 158
    <886>   DW_AT_decl_column : 17
    <887>   DW_AT_type        : <0x2b>
    <88b>   DW_AT_external    : 1
    <88c>   DW_AT_declaration : 1
 <1><88d>: Abbrev Number: 13 (DW_TAG_variable)
    <88e>   DW_AT_name        : (indirect string, offset: 0x889): current_wordsize
    <892>   DW_AT_decl_file   : 18
    <893>   DW_AT_decl_line   : 171
    <894>   DW_AT_decl_column : 17
    <895>   DW_AT_type        : <0x2b>
    <899>   DW_AT_external    : 1
    <89a>   DW_AT_declaration : 1
 <1><89b>: Abbrev Number: 13 (DW_TAG_variable)
    <89c>   DW_AT_name        : (indirect string, offset: 0xafb): current_klongsize
    <8a0>   DW_AT_decl_file   : 18
    <8a1>   DW_AT_decl_line   : 176
    <8a2>   DW_AT_decl_column : 17
    <8a3>   DW_AT_type        : <0x2b>
    <8a7>   DW_AT_external    : 1
    <8a8>   DW_AT_declaration : 1
 <1><8a9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xd84): ioctlent
    <8ae>   DW_AT_byte_size   : 8
    <8af>   DW_AT_decl_file   : 18
    <8b0>   DW_AT_decl_line   : 217
    <8b1>   DW_AT_decl_column : 16
    <8b2>   DW_AT_sibling     : <0x8d5>
 <2><8b6>: Abbrev Number: 9 (DW_TAG_member)
    <8b7>   DW_AT_name        : (indirect string, offset: 0x102b): symbol
    <8bb>   DW_AT_decl_file   : 18
    <8bc>   DW_AT_decl_line   : 218
    <8bd>   DW_AT_decl_column : 14
    <8be>   DW_AT_type        : <0x1d2>
    <8c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c5>: Abbrev Number: 9 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0xdfb): code
    <8ca>   DW_AT_decl_file   : 18
    <8cb>   DW_AT_decl_line   : 219
    <8cc>   DW_AT_decl_column : 15
    <8cd>   DW_AT_type        : <0x2b>
    <8d1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d4>: Abbrev Number: 0
 <1><8d5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xd31): struct_ioctlent
    <8da>   DW_AT_decl_file   : 18
    <8db>   DW_AT_decl_line   : 220
    <8dc>   DW_AT_decl_column : 3
    <8dd>   DW_AT_type        : <0x8a9>
 <1><8e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <8e2>   DW_AT_type        : <0x8d5>
 <1><8e6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x87d): inject_data
    <8eb>   DW_AT_byte_size   : 10
    <8ec>   DW_AT_decl_file   : 18
    <8ed>   DW_AT_decl_line   : 241
    <8ee>   DW_AT_decl_column : 8
    <8ef>   DW_AT_sibling     : <0x94e>
 <2><8f3>: Abbrev Number: 9 (DW_TAG_member)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x510): flags
    <8f8>   DW_AT_decl_file   : 18
    <8f9>   DW_AT_decl_line   : 242
    <8fa>   DW_AT_decl_column : 10
    <8fb>   DW_AT_type        : <0xeb>
    <8ff>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><902>: Abbrev Number: 9 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x9b7): signo
    <907>   DW_AT_decl_file   : 18
    <908>   DW_AT_decl_line   : 243
    <909>   DW_AT_decl_column : 10
    <90a>   DW_AT_type        : <0xeb>
    <90e>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><911>: Abbrev Number: 9 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x109): rval_idx
    <916>   DW_AT_decl_file   : 18
    <917>   DW_AT_decl_line   : 244
    <918>   DW_AT_decl_column : 11
    <919>   DW_AT_type        : <0xf7>
    <91d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><920>: Abbrev Number: 9 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0xdd8): delay_idx
    <925>   DW_AT_decl_file   : 18
    <926>   DW_AT_decl_line   : 245
    <927>   DW_AT_decl_column : 11
    <928>   DW_AT_type        : <0xf7>
    <92c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><92f>: Abbrev Number: 9 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0x63e): poke_idx
    <934>   DW_AT_decl_file   : 18
    <935>   DW_AT_decl_line   : 246
    <936>   DW_AT_decl_column : 11
    <937>   DW_AT_type        : <0xf7>
    <93b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><93e>: Abbrev Number: 9 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x199): scno
    <943>   DW_AT_decl_file   : 18
    <944>   DW_AT_decl_line   : 247
    <945>   DW_AT_decl_column : 11
    <946>   DW_AT_type        : <0xf7>
    <94a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><94d>: Abbrev Number: 0
 <1><94e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <94f>   DW_AT_name        : (indirect string, offset: 0xea): inject_opts
    <953>   DW_AT_byte_size   : 16
    <954>   DW_AT_decl_file   : 18
    <955>   DW_AT_decl_line   : 250
    <956>   DW_AT_decl_column : 8
    <957>   DW_AT_sibling     : <0x998>
 <2><95b>: Abbrev Number: 9 (DW_TAG_member)
    <95c>   DW_AT_name        : (indirect string, offset: 0xaba): first
    <960>   DW_AT_decl_file   : 18
    <961>   DW_AT_decl_line   : 251
    <962>   DW_AT_decl_column : 11
    <963>   DW_AT_type        : <0xf7>
    <967>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><96a>: Abbrev Number: 9 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x122e): last
    <96f>   DW_AT_decl_file   : 18
    <970>   DW_AT_decl_line   : 252
    <971>   DW_AT_decl_column : 11
    <972>   DW_AT_type        : <0xf7>
    <976>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><979>: Abbrev Number: 9 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x3bb): step
    <97e>   DW_AT_decl_file   : 18
    <97f>   DW_AT_decl_line   : 253
    <980>   DW_AT_decl_column : 11
    <981>   DW_AT_type        : <0xf7>
    <985>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><988>: Abbrev Number: 9 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x11eb): data
    <98d>   DW_AT_decl_file   : 18
    <98e>   DW_AT_decl_line   : 254
    <98f>   DW_AT_decl_column : 21
    <990>   DW_AT_type        : <0x8e6>
    <994>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><997>: Abbrev Number: 0
 <1><998>: Abbrev Number: 10 (DW_TAG_array_type)
    <999>   DW_AT_type        : <0x54e>
    <99d>   DW_AT_sibling     : <0x9a8>
 <2><9a1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9a2>   DW_AT_type        : <0x2b>
    <9a6>   DW_AT_upper_bound : 5
 <2><9a7>: Abbrev Number: 0
 <1><9a8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x1003): staged_output_data
    <9ad>   DW_AT_declaration : 1
 <1><9ae>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9af>   DW_AT_byte_size   : 4
    <9b0>   DW_AT_type        : <0x9a8>
 <1><9b4>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b5>   DW_AT_prototyped  : 1
    <9b6>   DW_AT_sibling     : <0x9c0>
 <2><9ba>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9bb>   DW_AT_type        : <0xc6>
 <2><9bf>: Abbrev Number: 0
 <1><9c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c1>   DW_AT_byte_size   : 4
    <9c2>   DW_AT_type        : <0x9b4>
 <1><9c6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c7>   DW_AT_byte_size   : 4
    <9c8>   DW_AT_type        : <0x87a>
 <1><9cc>: Abbrev Number: 3 (DW_TAG_const_type)
    <9cd>   DW_AT_type        : <0x9c6>
 <1><9d1>: Abbrev Number: 10 (DW_TAG_array_type)
    <9d2>   DW_AT_type        : <0x9e1>
    <9d6>   DW_AT_sibling     : <0x9e1>
 <2><9da>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9db>   DW_AT_type        : <0x2b>
    <9df>   DW_AT_upper_bound : 2
 <2><9e0>: Abbrev Number: 0
 <1><9e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e2>   DW_AT_byte_size   : 4
    <9e3>   DW_AT_type        : <0x94e>
 <1><9e7>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9ec>   DW_AT_declaration : 1
 <1><9ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ee>   DW_AT_byte_size   : 4
    <9ef>   DW_AT_type        : <0x9e7>
 <1><9f3>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x3d6): tcb_wait_data
    <9f8>   DW_AT_declaration : 1
 <1><9f9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fa>   DW_AT_byte_size   : 4
    <9fb>   DW_AT_type        : <0x9f3>
 <1><9ff>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a00>   DW_AT_name        : (indirect string, offset: 0x16d): vcpu_info
    <a04>   DW_AT_declaration : 1
 <1><a05>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
    <a07>   DW_AT_type        : <0x9ff>
 <1><a0b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a0c>   DW_AT_name        : (indirect string, offset: 0xfe7): unwind_queue_t
    <a10>   DW_AT_declaration : 1
 <1><a11>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a12>   DW_AT_byte_size   : 4
    <a13>   DW_AT_type        : <0xa0b>
 <1><a17>: Abbrev Number: 10 (DW_TAG_array_type)
    <a18>   DW_AT_type        : <0xdf>
    <a1c>   DW_AT_sibling     : <0xa27>
 <2><a20>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a21>   DW_AT_type        : <0x2b>
    <a25>   DW_AT_upper_bound : 15
 <2><a26>: Abbrev Number: 0
 <1><a27>: Abbrev Number: 12 (DW_TAG_variable)
    <a28>   DW_AT_name        : (indirect string, offset: 0xc40): stub_sysent
    <a2c>   DW_AT_decl_file   : 18
    <a2d>   DW_AT_decl_line   : 405
    <a2f>   DW_AT_decl_column : 28
    <a30>   DW_AT_type        : <0x87a>
    <a34>   DW_AT_external    : 1
    <a35>   DW_AT_declaration : 1
 <1><a36>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a37>   DW_AT_name        : (indirect string, offset: 0x11ce): xlat_type
    <a3b>   DW_AT_encoding    : 7	(unsigned)
    <a3c>   DW_AT_byte_size   : 4
    <a3d>   DW_AT_type        : <0x2b>
    <a41>   DW_AT_decl_file   : 19
    <a42>   DW_AT_decl_line   : 13
    <a43>   DW_AT_decl_column : 6
    <a44>   DW_AT_sibling     : <0xa5b>
 <2><a48>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x2cd): XT_NORMAL
    <a4d>   DW_AT_const_value : 0
 <2><a4e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xd48): XT_SORTED
    <a53>   DW_AT_const_value : 1
 <2><a54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0xec3): XT_INDEXED
    <a59>   DW_AT_const_value : 2
 <2><a5a>: Abbrev Number: 0
 <1><a5b>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a5c>   DW_AT_name        : (indirect string, offset: 0xc95): xlat_style
    <a60>   DW_AT_encoding    : 7	(unsigned)
    <a61>   DW_AT_byte_size   : 4
    <a62>   DW_AT_type        : <0x2b>
    <a66>   DW_AT_decl_file   : 19
    <a67>   DW_AT_decl_line   : 19
    <a68>   DW_AT_decl_column : 6
    <a69>   DW_AT_sibling     : <0xa98>
 <2><a6d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6e>   DW_AT_name        : (indirect string, offset: 0xf6): XLAT_STYLE_DEFAULT
    <a72>   DW_AT_const_value : 0
 <2><a73>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a74>   DW_AT_name        : (indirect string, offset: 0xcc8): XLAT_STYLE_RAW
    <a78>   DW_AT_const_value : 1
 <2><a79>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x1175): XLAT_STYLE_ABBREV
    <a7e>   DW_AT_const_value : 2
 <2><a7f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a80>   DW_AT_name        : (indirect string, offset: 0x2ea): XLAT_STYLE_VERBOSE
    <a84>   DW_AT_const_value : 3
 <2><a85>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a86>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a8a>   DW_AT_const_value : 0
 <2><a8b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a90>   DW_AT_const_value : 4
 <2><a91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a92>   DW_AT_name        : (indirect string, offset: 0x121d): XLAT_STYLE_FMT_D
    <a96>   DW_AT_const_value : 8
 <2><a97>: Abbrev Number: 0
 <1><a98>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a99>   DW_AT_name        : (indirect string, offset: 0x32a): xlat_data
    <a9d>   DW_AT_byte_size   : 16
    <a9e>   DW_AT_decl_file   : 19
    <a9f>   DW_AT_decl_line   : 51
    <aa0>   DW_AT_decl_column : 8
    <aa1>   DW_AT_sibling     : <0xac4>
 <2><aa5>: Abbrev Number: 18 (DW_TAG_member)
    <aa6>   DW_AT_name        : val
    <aaa>   DW_AT_decl_file   : 19
    <aab>   DW_AT_decl_line   : 52
    <aac>   DW_AT_decl_column : 11
    <aad>   DW_AT_type        : <0x10f>
    <ab1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab4>: Abbrev Number: 18 (DW_TAG_member)
    <ab5>   DW_AT_name        : str
    <ab9>   DW_AT_decl_file   : 19
    <aba>   DW_AT_decl_line   : 53
    <abb>   DW_AT_decl_column : 14
    <abc>   DW_AT_type        : <0x1d2>
    <ac0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac5>   DW_AT_type        : <0xa98>
 <1><ac9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aca>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ace>   DW_AT_byte_size   : 24
    <acf>   DW_AT_decl_file   : 19
    <ad0>   DW_AT_decl_line   : 56
    <ad1>   DW_AT_decl_column : 8
    <ad2>   DW_AT_sibling     : <0xb22>
 <2><ad6>: Abbrev Number: 9 (DW_TAG_member)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x11eb): data
    <adb>   DW_AT_decl_file   : 19
    <adc>   DW_AT_decl_line   : 57
    <add>   DW_AT_decl_column : 26
    <ade>   DW_AT_type        : <0xb27>
    <ae2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae5>: Abbrev Number: 9 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x8db): flags_strsz
    <aea>   DW_AT_decl_file   : 19
    <aeb>   DW_AT_decl_line   : 58
    <aec>   DW_AT_decl_column : 9
    <aed>   DW_AT_type        : <0x122>
    <af1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af4>: Abbrev Number: 9 (DW_TAG_member)
    <af5>   DW_AT_name        : (indirect string, offset: 0xc11): size
    <af9>   DW_AT_decl_file   : 19
    <afa>   DW_AT_decl_line   : 59
    <afb>   DW_AT_decl_column : 11
    <afc>   DW_AT_type        : <0x103>
    <b00>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b03>: Abbrev Number: 9 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0x19e): type
    <b08>   DW_AT_decl_file   : 19
    <b09>   DW_AT_decl_line   : 60
    <b0a>   DW_AT_decl_column : 17
    <b0b>   DW_AT_type        : <0xa36>
    <b0f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b12>: Abbrev Number: 9 (DW_TAG_member)
    <b13>   DW_AT_name        : (indirect string, offset: 0x781): flags_mask
    <b17>   DW_AT_decl_file   : 19
    <b18>   DW_AT_decl_line   : 61
    <b19>   DW_AT_decl_column : 11
    <b1a>   DW_AT_type        : <0x10f>
    <b1e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b21>: Abbrev Number: 0
 <1><b22>: Abbrev Number: 3 (DW_TAG_const_type)
    <b23>   DW_AT_type        : <0xac9>
 <1><b27>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b28>   DW_AT_byte_size   : 4
    <b29>   DW_AT_type        : <0xac4>
 <1><b2d>: Abbrev Number: 10 (DW_TAG_array_type)
    <b2e>   DW_AT_type        : <0xb22>
    <b32>   DW_AT_sibling     : <0xb38>
 <2><b36>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b37>: Abbrev Number: 0
 <1><b38>: Abbrev Number: 3 (DW_TAG_const_type)
    <b39>   DW_AT_type        : <0xb2d>
 <1><b3d>: Abbrev Number: 12 (DW_TAG_variable)
    <b3e>   DW_AT_name        : (indirect string, offset: 0xf3e): addrfams
    <b42>   DW_AT_decl_file   : 18
    <b43>   DW_AT_decl_line   : 411
    <b45>   DW_AT_decl_column : 26
    <b46>   DW_AT_type        : <0xb38>
    <b4a>   DW_AT_external    : 1
    <b4b>   DW_AT_declaration : 1
 <1><b4c>: Abbrev Number: 12 (DW_TAG_variable)
    <b4d>   DW_AT_name        : (indirect string, offset: 0xe0b): arp_hardware_types
    <b51>   DW_AT_decl_file   : 18
    <b52>   DW_AT_decl_line   : 412
    <b54>   DW_AT_decl_column : 26
    <b55>   DW_AT_type        : <0xb38>
    <b59>   DW_AT_external    : 1
    <b5a>   DW_AT_declaration : 1
 <1><b5b>: Abbrev Number: 12 (DW_TAG_variable)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x10f2): at_flags
    <b60>   DW_AT_decl_file   : 18
    <b61>   DW_AT_decl_line   : 413
    <b63>   DW_AT_decl_column : 26
    <b64>   DW_AT_type        : <0xb38>
    <b68>   DW_AT_external    : 1
    <b69>   DW_AT_declaration : 1
 <1><b6a>: Abbrev Number: 12 (DW_TAG_variable)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x4d2): clocknames
    <b6f>   DW_AT_decl_file   : 18
    <b70>   DW_AT_decl_line   : 414
    <b72>   DW_AT_decl_column : 26
    <b73>   DW_AT_type        : <0xb38>
    <b77>   DW_AT_external    : 1
    <b78>   DW_AT_declaration : 1
 <1><b79>: Abbrev Number: 12 (DW_TAG_variable)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x10b3): dirent_types
    <b7e>   DW_AT_decl_file   : 18
    <b7f>   DW_AT_decl_line   : 415
    <b81>   DW_AT_decl_column : 26
    <b82>   DW_AT_type        : <0xb38>
    <b86>   DW_AT_external    : 1
    <b87>   DW_AT_declaration : 1
 <1><b88>: Abbrev Number: 12 (DW_TAG_variable)
    <b89>   DW_AT_name        : (indirect string, offset: 0x951): ethernet_protocols
    <b8d>   DW_AT_decl_file   : 18
    <b8e>   DW_AT_decl_line   : 416
    <b90>   DW_AT_decl_column : 26
    <b91>   DW_AT_type        : <0xb38>
    <b95>   DW_AT_external    : 1
    <b96>   DW_AT_declaration : 1
 <1><b97>: Abbrev Number: 12 (DW_TAG_variable)
    <b98>   DW_AT_name        : (indirect string, offset: 0x691): inet_protocols
    <b9c>   DW_AT_decl_file   : 18
    <b9d>   DW_AT_decl_line   : 417
    <b9f>   DW_AT_decl_column : 26
    <ba0>   DW_AT_type        : <0xb38>
    <ba4>   DW_AT_external    : 1
    <ba5>   DW_AT_declaration : 1
 <1><ba6>: Abbrev Number: 12 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x2ba): evdev_abs
    <bab>   DW_AT_decl_file   : 18
    <bac>   DW_AT_decl_line   : 418
    <bae>   DW_AT_decl_column : 26
    <baf>   DW_AT_type        : <0xb38>
    <bb3>   DW_AT_external    : 1
    <bb4>   DW_AT_declaration : 1
 <1><bb5>: Abbrev Number: 12 (DW_TAG_variable)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x776): audit_arch
    <bba>   DW_AT_decl_file   : 18
    <bbb>   DW_AT_decl_line   : 419
    <bbd>   DW_AT_decl_column : 26
    <bbe>   DW_AT_type        : <0xb38>
    <bc2>   DW_AT_external    : 1
    <bc3>   DW_AT_declaration : 1
 <1><bc4>: Abbrev Number: 12 (DW_TAG_variable)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bc9>   DW_AT_decl_file   : 18
    <bca>   DW_AT_decl_line   : 420
    <bcc>   DW_AT_decl_column : 26
    <bcd>   DW_AT_type        : <0xb38>
    <bd1>   DW_AT_external    : 1
    <bd2>   DW_AT_declaration : 1
 <1><bd3>: Abbrev Number: 12 (DW_TAG_variable)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x4a9): iffflags
    <bd8>   DW_AT_decl_file   : 18
    <bd9>   DW_AT_decl_line   : 421
    <bdb>   DW_AT_decl_column : 26
    <bdc>   DW_AT_type        : <0xb38>
    <be0>   DW_AT_external    : 1
    <be1>   DW_AT_declaration : 1
 <1><be2>: Abbrev Number: 12 (DW_TAG_variable)
    <be3>   DW_AT_name        : (indirect string, offset: 0xcd7): ip_type_of_services
    <be7>   DW_AT_decl_file   : 18
    <be8>   DW_AT_decl_line   : 422
    <bea>   DW_AT_decl_column : 26
    <beb>   DW_AT_type        : <0xb38>
    <bef>   DW_AT_external    : 1
    <bf0>   DW_AT_declaration : 1
 <1><bf1>: Abbrev Number: 12 (DW_TAG_variable)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x6f9): ipc_private
    <bf6>   DW_AT_decl_file   : 18
    <bf7>   DW_AT_decl_line   : 423
    <bf9>   DW_AT_decl_column : 26
    <bfa>   DW_AT_type        : <0xb38>
    <bfe>   DW_AT_external    : 1
    <bff>   DW_AT_declaration : 1
 <1><c00>: Abbrev Number: 12 (DW_TAG_variable)
    <c01>   DW_AT_name        : (indirect string, offset: 0x320): msg_flags
    <c05>   DW_AT_decl_file   : 18
    <c06>   DW_AT_decl_line   : 424
    <c08>   DW_AT_decl_column : 26
    <c09>   DW_AT_type        : <0xb38>
    <c0d>   DW_AT_external    : 1
    <c0e>   DW_AT_declaration : 1
 <1><c0f>: Abbrev Number: 12 (DW_TAG_variable)
    <c10>   DW_AT_name        : (indirect string, offset: 0x112): netlink_protocols
    <c14>   DW_AT_decl_file   : 18
    <c15>   DW_AT_decl_line   : 425
    <c17>   DW_AT_decl_column : 26
    <c18>   DW_AT_type        : <0xb38>
    <c1c>   DW_AT_external    : 1
    <c1d>   DW_AT_declaration : 1
 <1><c1e>: Abbrev Number: 12 (DW_TAG_variable)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x1016): nl_bridge_vlan_flags
    <c23>   DW_AT_decl_file   : 18
    <c24>   DW_AT_decl_line   : 426
    <c26>   DW_AT_decl_column : 26
    <c27>   DW_AT_type        : <0xb38>
    <c2b>   DW_AT_external    : 1
    <c2c>   DW_AT_declaration : 1
 <1><c2d>: Abbrev Number: 12 (DW_TAG_variable)
    <c2e>   DW_AT_name        : (indirect string, offset: 0xea7): nl_netfilter_msg_types
    <c32>   DW_AT_decl_file   : 18
    <c33>   DW_AT_decl_line   : 427
    <c35>   DW_AT_decl_column : 26
    <c36>   DW_AT_type        : <0xb38>
    <c3a>   DW_AT_external    : 1
    <c3b>   DW_AT_declaration : 1
 <1><c3c>: Abbrev Number: 12 (DW_TAG_variable)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x48b): nl_route_types
    <c41>   DW_AT_decl_file   : 18
    <c42>   DW_AT_decl_line   : 428
    <c44>   DW_AT_decl_column : 26
    <c45>   DW_AT_type        : <0xb38>
    <c49>   DW_AT_external    : 1
    <c4a>   DW_AT_declaration : 1
 <1><c4b>: Abbrev Number: 12 (DW_TAG_variable)
    <c4c>   DW_AT_name        : (indirect string, offset: 0xf84): open_access_modes
    <c50>   DW_AT_decl_file   : 18
    <c51>   DW_AT_decl_line   : 429
    <c53>   DW_AT_decl_column : 26
    <c54>   DW_AT_type        : <0xb38>
    <c58>   DW_AT_external    : 1
    <c59>   DW_AT_declaration : 1
 <1><c5a>: Abbrev Number: 12 (DW_TAG_variable)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c5f>   DW_AT_decl_file   : 18
    <c60>   DW_AT_decl_line   : 430
    <c62>   DW_AT_decl_column : 26
    <c63>   DW_AT_type        : <0xb38>
    <c67>   DW_AT_external    : 1
    <c68>   DW_AT_declaration : 1
 <1><c69>: Abbrev Number: 12 (DW_TAG_variable)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xd24): perf_type_id
    <c6e>   DW_AT_decl_file   : 18
    <c6f>   DW_AT_decl_line   : 431
    <c71>   DW_AT_decl_column : 26
    <c72>   DW_AT_type        : <0xb38>
    <c76>   DW_AT_external    : 1
    <c77>   DW_AT_declaration : 1
 <1><c78>: Abbrev Number: 12 (DW_TAG_variable)
    <c79>   DW_AT_name        : (indirect string, offset: 0xf47): pollflags
    <c7d>   DW_AT_decl_file   : 18
    <c7e>   DW_AT_decl_line   : 432
    <c80>   DW_AT_decl_column : 26
    <c81>   DW_AT_type        : <0xb38>
    <c85>   DW_AT_external    : 1
    <c86>   DW_AT_declaration : 1
 <1><c87>: Abbrev Number: 12 (DW_TAG_variable)
    <c88>   DW_AT_name        : (indirect string, offset: 0x632): ptrace_cmds
    <c8c>   DW_AT_decl_file   : 18
    <c8d>   DW_AT_decl_line   : 433
    <c8f>   DW_AT_decl_column : 26
    <c90>   DW_AT_type        : <0xb38>
    <c94>   DW_AT_external    : 1
    <c95>   DW_AT_declaration : 1
 <1><c96>: Abbrev Number: 12 (DW_TAG_variable)
    <c97>   DW_AT_name        : (indirect string, offset: 0x86e): resource_flags
    <c9b>   DW_AT_decl_file   : 18
    <c9c>   DW_AT_decl_line   : 434
    <c9e>   DW_AT_decl_column : 26
    <c9f>   DW_AT_type        : <0xb38>
    <ca3>   DW_AT_external    : 1
    <ca4>   DW_AT_declaration : 1
 <1><ca5>: Abbrev Number: 12 (DW_TAG_variable)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x290): route_nexthop_flags
    <caa>   DW_AT_decl_file   : 18
    <cab>   DW_AT_decl_line   : 435
    <cad>   DW_AT_decl_column : 26
    <cae>   DW_AT_type        : <0xb38>
    <cb2>   DW_AT_external    : 1
    <cb3>   DW_AT_declaration : 1
 <1><cb4>: Abbrev Number: 12 (DW_TAG_variable)
    <cb5>   DW_AT_name        : (indirect string, offset: 0xfa1): routing_protocols
    <cb9>   DW_AT_decl_file   : 18
    <cba>   DW_AT_decl_line   : 436
    <cbc>   DW_AT_decl_column : 26
    <cbd>   DW_AT_type        : <0xb38>
    <cc1>   DW_AT_external    : 1
    <cc2>   DW_AT_declaration : 1
 <1><cc3>: Abbrev Number: 12 (DW_TAG_variable)
    <cc4>   DW_AT_name        : (indirect string, offset: 0x49a): routing_scopes
    <cc8>   DW_AT_decl_file   : 18
    <cc9>   DW_AT_decl_line   : 437
    <ccb>   DW_AT_decl_column : 26
    <ccc>   DW_AT_type        : <0xb38>
    <cd0>   DW_AT_external    : 1
    <cd1>   DW_AT_declaration : 1
 <1><cd2>: Abbrev Number: 12 (DW_TAG_variable)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xe95): routing_table_ids
    <cd7>   DW_AT_decl_file   : 18
    <cd8>   DW_AT_decl_line   : 438
    <cda>   DW_AT_decl_column : 26
    <cdb>   DW_AT_type        : <0xb38>
    <cdf>   DW_AT_external    : 1
    <ce0>   DW_AT_declaration : 1
 <1><ce1>: Abbrev Number: 12 (DW_TAG_variable)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x6c9): routing_types
    <ce6>   DW_AT_decl_file   : 18
    <ce7>   DW_AT_decl_line   : 439
    <ce9>   DW_AT_decl_column : 26
    <cea>   DW_AT_type        : <0xb38>
    <cee>   DW_AT_external    : 1
    <cef>   DW_AT_declaration : 1
 <1><cf0>: Abbrev Number: 12 (DW_TAG_variable)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x1c2): rwf_flags
    <cf5>   DW_AT_decl_file   : 18
    <cf6>   DW_AT_decl_line   : 440
    <cf8>   DW_AT_decl_column : 26
    <cf9>   DW_AT_type        : <0xb38>
    <cfd>   DW_AT_external    : 1
    <cfe>   DW_AT_declaration : 1
 <1><cff>: Abbrev Number: 12 (DW_TAG_variable)
    <d00>   DW_AT_name        : (indirect string, offset: 0x8a6): seccomp_filter_flags
    <d04>   DW_AT_decl_file   : 18
    <d05>   DW_AT_decl_line   : 441
    <d07>   DW_AT_decl_column : 26
    <d08>   DW_AT_type        : <0xb38>
    <d0c>   DW_AT_external    : 1
    <d0d>   DW_AT_declaration : 1
 <1><d0e>: Abbrev Number: 12 (DW_TAG_variable)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x2d7): seccomp_ret_action
    <d13>   DW_AT_decl_file   : 18
    <d14>   DW_AT_decl_line   : 442
    <d16>   DW_AT_decl_column : 26
    <d17>   DW_AT_type        : <0xb38>
    <d1b>   DW_AT_external    : 1
    <d1c>   DW_AT_declaration : 1
 <1><d1d>: Abbrev Number: 12 (DW_TAG_variable)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x456): setns_types
    <d22>   DW_AT_decl_file   : 18
    <d23>   DW_AT_decl_line   : 443
    <d25>   DW_AT_decl_column : 26
    <d26>   DW_AT_type        : <0xb38>
    <d2a>   DW_AT_external    : 1
    <d2b>   DW_AT_declaration : 1
 <1><d2c>: Abbrev Number: 12 (DW_TAG_variable)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xf33): sg_io_info
    <d31>   DW_AT_decl_file   : 18
    <d32>   DW_AT_decl_line   : 444
    <d34>   DW_AT_decl_column : 26
    <d35>   DW_AT_type        : <0xb38>
    <d39>   DW_AT_external    : 1
    <d3a>   DW_AT_declaration : 1
 <1><d3b>: Abbrev Number: 12 (DW_TAG_variable)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xc7d): socketlayers
    <d40>   DW_AT_decl_file   : 18
    <d41>   DW_AT_decl_line   : 445
    <d43>   DW_AT_decl_column : 26
    <d44>   DW_AT_type        : <0xb38>
    <d48>   DW_AT_external    : 1
    <d49>   DW_AT_declaration : 1
 <1><d4a>: Abbrev Number: 12 (DW_TAG_variable)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xe7f): socktypes
    <d4f>   DW_AT_decl_file   : 18
    <d50>   DW_AT_decl_line   : 446
    <d52>   DW_AT_decl_column : 26
    <d53>   DW_AT_type        : <0xb38>
    <d57>   DW_AT_external    : 1
    <d58>   DW_AT_declaration : 1
 <1><d59>: Abbrev Number: 12 (DW_TAG_variable)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xb0d): tcp_state_flags
    <d5e>   DW_AT_decl_file   : 18
    <d5f>   DW_AT_decl_line   : 447
    <d61>   DW_AT_decl_column : 26
    <d62>   DW_AT_type        : <0xb38>
    <d66>   DW_AT_external    : 1
    <d67>   DW_AT_declaration : 1
 <1><d68>: Abbrev Number: 12 (DW_TAG_variable)
    <d69>   DW_AT_name        : (indirect string, offset: 0x7ab): tcp_states
    <d6d>   DW_AT_decl_file   : 18
    <d6e>   DW_AT_decl_line   : 448
    <d70>   DW_AT_decl_column : 26
    <d71>   DW_AT_type        : <0xb38>
    <d75>   DW_AT_external    : 1
    <d76>   DW_AT_declaration : 1
 <1><d77>: Abbrev Number: 12 (DW_TAG_variable)
    <d78>   DW_AT_name        : (indirect string, offset: 0x1158): whence_codes
    <d7c>   DW_AT_decl_file   : 18
    <d7d>   DW_AT_decl_line   : 449
    <d7f>   DW_AT_decl_column : 26
    <d80>   DW_AT_type        : <0xb38>
    <d84>   DW_AT_external    : 1
    <d85>   DW_AT_declaration : 1
 <1><d86>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d87>   DW_AT_encoding    : 7	(unsigned)
    <d88>   DW_AT_byte_size   : 4
    <d89>   DW_AT_type        : <0x2b>
    <d8d>   DW_AT_decl_file   : 18
    <d8e>   DW_AT_decl_line   : 510
    <d90>   DW_AT_decl_column : 14
    <d91>   DW_AT_sibling     : <0xda8>
 <2><d95>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d96>   DW_AT_name        : (indirect string, offset: 0xa34): CFLAG_NONE
    <d9a>   DW_AT_const_value : 0
 <2><d9b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x964): CFLAG_ONLY_STATS
    <da0>   DW_AT_const_value : 1
 <2><da1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da2>   DW_AT_name        : (indirect string, offset: 0xc8a): CFLAG_BOTH
    <da6>   DW_AT_const_value : 2
 <2><da7>: Abbrev Number: 0
 <1><da8>: Abbrev Number: 28 (DW_TAG_typedef)
    <da9>   DW_AT_name        : (indirect string, offset: 0x1233): cflag_t
    <dad>   DW_AT_decl_file   : 18
    <dae>   DW_AT_decl_line   : 514
    <db0>   DW_AT_decl_column : 3
    <db1>   DW_AT_type        : <0xd86>
 <1><db5>: Abbrev Number: 12 (DW_TAG_variable)
    <db6>   DW_AT_name        : (indirect string, offset: 0xdd2): cflag
    <dba>   DW_AT_decl_file   : 18
    <dbb>   DW_AT_decl_line   : 515
    <dbd>   DW_AT_decl_column : 16
    <dbe>   DW_AT_type        : <0xda8>
    <dc2>   DW_AT_external    : 1
    <dc3>   DW_AT_declaration : 1
 <1><dc4>: Abbrev Number: 12 (DW_TAG_variable)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x18d): Tflag
    <dc9>   DW_AT_decl_file   : 18
    <dca>   DW_AT_decl_line   : 516
    <dcc>   DW_AT_decl_column : 13
    <dcd>   DW_AT_type        : <0x51e>
    <dd1>   DW_AT_external    : 1
    <dd2>   DW_AT_declaration : 1
 <1><dd3>: Abbrev Number: 12 (DW_TAG_variable)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x81a): Tflag_scale
    <dd8>   DW_AT_decl_file   : 18
    <dd9>   DW_AT_decl_line   : 517
    <ddb>   DW_AT_decl_column : 12
    <ddc>   DW_AT_type        : <0x64>
    <de0>   DW_AT_external    : 1
    <de1>   DW_AT_declaration : 1
 <1><de2>: Abbrev Number: 12 (DW_TAG_variable)
    <de3>   DW_AT_name        : (indirect string, offset: 0x8bb): Tflag_width
    <de7>   DW_AT_decl_file   : 18
    <de8>   DW_AT_decl_line   : 518
    <dea>   DW_AT_decl_column : 12
    <deb>   DW_AT_type        : <0x64>
    <def>   DW_AT_external    : 1
    <df0>   DW_AT_declaration : 1
 <1><df1>: Abbrev Number: 12 (DW_TAG_variable)
    <df2>   DW_AT_name        : (indirect string, offset: 0xf25): iflag
    <df6>   DW_AT_decl_file   : 18
    <df7>   DW_AT_decl_line   : 519
    <df9>   DW_AT_decl_column : 13
    <dfa>   DW_AT_type        : <0x51e>
    <dfe>   DW_AT_external    : 1
    <dff>   DW_AT_declaration : 1
 <1><e00>: Abbrev Number: 12 (DW_TAG_variable)
    <e01>   DW_AT_name        : (indirect string, offset: 0x672): count_wallclock
    <e05>   DW_AT_decl_file   : 18
    <e06>   DW_AT_decl_line   : 520
    <e08>   DW_AT_decl_column : 13
    <e09>   DW_AT_type        : <0x51e>
    <e0d>   DW_AT_external    : 1
    <e0e>   DW_AT_declaration : 1
 <1><e0f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e10>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e14>   DW_AT_byte_size   : 4
    <e15>   DW_AT_decl_file   : 18
    <e16>   DW_AT_decl_line   : 522
    <e18>   DW_AT_decl_column : 8
    <e19>   DW_AT_sibling     : <0xe2e>
 <2><e1d>: Abbrev Number: 22 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e22>   DW_AT_decl_file   : 18
    <e23>   DW_AT_decl_line   : 523
    <e25>   DW_AT_decl_column : 14
    <e26>   DW_AT_type        : <0x1d2>
    <e2a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e2d>: Abbrev Number: 0
 <1><e2e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x7b6): path_set
    <e33>   DW_AT_byte_size   : 12
    <e34>   DW_AT_decl_file   : 18
    <e35>   DW_AT_decl_line   : 527
    <e37>   DW_AT_decl_column : 15
    <e38>   DW_AT_sibling     : <0xe6d>
 <2><e3c>: Abbrev Number: 22 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x744): paths_selected
    <e41>   DW_AT_decl_file   : 18
    <e42>   DW_AT_decl_line   : 528
    <e44>   DW_AT_decl_column : 24
    <e45>   DW_AT_type        : <0xe6d>
    <e49>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e4c>: Abbrev Number: 22 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x114b): num_selected
    <e51>   DW_AT_decl_file   : 18
    <e52>   DW_AT_decl_line   : 529
    <e54>   DW_AT_decl_column : 9
    <e55>   DW_AT_type        : <0x122>
    <e59>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e5c>: Abbrev Number: 22 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0xc11): size
    <e61>   DW_AT_decl_file   : 18
    <e62>   DW_AT_decl_line   : 530
    <e64>   DW_AT_decl_column : 9
    <e65>   DW_AT_type        : <0x122>
    <e69>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e6c>: Abbrev Number: 0
 <1><e6d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6e>   DW_AT_byte_size   : 4
    <e6f>   DW_AT_type        : <0xe0f>
 <1><e73>: Abbrev Number: 12 (DW_TAG_variable)
    <e74>   DW_AT_name        : (indirect string, offset: 0x11ab): global_path_set
    <e78>   DW_AT_decl_file   : 18
    <e79>   DW_AT_decl_line   : 531
    <e7b>   DW_AT_decl_column : 3
    <e7c>   DW_AT_type        : <0xe2e>
    <e80>   DW_AT_external    : 1
    <e81>   DW_AT_declaration : 1
 <1><e82>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e83>   DW_AT_name        : (indirect string, offset: 0x108e): xflag_opts
    <e87>   DW_AT_encoding    : 7	(unsigned)
    <e88>   DW_AT_byte_size   : 4
    <e89>   DW_AT_type        : <0x2b>
    <e8d>   DW_AT_decl_file   : 18
    <e8e>   DW_AT_decl_line   : 533
    <e90>   DW_AT_decl_column : 6
    <e91>   DW_AT_sibling     : <0xeb4>
 <2><e95>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e96>   DW_AT_name        : (indirect string, offset: 0xaae): HEXSTR_NONE
    <e9a>   DW_AT_const_value : 0
 <2><e9b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x10d4): HEXSTR_NON_ASCII
    <ea0>   DW_AT_const_value : 1
 <2><ea1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x9a2): HEXSTR_ALL
    <ea6>   DW_AT_const_value : 2
 <2><ea7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea8>   DW_AT_name        : (indirect string, offset: 0x6b2): HEXSTR_NON_ASCII_CHARS
    <eac>   DW_AT_const_value : 3
 <2><ead>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eae>   DW_AT_name        : (indirect string, offset: 0x1165): NUM_HEXSTR_OPTS
    <eb2>   DW_AT_const_value : 4
 <2><eb3>: Abbrev Number: 0
 <1><eb4>: Abbrev Number: 12 (DW_TAG_variable)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xeff): xflag
    <eb9>   DW_AT_decl_file   : 18
    <eba>   DW_AT_decl_line   : 546
    <ebc>   DW_AT_decl_column : 17
    <ebd>   DW_AT_type        : <0x2b>
    <ec1>   DW_AT_external    : 1
    <ec2>   DW_AT_declaration : 1
 <1><ec3>: Abbrev Number: 12 (DW_TAG_variable)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xd8d): followfork
    <ec8>   DW_AT_decl_file   : 18
    <ec9>   DW_AT_decl_line   : 547
    <ecb>   DW_AT_decl_column : 13
    <ecc>   DW_AT_type        : <0x51e>
    <ed0>   DW_AT_external    : 1
    <ed1>   DW_AT_declaration : 1
 <1><ed2>: Abbrev Number: 12 (DW_TAG_variable)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x334): output_separately
    <ed7>   DW_AT_decl_file   : 18
    <ed8>   DW_AT_decl_line   : 548
    <eda>   DW_AT_decl_column : 13
    <edb>   DW_AT_type        : <0x51e>
    <edf>   DW_AT_external    : 1
    <ee0>   DW_AT_declaration : 1
 <1><ee1>: Abbrev Number: 12 (DW_TAG_variable)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x229): stack_trace_enabled
    <ee6>   DW_AT_decl_file   : 18
    <ee7>   DW_AT_decl_line   : 551
    <ee9>   DW_AT_decl_column : 13
    <eea>   DW_AT_type        : <0x51e>
    <eee>   DW_AT_external    : 1
    <eef>   DW_AT_declaration : 1
 <1><ef0>: Abbrev Number: 12 (DW_TAG_variable)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x6a0): ptrace_setoptions
    <ef5>   DW_AT_decl_file   : 18
    <ef6>   DW_AT_decl_line   : 555
    <ef8>   DW_AT_decl_column : 17
    <ef9>   DW_AT_type        : <0x2b>
    <efd>   DW_AT_external    : 1
    <efe>   DW_AT_declaration : 1
 <1><eff>: Abbrev Number: 12 (DW_TAG_variable)
    <f00>   DW_AT_name        : (indirect string, offset: 0xaa3): max_strlen
    <f04>   DW_AT_decl_file   : 18
    <f05>   DW_AT_decl_line   : 556
    <f07>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0x2b>
    <f0c>   DW_AT_external    : 1
    <f0d>   DW_AT_declaration : 1
 <1><f0e>: Abbrev Number: 12 (DW_TAG_variable)
    <f0f>   DW_AT_name        : (indirect string, offset: 0xae7): os_release
    <f13>   DW_AT_decl_file   : 18
    <f14>   DW_AT_decl_line   : 557
    <f16>   DW_AT_decl_column : 17
    <f17>   DW_AT_type        : <0x2b>
    <f1b>   DW_AT_external    : 1
    <f1c>   DW_AT_declaration : 1
 <1><f1d>: Abbrev Number: 12 (DW_TAG_variable)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x753): xlat_verbosity
    <f22>   DW_AT_decl_file   : 18
    <f23>   DW_AT_decl_line   : 919
    <f25>   DW_AT_decl_column : 24
    <f26>   DW_AT_type        : <0xa5b>
    <f2a>   DW_AT_external    : 1
    <f2b>   DW_AT_declaration : 1
 <1><f2c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x655): xlat_style_private_flag_bits
    <f31>   DW_AT_encoding    : 7	(unsigned)
    <f32>   DW_AT_byte_size   : 4
    <f33>   DW_AT_type        : <0x2b>
    <f37>   DW_AT_decl_file   : 18
    <f38>   DW_AT_decl_line   : 939
    <f3a>   DW_AT_decl_column : 6
    <f3b>   DW_AT_sibling     : <0xf58>
 <2><f3f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f40>   DW_AT_name        : (indirect string, offset: 0x2a4): PAF_PRINT_INDICES_BIT
    <f44>   DW_AT_const_value : 5
 <2><f45>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f46>   DW_AT_name        : (indirect string, offset: 0xbb6): PAF_ARRAY_TRUNCATED_BIT
    <f4a>   DW_AT_const_value : 6
 <2><f4b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x416): PXF_DEFAULT_STR_BIT
    <f50>   DW_AT_const_value : 7
 <2><f51>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f52>   DW_AT_name        : (indirect string, offset: 0xd6f): SPFF_AUXSTR_MODE_BIT
    <f56>   DW_AT_const_value : 8
 <2><f57>: Abbrev Number: 0
 <1><f58>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f59>   DW_AT_name        : (indirect string, offset: 0xe1e): find_xlat_flag_bits
    <f5d>   DW_AT_encoding    : 7	(unsigned)
    <f5e>   DW_AT_byte_size   : 4
    <f5f>   DW_AT_type        : <0x2b>
    <f63>   DW_AT_decl_file   : 18
    <f64>   DW_AT_decl_line   : 1443
    <f66>   DW_AT_decl_column : 6
    <f67>   DW_AT_sibling     : <0xf72>
 <2><f6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x9df): FXL_CASE_SENSITIVE_BIT
    <f70>   DW_AT_const_value : 0
 <2><f71>: Abbrev Number: 0
 <1><f72>: Abbrev Number: 12 (DW_TAG_variable)
    <f73>   DW_AT_name        : (indirect string, offset: 0xa7f): printing_tcp
    <f77>   DW_AT_decl_file   : 18
    <f78>   DW_AT_decl_line   : 1689
    <f7a>   DW_AT_decl_column : 20
    <f7b>   DW_AT_type        : <0x5fa>
    <f7f>   DW_AT_external    : 1
    <f80>   DW_AT_declaration : 1
 <1><f81>: Abbrev Number: 12 (DW_TAG_variable)
    <f82>   DW_AT_name        : (indirect string, offset: 0x609): errnoent
    <f86>   DW_AT_decl_file   : 18
    <f87>   DW_AT_decl_line   : 1887
    <f89>   DW_AT_decl_column : 26
    <f8a>   DW_AT_type        : <0x452>
    <f8e>   DW_AT_external    : 1
    <f8f>   DW_AT_declaration : 1
 <1><f90>: Abbrev Number: 12 (DW_TAG_variable)
    <f91>   DW_AT_name        : (indirect string, offset: 0x8c7): signalent
    <f95>   DW_AT_decl_file   : 18
    <f96>   DW_AT_decl_line   : 1888
    <f98>   DW_AT_decl_column : 26
    <f99>   DW_AT_type        : <0x452>
    <f9d>   DW_AT_external    : 1
    <f9e>   DW_AT_declaration : 1
 <1><f9f>: Abbrev Number: 12 (DW_TAG_variable)
    <fa0>   DW_AT_name        : (indirect string, offset: 0xf7c): nerrnos
    <fa4>   DW_AT_decl_file   : 18
    <fa5>   DW_AT_decl_line   : 1889
    <fa7>   DW_AT_decl_column : 27
    <fa8>   DW_AT_type        : <0x32>
    <fac>   DW_AT_external    : 1
    <fad>   DW_AT_declaration : 1
 <1><fae>: Abbrev Number: 12 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0x1134): nsignals
    <fb3>   DW_AT_decl_file   : 18
    <fb4>   DW_AT_decl_line   : 1890
    <fb6>   DW_AT_decl_column : 27
    <fb7>   DW_AT_type        : <0x32>
    <fbb>   DW_AT_external    : 1
    <fbc>   DW_AT_declaration : 1
 <1><fbd>: Abbrev Number: 10 (DW_TAG_array_type)
    <fbe>   DW_AT_type        : <0x87a>
    <fc2>   DW_AT_sibling     : <0xfc8>
 <2><fc6>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc7>: Abbrev Number: 0
 <1><fc8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc9>   DW_AT_type        : <0xfbd>
 <1><fcd>: Abbrev Number: 12 (DW_TAG_variable)
    <fce>   DW_AT_name        : (indirect string, offset: 0xde9): sysent0
    <fd2>   DW_AT_decl_file   : 18
    <fd3>   DW_AT_decl_line   : 1892
    <fd5>   DW_AT_decl_column : 28
    <fd6>   DW_AT_type        : <0xfc8>
    <fda>   DW_AT_external    : 1
    <fdb>   DW_AT_declaration : 1
 <1><fdc>: Abbrev Number: 10 (DW_TAG_array_type)
    <fdd>   DW_AT_type        : <0x8e1>
    <fe1>   DW_AT_sibling     : <0xfe7>
 <2><fe5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fe6>: Abbrev Number: 0
 <1><fe7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe8>   DW_AT_type        : <0xfdc>
 <1><fec>: Abbrev Number: 12 (DW_TAG_variable)
    <fed>   DW_AT_name        : (indirect string, offset: 0x11a1): ioctlent0
    <ff1>   DW_AT_decl_file   : 18
    <ff2>   DW_AT_decl_line   : 1893
    <ff4>   DW_AT_decl_column : 30
    <ff5>   DW_AT_type        : <0xfe7>
    <ff9>   DW_AT_external    : 1
    <ffa>   DW_AT_declaration : 1
 <1><ffb>: Abbrev Number: 12 (DW_TAG_variable)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x1099): personality_names
    <1000>   DW_AT_decl_file   : 18
    <1001>   DW_AT_decl_line   : 1895
    <1003>   DW_AT_decl_column : 26
    <1004>   DW_AT_type        : <0x452>
    <1008>   DW_AT_external    : 1
    <1009>   DW_AT_declaration : 1
 <1><100a>: Abbrev Number: 12 (DW_TAG_variable)
    <100b>   DW_AT_name        : (indirect string, offset: 0x8e7): sysent
    <100f>   DW_AT_decl_file   : 18
    <1010>   DW_AT_decl_line   : 1898
    <1012>   DW_AT_decl_column : 29
    <1013>   DW_AT_type        : <0x9c6>
    <1017>   DW_AT_external    : 1
    <1018>   DW_AT_declaration : 1
 <1><1019>: Abbrev Number: 12 (DW_TAG_variable)
    <101a>   DW_AT_name        : (indirect string, offset: 0xd84): ioctlent
    <101e>   DW_AT_decl_file   : 18
    <101f>   DW_AT_decl_line   : 1899
    <1021>   DW_AT_decl_column : 31
    <1022>   DW_AT_type        : <0x1028>
    <1026>   DW_AT_external    : 1
    <1027>   DW_AT_declaration : 1
 <1><1028>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1029>   DW_AT_byte_size   : 4
    <102a>   DW_AT_type        : <0x8e1>
 <1><102e>: Abbrev Number: 12 (DW_TAG_variable)
    <102f>   DW_AT_name        : (indirect string, offset: 0x8d1): nsyscalls
    <1033>   DW_AT_decl_file   : 18
    <1034>   DW_AT_decl_line   : 1905
    <1036>   DW_AT_decl_column : 17
    <1037>   DW_AT_type        : <0x2b>
    <103b>   DW_AT_external    : 1
    <103c>   DW_AT_declaration : 1
 <1><103d>: Abbrev Number: 12 (DW_TAG_variable)
    <103e>   DW_AT_name        : (indirect string, offset: 0xf96): nioctlents
    <1042>   DW_AT_decl_file   : 18
    <1043>   DW_AT_decl_line   : 1906
    <1045>   DW_AT_decl_column : 17
    <1046>   DW_AT_type        : <0x2b>
    <104a>   DW_AT_external    : 1
    <104b>   DW_AT_declaration : 1
 <1><104c>: Abbrev Number: 10 (DW_TAG_array_type)
    <104d>   DW_AT_type        : <0x32>
    <1051>   DW_AT_sibling     : <0x105c>
 <2><1055>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1056>   DW_AT_type        : <0x2b>
    <105a>   DW_AT_upper_bound : 2
 <2><105b>: Abbrev Number: 0
 <1><105c>: Abbrev Number: 3 (DW_TAG_const_type)
    <105d>   DW_AT_type        : <0x104c>
 <1><1061>: Abbrev Number: 12 (DW_TAG_variable)
    <1062>   DW_AT_name        : (indirect string, offset: 0xff6): nsyscall_vec
    <1066>   DW_AT_decl_file   : 18
    <1067>   DW_AT_decl_line   : 1908
    <1069>   DW_AT_decl_column : 27
    <106a>   DW_AT_type        : <0x105c>
    <106e>   DW_AT_external    : 1
    <106f>   DW_AT_declaration : 1
 <1><1070>: Abbrev Number: 10 (DW_TAG_array_type)
    <1071>   DW_AT_type        : <0x9cc>
    <1075>   DW_AT_sibling     : <0x1080>
 <2><1079>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <107a>   DW_AT_type        : <0x2b>
    <107e>   DW_AT_upper_bound : 2
 <2><107f>: Abbrev Number: 0
 <1><1080>: Abbrev Number: 3 (DW_TAG_const_type)
    <1081>   DW_AT_type        : <0x1070>
 <1><1085>: Abbrev Number: 12 (DW_TAG_variable)
    <1086>   DW_AT_name        : (indirect string, offset: 0x807): sysent_vec
    <108a>   DW_AT_decl_file   : 18
    <108b>   DW_AT_decl_line   : 1909
    <108d>   DW_AT_decl_column : 35
    <108e>   DW_AT_type        : <0x1080>
    <1092>   DW_AT_external    : 1
    <1093>   DW_AT_declaration : 1
 <1><1094>: Abbrev Number: 12 (DW_TAG_variable)
    <1095>   DW_AT_name        : (indirect string, offset: 0x3a1): inject_vec
    <1099>   DW_AT_decl_file   : 18
    <109a>   DW_AT_decl_line   : 1910
    <109c>   DW_AT_decl_column : 28
    <109d>   DW_AT_type        : <0x9d1>
    <10a1>   DW_AT_external    : 1
    <10a2>   DW_AT_declaration : 1
 <1><10a3>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a4>   DW_AT_name        : (indirect string, offset: 0xe72): audit_arch_t
    <10a8>   DW_AT_byte_size   : 8
    <10a9>   DW_AT_decl_file   : 18
    <10aa>   DW_AT_decl_line   : 1912
    <10ac>   DW_AT_decl_column : 8
    <10ad>   DW_AT_sibling     : <0x10d2>
 <2><10b1>: Abbrev Number: 22 (DW_TAG_member)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x647): arch
    <10b6>   DW_AT_decl_file   : 18
    <10b7>   DW_AT_decl_line   : 1913
    <10b9>   DW_AT_decl_column : 15
    <10ba>   DW_AT_type        : <0x2b>
    <10be>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c1>: Abbrev Number: 22 (DW_TAG_member)
    <10c2>   DW_AT_name        : (indirect string, offset: 0xa65): flag
    <10c6>   DW_AT_decl_file   : 18
    <10c7>   DW_AT_decl_line   : 1914
    <10c9>   DW_AT_decl_column : 15
    <10ca>   DW_AT_type        : <0x2b>
    <10ce>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d1>: Abbrev Number: 0
 <1><10d2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d3>   DW_AT_type        : <0x10a3>
 <1><10d7>: Abbrev Number: 10 (DW_TAG_array_type)
    <10d8>   DW_AT_type        : <0x10d2>
    <10dc>   DW_AT_sibling     : <0x10e7>
 <2><10e0>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10e1>   DW_AT_type        : <0x2b>
    <10e5>   DW_AT_upper_bound : 2
 <2><10e6>: Abbrev Number: 0
 <1><10e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e8>   DW_AT_type        : <0x10d7>
 <1><10ec>: Abbrev Number: 12 (DW_TAG_variable)
    <10ed>   DW_AT_name        : (indirect string, offset: 0x9d0): audit_arch_vec
    <10f1>   DW_AT_decl_file   : 18
    <10f2>   DW_AT_decl_line   : 1917
    <10f4>   DW_AT_decl_column : 34
    <10f5>   DW_AT_type        : <0x10e7>
    <10f9>   DW_AT_external    : 1
    <10fa>   DW_AT_declaration : 1
 <1><10fb>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10fc>   DW_AT_byte_size   : 180
    <10fd>   DW_AT_decl_file   : 20
    <10fe>   DW_AT_decl_line   : 2
    <10ff>   DW_AT_decl_column : 9
    <1100>   DW_AT_sibling     : <0x13b5>
 <2><1104>: Abbrev Number: 9 (DW_TAG_member)
    <1105>   DW_AT_name        : (indirect string, offset: 0x1da): block_ioctl
    <1109>   DW_AT_decl_file   : 20
    <110a>   DW_AT_decl_line   : 3
    <110b>   DW_AT_decl_column : 8
    <110c>   DW_AT_type        : <0x13cf>
    <1110>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1113>: Abbrev Number: 9 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0xb55): btrfs_ioctl
    <1118>   DW_AT_decl_file   : 20
    <1119>   DW_AT_decl_line   : 6
    <111a>   DW_AT_decl_column : 8
    <111b>   DW_AT_type        : <0x13cf>
    <111f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1122>: Abbrev Number: 9 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0x78c): evdev_write_ioctl_mpers
    <1127>   DW_AT_decl_file   : 20
    <1128>   DW_AT_decl_line   : 9
    <1129>   DW_AT_decl_column : 8
    <112a>   DW_AT_type        : <0x13cf>
    <112e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1131>: Abbrev Number: 9 (DW_TAG_member)
    <1132>   DW_AT_name        : (indirect string, offset: 0x762): get_sock_fprog_size
    <1136>   DW_AT_decl_file   : 20
    <1137>   DW_AT_decl_line   : 12
    <1138>   DW_AT_decl_column : 17
    <1139>   DW_AT_type        : <0x13db>
    <113d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1140>: Abbrev Number: 9 (DW_TAG_member)
    <1141>   DW_AT_name        : (indirect string, offset: 0x1a9): fetch_bpf_fprog
    <1145>   DW_AT_decl_file   : 20
    <1146>   DW_AT_decl_line   : 15
    <1147>   DW_AT_decl_column : 10
    <1148>   DW_AT_type        : <0x13fb>
    <114c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><114f>: Abbrev Number: 9 (DW_TAG_member)
    <1150>   DW_AT_name        : (indirect string, offset: 0x9bd): fetch_struct_flock
    <1154>   DW_AT_decl_file   : 20
