Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1699 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4c6): GNU C17 9.4.0 -mx32 -mtune=generic -march=x86-64 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1bd): mpers-mx32/struct_sigset_addr_size.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa01): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x39b): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfb2): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x94a): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x33e): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x24e): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdaa): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x46a): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x850): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe94): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x880): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x74f): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb3b): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb71): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x7c>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xcbd): __off64_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 153
    <b5>   DW_AT_decl_column : 27
    <b6>   DW_AT_type        : <0x7c>
 <1><ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <bb>   DW_AT_name        : (indirect string, offset: 0xc32): __time_t
    <bf>   DW_AT_decl_file   : 1
    <c0>   DW_AT_decl_line   : 160
    <c1>   DW_AT_decl_column : 26
    <c2>   DW_AT_type        : <0x7c>
 <1><c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc6>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x3e7): __syscall_slong_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 196
    <d4>   DW_AT_decl_column : 33
    <d5>   DW_AT_type        : <0x7c>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0>   DW_AT_byte_size   : 1
    <e1>   DW_AT_encoding    : 6	(signed char)
    <e2>   DW_AT_name        : (indirect string, offset: 0x433): char
 <1><e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <e7>   DW_AT_type        : <0xdf>
 <1><eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x34a): uint8_t
    <f0>   DW_AT_decl_file   : 2
    <f1>   DW_AT_decl_line   : 24
    <f2>   DW_AT_decl_column : 19
    <f3>   DW_AT_type        : <0x45>
 <1><f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xb5c): uint16_t
    <fc>   DW_AT_decl_file   : 2
    <fd>   DW_AT_decl_line   : 25
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x58>
 <1><103>: Abbrev Number: 4 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xf3c): uint32_t
    <108>   DW_AT_decl_file   : 2
    <109>   DW_AT_decl_line   : 26
    <10a>   DW_AT_decl_column : 20
    <10b>   DW_AT_type        : <0x70>
 <1><10f>: Abbrev Number: 4 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xdba): uint64_t
    <114>   DW_AT_decl_file   : 2
    <115>   DW_AT_decl_line   : 27
    <116>   DW_AT_decl_column : 20
    <117>   DW_AT_type        : <0x8f>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_encoding    : 5	(signed)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2ba): long int
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe47): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x1088): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x124): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xae4): timespec
    <179>   DW_AT_byte_size   : 16
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x109d): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xba>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xdeb): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xcd>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 16
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xaa6): long double
 <1><1a7>: Abbrev Number: 13 (DW_TAG_variable)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x271): __environ
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 543
    <1af>   DW_AT_decl_column : 15
    <1b0>   DW_AT_type        : <0x1b6>
    <1b4>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1b7>   DW_AT_byte_size   : 4
    <1b8>   DW_AT_type        : <0xd9>
 <1><1bc>: Abbrev Number: 13 (DW_TAG_variable)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x393): environ
    <1c1>   DW_AT_decl_file   : 7
    <1c2>   DW_AT_decl_line   : 545
    <1c4>   DW_AT_decl_column : 15
    <1c5>   DW_AT_type        : <0x1b6>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 14 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xf9c): optarg
    <1d0>   DW_AT_decl_file   : 8
    <1d1>   DW_AT_decl_line   : 36
    <1d2>   DW_AT_decl_column : 14
    <1d3>   DW_AT_type        : <0xd9>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 14 (DW_TAG_variable)
    <1da>   DW_AT_name        : (indirect string, offset: 0x722): optind
    <1de>   DW_AT_decl_file   : 8
    <1df>   DW_AT_decl_line   : 50
    <1e0>   DW_AT_decl_column : 12
    <1e1>   DW_AT_type        : <0x64>
    <1e5>   DW_AT_external    : 1
    <1e6>   DW_AT_declaration : 1
 <1><1e7>: Abbrev Number: 14 (DW_TAG_variable)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xc21): opterr
    <1ec>   DW_AT_decl_file   : 8
    <1ed>   DW_AT_decl_line   : 55
    <1ee>   DW_AT_decl_column : 12
    <1ef>   DW_AT_type        : <0x64>
    <1f3>   DW_AT_external    : 1
    <1f4>   DW_AT_declaration : 1
 <1><1f5>: Abbrev Number: 14 (DW_TAG_variable)
    <1f6>   DW_AT_name        : (indirect string, offset: 0xb21): optopt
    <1fa>   DW_AT_decl_file   : 8
    <1fb>   DW_AT_decl_line   : 59
    <1fc>   DW_AT_decl_column : 12
    <1fd>   DW_AT_type        : <0x64>
    <201>   DW_AT_external    : 1
    <202>   DW_AT_declaration : 1
 <1><203>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <204>   DW_AT_byte_size   : 4
    <205>   DW_AT_type        : <0xe6>
 <1><209>: Abbrev Number: 3 (DW_TAG_const_type)
    <20a>   DW_AT_type        : <0x203>
 <1><20e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <20f>   DW_AT_byte_size   : 4
    <210>   DW_AT_type        : <0x214>
 <1><214>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><215>: Abbrev Number: 12 (DW_TAG_structure_type)
    <216>   DW_AT_name        : (indirect string, offset: 0x352): _IO_FILE
    <21a>   DW_AT_byte_size   : 152
    <21b>   DW_AT_decl_file   : 9
    <21c>   DW_AT_decl_line   : 49
    <21d>   DW_AT_decl_column : 8
    <21e>   DW_AT_sibling     : <0x3d6>
 <2><222>: Abbrev Number: 9 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x9dd): _flags
    <227>   DW_AT_decl_file   : 9
    <228>   DW_AT_decl_line   : 51
    <229>   DW_AT_decl_column : 7
    <22a>   DW_AT_type        : <0x64>
    <22e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><231>: Abbrev Number: 9 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x4b9): _IO_read_ptr
    <236>   DW_AT_decl_file   : 9
    <237>   DW_AT_decl_line   : 54
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0xd9>
    <23d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><240>: Abbrev Number: 9 (DW_TAG_member)
    <241>   DW_AT_name        : (indirect string, offset: 0xee9): _IO_read_end
    <245>   DW_AT_decl_file   : 9
    <246>   DW_AT_decl_line   : 55
    <247>   DW_AT_decl_column : 9
    <248>   DW_AT_type        : <0xd9>
    <24c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><24f>: Abbrev Number: 9 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x78b): _IO_read_base
    <254>   DW_AT_decl_file   : 9
    <255>   DW_AT_decl_line   : 56
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0xd9>
    <25b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><25e>: Abbrev Number: 9 (DW_TAG_member)
    <25f>   DW_AT_name        : (indirect string, offset: 0x9be): _IO_write_base
    <263>   DW_AT_decl_file   : 9
    <264>   DW_AT_decl_line   : 57
    <265>   DW_AT_decl_column : 9
    <266>   DW_AT_type        : <0xd9>
    <26a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><26d>: Abbrev Number: 9 (DW_TAG_member)
    <26e>   DW_AT_name        : (indirect string, offset: 0xfeb): _IO_write_ptr
    <272>   DW_AT_decl_file   : 9
    <273>   DW_AT_decl_line   : 58
    <274>   DW_AT_decl_column : 9
    <275>   DW_AT_type        : <0xd9>
    <279>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><27c>: Abbrev Number: 9 (DW_TAG_member)
    <27d>   DW_AT_name        : (indirect string, offset: 0x8c2): _IO_write_end
    <281>   DW_AT_decl_file   : 9
    <282>   DW_AT_decl_line   : 59
    <283>   DW_AT_decl_column : 9
    <284>   DW_AT_type        : <0xd9>
    <288>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><28b>: Abbrev Number: 9 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x933): _IO_buf_base
    <290>   DW_AT_decl_file   : 9
    <291>   DW_AT_decl_line   : 60
    <292>   DW_AT_decl_column : 9
    <293>   DW_AT_type        : <0xd9>
    <297>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><29a>: Abbrev Number: 9 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0xd55): _IO_buf_end
    <29f>   DW_AT_decl_file   : 9
    <2a0>   DW_AT_decl_line   : 61
    <2a1>   DW_AT_decl_column : 9
    <2a2>   DW_AT_type        : <0xd9>
    <2a6>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2a9>: Abbrev Number: 9 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x1af): _IO_save_base
    <2ae>   DW_AT_decl_file   : 9
    <2af>   DW_AT_decl_line   : 64
    <2b0>   DW_AT_decl_column : 9
    <2b1>   DW_AT_type        : <0xd9>
    <2b5>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2b8>: Abbrev Number: 9 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0xc84): _IO_backup_base
    <2bd>   DW_AT_decl_file   : 9
    <2be>   DW_AT_decl_line   : 65
    <2bf>   DW_AT_decl_column : 9
    <2c0>   DW_AT_type        : <0xd9>
    <2c4>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2c7>: Abbrev Number: 9 (DW_TAG_member)
    <2c8>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2cc>   DW_AT_decl_file   : 9
    <2cd>   DW_AT_decl_line   : 66
    <2ce>   DW_AT_decl_column : 9
    <2cf>   DW_AT_type        : <0xd9>
    <2d3>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2d6>: Abbrev Number: 9 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x5e7): _markers
    <2db>   DW_AT_decl_file   : 9
    <2dc>   DW_AT_decl_line   : 68
    <2dd>   DW_AT_decl_column : 22
    <2de>   DW_AT_type        : <0x3f0>
    <2e2>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2e5>: Abbrev Number: 9 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2ea>   DW_AT_decl_file   : 9
    <2eb>   DW_AT_decl_line   : 70
    <2ec>   DW_AT_decl_column : 20
    <2ed>   DW_AT_type        : <0x3f6>
    <2f1>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2f4>: Abbrev Number: 9 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0xf62): _fileno
    <2f9>   DW_AT_decl_file   : 9
    <2fa>   DW_AT_decl_line   : 72
    <2fb>   DW_AT_decl_column : 7
    <2fc>   DW_AT_type        : <0x64>
    <300>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><303>: Abbrev Number: 9 (DW_TAG_member)
    <304>   DW_AT_name        : (indirect string, offset: 0x777): _flags2
    <308>   DW_AT_decl_file   : 9
    <309>   DW_AT_decl_line   : 73
    <30a>   DW_AT_decl_column : 7
    <30b>   DW_AT_type        : <0x64>
    <30f>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><312>: Abbrev Number: 9 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0x7f0): _old_offset
    <317>   DW_AT_decl_file   : 9
    <318>   DW_AT_decl_line   : 74
    <319>   DW_AT_decl_column : 11
    <31a>   DW_AT_type        : <0xa2>
    <31e>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><321>: Abbrev Number: 9 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x239): _cur_column
    <326>   DW_AT_decl_file   : 9
    <327>   DW_AT_decl_line   : 77
    <328>   DW_AT_decl_column : 18
    <329>   DW_AT_type        : <0x24>
    <32d>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><330>: Abbrev Number: 9 (DW_TAG_member)
    <331>   DW_AT_name        : (indirect string, offset: 0xe11): _vtable_offset
    <335>   DW_AT_decl_file   : 9
    <336>   DW_AT_decl_line   : 78
    <337>   DW_AT_decl_column : 15
    <338>   DW_AT_type        : <0x3e>
    <33c>   DW_AT_data_member_location: 2 byte block: 23 4a 	(DW_OP_plus_uconst: 74)
 <2><33f>: Abbrev Number: 9 (DW_TAG_member)
    <340>   DW_AT_name        : (indirect string, offset: 0xc94): _shortbuf
    <344>   DW_AT_decl_file   : 9
    <345>   DW_AT_decl_line   : 79
    <346>   DW_AT_decl_column : 8
    <347>   DW_AT_type        : <0x3fc>
    <34b>   DW_AT_data_member_location: 2 byte block: 23 4b 	(DW_OP_plus_uconst: 75)
 <2><34e>: Abbrev Number: 9 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x15f): _lock
    <353>   DW_AT_decl_file   : 9
    <354>   DW_AT_decl_line   : 81
    <355>   DW_AT_decl_column : 15
    <356>   DW_AT_type        : <0x40c>
    <35a>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><35d>: Abbrev Number: 9 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0x6ba): _offset
    <362>   DW_AT_decl_file   : 9
    <363>   DW_AT_decl_line   : 89
    <364>   DW_AT_decl_column : 13
    <365>   DW_AT_type        : <0xae>
    <369>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><36c>: Abbrev Number: 9 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xa33): _codecvt
    <371>   DW_AT_decl_file   : 9
    <372>   DW_AT_decl_line   : 91
    <373>   DW_AT_decl_column : 23
    <374>   DW_AT_type        : <0x418>
    <378>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><37b>: Abbrev Number: 9 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0xf80): _wide_data
    <380>   DW_AT_decl_file   : 9
    <381>   DW_AT_decl_line   : 92
    <382>   DW_AT_decl_column : 25
    <383>   DW_AT_type        : <0x424>
    <387>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><38a>: Abbrev Number: 9 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x3b7): _freeres_list
    <38f>   DW_AT_decl_file   : 9
    <390>   DW_AT_decl_line   : 93
    <391>   DW_AT_decl_column : 20
    <392>   DW_AT_type        : <0x3f6>
    <396>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><399>: Abbrev Number: 9 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0xbf7): _freeres_buf
    <39e>   DW_AT_decl_file   : 9
    <39f>   DW_AT_decl_line   : 94
    <3a0>   DW_AT_decl_column : 9
    <3a1>   DW_AT_type        : <0xc6>
    <3a5>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3a8>: Abbrev Number: 9 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x990): __pad5
    <3ad>   DW_AT_decl_file   : 9
    <3ae>   DW_AT_decl_line   : 95
    <3af>   DW_AT_decl_column : 10
    <3b0>   DW_AT_type        : <0x122>
    <3b4>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3b7>: Abbrev Number: 9 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x258): _mode
    <3bc>   DW_AT_decl_file   : 9
    <3bd>   DW_AT_decl_line   : 96
    <3be>   DW_AT_decl_column : 7
    <3bf>   DW_AT_type        : <0x64>
    <3c3>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3c6>: Abbrev Number: 9 (DW_TAG_member)
    <3c7>   DW_AT_name        : (indirect string, offset: 0x7a5): _unused2
    <3cb>   DW_AT_decl_file   : 9
    <3cc>   DW_AT_decl_line   : 98
    <3cd>   DW_AT_decl_column : 8
    <3ce>   DW_AT_type        : <0x42a>
    <3d2>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><3d5>: Abbrev Number: 0
 <1><3d6>: Abbrev Number: 4 (DW_TAG_typedef)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xac6): FILE
    <3db>   DW_AT_decl_file   : 10
    <3dc>   DW_AT_decl_line   : 7
    <3dd>   DW_AT_decl_column : 25
    <3de>   DW_AT_type        : <0x215>
 <1><3e2>: Abbrev Number: 16 (DW_TAG_typedef)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x45f): _IO_lock_t
    <3e7>   DW_AT_decl_file   : 9
    <3e8>   DW_AT_decl_line   : 43
    <3e9>   DW_AT_decl_column : 14
 <1><3ea>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x2fc): _IO_marker
    <3ef>   DW_AT_declaration : 1
 <1><3f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x3ea>
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x215>
 <1><3fc>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fd>   DW_AT_type        : <0xdf>
    <401>   DW_AT_sibling     : <0x40c>
 <2><405>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <406>   DW_AT_type        : <0x2b>
    <40a>   DW_AT_upper_bound : 0
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40d>   DW_AT_byte_size   : 4
    <40e>   DW_AT_type        : <0x3e2>
 <1><412>: Abbrev Number: 17 (DW_TAG_structure_type)
    <413>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <417>   DW_AT_declaration : 1
 <1><418>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <419>   DW_AT_byte_size   : 4
    <41a>   DW_AT_type        : <0x412>
 <1><41e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <41f>   DW_AT_name        : (indirect string, offset: 0x366): _IO_wide_data
    <423>   DW_AT_declaration : 1
 <1><424>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <425>   DW_AT_byte_size   : 4
    <426>   DW_AT_type        : <0x41e>
 <1><42a>: Abbrev Number: 10 (DW_TAG_array_type)
    <42b>   DW_AT_type        : <0xdf>
    <42f>   DW_AT_sibling     : <0x43a>
 <2><433>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <434>   DW_AT_type        : <0x2b>
    <438>   DW_AT_upper_bound : 39
 <2><439>: Abbrev Number: 0
 <1><43a>: Abbrev Number: 14 (DW_TAG_variable)
    <43b>   DW_AT_name        : (indirect string, offset: 0x59e): stdin
    <43f>   DW_AT_decl_file   : 11
    <440>   DW_AT_decl_line   : 137
    <441>   DW_AT_decl_column : 14
    <442>   DW_AT_type        : <0x448>
    <446>   DW_AT_external    : 1
    <447>   DW_AT_declaration : 1
 <1><448>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <449>   DW_AT_byte_size   : 4
    <44a>   DW_AT_type        : <0x3d6>
 <1><44e>: Abbrev Number: 14 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0xfc5): stdout
    <453>   DW_AT_decl_file   : 11
    <454>   DW_AT_decl_line   : 138
    <455>   DW_AT_decl_column : 14
    <456>   DW_AT_type        : <0x448>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 14 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0xda3): stderr
    <461>   DW_AT_decl_file   : 11
    <462>   DW_AT_decl_line   : 139
    <463>   DW_AT_decl_column : 14
    <464>   DW_AT_type        : <0x448>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 14 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0x245): sys_nerr
    <46f>   DW_AT_decl_file   : 12
    <470>   DW_AT_decl_line   : 26
    <471>   DW_AT_decl_column : 12
    <472>   DW_AT_type        : <0x64>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 10 (DW_TAG_array_type)
    <479>   DW_AT_type        : <0x209>
    <47d>   DW_AT_sibling     : <0x483>
 <2><481>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><482>: Abbrev Number: 0
 <1><483>: Abbrev Number: 3 (DW_TAG_const_type)
    <484>   DW_AT_type        : <0x478>
 <1><488>: Abbrev Number: 14 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x5ad): sys_errlist
    <48d>   DW_AT_decl_file   : 12
    <48e>   DW_AT_decl_line   : 27
    <48f>   DW_AT_decl_column : 26
    <490>   DW_AT_type        : <0x483>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 14 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0x25e): _sys_nerr
    <49b>   DW_AT_decl_file   : 12
    <49c>   DW_AT_decl_line   : 30
    <49d>   DW_AT_decl_column : 12
    <49e>   DW_AT_type        : <0x64>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 14 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe20): _sys_errlist
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 31
    <4ab>   DW_AT_decl_column : 26
    <4ac>   DW_AT_type        : <0x483>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 14 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x693): program_invocation_name
    <4b7>   DW_AT_decl_file   : 13
    <4b8>   DW_AT_decl_line   : 45
    <4b9>   DW_AT_decl_column : 14
    <4ba>   DW_AT_type        : <0xd9>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 14 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0xb9c): program_invocation_short_name
    <4c5>   DW_AT_decl_file   : 13
    <4c6>   DW_AT_decl_line   : 46
    <4c7>   DW_AT_decl_column : 14
    <4c8>   DW_AT_type        : <0xd9>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 10 (DW_TAG_array_type)
    <4cf>   DW_AT_type        : <0xd9>
    <4d3>   DW_AT_sibling     : <0x4de>
 <2><4d7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4d8>   DW_AT_type        : <0x2b>
    <4dc>   DW_AT_upper_bound : 1
 <2><4dd>: Abbrev Number: 0
 <1><4de>: Abbrev Number: 14 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x19c): __tzname
    <4e3>   DW_AT_decl_file   : 14
    <4e4>   DW_AT_decl_line   : 159
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4ce>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 14 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0xe7b): __daylight
    <4f1>   DW_AT_decl_file   : 14
    <4f2>   DW_AT_decl_line   : 160
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 14 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x35b): __timezone
    <4ff>   DW_AT_decl_file   : 14
    <500>   DW_AT_decl_line   : 161
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0x11b>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 14 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0x989): tzname
    <50d>   DW_AT_decl_file   : 14
    <50e>   DW_AT_decl_line   : 166
    <50f>   DW_AT_decl_column : 14
    <510>   DW_AT_type        : <0x4ce>
    <514>   DW_AT_external    : 1
    <515>   DW_AT_declaration : 1
 <1><516>: Abbrev Number: 14 (DW_TAG_variable)
    <517>   DW_AT_name        : (indirect string, offset: 0x1035): daylight
    <51b>   DW_AT_decl_file   : 14
    <51c>   DW_AT_decl_line   : 174
    <51d>   DW_AT_decl_column : 12
    <51e>   DW_AT_type        : <0x64>
    <522>   DW_AT_external    : 1
    <523>   DW_AT_declaration : 1
 <1><524>: Abbrev Number: 14 (DW_TAG_variable)
    <525>   DW_AT_name        : (indirect string, offset: 0x4a4): timezone
    <529>   DW_AT_decl_file   : 14
    <52a>   DW_AT_decl_line   : 175
    <52b>   DW_AT_decl_column : 17
    <52c>   DW_AT_type        : <0x11b>
    <530>   DW_AT_external    : 1
    <531>   DW_AT_declaration : 1
 <1><532>: Abbrev Number: 13 (DW_TAG_variable)
    <533>   DW_AT_name        : (indirect string, offset: 0xf10): getdate_err
    <537>   DW_AT_decl_file   : 14
    <538>   DW_AT_decl_line   : 274
    <53a>   DW_AT_decl_column : 12
    <53b>   DW_AT_type        : <0x64>
    <53f>   DW_AT_external    : 1
    <540>   DW_AT_declaration : 1
 <1><541>: Abbrev Number: 14 (DW_TAG_variable)
    <542>   DW_AT_name        : (indirect string, offset: 0x99c): debug_flag
    <546>   DW_AT_decl_file   : 15
    <547>   DW_AT_decl_line   : 20
    <548>   DW_AT_decl_column : 13
    <549>   DW_AT_type        : <0x54f>
    <54d>   DW_AT_external    : 1
    <54e>   DW_AT_declaration : 1
 <1><54f>: Abbrev Number: 2 (DW_TAG_base_type)
    <550>   DW_AT_byte_size   : 1
    <551>   DW_AT_encoding    : 2	(boolean)
    <552>   DW_AT_name        : (indirect string, offset: 0x3f9): _Bool
 <1><556>: Abbrev Number: 3 (DW_TAG_const_type)
    <557>   DW_AT_type        : <0x54f>
 <1><55b>: Abbrev Number: 4 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xa77): __kernel_long_t
    <560>   DW_AT_decl_file   : 16
    <561>   DW_AT_decl_line   : 14
    <562>   DW_AT_decl_column : 19
    <563>   DW_AT_type        : <0x88>
 <1><567>: Abbrev Number: 4 (DW_TAG_typedef)
    <568>   DW_AT_name        : (indirect string, offset: 0x58d): __kernel_ulong_t
    <56c>   DW_AT_decl_file   : 16
    <56d>   DW_AT_decl_line   : 15
    <56e>   DW_AT_decl_column : 28
    <56f>   DW_AT_type        : <0x9b>
 <1><573>: Abbrev Number: 4 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x3c5): kernel_long_t
    <578>   DW_AT_decl_file   : 17
    <579>   DW_AT_decl_line   : 16
    <57a>   DW_AT_decl_column : 25
    <57b>   DW_AT_type        : <0x55b>
 <1><57f>: Abbrev Number: 4 (DW_TAG_typedef)
    <580>   DW_AT_name        : (indirect string, offset: 0x871): kernel_ulong_t
    <584>   DW_AT_decl_file   : 17
    <585>   DW_AT_decl_line   : 17
    <586>   DW_AT_decl_column : 26
    <587>   DW_AT_type        : <0x567>
 <1><58b>: Abbrev Number: 3 (DW_TAG_const_type)
    <58c>   DW_AT_type        : <0x57f>
 <1><590>: Abbrev Number: 12 (DW_TAG_structure_type)
    <591>   DW_AT_name        : (indirect string, offset: 0xbba): list_item
    <595>   DW_AT_byte_size   : 8
    <596>   DW_AT_decl_file   : 18
    <597>   DW_AT_decl_line   : 92
    <598>   DW_AT_decl_column : 8
    <599>   DW_AT_sibling     : <0x5bc>
 <2><59d>: Abbrev Number: 9 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x1098): prev
    <5a2>   DW_AT_decl_file   : 18
    <5a3>   DW_AT_decl_line   : 93
    <5a4>   DW_AT_decl_column : 20
    <5a5>   DW_AT_type        : <0x5bc>
    <5a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5ac>: Abbrev Number: 9 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xa87): next
    <5b1>   DW_AT_decl_file   : 18
    <5b2>   DW_AT_decl_line   : 94
    <5b3>   DW_AT_decl_column : 20
    <5b4>   DW_AT_type        : <0x5bc>
    <5b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5bb>: Abbrev Number: 0
 <1><5bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5bd>   DW_AT_byte_size   : 4
    <5be>   DW_AT_type        : <0x590>
 <1><5c2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x83d): sysent
    <5c7>   DW_AT_byte_size   : 20
    <5c8>   DW_AT_decl_file   : 19
    <5c9>   DW_AT_decl_line   : 13
    <5ca>   DW_AT_decl_column : 16
    <5cb>   DW_AT_sibling     : <0x61b>
 <2><5cf>: Abbrev Number: 9 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0xfdc): nargs
    <5d4>   DW_AT_decl_file   : 19
    <5d5>   DW_AT_decl_line   : 14
    <5d6>   DW_AT_decl_column : 11
    <5d7>   DW_AT_type        : <0x2b>
    <5db>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5de>: Abbrev Number: 9 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x940): sys_flags
    <5e3>   DW_AT_decl_file   : 19
    <5e4>   DW_AT_decl_line   : 15
    <5e5>   DW_AT_decl_column : 6
    <5e6>   DW_AT_type        : <0x64>
    <5ea>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5ed>: Abbrev Number: 19 (DW_TAG_member)
    <5ee>   DW_AT_name        : sen
    <5f2>   DW_AT_decl_file   : 19
    <5f3>   DW_AT_decl_line   : 16
    <5f4>   DW_AT_decl_column : 6
    <5f5>   DW_AT_type        : <0x64>
    <5f9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5fc>: Abbrev Number: 9 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x2f3): sys_func
    <601>   DW_AT_decl_file   : 19
    <602>   DW_AT_decl_line   : 17
    <603>   DW_AT_decl_column : 8
    <604>   DW_AT_type        : <0x899>
    <608>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><60b>: Abbrev Number: 9 (DW_TAG_member)
    <60c>   DW_AT_name        : (indirect string, offset: 0x268): sys_name
    <610>   DW_AT_decl_file   : 19
    <611>   DW_AT_decl_line   : 18
    <612>   DW_AT_decl_column : 14
    <613>   DW_AT_type        : <0x203>
    <617>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <61c>   DW_AT_prototyped  : 1
    <61d>   DW_AT_type        : <0x64>
    <621>   DW_AT_sibling     : <0x62b>
 <2><625>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <626>   DW_AT_type        : <0x62b>
 <2><62a>: Abbrev Number: 0
 <1><62b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <62c>   DW_AT_byte_size   : 4
    <62d>   DW_AT_type        : <0x636>
 <1><631>: Abbrev Number: 3 (DW_TAG_const_type)
    <632>   DW_AT_type        : <0x62b>
 <1><636>: Abbrev Number: 22 (DW_TAG_structure_type)
    <637>   DW_AT_name        : tcb
    <63b>   DW_AT_byte_size   : 304
    <63d>   DW_AT_decl_file   : 20
    <63e>   DW_AT_decl_line   : 262
    <640>   DW_AT_decl_column : 8
    <641>   DW_AT_sibling     : <0x899>
 <2><645>: Abbrev Number: 23 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0x4b3): flags
    <64a>   DW_AT_decl_file   : 20
    <64b>   DW_AT_decl_line   : 263
    <64d>   DW_AT_decl_column : 6
    <64e>   DW_AT_type        : <0x64>
    <652>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><655>: Abbrev Number: 24 (DW_TAG_member)
    <656>   DW_AT_name        : pid
    <65a>   DW_AT_decl_file   : 20
    <65b>   DW_AT_decl_line   : 264
    <65d>   DW_AT_decl_column : 6
    <65e>   DW_AT_type        : <0x64>
    <662>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><665>: Abbrev Number: 23 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <66a>   DW_AT_decl_file   : 20
    <66b>   DW_AT_decl_line   : 265
    <66d>   DW_AT_decl_column : 6
    <66e>   DW_AT_type        : <0x64>
    <672>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><675>: Abbrev Number: 23 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x37f): currpers
    <67a>   DW_AT_decl_file   : 20
    <67b>   DW_AT_decl_line   : 267
    <67d>   DW_AT_decl_column : 15
    <67e>   DW_AT_type        : <0x2b>
    <682>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><685>: Abbrev Number: 23 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0xb19): u_error
    <68a>   DW_AT_decl_file   : 20
    <68b>   DW_AT_decl_line   : 269
    <68d>   DW_AT_decl_column : 16
    <68e>   DW_AT_type        : <0x37>
    <692>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><695>: Abbrev Number: 23 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <69a>   DW_AT_decl_file   : 20
    <69b>   DW_AT_decl_line   : 270
    <69d>   DW_AT_decl_column : 17
    <69e>   DW_AT_type        : <0x57f>
    <6a2>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6a5>: Abbrev Number: 23 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0xb52): true_scno
    <6aa>   DW_AT_decl_file   : 20
    <6ab>   DW_AT_decl_line   : 271
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0x57f>
    <6b2>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6b5>: Abbrev Number: 23 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x186): u_arg
    <6ba>   DW_AT_decl_file   : 20
    <6bb>   DW_AT_decl_line   : 272
    <6bd>   DW_AT_decl_column : 17
    <6be>   DW_AT_type        : <0x9c9>
    <6c2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><6c5>: Abbrev Number: 23 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x957): u_rval
    <6ca>   DW_AT_decl_file   : 20
    <6cb>   DW_AT_decl_line   : 273
    <6cd>   DW_AT_decl_column : 16
    <6ce>   DW_AT_type        : <0x573>
    <6d2>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><6d5>: Abbrev Number: 23 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0xa98): sys_func_rval
    <6da>   DW_AT_decl_file   : 20
    <6db>   DW_AT_decl_line   : 274
    <6dd>   DW_AT_decl_column : 6
    <6de>   DW_AT_type        : <0x64>
    <6e2>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><6e5>: Abbrev Number: 23 (DW_TAG_member)
    <6e6>   DW_AT_name        : (indirect string, offset: 0xcae): curcol
    <6ea>   DW_AT_decl_file   : 20
    <6eb>   DW_AT_decl_line   : 275
    <6ed>   DW_AT_decl_column : 6
    <6ee>   DW_AT_type        : <0x64>
    <6f2>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><6f5>: Abbrev Number: 23 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x969): outf
    <6fa>   DW_AT_decl_file   : 20
    <6fb>   DW_AT_decl_line   : 276
    <6fd>   DW_AT_decl_column : 8
    <6fe>   DW_AT_type        : <0x448>
    <702>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><705>: Abbrev Number: 23 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0xeba): staged_output_data
    <70a>   DW_AT_decl_file   : 20
    <70b>   DW_AT_decl_line   : 277
    <70d>   DW_AT_decl_column : 29
    <70e>   DW_AT_type        : <0x9df>
    <712>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><715>: Abbrev Number: 23 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0xa5e): auxstr
    <71a>   DW_AT_decl_file   : 20
    <71b>   DW_AT_decl_line   : 279
    <71d>   DW_AT_decl_column : 14
    <71e>   DW_AT_type        : <0x203>
    <722>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><725>: Abbrev Number: 23 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x165): _priv_data
    <72a>   DW_AT_decl_file   : 20
    <72b>   DW_AT_decl_line   : 280
    <72d>   DW_AT_decl_column : 8
    <72e>   DW_AT_type        : <0xc6>
    <732>   DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><735>: Abbrev Number: 23 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0xbe7): _free_priv_data
    <73a>   DW_AT_decl_file   : 20
    <73b>   DW_AT_decl_line   : 281
    <73d>   DW_AT_decl_column : 9
    <73e>   DW_AT_type        : <0x9f1>
    <742>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><745>: Abbrev Number: 23 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0x176): s_ent
    <74a>   DW_AT_decl_file   : 20
    <74b>   DW_AT_decl_line   : 282
    <74d>   DW_AT_decl_column : 23
    <74e>   DW_AT_type        : <0x9f7>
    <752>   DW_AT_data_member_location: 2 byte block: 23 7c 	(DW_OP_plus_uconst: 124)
 <2><755>: Abbrev Number: 23 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <75a>   DW_AT_decl_file   : 20
    <75b>   DW_AT_decl_line   : 285
    <75d>   DW_AT_decl_column : 23
    <75e>   DW_AT_type        : <0x9f7>
    <762>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><766>: Abbrev Number: 23 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x374): inject_vec
    <76b>   DW_AT_decl_file   : 20
    <76c>   DW_AT_decl_line   : 286
    <76e>   DW_AT_decl_column : 22
    <76f>   DW_AT_type        : <0xa02>
    <773>   DW_AT_data_member_location: 3 byte block: 23 84 1 	(DW_OP_plus_uconst: 132)
 <2><777>: Abbrev Number: 23 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x7ae): stime
    <77c>   DW_AT_decl_file   : 20
    <77d>   DW_AT_decl_line   : 287
    <77f>   DW_AT_decl_column : 18
    <780>   DW_AT_type        : <0x174>
    <784>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><788>: Abbrev Number: 23 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x388): ltime
    <78d>   DW_AT_decl_file   : 20
    <78e>   DW_AT_decl_line   : 288
    <790>   DW_AT_decl_column : 18
    <791>   DW_AT_type        : <0x174>
    <795>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><799>: Abbrev Number: 23 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0xfa3): atime
    <79e>   DW_AT_decl_file   : 20
    <79f>   DW_AT_decl_line   : 289
    <7a1>   DW_AT_decl_column : 18
    <7a2>   DW_AT_type        : <0x174>
    <7a6>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><7aa>: Abbrev Number: 23 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x4ad): etime
    <7af>   DW_AT_decl_file   : 20
    <7b0>   DW_AT_decl_line   : 290
    <7b2>   DW_AT_decl_column : 18
    <7b3>   DW_AT_type        : <0x174>
    <7b7>   DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><7bb>: Abbrev Number: 23 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xd12): delay_expiration_time
    <7c0>   DW_AT_decl_file   : 20
    <7c1>   DW_AT_decl_line   : 291
    <7c3>   DW_AT_decl_column : 18
    <7c4>   DW_AT_type        : <0x174>
    <7c8>   DW_AT_data_member_location: 3 byte block: 23 d0 1 	(DW_OP_plus_uconst: 208)
 <2><7cc>: Abbrev Number: 23 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7d1>   DW_AT_decl_file   : 20
    <7d2>   DW_AT_decl_line   : 298
    <7d4>   DW_AT_decl_column : 15
    <7d5>   DW_AT_type        : <0x2b>
    <7d9>   DW_AT_data_member_location: 3 byte block: 23 e0 1 	(DW_OP_plus_uconst: 224)
 <2><7dd>: Abbrev Number: 23 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xef6): last_dirfd
    <7e2>   DW_AT_decl_file   : 20
    <7e3>   DW_AT_decl_line   : 301
    <7e5>   DW_AT_decl_column : 6
    <7e6>   DW_AT_type        : <0x64>
    <7ea>   DW_AT_data_member_location: 3 byte block: 23 e4 1 	(DW_OP_plus_uconst: 228)
 <2><7ee>: Abbrev Number: 23 (DW_TAG_member)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xf1c): mmap_cache
    <7f3>   DW_AT_decl_file   : 20
    <7f4>   DW_AT_decl_line   : 304
    <7f6>   DW_AT_decl_column : 23
    <7f7>   DW_AT_type        : <0xa1e>
    <7fb>   DW_AT_data_member_location: 3 byte block: 23 e8 1 	(DW_OP_plus_uconst: 232)
 <2><7ff>: Abbrev Number: 23 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0xb28): wait_data_idx
    <804>   DW_AT_decl_file   : 20
    <805>   DW_AT_decl_line   : 311
    <807>   DW_AT_decl_column : 9
    <808>   DW_AT_type        : <0x122>
    <80c>   DW_AT_data_member_location: 3 byte block: 23 ec 1 	(DW_OP_plus_uconst: 236)
 <2><810>: Abbrev Number: 23 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0xa65): delayed_wait_data
    <815>   DW_AT_decl_file   : 20
    <816>   DW_AT_decl_line   : 313
    <818>   DW_AT_decl_column : 24
    <819>   DW_AT_type        : <0xa2a>
    <81d>   DW_AT_data_member_location: 3 byte block: 23 f0 1 	(DW_OP_plus_uconst: 240)
 <2><821>: Abbrev Number: 23 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0xada): wait_list
    <826>   DW_AT_decl_file   : 20
    <827>   DW_AT_decl_line   : 314
    <829>   DW_AT_decl_column : 19
    <82a>   DW_AT_type        : <0x590>
    <82e>   DW_AT_data_member_location: 3 byte block: 23 f4 1 	(DW_OP_plus_uconst: 244)
 <2><832>: Abbrev Number: 23 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0x6ab): vcpu_info_list
    <837>   DW_AT_decl_file   : 20
    <838>   DW_AT_decl_line   : 318
    <83a>   DW_AT_decl_column : 20
    <83b>   DW_AT_type        : <0xa36>
    <83f>   DW_AT_data_member_location: 3 byte block: 23 fc 1 	(DW_OP_plus_uconst: 252)
 <2><843>: Abbrev Number: 23 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0xc79): unwind_ctx
    <848>   DW_AT_decl_file   : 20
    <849>   DW_AT_decl_line   : 322
    <84b>   DW_AT_decl_column : 8
    <84c>   DW_AT_type        : <0xc6>
    <850>   DW_AT_data_member_location: 3 byte block: 23 80 2 	(DW_OP_plus_uconst: 256)
 <2><854>: Abbrev Number: 23 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x497): unwind_queue
    <859>   DW_AT_decl_file   : 20
    <85a>   DW_AT_decl_line   : 323
    <85c>   DW_AT_decl_column : 25
    <85d>   DW_AT_type        : <0xa42>
    <861>   DW_AT_data_member_location: 3 byte block: 23 84 2 	(DW_OP_plus_uconst: 260)
 <2><865>: Abbrev Number: 23 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x15a): comm
    <86a>   DW_AT_decl_file   : 20
    <86b>   DW_AT_decl_line   : 327
    <86d>   DW_AT_decl_column : 7
    <86e>   DW_AT_type        : <0xa48>
    <872>   DW_AT_data_member_location: 3 byte block: 23 88 2 	(DW_OP_plus_uconst: 264)
 <2><876>: Abbrev Number: 23 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x21b): start_prc
    <87b>   DW_AT_decl_file   : 20
    <87c>   DW_AT_decl_line   : 329
    <87e>   DW_AT_decl_column : 16
    <87f>   DW_AT_type        : <0x37>
    <883>   DW_AT_data_member_location: 3 byte block: 23 98 2 	(DW_OP_plus_uconst: 280)
 <2><887>: Abbrev Number: 23 (DW_TAG_member)
    <888>   DW_AT_name        : (indirect string, offset: 0xf77): pre_comm
    <88c>   DW_AT_decl_file   : 20
    <88d>   DW_AT_decl_line   : 330
    <88f>   DW_AT_decl_column : 7
    <890>   DW_AT_type        : <0xa48>
    <894>   DW_AT_data_member_location: 3 byte block: 23 9c 2 	(DW_OP_plus_uconst: 284)
 <2><898>: Abbrev Number: 0
 <1><899>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <89a>   DW_AT_byte_size   : 4
    <89b>   DW_AT_type        : <0x61b>
 <1><89f>: Abbrev Number: 4 (DW_TAG_typedef)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x57f): struct_sysent
    <8a4>   DW_AT_decl_file   : 19
    <8a5>   DW_AT_decl_line   : 19
    <8a6>   DW_AT_decl_column : 3
    <8a7>   DW_AT_type        : <0x5c2>
 <1><8ab>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ac>   DW_AT_type        : <0x89f>
 <1><8b0>: Abbrev Number: 14 (DW_TAG_variable)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xcfe): current_personality
    <8b5>   DW_AT_decl_file   : 20
    <8b6>   DW_AT_decl_line   : 158
    <8b7>   DW_AT_decl_column : 17
    <8b8>   DW_AT_type        : <0x2b>
    <8bc>   DW_AT_external    : 1
    <8bd>   DW_AT_declaration : 1
 <1><8be>: Abbrev Number: 14 (DW_TAG_variable)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x7df): current_wordsize
    <8c3>   DW_AT_decl_file   : 20
    <8c4>   DW_AT_decl_line   : 171
    <8c5>   DW_AT_decl_column : 17
    <8c6>   DW_AT_type        : <0x2b>
    <8ca>   DW_AT_external    : 1
    <8cb>   DW_AT_declaration : 1
 <1><8cc>: Abbrev Number: 14 (DW_TAG_variable)
    <8cd>   DW_AT_name        : (indirect string, offset: 0xa3c): current_klongsize
    <8d1>   DW_AT_decl_file   : 20
    <8d2>   DW_AT_decl_line   : 176
    <8d3>   DW_AT_decl_column : 17
    <8d4>   DW_AT_type        : <0x2b>
    <8d8>   DW_AT_external    : 1
    <8d9>   DW_AT_declaration : 1
 <1><8da>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8db>   DW_AT_name        : (indirect string, offset: 0xc50): ioctlent
    <8df>   DW_AT_byte_size   : 8
    <8e0>   DW_AT_decl_file   : 20
    <8e1>   DW_AT_decl_line   : 217
    <8e2>   DW_AT_decl_column : 16
    <8e3>   DW_AT_sibling     : <0x906>
 <2><8e7>: Abbrev Number: 9 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0xee2): symbol
    <8ec>   DW_AT_decl_file   : 20
    <8ed>   DW_AT_decl_line   : 218
    <8ee>   DW_AT_decl_column : 14
    <8ef>   DW_AT_type        : <0x203>
    <8f3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f6>: Abbrev Number: 9 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xcc7): code
    <8fb>   DW_AT_decl_file   : 20
    <8fc>   DW_AT_decl_line   : 219
    <8fd>   DW_AT_decl_column : 15
    <8fe>   DW_AT_type        : <0x2b>
    <902>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><905>: Abbrev Number: 0
 <1><906>: Abbrev Number: 4 (DW_TAG_typedef)
    <907>   DW_AT_name        : (indirect string, offset: 0xc11): struct_ioctlent
    <90b>   DW_AT_decl_file   : 20
    <90c>   DW_AT_decl_line   : 220
    <90d>   DW_AT_decl_column : 3
    <90e>   DW_AT_type        : <0x8da>
 <1><912>: Abbrev Number: 3 (DW_TAG_const_type)
    <913>   DW_AT_type        : <0x906>
 <1><917>: Abbrev Number: 12 (DW_TAG_structure_type)
    <918>   DW_AT_name        : (indirect string, offset: 0x7d3): inject_data
    <91c>   DW_AT_byte_size   : 10
    <91d>   DW_AT_decl_file   : 20
    <91e>   DW_AT_decl_line   : 241
    <91f>   DW_AT_decl_column : 8
    <920>   DW_AT_sibling     : <0x97f>
 <2><924>: Abbrev Number: 9 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0x4b3): flags
    <929>   DW_AT_decl_file   : 20
    <92a>   DW_AT_decl_line   : 242
    <92b>   DW_AT_decl_column : 10
    <92c>   DW_AT_type        : <0xeb>
    <930>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><933>: Abbrev Number: 9 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0x8f4): signo
    <938>   DW_AT_decl_file   : 20
    <939>   DW_AT_decl_line   : 243
    <93a>   DW_AT_decl_column : 10
    <93b>   DW_AT_type        : <0xeb>
    <93f>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><942>: Abbrev Number: 9 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <947>   DW_AT_decl_file   : 20
    <948>   DW_AT_decl_line   : 244
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0xf7>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><951>: Abbrev Number: 9 (DW_TAG_member)
    <952>   DW_AT_name        : (indirect string, offset: 0xca4): delay_idx
    <956>   DW_AT_decl_file   : 20
    <957>   DW_AT_decl_line   : 245
    <958>   DW_AT_decl_column : 11
    <959>   DW_AT_type        : <0xf7>
    <95d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><960>: Abbrev Number: 9 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x5d9): poke_idx
    <965>   DW_AT_decl_file   : 20
    <966>   DW_AT_decl_line   : 246
    <967>   DW_AT_decl_column : 11
    <968>   DW_AT_type        : <0xf7>
    <96c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><96f>: Abbrev Number: 9 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <974>   DW_AT_decl_file   : 20
    <975>   DW_AT_decl_line   : 247
    <976>   DW_AT_decl_column : 11
    <977>   DW_AT_type        : <0xf7>
    <97b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><97e>: Abbrev Number: 0
 <1><97f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <980>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <984>   DW_AT_byte_size   : 16
    <985>   DW_AT_decl_file   : 20
    <986>   DW_AT_decl_line   : 250
    <987>   DW_AT_decl_column : 8
    <988>   DW_AT_sibling     : <0x9c9>
 <2><98c>: Abbrev Number: 9 (DW_TAG_member)
    <98d>   DW_AT_name        : (indirect string, offset: 0x9fb): first
    <991>   DW_AT_decl_file   : 20
    <992>   DW_AT_decl_line   : 251
    <993>   DW_AT_decl_column : 11
    <994>   DW_AT_type        : <0xf7>
    <998>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><99b>: Abbrev Number: 9 (DW_TAG_member)
    <99c>   DW_AT_name        : (indirect string, offset: 0x10c1): last
    <9a0>   DW_AT_decl_file   : 20
    <9a1>   DW_AT_decl_line   : 252
    <9a2>   DW_AT_decl_column : 11
    <9a3>   DW_AT_type        : <0xf7>
    <9a7>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><9aa>: Abbrev Number: 9 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x38e): step
    <9af>   DW_AT_decl_file   : 20
    <9b0>   DW_AT_decl_line   : 253
    <9b1>   DW_AT_decl_column : 11
    <9b2>   DW_AT_type        : <0xf7>
    <9b6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9b9>: Abbrev Number: 9 (DW_TAG_member)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x1093): data
    <9be>   DW_AT_decl_file   : 20
    <9bf>   DW_AT_decl_line   : 254
    <9c0>   DW_AT_decl_column : 21
    <9c1>   DW_AT_type        : <0x917>
    <9c5>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9c8>: Abbrev Number: 0
 <1><9c9>: Abbrev Number: 10 (DW_TAG_array_type)
    <9ca>   DW_AT_type        : <0x57f>
    <9ce>   DW_AT_sibling     : <0x9d9>
 <2><9d2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9d3>   DW_AT_type        : <0x2b>
    <9d7>   DW_AT_upper_bound : 5
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9da>   DW_AT_name        : (indirect string, offset: 0xeba): staged_output_data
    <9de>   DW_AT_declaration : 1
 <1><9df>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e0>   DW_AT_byte_size   : 4
    <9e1>   DW_AT_type        : <0x9d9>
 <1><9e5>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9e6>   DW_AT_prototyped  : 1
    <9e7>   DW_AT_sibling     : <0x9f1>
 <2><9eb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9ec>   DW_AT_type        : <0xc6>
 <2><9f0>: Abbrev Number: 0
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9e5>
 <1><9f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f8>   DW_AT_byte_size   : 4
    <9f9>   DW_AT_type        : <0x8ab>
 <1><9fd>: Abbrev Number: 3 (DW_TAG_const_type)
    <9fe>   DW_AT_type        : <0x9f7>
 <1><a02>: Abbrev Number: 10 (DW_TAG_array_type)
    <a03>   DW_AT_type        : <0xa12>
    <a07>   DW_AT_sibling     : <0xa12>
 <2><a0b>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a0c>   DW_AT_type        : <0x2b>
    <a10>   DW_AT_upper_bound : 2
 <2><a11>: Abbrev Number: 0
 <1><a12>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a13>   DW_AT_byte_size   : 4
    <a14>   DW_AT_type        : <0x97f>
 <1><a18>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a19>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <a1d>   DW_AT_declaration : 1
 <1><a1e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1f>   DW_AT_byte_size   : 4
    <a20>   DW_AT_type        : <0xa18>
 <1><a24>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a25>   DW_AT_name        : (indirect string, offset: 0x3a9): tcb_wait_data
    <a29>   DW_AT_declaration : 1
 <1><a2a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a2b>   DW_AT_byte_size   : 4
    <a2c>   DW_AT_type        : <0xa24>
 <1><a30>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a31>   DW_AT_name        : (indirect string, offset: 0x150): vcpu_info
    <a35>   DW_AT_declaration : 1
 <1><a36>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a37>   DW_AT_byte_size   : 4
    <a38>   DW_AT_type        : <0xa30>
 <1><a3c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xe9e): unwind_queue_t
    <a41>   DW_AT_declaration : 1
 <1><a42>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a43>   DW_AT_byte_size   : 4
    <a44>   DW_AT_type        : <0xa3c>
 <1><a48>: Abbrev Number: 10 (DW_TAG_array_type)
    <a49>   DW_AT_type        : <0xdf>
    <a4d>   DW_AT_sibling     : <0xa58>
 <2><a51>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a52>   DW_AT_type        : <0x2b>
    <a56>   DW_AT_upper_bound : 15
 <2><a57>: Abbrev Number: 0
 <1><a58>: Abbrev Number: 13 (DW_TAG_variable)
    <a59>   DW_AT_name        : (indirect string, offset: 0xb65): stub_sysent
    <a5d>   DW_AT_decl_file   : 20
    <a5e>   DW_AT_decl_line   : 405
    <a60>   DW_AT_decl_column : 28
    <a61>   DW_AT_type        : <0x8ab>
    <a65>   DW_AT_external    : 1
    <a66>   DW_AT_declaration : 1
 <1><a67>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a68>   DW_AT_name        : (indirect string, offset: 0x1070): xlat_type
    <a6c>   DW_AT_encoding    : 7	(unsigned)
    <a6d>   DW_AT_byte_size   : 4
    <a6e>   DW_AT_type        : <0x2b>
    <a72>   DW_AT_decl_file   : 21
    <a73>   DW_AT_decl_line   : 13
    <a74>   DW_AT_decl_column : 6
    <a75>   DW_AT_sibling     : <0xa8c>
 <2><a79>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x2c3): XT_NORMAL
    <a7e>   DW_AT_const_value : 0
 <2><a7f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a80>   DW_AT_name        : (indirect string, offset: 0xc28): XT_SORTED
    <a84>   DW_AT_const_value : 1
 <2><a85>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a86>   DW_AT_name        : (indirect string, offset: 0xd8a): XT_INDEXED
    <a8a>   DW_AT_const_value : 2
 <2><a8b>: Abbrev Number: 0
 <1><a8c>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a8d>   DW_AT_name        : (indirect string, offset: 0xb91): xlat_style
    <a91>   DW_AT_encoding    : 7	(unsigned)
    <a92>   DW_AT_byte_size   : 4
    <a93>   DW_AT_type        : <0x2b>
    <a97>   DW_AT_decl_file   : 21
    <a98>   DW_AT_decl_line   : 19
    <a99>   DW_AT_decl_column : 6
    <a9a>   DW_AT_sibling     : <0xac9>
 <2><a9e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9f>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <aa3>   DW_AT_const_value : 0
 <2><aa4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa5>   DW_AT_name        : (indirect string, offset: 0xbc4): XLAT_STYLE_RAW
    <aa9>   DW_AT_const_value : 1
 <2><aaa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aab>   DW_AT_name        : (indirect string, offset: 0x1023): XLAT_STYLE_ABBREV
    <aaf>   DW_AT_const_value : 2
 <2><ab0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x2e0): XLAT_STYLE_VERBOSE
    <ab5>   DW_AT_const_value : 3
 <2><ab6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <abb>   DW_AT_const_value : 0
 <2><abc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <abd>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ac1>   DW_AT_const_value : 4
 <2><ac2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x10b0): XLAT_STYLE_FMT_D
    <ac7>   DW_AT_const_value : 8
 <2><ac8>: Abbrev Number: 0
 <1><ac9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <aca>   DW_AT_name        : (indirect string, offset: 0x311): xlat_data
    <ace>   DW_AT_byte_size   : 16
    <acf>   DW_AT_decl_file   : 21
    <ad0>   DW_AT_decl_line   : 51
    <ad1>   DW_AT_decl_column : 8
    <ad2>   DW_AT_sibling     : <0xaf5>
 <2><ad6>: Abbrev Number: 19 (DW_TAG_member)
    <ad7>   DW_AT_name        : val
    <adb>   DW_AT_decl_file   : 21
    <adc>   DW_AT_decl_line   : 52
    <add>   DW_AT_decl_column : 11
    <ade>   DW_AT_type        : <0x10f>
    <ae2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae5>: Abbrev Number: 19 (DW_TAG_member)
    <ae6>   DW_AT_name        : str
    <aea>   DW_AT_decl_file   : 21
    <aeb>   DW_AT_decl_line   : 53
    <aec>   DW_AT_decl_column : 14
    <aed>   DW_AT_type        : <0x203>
    <af1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af4>: Abbrev Number: 0
 <1><af5>: Abbrev Number: 3 (DW_TAG_const_type)
    <af6>   DW_AT_type        : <0xac9>
 <1><afa>: Abbrev Number: 12 (DW_TAG_structure_type)
    <afb>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aff>   DW_AT_byte_size   : 24
    <b00>   DW_AT_decl_file   : 21
    <b01>   DW_AT_decl_line   : 56
    <b02>   DW_AT_decl_column : 8
    <b03>   DW_AT_sibling     : <0xb53>
 <2><b07>: Abbrev Number: 9 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x1093): data
    <b0c>   DW_AT_decl_file   : 21
    <b0d>   DW_AT_decl_line   : 57
    <b0e>   DW_AT_decl_column : 26
    <b0f>   DW_AT_type        : <0xb58>
    <b13>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b16>: Abbrev Number: 9 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x831): flags_strsz
    <b1b>   DW_AT_decl_file   : 21
    <b1c>   DW_AT_decl_line   : 58
    <b1d>   DW_AT_decl_column : 9
    <b1e>   DW_AT_type        : <0x122>
    <b22>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b25>: Abbrev Number: 9 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0xb36): size
    <b2a>   DW_AT_decl_file   : 21
    <b2b>   DW_AT_decl_line   : 59
    <b2c>   DW_AT_decl_column : 11
    <b2d>   DW_AT_type        : <0x103>
    <b31>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b34>: Abbrev Number: 9 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x181): type
    <b39>   DW_AT_decl_file   : 21
    <b3a>   DW_AT_decl_line   : 60
    <b3b>   DW_AT_decl_column : 17
    <b3c>   DW_AT_type        : <0xa67>
    <b40>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b43>: Abbrev Number: 9 (DW_TAG_member)
    <b44>   DW_AT_name        : (indirect string, offset: 0x6ff): flags_mask
    <b48>   DW_AT_decl_file   : 21
    <b49>   DW_AT_decl_line   : 61
    <b4a>   DW_AT_decl_column : 11
    <b4b>   DW_AT_type        : <0x10f>
    <b4f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b52>: Abbrev Number: 0
 <1><b53>: Abbrev Number: 3 (DW_TAG_const_type)
    <b54>   DW_AT_type        : <0xafa>
 <1><b58>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b59>   DW_AT_byte_size   : 4
    <b5a>   DW_AT_type        : <0xaf5>
 <1><b5e>: Abbrev Number: 10 (DW_TAG_array_type)
    <b5f>   DW_AT_type        : <0xb53>
    <b63>   DW_AT_sibling     : <0xb69>
 <2><b67>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b68>: Abbrev Number: 0
 <1><b69>: Abbrev Number: 3 (DW_TAG_const_type)
    <b6a>   DW_AT_type        : <0xb5e>
 <1><b6e>: Abbrev Number: 13 (DW_TAG_variable)
    <b6f>   DW_AT_name        : (indirect string, offset: 0xdfe): addrfams
    <b73>   DW_AT_decl_file   : 20
    <b74>   DW_AT_decl_line   : 411
    <b76>   DW_AT_decl_column : 26
    <b77>   DW_AT_type        : <0xb69>
    <b7b>   DW_AT_external    : 1
    <b7c>   DW_AT_declaration : 1
 <1><b7d>: Abbrev Number: 13 (DW_TAG_variable)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xcd7): arp_hardware_types
    <b82>   DW_AT_decl_file   : 20
    <b83>   DW_AT_decl_line   : 412
    <b85>   DW_AT_decl_column : 26
    <b86>   DW_AT_type        : <0xb69>
    <b8a>   DW_AT_external    : 1
    <b8b>   DW_AT_declaration : 1
 <1><b8c>: Abbrev Number: 13 (DW_TAG_variable)
    <b8d>   DW_AT_name        : (indirect string, offset: 0xfa9): at_flags
    <b91>   DW_AT_decl_file   : 20
    <b92>   DW_AT_decl_line   : 413
    <b94>   DW_AT_decl_column : 26
    <b95>   DW_AT_type        : <0xb69>
    <b99>   DW_AT_external    : 1
    <b9a>   DW_AT_declaration : 1
 <1><b9b>: Abbrev Number: 13 (DW_TAG_variable)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x475): clocknames
    <ba0>   DW_AT_decl_file   : 20
    <ba1>   DW_AT_decl_line   : 414
    <ba3>   DW_AT_decl_column : 26
    <ba4>   DW_AT_type        : <0xb69>
    <ba8>   DW_AT_external    : 1
    <ba9>   DW_AT_declaration : 1
 <1><baa>: Abbrev Number: 13 (DW_TAG_variable)
    <bab>   DW_AT_name        : (indirect string, offset: 0xf6a): dirent_types
    <baf>   DW_AT_decl_file   : 20
    <bb0>   DW_AT_decl_line   : 415
    <bb2>   DW_AT_decl_column : 26
    <bb3>   DW_AT_type        : <0xb69>
    <bb7>   DW_AT_external    : 1
    <bb8>   DW_AT_declaration : 1
 <1><bb9>: Abbrev Number: 13 (DW_TAG_variable)
    <bba>   DW_AT_name        : (indirect string, offset: 0x88e): ethernet_protocols
    <bbe>   DW_AT_decl_file   : 20
    <bbf>   DW_AT_decl_line   : 416
    <bc1>   DW_AT_decl_column : 26
    <bc2>   DW_AT_type        : <0xb69>
    <bc6>   DW_AT_external    : 1
    <bc7>   DW_AT_declaration : 1
 <1><bc8>: Abbrev Number: 13 (DW_TAG_variable)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x62c): inet_protocols
    <bcd>   DW_AT_decl_file   : 20
    <bce>   DW_AT_decl_line   : 417
    <bd0>   DW_AT_decl_column : 26
    <bd1>   DW_AT_type        : <0xb69>
    <bd5>   DW_AT_external    : 1
    <bd6>   DW_AT_declaration : 1
 <1><bd7>: Abbrev Number: 13 (DW_TAG_variable)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x2b0): evdev_abs
    <bdc>   DW_AT_decl_file   : 20
    <bdd>   DW_AT_decl_line   : 418
    <bdf>   DW_AT_decl_column : 26
    <be0>   DW_AT_type        : <0xb69>
    <be4>   DW_AT_external    : 1
    <be5>   DW_AT_declaration : 1
 <1><be6>: Abbrev Number: 13 (DW_TAG_variable)
    <be7>   DW_AT_name        : (indirect string, offset: 0x6f4): audit_arch
    <beb>   DW_AT_decl_file   : 20
    <bec>   DW_AT_decl_line   : 419
    <bee>   DW_AT_decl_column : 26
    <bef>   DW_AT_type        : <0xb69>
    <bf3>   DW_AT_external    : 1
    <bf4>   DW_AT_declaration : 1
 <1><bf5>: Abbrev Number: 13 (DW_TAG_variable)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bfa>   DW_AT_decl_file   : 20
    <bfb>   DW_AT_decl_line   : 420
    <bfd>   DW_AT_decl_column : 26
    <bfe>   DW_AT_type        : <0xb69>
    <c02>   DW_AT_external    : 1
    <c03>   DW_AT_declaration : 1
 <1><c04>: Abbrev Number: 13 (DW_TAG_variable)
    <c05>   DW_AT_name        : (indirect string, offset: 0x456): iffflags
    <c09>   DW_AT_decl_file   : 20
    <c0a>   DW_AT_decl_line   : 421
    <c0c>   DW_AT_decl_column : 26
    <c0d>   DW_AT_type        : <0xb69>
    <c11>   DW_AT_external    : 1
    <c12>   DW_AT_declaration : 1
 <1><c13>: Abbrev Number: 13 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0xbd3): ip_type_of_services
    <c18>   DW_AT_decl_file   : 20
    <c19>   DW_AT_decl_line   : 422
    <c1b>   DW_AT_decl_column : 26
    <c1c>   DW_AT_type        : <0xb69>
    <c20>   DW_AT_external    : 1
    <c21>   DW_AT_declaration : 1
 <1><c22>: Abbrev Number: 13 (DW_TAG_variable)
    <c23>   DW_AT_name        : (indirect string, offset: 0x687): ipc_private
    <c27>   DW_AT_decl_file   : 20
    <c28>   DW_AT_decl_line   : 423
    <c2a>   DW_AT_decl_column : 26
    <c2b>   DW_AT_type        : <0xb69>
    <c2f>   DW_AT_external    : 1
    <c30>   DW_AT_declaration : 1
 <1><c31>: Abbrev Number: 13 (DW_TAG_variable)
    <c32>   DW_AT_name        : (indirect string, offset: 0x307): msg_flags
    <c36>   DW_AT_decl_file   : 20
    <c37>   DW_AT_decl_line   : 424
    <c39>   DW_AT_decl_column : 26
    <c3a>   DW_AT_type        : <0xb69>
    <c3e>   DW_AT_external    : 1
    <c3f>   DW_AT_declaration : 1
 <1><c40>: Abbrev Number: 13 (DW_TAG_variable)
    <c41>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c45>   DW_AT_decl_file   : 20
    <c46>   DW_AT_decl_line   : 425
    <c48>   DW_AT_decl_column : 26
    <c49>   DW_AT_type        : <0xb69>
    <c4d>   DW_AT_external    : 1
    <c4e>   DW_AT_declaration : 1
 <1><c4f>: Abbrev Number: 13 (DW_TAG_variable)
    <c50>   DW_AT_name        : (indirect string, offset: 0xecd): nl_bridge_vlan_flags
    <c54>   DW_AT_decl_file   : 20
    <c55>   DW_AT_decl_line   : 426
    <c57>   DW_AT_decl_column : 26
    <c58>   DW_AT_type        : <0xb69>
    <c5c>   DW_AT_external    : 1
    <c5d>   DW_AT_declaration : 1
 <1><c5e>: Abbrev Number: 13 (DW_TAG_variable)
    <c5f>   DW_AT_name        : (indirect string, offset: 0xd73): nl_netfilter_msg_types
    <c63>   DW_AT_decl_file   : 20
    <c64>   DW_AT_decl_line   : 427
    <c66>   DW_AT_decl_column : 26
    <c67>   DW_AT_type        : <0xb69>
    <c6b>   DW_AT_external    : 1
    <c6c>   DW_AT_declaration : 1
 <1><c6d>: Abbrev Number: 13 (DW_TAG_variable)
    <c6e>   DW_AT_name        : (indirect string, offset: 0x438): nl_route_types
    <c72>   DW_AT_decl_file   : 20
    <c73>   DW_AT_decl_line   : 428
    <c75>   DW_AT_decl_column : 26
    <c76>   DW_AT_type        : <0xb69>
    <c7a>   DW_AT_external    : 1
    <c7b>   DW_AT_declaration : 1
 <1><c7c>: Abbrev Number: 13 (DW_TAG_variable)
    <c7d>   DW_AT_name        : (indirect string, offset: 0xe35): open_access_modes
    <c81>   DW_AT_decl_file   : 20
    <c82>   DW_AT_decl_line   : 429
    <c84>   DW_AT_decl_column : 26
    <c85>   DW_AT_type        : <0xb69>
    <c89>   DW_AT_external    : 1
    <c8a>   DW_AT_declaration : 1
 <1><c8b>: Abbrev Number: 13 (DW_TAG_variable)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c90>   DW_AT_decl_file   : 20
    <c91>   DW_AT_decl_line   : 430
    <c93>   DW_AT_decl_column : 26
    <c94>   DW_AT_type        : <0xb69>
    <c98>   DW_AT_external    : 1
    <c99>   DW_AT_declaration : 1
 <1><c9a>: Abbrev Number: 13 (DW_TAG_variable)
    <c9b>   DW_AT_name        : (indirect string, offset: 0xc04): perf_type_id
    <c9f>   DW_AT_decl_file   : 20
    <ca0>   DW_AT_decl_line   : 431
    <ca2>   DW_AT_decl_column : 26
    <ca3>   DW_AT_type        : <0xb69>
    <ca7>   DW_AT_external    : 1
    <ca8>   DW_AT_declaration : 1
 <1><ca9>: Abbrev Number: 13 (DW_TAG_variable)
    <caa>   DW_AT_name        : (indirect string, offset: 0xe07): pollflags
    <cae>   DW_AT_decl_file   : 20
    <caf>   DW_AT_decl_line   : 432
    <cb1>   DW_AT_decl_column : 26
    <cb2>   DW_AT_type        : <0xb69>
    <cb6>   DW_AT_external    : 1
    <cb7>   DW_AT_declaration : 1
 <1><cb8>: Abbrev Number: 13 (DW_TAG_variable)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x5cd): ptrace_cmds
    <cbd>   DW_AT_decl_file   : 20
    <cbe>   DW_AT_decl_line   : 433
    <cc0>   DW_AT_decl_column : 26
    <cc1>   DW_AT_type        : <0xb69>
    <cc5>   DW_AT_external    : 1
    <cc6>   DW_AT_declaration : 1
 <1><cc7>: Abbrev Number: 13 (DW_TAG_variable)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x7c4): resource_flags
    <ccc>   DW_AT_decl_file   : 20
    <ccd>   DW_AT_decl_line   : 434
    <ccf>   DW_AT_decl_column : 26
    <cd0>   DW_AT_type        : <0xb69>
    <cd4>   DW_AT_external    : 1
    <cd5>   DW_AT_declaration : 1
 <1><cd6>: Abbrev Number: 13 (DW_TAG_variable)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x286): route_nexthop_flags
    <cdb>   DW_AT_decl_file   : 20
    <cdc>   DW_AT_decl_line   : 435
    <cde>   DW_AT_decl_column : 26
    <cdf>   DW_AT_type        : <0xb69>
    <ce3>   DW_AT_external    : 1
    <ce4>   DW_AT_declaration : 1
 <1><ce5>: Abbrev Number: 13 (DW_TAG_variable)
    <ce6>   DW_AT_name        : (indirect string, offset: 0xe58): routing_protocols
    <cea>   DW_AT_decl_file   : 20
    <ceb>   DW_AT_decl_line   : 436
    <ced>   DW_AT_decl_column : 26
    <cee>   DW_AT_type        : <0xb69>
    <cf2>   DW_AT_external    : 1
    <cf3>   DW_AT_declaration : 1
 <1><cf4>: Abbrev Number: 13 (DW_TAG_variable)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x447): routing_scopes
    <cf9>   DW_AT_decl_file   : 20
    <cfa>   DW_AT_decl_line   : 437
    <cfc>   DW_AT_decl_column : 26
    <cfd>   DW_AT_type        : <0xb69>
    <d01>   DW_AT_external    : 1
    <d02>   DW_AT_declaration : 1
 <1><d03>: Abbrev Number: 13 (DW_TAG_variable)
    <d04>   DW_AT_name        : (indirect string, offset: 0xd61): routing_table_ids
    <d08>   DW_AT_decl_file   : 20
    <d09>   DW_AT_decl_line   : 438
    <d0b>   DW_AT_decl_column : 26
    <d0c>   DW_AT_type        : <0xb69>
    <d10>   DW_AT_external    : 1
    <d11>   DW_AT_declaration : 1
 <1><d12>: Abbrev Number: 13 (DW_TAG_variable)
    <d13>   DW_AT_name        : (indirect string, offset: 0x664): routing_types
    <d17>   DW_AT_decl_file   : 20
    <d18>   DW_AT_decl_line   : 439
    <d1a>   DW_AT_decl_column : 26
    <d1b>   DW_AT_type        : <0xb69>
    <d1f>   DW_AT_external    : 1
    <d20>   DW_AT_declaration : 1
 <1><d21>: Abbrev Number: 13 (DW_TAG_variable)
    <d22>   DW_AT_name        : (indirect string, offset: 0x1a5): rwf_flags
    <d26>   DW_AT_decl_file   : 20
    <d27>   DW_AT_decl_line   : 440
    <d29>   DW_AT_decl_column : 26
    <d2a>   DW_AT_type        : <0xb69>
    <d2e>   DW_AT_external    : 1
    <d2f>   DW_AT_declaration : 1
 <1><d30>: Abbrev Number: 13 (DW_TAG_variable)
    <d31>   DW_AT_name        : (indirect string, offset: 0x7fc): seccomp_filter_flags
    <d35>   DW_AT_decl_file   : 20
    <d36>   DW_AT_decl_line   : 441
    <d38>   DW_AT_decl_column : 26
    <d39>   DW_AT_type        : <0xb69>
    <d3d>   DW_AT_external    : 1
    <d3e>   DW_AT_declaration : 1
 <1><d3f>: Abbrev Number: 13 (DW_TAG_variable)
    <d40>   DW_AT_name        : (indirect string, offset: 0x2cd): seccomp_ret_action
    <d44>   DW_AT_decl_file   : 20
    <d45>   DW_AT_decl_line   : 442
    <d47>   DW_AT_decl_column : 26
    <d48>   DW_AT_type        : <0xb69>
    <d4c>   DW_AT_external    : 1
    <d4d>   DW_AT_declaration : 1
 <1><d4e>: Abbrev Number: 13 (DW_TAG_variable)
    <d4f>   DW_AT_name        : (indirect string, offset: 0x413): setns_types
    <d53>   DW_AT_decl_file   : 20
    <d54>   DW_AT_decl_line   : 443
    <d56>   DW_AT_decl_column : 26
    <d57>   DW_AT_type        : <0xb69>
    <d5b>   DW_AT_external    : 1
    <d5c>   DW_AT_declaration : 1
 <1><d5d>: Abbrev Number: 13 (DW_TAG_variable)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xdf3): sg_io_info
    <d62>   DW_AT_decl_file   : 20
    <d63>   DW_AT_decl_line   : 444
    <d65>   DW_AT_decl_column : 26
    <d66>   DW_AT_type        : <0xb69>
    <d6a>   DW_AT_external    : 1
    <d6b>   DW_AT_declaration : 1
 <1><d6c>: Abbrev Number: 13 (DW_TAG_variable)
    <d6d>   DW_AT_name        : (indirect string, offset: 0xb79): socketlayers
    <d71>   DW_AT_decl_file   : 20
    <d72>   DW_AT_decl_line   : 445
    <d74>   DW_AT_decl_column : 26
    <d75>   DW_AT_type        : <0xb69>
    <d79>   DW_AT_external    : 1
    <d7a>   DW_AT_declaration : 1
 <1><d7b>: Abbrev Number: 13 (DW_TAG_variable)
    <d7c>   DW_AT_name        : (indirect string, offset: 0xd4b): socktypes
    <d80>   DW_AT_decl_file   : 20
    <d81>   DW_AT_decl_line   : 446
    <d83>   DW_AT_decl_column : 26
    <d84>   DW_AT_type        : <0xb69>
    <d88>   DW_AT_external    : 1
    <d89>   DW_AT_declaration : 1
 <1><d8a>: Abbrev Number: 13 (DW_TAG_variable)
    <d8b>   DW_AT_name        : (indirect string, offset: 0xa4e): tcp_state_flags
    <d8f>   DW_AT_decl_file   : 20
    <d90>   DW_AT_decl_line   : 447
    <d92>   DW_AT_decl_column : 26
    <d93>   DW_AT_type        : <0xb69>
    <d97>   DW_AT_external    : 1
    <d98>   DW_AT_declaration : 1
 <1><d99>: Abbrev Number: 13 (DW_TAG_variable)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x729): tcp_states
    <d9e>   DW_AT_decl_file   : 20
    <d9f>   DW_AT_decl_line   : 448
    <da1>   DW_AT_decl_column : 26
    <da2>   DW_AT_type        : <0xb69>
    <da6>   DW_AT_external    : 1
    <da7>   DW_AT_declaration : 1
 <1><da8>: Abbrev Number: 13 (DW_TAG_variable)
    <da9>   DW_AT_name        : (indirect string, offset: 0x1006): whence_codes
    <dad>   DW_AT_decl_file   : 20
    <dae>   DW_AT_decl_line   : 449
    <db0>   DW_AT_decl_column : 26
    <db1>   DW_AT_type        : <0xb69>
    <db5>   DW_AT_external    : 1
    <db6>   DW_AT_declaration : 1
 <1><db7>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <db8>   DW_AT_encoding    : 7	(unsigned)
    <db9>   DW_AT_byte_size   : 4
    <dba>   DW_AT_type        : <0x2b>
    <dbe>   DW_AT_decl_file   : 20
    <dbf>   DW_AT_decl_line   : 510
    <dc1>   DW_AT_decl_column : 14
    <dc2>   DW_AT_sibling     : <0xdd9>
 <2><dc6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x95e): CFLAG_NONE
    <dcb>   DW_AT_const_value : 0
 <2><dcc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x8a1): CFLAG_ONLY_STATS
    <dd1>   DW_AT_const_value : 1
 <2><dd2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dd3>   DW_AT_name        : (indirect string, offset: 0xb86): CFLAG_BOTH
    <dd7>   DW_AT_const_value : 2
 <2><dd8>: Abbrev Number: 0
 <1><dd9>: Abbrev Number: 29 (DW_TAG_typedef)
    <dda>   DW_AT_name        : (indirect string, offset: 0x10c6): cflag_t
    <dde>   DW_AT_decl_file   : 20
    <ddf>   DW_AT_decl_line   : 514
    <de1>   DW_AT_decl_column : 3
    <de2>   DW_AT_type        : <0xdb7>
 <1><de6>: Abbrev Number: 13 (DW_TAG_variable)
    <de7>   DW_AT_name        : (indirect string, offset: 0xc9e): cflag
    <deb>   DW_AT_decl_file   : 20
    <dec>   DW_AT_decl_line   : 515
    <dee>   DW_AT_decl_column : 16
    <def>   DW_AT_type        : <0xdd9>
    <df3>   DW_AT_external    : 1
    <df4>   DW_AT_declaration : 1
 <1><df5>: Abbrev Number: 13 (DW_TAG_variable)
    <df6>   DW_AT_name        : (indirect string, offset: 0x170): Tflag
    <dfa>   DW_AT_decl_file   : 20
    <dfb>   DW_AT_decl_line   : 516
    <dfd>   DW_AT_decl_column : 13
    <dfe>   DW_AT_type        : <0x54f>
    <e02>   DW_AT_external    : 1
    <e03>   DW_AT_declaration : 1
 <1><e04>: Abbrev Number: 13 (DW_TAG_variable)
    <e05>   DW_AT_name        : (indirect string, offset: 0x77f): Tflag_scale
    <e09>   DW_AT_decl_file   : 20
    <e0a>   DW_AT_decl_line   : 517
    <e0c>   DW_AT_decl_column : 12
    <e0d>   DW_AT_type        : <0x64>
    <e11>   DW_AT_external    : 1
    <e12>   DW_AT_declaration : 1
 <1><e13>: Abbrev Number: 13 (DW_TAG_variable)
    <e14>   DW_AT_name        : (indirect string, offset: 0x811): Tflag_width
    <e18>   DW_AT_decl_file   : 20
    <e19>   DW_AT_decl_line   : 518
    <e1b>   DW_AT_decl_column : 12
    <e1c>   DW_AT_type        : <0x64>
    <e20>   DW_AT_external    : 1
    <e21>   DW_AT_declaration : 1
 <1><e22>: Abbrev Number: 13 (DW_TAG_variable)
    <e23>   DW_AT_name        : (indirect string, offset: 0xde5): iflag
    <e27>   DW_AT_decl_file   : 20
    <e28>   DW_AT_decl_line   : 519
    <e2a>   DW_AT_decl_column : 13
    <e2b>   DW_AT_type        : <0x54f>
    <e2f>   DW_AT_external    : 1
    <e30>   DW_AT_declaration : 1
 <1><e31>: Abbrev Number: 13 (DW_TAG_variable)
    <e32>   DW_AT_name        : (indirect string, offset: 0x60d): count_wallclock
    <e36>   DW_AT_decl_file   : 20
    <e37>   DW_AT_decl_line   : 520
    <e39>   DW_AT_decl_column : 13
    <e3a>   DW_AT_type        : <0x54f>
    <e3e>   DW_AT_external    : 1
    <e3f>   DW_AT_declaration : 1
 <1><e40>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e41>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e45>   DW_AT_byte_size   : 4
    <e46>   DW_AT_decl_file   : 20
    <e47>   DW_AT_decl_line   : 522
    <e49>   DW_AT_decl_column : 8
    <e4a>   DW_AT_sibling     : <0xe5f>
 <2><e4e>: Abbrev Number: 23 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e53>   DW_AT_decl_file   : 20
    <e54>   DW_AT_decl_line   : 523
    <e56>   DW_AT_decl_column : 14
    <e57>   DW_AT_type        : <0x203>
    <e5b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e5e>: Abbrev Number: 0
 <1><e5f>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e60>   DW_AT_name        : (indirect string, offset: 0x734): path_set
    <e64>   DW_AT_byte_size   : 12
    <e65>   DW_AT_decl_file   : 20
    <e66>   DW_AT_decl_line   : 527
    <e68>   DW_AT_decl_column : 15
    <e69>   DW_AT_sibling     : <0xe9e>
 <2><e6d>: Abbrev Number: 23 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x6c2): paths_selected
    <e72>   DW_AT_decl_file   : 20
    <e73>   DW_AT_decl_line   : 528
    <e75>   DW_AT_decl_column : 24
    <e76>   DW_AT_type        : <0xe9e>
    <e7a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e7d>: Abbrev Number: 23 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0xff9): num_selected
    <e82>   DW_AT_decl_file   : 20
    <e83>   DW_AT_decl_line   : 529
    <e85>   DW_AT_decl_column : 9
    <e86>   DW_AT_type        : <0x122>
    <e8a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e8d>: Abbrev Number: 23 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xb36): size
    <e92>   DW_AT_decl_file   : 20
    <e93>   DW_AT_decl_line   : 530
    <e95>   DW_AT_decl_column : 9
    <e96>   DW_AT_type        : <0x122>
    <e9a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e9d>: Abbrev Number: 0
 <1><e9e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e9f>   DW_AT_byte_size   : 4
    <ea0>   DW_AT_type        : <0xe40>
 <1><ea4>: Abbrev Number: 13 (DW_TAG_variable)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x1048): global_path_set
    <ea9>   DW_AT_decl_file   : 20
    <eaa>   DW_AT_decl_line   : 531
    <eac>   DW_AT_decl_column : 3
    <ead>   DW_AT_type        : <0xe5f>
    <eb1>   DW_AT_external    : 1
    <eb2>   DW_AT_declaration : 1
 <1><eb3>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xf45): xflag_opts
    <eb8>   DW_AT_encoding    : 7	(unsigned)
    <eb9>   DW_AT_byte_size   : 4
    <eba>   DW_AT_type        : <0x2b>
    <ebe>   DW_AT_decl_file   : 20
    <ebf>   DW_AT_decl_line   : 533
    <ec1>   DW_AT_decl_column : 6
    <ec2>   DW_AT_sibling     : <0xee5>
 <2><ec6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x9ef): HEXSTR_NONE
    <ecb>   DW_AT_const_value : 0
 <2><ecc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ecd>   DW_AT_name        : (indirect string, offset: 0xf8b): HEXSTR_NON_ASCII
    <ed1>   DW_AT_const_value : 1
 <2><ed2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x8df): HEXSTR_ALL
    <ed7>   DW_AT_const_value : 2
 <2><ed8>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x64d): HEXSTR_NON_ASCII_CHARS
    <edd>   DW_AT_const_value : 3
 <2><ede>: Abbrev Number: 27 (DW_TAG_enumerator)
    <edf>   DW_AT_name        : (indirect string, offset: 0x1013): NUM_HEXSTR_OPTS
    <ee3>   DW_AT_const_value : 4
 <2><ee4>: Abbrev Number: 0
 <1><ee5>: Abbrev Number: 13 (DW_TAG_variable)
    <ee6>   DW_AT_name        : (indirect string, offset: 0xdb4): xflag
    <eea>   DW_AT_decl_file   : 20
    <eeb>   DW_AT_decl_line   : 546
    <eed>   DW_AT_decl_column : 17
    <eee>   DW_AT_type        : <0x2b>
    <ef2>   DW_AT_external    : 1
    <ef3>   DW_AT_declaration : 1
 <1><ef4>: Abbrev Number: 13 (DW_TAG_variable)
    <ef5>   DW_AT_name        : (indirect string, offset: 0xc59): followfork
    <ef9>   DW_AT_decl_file   : 20
    <efa>   DW_AT_decl_line   : 547
    <efc>   DW_AT_decl_column : 13
    <efd>   DW_AT_type        : <0x54f>
    <f01>   DW_AT_external    : 1
    <f02>   DW_AT_declaration : 1
 <1><f03>: Abbrev Number: 13 (DW_TAG_variable)
    <f04>   DW_AT_name        : (indirect string, offset: 0x31b): output_separately
    <f08>   DW_AT_decl_file   : 20
    <f09>   DW_AT_decl_line   : 548
    <f0b>   DW_AT_decl_column : 13
    <f0c>   DW_AT_type        : <0x54f>
    <f10>   DW_AT_external    : 1
    <f11>   DW_AT_declaration : 1
 <1><f12>: Abbrev Number: 13 (DW_TAG_variable)
    <f13>   DW_AT_name        : (indirect string, offset: 0x225): stack_trace_enabled
    <f17>   DW_AT_decl_file   : 20
    <f18>   DW_AT_decl_line   : 551
    <f1a>   DW_AT_decl_column : 13
    <f1b>   DW_AT_type        : <0x54f>
    <f1f>   DW_AT_external    : 1
    <f20>   DW_AT_declaration : 1
 <1><f21>: Abbrev Number: 13 (DW_TAG_variable)
    <f22>   DW_AT_name        : (indirect string, offset: 0x63b): ptrace_setoptions
    <f26>   DW_AT_decl_file   : 20
    <f27>   DW_AT_decl_line   : 555
    <f29>   DW_AT_decl_column : 17
    <f2a>   DW_AT_type        : <0x2b>
    <f2e>   DW_AT_external    : 1
    <f2f>   DW_AT_declaration : 1
 <1><f30>: Abbrev Number: 13 (DW_TAG_variable)
    <f31>   DW_AT_name        : (indirect string, offset: 0x9e4): max_strlen
    <f35>   DW_AT_decl_file   : 20
    <f36>   DW_AT_decl_line   : 556
    <f38>   DW_AT_decl_column : 17
    <f39>   DW_AT_type        : <0x2b>
    <f3d>   DW_AT_external    : 1
    <f3e>   DW_AT_declaration : 1
 <1><f3f>: Abbrev Number: 13 (DW_TAG_variable)
    <f40>   DW_AT_name        : (indirect string, offset: 0xa28): os_release
    <f44>   DW_AT_decl_file   : 20
    <f45>   DW_AT_decl_line   : 557
    <f47>   DW_AT_decl_column : 17
    <f48>   DW_AT_type        : <0x2b>
    <f4c>   DW_AT_external    : 1
    <f4d>   DW_AT_declaration : 1
 <1><f4e>: Abbrev Number: 13 (DW_TAG_variable)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x6d1): xlat_verbosity
    <f53>   DW_AT_decl_file   : 20
    <f54>   DW_AT_decl_line   : 919
    <f56>   DW_AT_decl_column : 24
    <f57>   DW_AT_type        : <0xa8c>
    <f5b>   DW_AT_external    : 1
    <f5c>   DW_AT_declaration : 1
 <1><f5d>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x5f0): xlat_style_private_flag_bits
    <f62>   DW_AT_encoding    : 7	(unsigned)
    <f63>   DW_AT_byte_size   : 4
    <f64>   DW_AT_type        : <0x2b>
    <f68>   DW_AT_decl_file   : 20
    <f69>   DW_AT_decl_line   : 939
    <f6b>   DW_AT_decl_column : 6
    <f6c>   DW_AT_sibling     : <0xf89>
 <2><f70>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f71>   DW_AT_name        : (indirect string, offset: 0x29a): PAF_PRINT_INDICES_BIT
    <f75>   DW_AT_const_value : 5
 <2><f76>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f77>   DW_AT_name        : (indirect string, offset: 0xaed): PAF_ARRAY_TRUNCATED_BIT
    <f7b>   DW_AT_const_value : 6
 <2><f7c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x3d3): PXF_DEFAULT_STR_BIT
    <f81>   DW_AT_const_value : 7
 <2><f82>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f83>   DW_AT_name        : (indirect string, offset: 0xc3b): SPFF_AUXSTR_MODE_BIT
    <f87>   DW_AT_const_value : 8
 <2><f88>: Abbrev Number: 0
 <1><f89>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xcea): find_xlat_flag_bits
    <f8e>   DW_AT_encoding    : 7	(unsigned)
    <f8f>   DW_AT_byte_size   : 4
    <f90>   DW_AT_type        : <0x2b>
    <f94>   DW_AT_decl_file   : 20
    <f95>   DW_AT_decl_line   : 1443
    <f97>   DW_AT_decl_column : 6
    <f98>   DW_AT_sibling     : <0xfa3>
 <2><f9c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x91c): FXL_CASE_SENSITIVE_BIT
    <fa1>   DW_AT_const_value : 0
 <2><fa2>: Abbrev Number: 0
 <1><fa3>: Abbrev Number: 13 (DW_TAG_variable)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x9b1): printing_tcp
    <fa8>   DW_AT_decl_file   : 20
    <fa9>   DW_AT_decl_line   : 1689
    <fab>   DW_AT_decl_column : 20
    <fac>   DW_AT_type        : <0x62b>
    <fb0>   DW_AT_external    : 1
    <fb1>   DW_AT_declaration : 1
 <1><fb2>: Abbrev Number: 13 (DW_TAG_variable)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x5a4): errnoent
    <fb7>   DW_AT_decl_file   : 20
    <fb8>   DW_AT_decl_line   : 1887
    <fba>   DW_AT_decl_column : 26
    <fbb>   DW_AT_type        : <0x483>
    <fbf>   DW_AT_external    : 1
    <fc0>   DW_AT_declaration : 1
 <1><fc1>: Abbrev Number: 13 (DW_TAG_variable)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x81d): signalent
    <fc6>   DW_AT_decl_file   : 20
    <fc7>   DW_AT_decl_line   : 1888
    <fc9>   DW_AT_decl_column : 26
    <fca>   DW_AT_type        : <0x483>
    <fce>   DW_AT_external    : 1
    <fcf>   DW_AT_declaration : 1
 <1><fd0>: Abbrev Number: 13 (DW_TAG_variable)
    <fd1>   DW_AT_name        : (indirect string, offset: 0xe2d): nerrnos
    <fd5>   DW_AT_decl_file   : 20
    <fd6>   DW_AT_decl_line   : 1889
    <fd8>   DW_AT_decl_column : 27
    <fd9>   DW_AT_type        : <0x32>
    <fdd>   DW_AT_external    : 1
    <fde>   DW_AT_declaration : 1
 <1><fdf>: Abbrev Number: 13 (DW_TAG_variable)
    <fe0>   DW_AT_name        : (indirect string, offset: 0xfe2): nsignals
    <fe4>   DW_AT_decl_file   : 20
    <fe5>   DW_AT_decl_line   : 1890
    <fe7>   DW_AT_decl_column : 27
    <fe8>   DW_AT_type        : <0x32>
    <fec>   DW_AT_external    : 1
    <fed>   DW_AT_declaration : 1
 <1><fee>: Abbrev Number: 10 (DW_TAG_array_type)
    <fef>   DW_AT_type        : <0x8ab>
    <ff3>   DW_AT_sibling     : <0xff9>
 <2><ff7>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><ff8>: Abbrev Number: 0
 <1><ff9>: Abbrev Number: 3 (DW_TAG_const_type)
    <ffa>   DW_AT_type        : <0xfee>
 <1><ffe>: Abbrev Number: 13 (DW_TAG_variable)
    <fff>   DW_AT_name        : (indirect string, offset: 0xcb5): sysent0
    <1003>   DW_AT_decl_file   : 20
    <1004>   DW_AT_decl_line   : 1892
    <1006>   DW_AT_decl_column : 28
    <1007>   DW_AT_type        : <0xff9>
    <100b>   DW_AT_external    : 1
    <100c>   DW_AT_declaration : 1
 <1><100d>: Abbrev Number: 10 (DW_TAG_array_type)
    <100e>   DW_AT_type        : <0x912>
    <1012>   DW_AT_sibling     : <0x1018>
 <2><1016>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 3 (DW_TAG_const_type)
    <1019>   DW_AT_type        : <0x100d>
 <1><101d>: Abbrev Number: 13 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0x103e): ioctlent0
    <1022>   DW_AT_decl_file   : 20
    <1023>   DW_AT_decl_line   : 1893
    <1025>   DW_AT_decl_column : 30
    <1026>   DW_AT_type        : <0x1018>
    <102a>   DW_AT_external    : 1
    <102b>   DW_AT_declaration : 1
 <1><102c>: Abbrev Number: 13 (DW_TAG_variable)
    <102d>   DW_AT_name        : (indirect string, offset: 0xf50): personality_names
    <1031>   DW_AT_decl_file   : 20
    <1032>   DW_AT_decl_line   : 1895
    <1034>   DW_AT_decl_column : 26
    <1035>   DW_AT_type        : <0x483>
    <1039>   DW_AT_external    : 1
    <103a>   DW_AT_declaration : 1
 <1><103b>: Abbrev Number: 13 (DW_TAG_variable)
    <103c>   DW_AT_name        : (indirect string, offset: 0x83d): sysent
    <1040>   DW_AT_decl_file   : 20
    <1041>   DW_AT_decl_line   : 1898
    <1043>   DW_AT_decl_column : 29
    <1044>   DW_AT_type        : <0x9f7>
    <1048>   DW_AT_external    : 1
    <1049>   DW_AT_declaration : 1
 <1><104a>: Abbrev Number: 13 (DW_TAG_variable)
    <104b>   DW_AT_name        : (indirect string, offset: 0xc50): ioctlent
    <104f>   DW_AT_decl_file   : 20
    <1050>   DW_AT_decl_line   : 1899
    <1052>   DW_AT_decl_column : 31
    <1053>   DW_AT_type        : <0x1059>
    <1057>   DW_AT_external    : 1
    <1058>   DW_AT_declaration : 1
 <1><1059>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <105a>   DW_AT_byte_size   : 4
    <105b>   DW_AT_type        : <0x912>
 <1><105f>: Abbrev Number: 13 (DW_TAG_variable)
    <1060>   DW_AT_name        : (indirect string, offset: 0x827): nsyscalls
    <1064>   DW_AT_decl_file   : 20
    <1065>   DW_AT_decl_line   : 1905
    <1067>   DW_AT_decl_column : 17
    <1068>   DW_AT_type        : <0x2b>
    <106c>   DW_AT_external    : 1
    <106d>   DW_AT_declaration : 1
 <1><106e>: Abbrev Number: 13 (DW_TAG_variable)
    <106f>   DW_AT_name        : (indirect string, offset: 0xe4d): nioctlents
    <1073>   DW_AT_decl_file   : 20
    <1074>   DW_AT_decl_line   : 1906
    <1076>   DW_AT_decl_column : 17
    <1077>   DW_AT_type        : <0x2b>
    <107b>   DW_AT_external    : 1
    <107c>   DW_AT_declaration : 1
 <1><107d>: Abbrev Number: 10 (DW_TAG_array_type)
    <107e>   DW_AT_type        : <0x32>
    <1082>   DW_AT_sibling     : <0x108d>
 <2><1086>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1087>   DW_AT_type        : <0x2b>
    <108b>   DW_AT_upper_bound : 2
 <2><108c>: Abbrev Number: 0
 <1><108d>: Abbrev Number: 3 (DW_TAG_const_type)
    <108e>   DW_AT_type        : <0x107d>
 <1><1092>: Abbrev Number: 13 (DW_TAG_variable)
    <1093>   DW_AT_name        : (indirect string, offset: 0xead): nsyscall_vec
    <1097>   DW_AT_decl_file   : 20
    <1098>   DW_AT_decl_line   : 1908
    <109a>   DW_AT_decl_column : 27
    <109b>   DW_AT_type        : <0x108d>
    <109f>   DW_AT_external    : 1
    <10a0>   DW_AT_declaration : 1
 <1><10a1>: Abbrev Number: 10 (DW_TAG_array_type)
    <10a2>   DW_AT_type        : <0x9fd>
    <10a6>   DW_AT_sibling     : <0x10b1>
 <2><10aa>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10ab>   DW_AT_type        : <0x2b>
    <10af>   DW_AT_upper_bound : 2
 <2><10b0>: Abbrev Number: 0
 <1><10b1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b2>   DW_AT_type        : <0x10a1>
 <1><10b6>: Abbrev Number: 13 (DW_TAG_variable)
    <10b7>   DW_AT_name        : (indirect string, offset: 0x76c): sysent_vec
    <10bb>   DW_AT_decl_file   : 20
    <10bc>   DW_AT_decl_line   : 1909
    <10be>   DW_AT_decl_column : 35
    <10bf>   DW_AT_type        : <0x10b1>
    <10c3>   DW_AT_external    : 1
    <10c4>   DW_AT_declaration : 1
 <1><10c5>: Abbrev Number: 13 (DW_TAG_variable)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x374): inject_vec
    <10ca>   DW_AT_decl_file   : 20
    <10cb>   DW_AT_decl_line   : 1910
    <10cd>   DW_AT_decl_column : 28
    <10ce>   DW_AT_type        : <0xa02>
    <10d2>   DW_AT_external    : 1
    <10d3>   DW_AT_declaration : 1
 <1><10d4>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10d5>   DW_AT_name        : (indirect string, offset: 0xd3e): audit_arch_t
    <10d9>   DW_AT_byte_size   : 8
    <10da>   DW_AT_decl_file   : 20
    <10db>   DW_AT_decl_line   : 1912
    <10dd>   DW_AT_decl_column : 8
    <10de>   DW_AT_sibling     : <0x1103>
 <2><10e2>: Abbrev Number: 23 (DW_TAG_member)
    <10e3>   DW_AT_name        : (indirect string, offset: 0x5e2): arch
    <10e7>   DW_AT_decl_file   : 20
    <10e8>   DW_AT_decl_line   : 1913
    <10ea>   DW_AT_decl_column : 15
    <10eb>   DW_AT_type        : <0x2b>
    <10ef>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10f2>: Abbrev Number: 23 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x997): flag
    <10f7>   DW_AT_decl_file   : 20
    <10f8>   DW_AT_decl_line   : 1914
    <10fa>   DW_AT_decl_column : 15
    <10fb>   DW_AT_type        : <0x2b>
    <10ff>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1102>: Abbrev Number: 0
 <1><1103>: Abbrev Number: 3 (DW_TAG_const_type)
    <1104>   DW_AT_type        : <0x10d4>
 <1><1108>: Abbrev Number: 10 (DW_TAG_array_type)
    <1109>   DW_AT_type        : <0x1103>
    <110d>   DW_AT_sibling     : <0x1118>
 <2><1111>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1112>   DW_AT_type        : <0x2b>
    <1116>   DW_AT_upper_bound : 2
 <2><1117>: Abbrev Number: 0
 <1><1118>: Abbrev Number: 3 (DW_TAG_const_type)
    <1119>   DW_AT_type        : <0x1108>
 <1><111d>: Abbrev Number: 13 (DW_TAG_variable)
    <111e>   DW_AT_name        : (indirect string, offset: 0x90d): audit_arch_vec
    <1122>   DW_AT_decl_file   : 20
    <1123>   DW_AT_decl_line   : 1917
    <1125>   DW_AT_decl_column : 34
    <1126>   DW_AT_type        : <0x1118>
    <112a>   DW_AT_external    : 1
    <112b>   DW_AT_declaration : 1
 <1><112c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <112d>   DW_AT_byte_size   : 180
    <112e>   DW_AT_decl_file   : 22
    <112f>   DW_AT_decl_line   : 2
    <1130>   DW_AT_decl_column : 9
    <1131>   DW_AT_sibling     : <0x13e6>
 <2><1135>: Abbrev Number: 9 (DW_TAG_member)
    <1136>   DW_AT_name        : (indirect string, offset: 0x844): block_ioctl
    <113a>   DW_AT_decl_file   : 22
    <113b>   DW_AT_decl_line   : 3
    <113c>   DW_AT_decl_column : 8
    <113d>   DW_AT_type        : <0x1400>
    <1141>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1144>: Abbrev Number: 9 (DW_TAG_member)
    <1145>   DW_AT_name        : (indirect string, offset: 0xa8c): btrfs_ioctl
    <1149>   DW_AT_decl_file   : 22
    <114a>   DW_AT_decl_line   : 6
    <114b>   DW_AT_decl_column : 8
    <114c>   DW_AT_type        : <0x1400>
    <1150>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1153>: Abbrev Number: 9 (DW_TAG_member)
