Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x190e (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xfa9): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x4d): mpers-m32/kernel_v4l2_buffer_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xf74): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0xed5): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xacf): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x22f): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <54>   DW_AT_name        : (indirect string, offset: 0x9f5): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x44d): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 4 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x1a7): __int32_t
    <69>   DW_AT_decl_file   : 1
    <6a>   DW_AT_decl_line   : 41
    <6b>   DW_AT_decl_column : 20
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 5 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 5	(signed)
    <73>   DW_AT_name        : int
 <1><77>: Abbrev Number: 3 (DW_TAG_const_type)
    <78>   DW_AT_type        : <0x70>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0x7d6): __uint32_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 42
    <83>   DW_AT_decl_column : 22
    <84>   DW_AT_type        : <0x2b>
 <1><88>: Abbrev Number: 4 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0xac5): __int64_t
    <8d>   DW_AT_decl_file   : 1
    <8e>   DW_AT_decl_line   : 47
    <8f>   DW_AT_decl_column : 44
    <90>   DW_AT_type        : <0x94>
 <1><94>: Abbrev Number: 2 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 5	(signed)
    <97>   DW_AT_name        : (indirect string, offset: 0x886): long long int
 <1><9b>: Abbrev Number: 4 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x5ee): __uint64_t
    <a0>   DW_AT_decl_file   : 1
    <a1>   DW_AT_decl_line   : 48
    <a2>   DW_AT_decl_column : 46
    <a3>   DW_AT_type        : <0xa7>
 <1><a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <a8>   DW_AT_byte_size   : 8
    <a9>   DW_AT_encoding    : 7	(unsigned)
    <aa>   DW_AT_name        : (indirect string, offset: 0x41b): long long unsigned int
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0x10a8): __off_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 152
    <b5>   DW_AT_decl_column : 25
    <b6>   DW_AT_type        : <0xba>
 <1><ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <bb>   DW_AT_byte_size   : 4
    <bc>   DW_AT_encoding    : 5	(signed)
    <bd>   DW_AT_name        : (indirect string, offset: 0x0): long int
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x11fe): __off64_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 153
    <c8>   DW_AT_decl_column : 27
    <c9>   DW_AT_type        : <0x88>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x1040): __time_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 160
    <d4>   DW_AT_decl_column : 26
    <d5>   DW_AT_type        : <0xba>
 <1><d9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
 <1><db>: Abbrev Number: 3 (DW_TAG_const_type)
    <dc>   DW_AT_type        : <0xd9>
 <1><e0>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1>   DW_AT_name        : (indirect string, offset: 0x93f): __syscall_slong_t
    <e5>   DW_AT_decl_file   : 1
    <e6>   DW_AT_decl_line   : 196
    <e7>   DW_AT_decl_column : 33
    <e8>   DW_AT_type        : <0xba>
 <1><ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed>   DW_AT_byte_size   : 4
    <ee>   DW_AT_type        : <0xf2>
 <1><f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3>   DW_AT_byte_size   : 1
    <f4>   DW_AT_encoding    : 6	(signed char)
    <f5>   DW_AT_name        : (indirect string, offset: 0x6dc): char
 <1><f9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fa>   DW_AT_type        : <0xf2>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xe42): int32_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 26
    <105>   DW_AT_decl_column : 19
    <106>   DW_AT_type        : <0x64>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0x7e1): uint8_t
    <10f>   DW_AT_decl_file   : 3
    <110>   DW_AT_decl_line   : 24
    <111>   DW_AT_decl_column : 19
    <112>   DW_AT_type        : <0x45>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xb08): uint16_t
    <11b>   DW_AT_decl_file   : 3
    <11c>   DW_AT_decl_line   : 25
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x58>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x33a): uint32_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 26
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x7c>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0xcc4): uint64_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 27
    <135>   DW_AT_decl_column : 20
    <136>   DW_AT_type        : <0x9b>
 <1><13a>: Abbrev Number: 4 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0x53d): size_t
    <13f>   DW_AT_decl_file   : 4
    <140>   DW_AT_decl_line   : 209
    <141>   DW_AT_decl_column : 23
    <142>   DW_AT_type        : <0x2b>
 <1><146>: Abbrev Number: 3 (DW_TAG_const_type)
    <147>   DW_AT_type        : <0x13a>
 <1><14b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <14c>   DW_AT_name        : (indirect string, offset: 0x6d3): timespec
    <150>   DW_AT_byte_size   : 8
    <151>   DW_AT_decl_file   : 5
    <152>   DW_AT_decl_line   : 10
    <153>   DW_AT_decl_column : 8
    <154>   DW_AT_sibling     : <0x177>
 <2><158>: Abbrev Number: 9 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0xddd): tv_sec
    <15d>   DW_AT_decl_file   : 5
    <15e>   DW_AT_decl_line   : 12
    <15f>   DW_AT_decl_column : 12
    <160>   DW_AT_type        : <0xcd>
    <164>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><167>: Abbrev Number: 9 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0x52a): tv_nsec
    <16c>   DW_AT_decl_file   : 5
    <16d>   DW_AT_decl_line   : 16
    <16e>   DW_AT_decl_column : 21
    <16f>   DW_AT_type        : <0xe0>
    <173>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><176>: Abbrev Number: 0
 <1><177>: Abbrev Number: 2 (DW_TAG_base_type)
    <178>   DW_AT_byte_size   : 12
    <179>   DW_AT_encoding    : 4	(float)
    <17a>   DW_AT_name        : (indirect string, offset: 0x9c6): long double
 <1><17e>: Abbrev Number: 2 (DW_TAG_base_type)
    <17f>   DW_AT_byte_size   : 16
    <180>   DW_AT_encoding    : 4	(float)
    <181>   DW_AT_name        : (indirect string, offset: 0x15c): _Float128
 <1><185>: Abbrev Number: 10 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0xccd): __environ
    <18a>   DW_AT_decl_file   : 6
    <18b>   DW_AT_decl_line   : 543
    <18d>   DW_AT_decl_column : 15
    <18e>   DW_AT_type        : <0x194>
    <192>   DW_AT_external    : 1
    <193>   DW_AT_declaration : 1
 <1><194>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <195>   DW_AT_byte_size   : 4
    <196>   DW_AT_type        : <0xec>
 <1><19a>: Abbrev Number: 10 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0x775): environ
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 545
    <1a2>   DW_AT_decl_column : 15
    <1a3>   DW_AT_type        : <0x194>
    <1a7>   DW_AT_external    : 1
    <1a8>   DW_AT_declaration : 1
 <1><1a9>: Abbrev Number: 11 (DW_TAG_variable)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xaaa): optarg
    <1ae>   DW_AT_decl_file   : 7
    <1af>   DW_AT_decl_line   : 36
    <1b0>   DW_AT_decl_column : 14
    <1b1>   DW_AT_type        : <0xec>
    <1b5>   DW_AT_external    : 1
    <1b6>   DW_AT_declaration : 1
 <1><1b7>: Abbrev Number: 11 (DW_TAG_variable)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x90e): optind
    <1bc>   DW_AT_decl_file   : 7
    <1bd>   DW_AT_decl_line   : 50
    <1be>   DW_AT_decl_column : 12
    <1bf>   DW_AT_type        : <0x70>
    <1c3>   DW_AT_external    : 1
    <1c4>   DW_AT_declaration : 1
 <1><1c5>: Abbrev Number: 11 (DW_TAG_variable)
    <1c6>   DW_AT_name        : (indirect string, offset: 0xa5a): opterr
    <1ca>   DW_AT_decl_file   : 7
    <1cb>   DW_AT_decl_line   : 55
    <1cc>   DW_AT_decl_column : 12
    <1cd>   DW_AT_type        : <0x70>
    <1d1>   DW_AT_external    : 1
    <1d2>   DW_AT_declaration : 1
 <1><1d3>: Abbrev Number: 11 (DW_TAG_variable)
    <1d4>   DW_AT_name        : (indirect string, offset: 0xfd): optopt
    <1d8>   DW_AT_decl_file   : 7
    <1d9>   DW_AT_decl_line   : 59
    <1da>   DW_AT_decl_column : 12
    <1db>   DW_AT_type        : <0x70>
    <1df>   DW_AT_external    : 1
    <1e0>   DW_AT_declaration : 1
 <1><1e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e2>   DW_AT_byte_size   : 4
    <1e3>   DW_AT_type        : <0xf9>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e8>   DW_AT_type        : <0x1e1>
 <1><1ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ed>   DW_AT_byte_size   : 4
    <1ee>   DW_AT_type        : <0x1f2>
 <1><1f2>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1f3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f4>   DW_AT_name        : (indirect string, offset: 0xe30): _IO_FILE
    <1f8>   DW_AT_byte_size   : 148
    <1f9>   DW_AT_decl_file   : 8
    <1fa>   DW_AT_decl_line   : 49
    <1fb>   DW_AT_decl_column : 8
    <1fc>   DW_AT_sibling     : <0x3b4>
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x187): _flags
    <205>   DW_AT_decl_file   : 8
    <206>   DW_AT_decl_line   : 51
    <207>   DW_AT_decl_column : 7
    <208>   DW_AT_type        : <0x70>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x79c): _IO_read_ptr
    <214>   DW_AT_decl_file   : 8
    <215>   DW_AT_decl_line   : 54
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xec>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0xbb0): _IO_read_end
    <223>   DW_AT_decl_file   : 8
    <224>   DW_AT_decl_line   : 55
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xec>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x597): _IO_read_base
    <232>   DW_AT_decl_file   : 8
    <233>   DW_AT_decl_line   : 56
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xec>
    <239>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x78d): _IO_write_base
    <241>   DW_AT_decl_file   : 8
    <242>   DW_AT_decl_line   : 57
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xec>
    <248>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0xf24): _IO_write_ptr
    <250>   DW_AT_decl_file   : 8
    <251>   DW_AT_decl_line   : 58
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xec>
    <257>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_end
    <25f>   DW_AT_decl_file   : 8
    <260>   DW_AT_decl_line   : 59
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xec>
    <266>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xda4): _IO_buf_base
    <26e>   DW_AT_decl_file   : 8
    <26f>   DW_AT_decl_line   : 60
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xec>
    <275>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0xc8): _IO_buf_end
    <27d>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 61
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xec>
    <284>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x89f): _IO_save_base
    <28c>   DW_AT_decl_file   : 8
    <28d>   DW_AT_decl_line   : 64
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xec>
    <293>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0x46f): _IO_backup_base
    <29b>   DW_AT_decl_file   : 8
    <29c>   DW_AT_decl_line   : 65
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xec>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x36d): _IO_save_end
    <2aa>   DW_AT_decl_file   : 8
    <2ab>   DW_AT_decl_line   : 66
    <2ac>   DW_AT_decl_column : 9
    <2ad>   DW_AT_type        : <0xec>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x1ee): _markers
    <2b9>   DW_AT_decl_file   : 8
    <2ba>   DW_AT_decl_line   : 68
    <2bb>   DW_AT_decl_column : 22
    <2bc>   DW_AT_type        : <0x3ce>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x1169): _chain
    <2c8>   DW_AT_decl_file   : 8
    <2c9>   DW_AT_decl_line   : 70
    <2ca>   DW_AT_decl_column : 20
    <2cb>   DW_AT_type        : <0x3d4>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x4d0): _fileno
    <2d7>   DW_AT_decl_file   : 8
    <2d8>   DW_AT_decl_line   : 72
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x70>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x1186): _flags2
    <2e6>   DW_AT_decl_file   : 8
    <2e7>   DW_AT_decl_line   : 73
    <2e8>   DW_AT_decl_column : 7
    <2e9>   DW_AT_type        : <0x70>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x1e2): _old_offset
    <2f5>   DW_AT_decl_file   : 8
    <2f6>   DW_AT_decl_line   : 74
    <2f7>   DW_AT_decl_column : 11
    <2f8>   DW_AT_type        : <0xae>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x11bd): _cur_column
    <304>   DW_AT_decl_file   : 8
    <305>   DW_AT_decl_line   : 77
    <306>   DW_AT_decl_column : 18
    <307>   DW_AT_type        : <0x24>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xa4b): _vtable_offset
    <313>   DW_AT_decl_file   : 8
    <314>   DW_AT_decl_line   : 78
    <315>   DW_AT_decl_column : 15
    <316>   DW_AT_type        : <0x3e>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x74): _shortbuf
    <322>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 79
    <324>   DW_AT_decl_column : 8
    <325>   DW_AT_type        : <0x3da>
    <329>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0xdd7): _lock
    <331>   DW_AT_decl_file   : 8
    <332>   DW_AT_decl_line   : 81
    <333>   DW_AT_decl_column : 15
    <334>   DW_AT_type        : <0x3ea>
    <338>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x495): _offset
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 89
    <342>   DW_AT_decl_column : 13
    <343>   DW_AT_type        : <0xc1>
    <347>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0x1069): _codecvt
    <34f>   DW_AT_decl_file   : 8
    <350>   DW_AT_decl_line   : 91
    <351>   DW_AT_decl_column : 23
    <352>   DW_AT_type        : <0x3f6>
    <356>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xdc1): _wide_data
    <35e>   DW_AT_decl_file   : 8
    <35f>   DW_AT_decl_line   : 92
    <360>   DW_AT_decl_column : 25
    <361>   DW_AT_type        : <0x402>
    <365>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x16d): _freeres_list
    <36d>   DW_AT_decl_file   : 8
    <36e>   DW_AT_decl_line   : 93
    <36f>   DW_AT_decl_column : 20
    <370>   DW_AT_type        : <0x3d4>
    <374>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x9a2): _freeres_buf
    <37c>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 94
    <37e>   DW_AT_decl_column : 9
    <37f>   DW_AT_type        : <0xd9>
    <383>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0xa26): __pad5
    <38b>   DW_AT_decl_file   : 8
    <38c>   DW_AT_decl_line   : 95
    <38d>   DW_AT_decl_column : 10
    <38e>   DW_AT_type        : <0x13a>
    <392>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0xa97): _mode
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 96
    <39c>   DW_AT_decl_column : 7
    <39d>   DW_AT_type        : <0x70>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
    <3a5>   DW_AT_name        : (indirect string, offset: 0x11ec): _unused2
    <3a9>   DW_AT_decl_file   : 8
    <3aa>   DW_AT_decl_line   : 98
    <3ab>   DW_AT_decl_column : 8
    <3ac>   DW_AT_type        : <0x408>
    <3b0>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3b3>: Abbrev Number: 0
 <1><3b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x117b): FILE
    <3b9>   DW_AT_decl_file   : 9
    <3ba>   DW_AT_decl_line   : 7
    <3bb>   DW_AT_decl_column : 25
    <3bc>   DW_AT_type        : <0x1f3>
 <1><3c0>: Abbrev Number: 13 (DW_TAG_typedef)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x26d): _IO_lock_t
    <3c5>   DW_AT_decl_file   : 8
    <3c6>   DW_AT_decl_line   : 43
    <3c7>   DW_AT_decl_column : 14
 <1><3c8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x76a): _IO_marker
    <3cd>   DW_AT_declaration : 1
 <1><3ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 4
    <3d0>   DW_AT_type        : <0x3c8>
 <1><3d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d5>   DW_AT_byte_size   : 4
    <3d6>   DW_AT_type        : <0x1f3>
 <1><3da>: Abbrev Number: 15 (DW_TAG_array_type)
    <3db>   DW_AT_type        : <0xf2>
    <3df>   DW_AT_sibling     : <0x3ea>
 <2><3e3>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3e4>   DW_AT_type        : <0x2b>
    <3e8>   DW_AT_upper_bound : 0
 <2><3e9>: Abbrev Number: 0
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3c0>
 <1><3f0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xdef): _IO_codecvt
    <3f5>   DW_AT_declaration : 1
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x3f0>
 <1><3fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3fd>   DW_AT_name        : (indirect string, offset: 0xca8): _IO_wide_data
    <401>   DW_AT_declaration : 1
 <1><402>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <403>   DW_AT_byte_size   : 4
    <404>   DW_AT_type        : <0x3fc>
 <1><408>: Abbrev Number: 15 (DW_TAG_array_type)
    <409>   DW_AT_type        : <0xf2>
    <40d>   DW_AT_sibling     : <0x418>
 <2><411>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <412>   DW_AT_type        : <0x2b>
    <416>   DW_AT_upper_bound : 39
 <2><417>: Abbrev Number: 0
 <1><418>: Abbrev Number: 11 (DW_TAG_variable)
    <419>   DW_AT_name        : (indirect string, offset: 0x5c8): stdin
    <41d>   DW_AT_decl_file   : 10
    <41e>   DW_AT_decl_line   : 137
    <41f>   DW_AT_decl_column : 14
    <420>   DW_AT_type        : <0x426>
    <424>   DW_AT_external    : 1
    <425>   DW_AT_declaration : 1
 <1><426>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <427>   DW_AT_byte_size   : 4
    <428>   DW_AT_type        : <0x3b4>
 <1><42c>: Abbrev Number: 11 (DW_TAG_variable)
    <42d>   DW_AT_name        : (indirect string, offset: 0x343): stdout
    <431>   DW_AT_decl_file   : 10
    <432>   DW_AT_decl_line   : 138
    <433>   DW_AT_decl_column : 14
    <434>   DW_AT_type        : <0x426>
    <438>   DW_AT_external    : 1
    <439>   DW_AT_declaration : 1
 <1><43a>: Abbrev Number: 11 (DW_TAG_variable)
    <43b>   DW_AT_name        : (indirect string, offset: 0xc1): stderr
    <43f>   DW_AT_decl_file   : 10
    <440>   DW_AT_decl_line   : 139
    <441>   DW_AT_decl_column : 14
    <442>   DW_AT_type        : <0x426>
    <446>   DW_AT_external    : 1
    <447>   DW_AT_declaration : 1
 <1><448>: Abbrev Number: 11 (DW_TAG_variable)
    <449>   DW_AT_name        : (indirect string, offset: 0x49d): sys_nerr
    <44d>   DW_AT_decl_file   : 11
    <44e>   DW_AT_decl_line   : 26
    <44f>   DW_AT_decl_column : 12
    <450>   DW_AT_type        : <0x70>
    <454>   DW_AT_external    : 1
    <455>   DW_AT_declaration : 1
 <1><456>: Abbrev Number: 15 (DW_TAG_array_type)
    <457>   DW_AT_type        : <0x1e7>
    <45b>   DW_AT_sibling     : <0x461>
 <2><45f>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 3 (DW_TAG_const_type)
    <462>   DW_AT_type        : <0x456>
 <1><466>: Abbrev Number: 11 (DW_TAG_variable)
    <467>   DW_AT_name        : (indirect string, offset: 0x463): sys_errlist
    <46b>   DW_AT_decl_file   : 11
    <46c>   DW_AT_decl_line   : 27
    <46d>   DW_AT_decl_column : 26
    <46e>   DW_AT_type        : <0x461>
    <472>   DW_AT_external    : 1
    <473>   DW_AT_declaration : 1
 <1><474>: Abbrev Number: 11 (DW_TAG_variable)
    <475>   DW_AT_name        : (indirect string, offset: 0x212): _sys_nerr
    <479>   DW_AT_decl_file   : 11
    <47a>   DW_AT_decl_line   : 30
    <47b>   DW_AT_decl_column : 12
    <47c>   DW_AT_type        : <0x70>
    <480>   DW_AT_external    : 1
    <481>   DW_AT_declaration : 1
 <1><482>: Abbrev Number: 11 (DW_TAG_variable)
    <483>   DW_AT_name        : (indirect string, offset: 0x10f8): _sys_errlist
    <487>   DW_AT_decl_file   : 11
    <488>   DW_AT_decl_line   : 31
    <489>   DW_AT_decl_column : 26
    <48a>   DW_AT_type        : <0x461>
    <48e>   DW_AT_external    : 1
    <48f>   DW_AT_declaration : 1
 <1><490>: Abbrev Number: 11 (DW_TAG_variable)
    <491>   DW_AT_name        : (indirect string, offset: 0x1151): program_invocation_name
    <495>   DW_AT_decl_file   : 12
    <496>   DW_AT_decl_line   : 45
    <497>   DW_AT_decl_column : 14
    <498>   DW_AT_type        : <0xec>
    <49c>   DW_AT_external    : 1
    <49d>   DW_AT_declaration : 1
 <1><49e>: Abbrev Number: 11 (DW_TAG_variable)
    <49f>   DW_AT_name        : (indirect string, offset: 0xa3): program_invocation_short_name
    <4a3>   DW_AT_decl_file   : 12
    <4a4>   DW_AT_decl_line   : 46
    <4a5>   DW_AT_decl_column : 14
    <4a6>   DW_AT_type        : <0xec>
    <4aa>   DW_AT_external    : 1
    <4ab>   DW_AT_declaration : 1
 <1><4ac>: Abbrev Number: 15 (DW_TAG_array_type)
    <4ad>   DW_AT_type        : <0xec>
    <4b1>   DW_AT_sibling     : <0x4bc>
 <2><4b5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4b6>   DW_AT_type        : <0x2b>
    <4ba>   DW_AT_upper_bound : 1
 <2><4bb>: Abbrev Number: 0
 <1><4bc>: Abbrev Number: 11 (DW_TAG_variable)
    <4bd>   DW_AT_name        : (indirect string, offset: 0xf01): __tzname
    <4c1>   DW_AT_decl_file   : 13
    <4c2>   DW_AT_decl_line   : 159
    <4c3>   DW_AT_decl_column : 14
    <4c4>   DW_AT_type        : <0x4ac>
    <4c8>   DW_AT_external    : 1
    <4c9>   DW_AT_declaration : 1
 <1><4ca>: Abbrev Number: 11 (DW_TAG_variable)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x70f): __daylight
    <4cf>   DW_AT_decl_file   : 13
    <4d0>   DW_AT_decl_line   : 160
    <4d1>   DW_AT_decl_column : 12
    <4d2>   DW_AT_type        : <0x70>
    <4d6>   DW_AT_external    : 1
    <4d7>   DW_AT_declaration : 1
 <1><4d8>: Abbrev Number: 11 (DW_TAG_variable)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x2fa): __timezone
    <4dd>   DW_AT_decl_file   : 13
    <4de>   DW_AT_decl_line   : 161
    <4df>   DW_AT_decl_column : 17
    <4e0>   DW_AT_type        : <0xba>
    <4e4>   DW_AT_external    : 1
    <4e5>   DW_AT_declaration : 1
 <1><4e6>: Abbrev Number: 11 (DW_TAG_variable)
    <4e7>   DW_AT_name        : (indirect string, offset: 0xe6f): tzname
    <4eb>   DW_AT_decl_file   : 13
    <4ec>   DW_AT_decl_line   : 166
    <4ed>   DW_AT_decl_column : 14
    <4ee>   DW_AT_type        : <0x4ac>
    <4f2>   DW_AT_external    : 1
    <4f3>   DW_AT_declaration : 1
 <1><4f4>: Abbrev Number: 11 (DW_TAG_variable)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x1072): daylight
    <4f9>   DW_AT_decl_file   : 13
    <4fa>   DW_AT_decl_line   : 174
    <4fb>   DW_AT_decl_column : 12
    <4fc>   DW_AT_type        : <0x70>
    <500>   DW_AT_external    : 1
    <501>   DW_AT_declaration : 1
 <1><502>: Abbrev Number: 11 (DW_TAG_variable)
    <503>   DW_AT_name        : (indirect string, offset: 0xb3d): timezone
    <507>   DW_AT_decl_file   : 13
    <508>   DW_AT_decl_line   : 175
    <509>   DW_AT_decl_column : 17
    <50a>   DW_AT_type        : <0xba>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 10 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0x17b): getdate_err
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 274
    <518>   DW_AT_decl_column : 12
    <519>   DW_AT_type        : <0x70>
    <51d>   DW_AT_external    : 1
    <51e>   DW_AT_declaration : 1
 <1><51f>: Abbrev Number: 11 (DW_TAG_variable)
    <520>   DW_AT_name        : (indirect string, offset: 0x10b0): debug_flag
    <524>   DW_AT_decl_file   : 14
    <525>   DW_AT_decl_line   : 20
    <526>   DW_AT_decl_column : 13
    <527>   DW_AT_type        : <0x52d>
    <52b>   DW_AT_external    : 1
    <52c>   DW_AT_declaration : 1
 <1><52d>: Abbrev Number: 2 (DW_TAG_base_type)
    <52e>   DW_AT_byte_size   : 1
    <52f>   DW_AT_encoding    : 2	(boolean)
    <530>   DW_AT_name        : (indirect string, offset: 0x5a5): _Bool
 <1><534>: Abbrev Number: 3 (DW_TAG_const_type)
    <535>   DW_AT_type        : <0x52d>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0xf14): __kernel_long_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 15
    <540>   DW_AT_decl_column : 15
    <541>   DW_AT_type        : <0xba>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x3c): __kernel_ulong_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 16
    <54c>   DW_AT_decl_column : 23
    <54d>   DW_AT_type        : <0x37>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x8fa): kernel_long_t
    <556>   DW_AT_decl_file   : 16
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 25
    <559>   DW_AT_type        : <0x539>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x568): kernel_ulong_t
    <562>   DW_AT_decl_file   : 16
    <563>   DW_AT_decl_line   : 17
    <564>   DW_AT_decl_column : 26
    <565>   DW_AT_type        : <0x545>
 <1><569>: Abbrev Number: 3 (DW_TAG_const_type)
    <56a>   DW_AT_type        : <0x55d>
 <1><56e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56f>   DW_AT_name        : (indirect string, offset: 0xbe1): list_item
    <573>   DW_AT_byte_size   : 8
    <574>   DW_AT_decl_file   : 17
    <575>   DW_AT_decl_line   : 92
    <576>   DW_AT_decl_column : 8
    <577>   DW_AT_sibling     : <0x59a>
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x268): prev
    <580>   DW_AT_decl_file   : 17
    <581>   DW_AT_decl_line   : 93
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x59a>
    <587>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58a>: Abbrev Number: 9 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x157): next
    <58f>   DW_AT_decl_file   : 17
    <590>   DW_AT_decl_line   : 94
    <591>   DW_AT_decl_column : 20
    <592>   DW_AT_type        : <0x59a>
    <596>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59b>   DW_AT_byte_size   : 4
    <59c>   DW_AT_type        : <0x56e>
 <1><5a0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x21c): sysent
    <5a5>   DW_AT_byte_size   : 20
    <5a6>   DW_AT_decl_file   : 18
    <5a7>   DW_AT_decl_line   : 13
    <5a8>   DW_AT_decl_column : 16
    <5a9>   DW_AT_sibling     : <0x5f9>
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xbbd): nargs
    <5b2>   DW_AT_decl_file   : 18
    <5b3>   DW_AT_decl_line   : 14
    <5b4>   DW_AT_decl_column : 11
    <5b5>   DW_AT_type        : <0x2b>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0xc20): sys_flags
    <5c1>   DW_AT_decl_file   : 18
    <5c2>   DW_AT_decl_line   : 15
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x70>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cb>: Abbrev Number: 18 (DW_TAG_member)
    <5cc>   DW_AT_name        : sen
    <5d0>   DW_AT_decl_file   : 18
    <5d1>   DW_AT_decl_line   : 16
    <5d2>   DW_AT_decl_column : 6
    <5d3>   DW_AT_type        : <0x70>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0xc3f): sys_func
    <5df>   DW_AT_decl_file   : 18
    <5e0>   DW_AT_decl_line   : 17
    <5e1>   DW_AT_decl_column : 8
    <5e2>   DW_AT_type        : <0x860>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e9>: Abbrev Number: 9 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x5f9): sys_name
    <5ee>   DW_AT_decl_file   : 18
    <5ef>   DW_AT_decl_line   : 18
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x1e1>
    <5f5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f8>: Abbrev Number: 0
 <1><5f9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fa>   DW_AT_prototyped  : 1
    <5fb>   DW_AT_type        : <0x70>
    <5ff>   DW_AT_sibling     : <0x609>
 <2><603>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x609>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 4
    <60b>   DW_AT_type        : <0x614>
 <1><60f>: Abbrev Number: 3 (DW_TAG_const_type)
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 21 (DW_TAG_structure_type)
    <615>   DW_AT_name        : tcb
    <619>   DW_AT_byte_size   : 204
    <61a>   DW_AT_decl_file   : 19
    <61b>   DW_AT_decl_line   : 262
    <61d>   DW_AT_decl_column : 8
    <61e>   DW_AT_sibling     : <0x860>
 <2><622>: Abbrev Number: 22 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x111): flags
    <627>   DW_AT_decl_file   : 19
    <628>   DW_AT_decl_line   : 263
    <62a>   DW_AT_decl_column : 6
    <62b>   DW_AT_type        : <0x70>
    <62f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><632>: Abbrev Number: 23 (DW_TAG_member)
    <633>   DW_AT_name        : pid
    <637>   DW_AT_decl_file   : 19
    <638>   DW_AT_decl_line   : 264
    <63a>   DW_AT_decl_column : 6
    <63b>   DW_AT_type        : <0x70>
    <63f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><642>: Abbrev Number: 22 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x3dc): qual_flg
    <647>   DW_AT_decl_file   : 19
    <648>   DW_AT_decl_line   : 265
    <64a>   DW_AT_decl_column : 6
    <64b>   DW_AT_type        : <0x70>
    <64f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><652>: Abbrev Number: 22 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x412): currpers
    <657>   DW_AT_decl_file   : 19
    <658>   DW_AT_decl_line   : 267
    <65a>   DW_AT_decl_column : 15
    <65b>   DW_AT_type        : <0x2b>
    <65f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><662>: Abbrev Number: 22 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0x743): u_error
    <667>   DW_AT_decl_file   : 19
    <668>   DW_AT_decl_line   : 269
    <66a>   DW_AT_decl_column : 16
    <66b>   DW_AT_type        : <0x37>
    <66f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><672>: Abbrev Number: 22 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x6b2): scno
    <677>   DW_AT_decl_file   : 19
    <678>   DW_AT_decl_line   : 270
    <67a>   DW_AT_decl_column : 17
    <67b>   DW_AT_type        : <0x55d>
    <67f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><682>: Abbrev Number: 22 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0x323): true_scno
    <687>   DW_AT_decl_file   : 19
    <688>   DW_AT_decl_line   : 271
    <68a>   DW_AT_decl_column : 17
    <68b>   DW_AT_type        : <0x55d>
    <68f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><692>: Abbrev Number: 22 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x1105): u_arg
    <697>   DW_AT_decl_file   : 19
    <698>   DW_AT_decl_line   : 272
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x990>
    <69f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a2>: Abbrev Number: 22 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x3eb): u_rval
    <6a7>   DW_AT_decl_file   : 19
    <6a8>   DW_AT_decl_line   : 273
    <6aa>   DW_AT_decl_column : 16
    <6ab>   DW_AT_type        : <0x551>
    <6af>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b2>: Abbrev Number: 22 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0x23c): sys_func_rval
    <6b7>   DW_AT_decl_file   : 19
    <6b8>   DW_AT_decl_line   : 274
    <6ba>   DW_AT_decl_column : 6
    <6bb>   DW_AT_type        : <0x70>
    <6bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c2>: Abbrev Number: 22 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x166): curcol
    <6c7>   DW_AT_decl_file   : 19
    <6c8>   DW_AT_decl_line   : 275
    <6ca>   DW_AT_decl_column : 6
    <6cb>   DW_AT_type        : <0x70>
    <6cf>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d2>: Abbrev Number: 22 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0xcd7): outf
    <6d7>   DW_AT_decl_file   : 19
    <6d8>   DW_AT_decl_line   : 276
    <6da>   DW_AT_decl_column : 8
    <6db>   DW_AT_type        : <0x426>
    <6df>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e2>: Abbrev Number: 22 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0xd31): staged_output_data
    <6e7>   DW_AT_decl_file   : 19
    <6e8>   DW_AT_decl_line   : 277
    <6ea>   DW_AT_decl_column : 29
    <6eb>   DW_AT_type        : <0x9a6>
    <6ef>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f2>: Abbrev Number: 22 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xe7): auxstr
    <6f7>   DW_AT_decl_file   : 19
    <6f8>   DW_AT_decl_line   : 279
    <6fa>   DW_AT_decl_column : 14
    <6fb>   DW_AT_type        : <0x1e1>
    <6ff>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><702>: Abbrev Number: 22 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0xf92): _priv_data
    <707>   DW_AT_decl_file   : 19
    <708>   DW_AT_decl_line   : 280
    <70a>   DW_AT_decl_column : 8
    <70b>   DW_AT_type        : <0xd9>
    <70f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><712>: Abbrev Number: 22 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xae2): _free_priv_data
    <717>   DW_AT_decl_file   : 19
    <718>   DW_AT_decl_line   : 281
    <71a>   DW_AT_decl_column : 9
    <71b>   DW_AT_type        : <0x9b8>
    <71f>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><722>: Abbrev Number: 22 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x1180): s_ent
    <727>   DW_AT_decl_file   : 19
    <728>   DW_AT_decl_line   : 282
    <72a>   DW_AT_decl_column : 23
    <72b>   DW_AT_type        : <0x9be>
    <72f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><732>: Abbrev Number: 22 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x4ea): s_prev_ent
    <737>   DW_AT_decl_file   : 19
    <738>   DW_AT_decl_line   : 285
    <73a>   DW_AT_decl_column : 23
    <73b>   DW_AT_type        : <0x9be>
    <73f>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x654): inject_vec
    <747>   DW_AT_decl_file   : 19
    <748>   DW_AT_decl_line   : 286
    <74a>   DW_AT_decl_column : 22
    <74b>   DW_AT_type        : <0x9c9>
    <74f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0xa3f): stime
    <757>   DW_AT_decl_file   : 19
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x14b>
    <75f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><762>: Abbrev Number: 22 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x24a): ltime
    <767>   DW_AT_decl_file   : 19
    <768>   DW_AT_decl_line   : 288
    <76a>   DW_AT_decl_column : 18
    <76b>   DW_AT_type        : <0x14b>
    <76f>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0x11a2): atime
    <777>   DW_AT_decl_file   : 19
    <778>   DW_AT_decl_line   : 289
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x14b>
    <77f>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><782>: Abbrev Number: 22 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x9ef): etime
    <787>   DW_AT_decl_file   : 19
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x14b>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><793>: Abbrev Number: 22 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xe00): delay_expiration_time
    <798>   DW_AT_decl_file   : 19
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x14b>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a4>: Abbrev Number: 22 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x72b): pid_ns
    <7a9>   DW_AT_decl_file   : 19
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b5>: Abbrev Number: 22 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xce9): last_dirfd
    <7ba>   DW_AT_decl_file   : 19
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x70>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c6>: Abbrev Number: 22 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0x3cb): mmap_cache
    <7cb>   DW_AT_decl_file   : 19
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9e5>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d7>: Abbrev Number: 22 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb25): wait_data_idx
    <7dc>   DW_AT_decl_file   : 19
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x13a>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e8>: Abbrev Number: 22 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x18e): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 19
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0x9f1>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7f9>: Abbrev Number: 22 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xc16): wait_list
    <7fe>   DW_AT_decl_file   : 19
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x56e>
    <806>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80a>: Abbrev Number: 22 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x4a6): vcpu_info_list
    <80f>   DW_AT_decl_file   : 19
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0x9fd>
    <817>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81b>: Abbrev Number: 22 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x1049): unwind_ctx
    <820>   DW_AT_decl_file   : 19
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xd9>
    <828>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82c>: Abbrev Number: 22 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0xc93): unwind_queue
    <831>   DW_AT_decl_file   : 19
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0xa09>
    <839>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83d>: Abbrev Number: 22 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x11a8): comm
    <842>   DW_AT_decl_file   : 19
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0xa0f>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84e>: Abbrev Number: 22 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0xb33): start_prc
    <853>   DW_AT_decl_file   : 19
    <854>   DW_AT_decl_line   : 329
    <856>   DW_AT_decl_column : 16
    <857>   DW_AT_type        : <0x37>
    <85b>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><85f>: Abbrev Number: 0
 <1><860>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <861>   DW_AT_byte_size   : 4
    <862>   DW_AT_type        : <0x5f9>
 <1><866>: Abbrev Number: 4 (DW_TAG_typedef)
    <867>   DW_AT_name        : (indirect string, offset: 0x7f5): struct_sysent
    <86b>   DW_AT_decl_file   : 18
    <86c>   DW_AT_decl_line   : 19
    <86d>   DW_AT_decl_column : 3
    <86e>   DW_AT_type        : <0x5a0>
 <1><872>: Abbrev Number: 3 (DW_TAG_const_type)
    <873>   DW_AT_type        : <0x866>
 <1><877>: Abbrev Number: 11 (DW_TAG_variable)
    <878>   DW_AT_name        : (indirect string, offset: 0xe5b): current_personality
    <87c>   DW_AT_decl_file   : 19
    <87d>   DW_AT_decl_line   : 158
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x2b>
    <883>   DW_AT_external    : 1
    <884>   DW_AT_declaration : 1
 <1><885>: Abbrev Number: 11 (DW_TAG_variable)
    <886>   DW_AT_name        : (indirect string, offset: 0x91f): current_wordsize
    <88a>   DW_AT_decl_file   : 19
    <88b>   DW_AT_decl_line   : 171
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x2b>
    <891>   DW_AT_external    : 1
    <892>   DW_AT_declaration : 1
 <1><893>: Abbrev Number: 11 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0x4b5): current_klongsize
    <898>   DW_AT_decl_file   : 19
    <899>   DW_AT_decl_line   : 176
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x2b>
    <89f>   DW_AT_external    : 1
    <8a0>   DW_AT_declaration : 1
 <1><8a1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xbf6): ioctlent
    <8a6>   DW_AT_byte_size   : 8
    <8a7>   DW_AT_decl_file   : 19
    <8a8>   DW_AT_decl_line   : 217
    <8a9>   DW_AT_decl_column : 16
    <8aa>   DW_AT_sibling     : <0x8cd>
 <2><8ae>: Abbrev Number: 9 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0x1a0): symbol
    <8b3>   DW_AT_decl_file   : 19
    <8b4>   DW_AT_decl_line   : 218
    <8b5>   DW_AT_decl_column : 14
    <8b6>   DW_AT_type        : <0x1e1>
    <8ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8bd>: Abbrev Number: 9 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x37): code
    <8c2>   DW_AT_decl_file   : 19
    <8c3>   DW_AT_decl_line   : 219
    <8c4>   DW_AT_decl_column : 15
    <8c5>   DW_AT_type        : <0x2b>
    <8c9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8cc>: Abbrev Number: 0
 <1><8cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x77d): struct_ioctlent
    <8d2>   DW_AT_decl_file   : 19
    <8d3>   DW_AT_decl_line   : 220
    <8d4>   DW_AT_decl_column : 3
    <8d5>   DW_AT_type        : <0x8a1>
 <1><8d9>: Abbrev Number: 3 (DW_TAG_const_type)
    <8da>   DW_AT_type        : <0x8cd>
 <1><8de>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8df>   DW_AT_name        : (indirect string, offset: 0x11e0): inject_data
    <8e3>   DW_AT_byte_size   : 10
    <8e4>   DW_AT_decl_file   : 19
    <8e5>   DW_AT_decl_line   : 241
    <8e6>   DW_AT_decl_column : 8
    <8e7>   DW_AT_sibling     : <0x946>
 <2><8eb>: Abbrev Number: 9 (DW_TAG_member)
    <8ec>   DW_AT_name        : (indirect string, offset: 0x111): flags
    <8f0>   DW_AT_decl_file   : 19
    <8f1>   DW_AT_decl_line   : 242
    <8f2>   DW_AT_decl_column : 10
    <8f3>   DW_AT_type        : <0x10a>
    <8f7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8fa>: Abbrev Number: 9 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x908): signo
    <8ff>   DW_AT_decl_file   : 19
    <900>   DW_AT_decl_line   : 243
    <901>   DW_AT_decl_column : 10
    <902>   DW_AT_type        : <0x10a>
    <906>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><909>: Abbrev Number: 9 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0x10bb): rval_idx
    <90e>   DW_AT_decl_file   : 19
    <90f>   DW_AT_decl_line   : 244
    <910>   DW_AT_decl_column : 11
    <911>   DW_AT_type        : <0x116>
    <915>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><918>: Abbrev Number: 9 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0x48b): delay_idx
    <91d>   DW_AT_decl_file   : 19
    <91e>   DW_AT_decl_line   : 245
    <91f>   DW_AT_decl_column : 11
    <920>   DW_AT_type        : <0x116>
    <924>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><927>: Abbrev Number: 9 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0xd9b): poke_idx
    <92c>   DW_AT_decl_file   : 19
    <92d>   DW_AT_decl_line   : 246
    <92e>   DW_AT_decl_column : 11
    <92f>   DW_AT_type        : <0x116>
    <933>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><936>: Abbrev Number: 9 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x6b2): scno
    <93b>   DW_AT_decl_file   : 19
    <93c>   DW_AT_decl_line   : 247
    <93d>   DW_AT_decl_column : 11
    <93e>   DW_AT_type        : <0x116>
    <942>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><945>: Abbrev Number: 0
 <1><946>: Abbrev Number: 8 (DW_TAG_structure_type)
    <947>   DW_AT_name        : (indirect string, offset: 0x4f5): inject_opts
    <94b>   DW_AT_byte_size   : 16
    <94c>   DW_AT_decl_file   : 19
    <94d>   DW_AT_decl_line   : 250
    <94e>   DW_AT_decl_column : 8
    <94f>   DW_AT_sibling     : <0x990>
 <2><953>: Abbrev Number: 9 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0xf6e): first
    <958>   DW_AT_decl_file   : 19
    <959>   DW_AT_decl_line   : 251
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0x116>
    <95f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><962>: Abbrev Number: 9 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0x32): last
    <967>   DW_AT_decl_file   : 19
    <968>   DW_AT_decl_line   : 252
    <969>   DW_AT_decl_column : 11
    <96a>   DW_AT_type        : <0x116>
    <96e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><971>: Abbrev Number: 9 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x998): step
    <976>   DW_AT_decl_file   : 19
    <977>   DW_AT_decl_line   : 253
    <978>   DW_AT_decl_column : 11
    <979>   DW_AT_type        : <0x116>
    <97d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><980>: Abbrev Number: 9 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x7b5): data
    <985>   DW_AT_decl_file   : 19
    <986>   DW_AT_decl_line   : 254
    <987>   DW_AT_decl_column : 21
    <988>   DW_AT_type        : <0x8de>
    <98c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><98f>: Abbrev Number: 0
 <1><990>: Abbrev Number: 15 (DW_TAG_array_type)
    <991>   DW_AT_type        : <0x55d>
    <995>   DW_AT_sibling     : <0x9a0>
 <2><999>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <99a>   DW_AT_type        : <0x2b>
    <99e>   DW_AT_upper_bound : 5
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9a1>   DW_AT_name        : (indirect string, offset: 0xd31): staged_output_data
    <9a5>   DW_AT_declaration : 1
 <1><9a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x9a0>
 <1><9ac>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9ad>   DW_AT_prototyped  : 1
    <9ae>   DW_AT_sibling     : <0x9b8>
 <2><9b2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9b3>   DW_AT_type        : <0xd9>
 <2><9b7>: Abbrev Number: 0
 <1><9b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x9ac>
 <1><9be>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bf>   DW_AT_byte_size   : 4
    <9c0>   DW_AT_type        : <0x872>
 <1><9c4>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c5>   DW_AT_type        : <0x9be>
 <1><9c9>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ca>   DW_AT_type        : <0x9d9>
    <9ce>   DW_AT_sibling     : <0x9d9>
 <2><9d2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9d3>   DW_AT_type        : <0x2b>
    <9d7>   DW_AT_upper_bound : 2
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9da>   DW_AT_byte_size   : 4
    <9db>   DW_AT_type        : <0x946>
 <1><9df>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x104): mmap_cache_t
    <9e4>   DW_AT_declaration : 1
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x9df>
 <1><9eb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xf32): tcb_wait_data
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x7e): vcpu_info
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0xee): unwind_queue_t
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 15 (DW_TAG_array_type)
    <a10>   DW_AT_type        : <0xf2>
    <a14>   DW_AT_sibling     : <0xa1f>
 <2><a18>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a19>   DW_AT_type        : <0x2b>
    <a1d>   DW_AT_upper_bound : 15
 <2><a1e>: Abbrev Number: 0
 <1><a1f>: Abbrev Number: 10 (DW_TAG_variable)
    <a20>   DW_AT_name        : (indirect string, offset: 0xbc3): stub_sysent
    <a24>   DW_AT_decl_file   : 19
    <a25>   DW_AT_decl_line   : 403
    <a27>   DW_AT_decl_column : 28
    <a28>   DW_AT_type        : <0x872>
    <a2c>   DW_AT_external    : 1
    <a2d>   DW_AT_declaration : 1
 <1><a2e>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x3f2): xlat_type
    <a33>   DW_AT_encoding    : 7	(unsigned)
    <a34>   DW_AT_byte_size   : 4
    <a35>   DW_AT_type        : <0x2b>
    <a39>   DW_AT_decl_file   : 20
    <a3a>   DW_AT_decl_line   : 13
    <a3b>   DW_AT_decl_column : 6
    <a3c>   DW_AT_sibling     : <0xa53>
 <2><a40>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0xb1b): XT_NORMAL
    <a45>   DW_AT_const_value : 0
 <2><a46>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0xd6f): XT_SORTED
    <a4b>   DW_AT_const_value : 1
 <2><a4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x458): XT_INDEXED
    <a51>   DW_AT_const_value : 2
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a54>   DW_AT_name        : (indirect string, offset: 0x122): xlat_style
    <a58>   DW_AT_encoding    : 7	(unsigned)
    <a59>   DW_AT_byte_size   : 4
    <a5a>   DW_AT_type        : <0x2b>
    <a5e>   DW_AT_decl_file   : 20
    <a5f>   DW_AT_decl_line   : 19
    <a60>   DW_AT_decl_column : 6
    <a61>   DW_AT_sibling     : <0xa90>
 <2><a65>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0xe94): XLAT_STYLE_DEFAULT
    <a6a>   DW_AT_const_value : 0
 <2><a6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xe21): XLAT_STYLE_RAW
    <a70>   DW_AT_const_value : 1
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x6fd): XLAT_STYLE_ABBREV
    <a76>   DW_AT_const_value : 2
 <2><a77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0xd79): XLAT_STYLE_VERBOSE
    <a7c>   DW_AT_const_value : 3
 <2><a7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x732): XLAT_STYLE_FMT_X
    <a82>   DW_AT_const_value : 0
 <2><a83>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x71a): XLAT_STYLE_FMT_U
    <a88>   DW_AT_const_value : 4
 <2><a89>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x6b7): XLAT_STYLE_FMT_D
    <a8e>   DW_AT_const_value : 8
 <2><a8f>: Abbrev Number: 0
 <1><a90>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a91>   DW_AT_name        : (indirect string, offset: 0xd12): xlat_data
    <a95>   DW_AT_byte_size   : 12
    <a96>   DW_AT_decl_file   : 20
    <a97>   DW_AT_decl_line   : 51
    <a98>   DW_AT_decl_column : 8
    <a99>   DW_AT_sibling     : <0xabc>
 <2><a9d>: Abbrev Number: 18 (DW_TAG_member)
    <a9e>   DW_AT_name        : val
    <aa2>   DW_AT_decl_file   : 20
    <aa3>   DW_AT_decl_line   : 52
    <aa4>   DW_AT_decl_column : 11
    <aa5>   DW_AT_type        : <0x12e>
    <aa9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aac>: Abbrev Number: 18 (DW_TAG_member)
    <aad>   DW_AT_name        : str
    <ab1>   DW_AT_decl_file   : 20
    <ab2>   DW_AT_decl_line   : 53
    <ab3>   DW_AT_decl_column : 14
    <ab4>   DW_AT_type        : <0x1e1>
    <ab8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><abb>: Abbrev Number: 0
 <1><abc>: Abbrev Number: 3 (DW_TAG_const_type)
    <abd>   DW_AT_type        : <0xa90>
 <1><ac1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x2d): xlat
    <ac6>   DW_AT_byte_size   : 24
    <ac7>   DW_AT_decl_file   : 20
    <ac8>   DW_AT_decl_line   : 56
    <ac9>   DW_AT_decl_column : 8
    <aca>   DW_AT_sibling     : <0xb1a>
 <2><ace>: Abbrev Number: 9 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0x7b5): data
    <ad3>   DW_AT_decl_file   : 20
    <ad4>   DW_AT_decl_line   : 57
    <ad5>   DW_AT_decl_column : 26
    <ad6>   DW_AT_type        : <0xb1f>
    <ada>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><add>: Abbrev Number: 9 (DW_TAG_member)
    <ade>   DW_AT_name        : (indirect string, offset: 0x58b): flags_strsz
    <ae2>   DW_AT_decl_file   : 20
    <ae3>   DW_AT_decl_line   : 58
    <ae4>   DW_AT_decl_column : 9
    <ae5>   DW_AT_type        : <0x13a>
    <ae9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><aec>: Abbrev Number: 9 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x99d): size
    <af1>   DW_AT_decl_file   : 20
    <af2>   DW_AT_decl_line   : 59
    <af3>   DW_AT_decl_column : 11
    <af4>   DW_AT_type        : <0x122>
    <af8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><afb>: Abbrev Number: 9 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0xeca): type
    <b00>   DW_AT_decl_file   : 20
    <b01>   DW_AT_decl_line   : 60
    <b02>   DW_AT_decl_column : 17
    <b03>   DW_AT_type        : <0xa2e>
    <b07>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b0a>: Abbrev Number: 9 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0xb90): flags_mask
    <b0f>   DW_AT_decl_file   : 20
    <b10>   DW_AT_decl_line   : 61
    <b11>   DW_AT_decl_column : 11
    <b12>   DW_AT_type        : <0x12e>
    <b16>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b19>: Abbrev Number: 0
 <1><b1a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1b>   DW_AT_type        : <0xac1>
 <1><b1f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b20>   DW_AT_byte_size   : 4
    <b21>   DW_AT_type        : <0xabc>
 <1><b25>: Abbrev Number: 15 (DW_TAG_array_type)
    <b26>   DW_AT_type        : <0xb1a>
    <b2a>   DW_AT_sibling     : <0xb30>
 <2><b2e>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b2f>: Abbrev Number: 0
 <1><b30>: Abbrev Number: 3 (DW_TAG_const_type)
    <b31>   DW_AT_type        : <0xb25>
 <1><b35>: Abbrev Number: 10 (DW_TAG_variable)
    <b36>   DW_AT_name        : (indirect string, offset: 0xcf4): addrfams
    <b3a>   DW_AT_decl_file   : 19
    <b3b>   DW_AT_decl_line   : 409
    <b3d>   DW_AT_decl_column : 26
    <b3e>   DW_AT_type        : <0xb30>
    <b42>   DW_AT_external    : 1
    <b43>   DW_AT_declaration : 1
 <1><b44>: Abbrev Number: 10 (DW_TAG_variable)
    <b45>   DW_AT_name        : (indirect string, offset: 0x35a): arp_hardware_types
    <b49>   DW_AT_decl_file   : 19
    <b4a>   DW_AT_decl_line   : 410
    <b4c>   DW_AT_decl_column : 26
    <b4d>   DW_AT_type        : <0xb30>
    <b51>   DW_AT_external    : 1
    <b52>   DW_AT_declaration : 1
 <1><b53>: Abbrev Number: 10 (DW_TAG_variable)
    <b54>   DW_AT_name        : (indirect string, offset: 0x11f5): at_flags
    <b58>   DW_AT_decl_file   : 19
    <b59>   DW_AT_decl_line   : 411
    <b5b>   DW_AT_decl_column : 26
    <b5c>   DW_AT_type        : <0xb30>
    <b60>   DW_AT_external    : 1
    <b61>   DW_AT_declaration : 1
 <1><b62>: Abbrev Number: 10 (DW_TAG_variable)
    <b63>   DW_AT_name        : (indirect string, offset: 0xbeb): clocknames
    <b67>   DW_AT_decl_file   : 19
    <b68>   DW_AT_decl_line   : 412
    <b6a>   DW_AT_decl_column : 26
    <b6b>   DW_AT_type        : <0xb30>
    <b6f>   DW_AT_external    : 1
    <b70>   DW_AT_declaration : 1
 <1><b71>: Abbrev Number: 10 (DW_TAG_variable)
    <b72>   DW_AT_name        : (indirect string, offset: 0xcdc): dirent_types
    <b76>   DW_AT_decl_file   : 19
    <b77>   DW_AT_decl_line   : 413
    <b79>   DW_AT_decl_column : 26
    <b7a>   DW_AT_type        : <0xb30>
    <b7e>   DW_AT_external    : 1
    <b7f>   DW_AT_declaration : 1
 <1><b80>: Abbrev Number: 10 (DW_TAG_variable)
    <b81>   DW_AT_name        : (indirect string, offset: 0x6ea): ethernet_protocols
    <b85>   DW_AT_decl_file   : 19
    <b86>   DW_AT_decl_line   : 414
    <b88>   DW_AT_decl_column : 26
    <b89>   DW_AT_type        : <0xb30>
    <b8d>   DW_AT_external    : 1
    <b8e>   DW_AT_declaration : 1
 <1><b8f>: Abbrev Number: 10 (DW_TAG_variable)
    <b90>   DW_AT_name        : (indirect string, offset: 0x5ab): inet_protocols
    <b94>   DW_AT_decl_file   : 19
    <b95>   DW_AT_decl_line   : 415
    <b97>   DW_AT_decl_column : 26
    <b98>   DW_AT_type        : <0xb30>
    <b9c>   DW_AT_external    : 1
    <b9d>   DW_AT_declaration : 1
 <1><b9e>: Abbrev Number: 10 (DW_TAG_variable)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x9e5): evdev_abs
    <ba3>   DW_AT_decl_file   : 19
    <ba4>   DW_AT_decl_line   : 416
    <ba6>   DW_AT_decl_column : 26
    <ba7>   DW_AT_type        : <0xb30>
    <bab>   DW_AT_external    : 1
    <bac>   DW_AT_declaration : 1
 <1><bad>: Abbrev Number: 10 (DW_TAG_variable)
    <bae>   DW_AT_name        : (indirect string, offset: 0x970): audit_arch
    <bb2>   DW_AT_decl_file   : 19
    <bb3>   DW_AT_decl_line   : 417
    <bb5>   DW_AT_decl_column : 26
    <bb6>   DW_AT_type        : <0xb30>
    <bba>   DW_AT_external    : 1
    <bbb>   DW_AT_declaration : 1
 <1><bbc>: Abbrev Number: 10 (DW_TAG_variable)
    <bbd>   DW_AT_name        : (indirect string, offset: 0xe39): evdev_ev
    <bc1>   DW_AT_decl_file   : 19
    <bc2>   DW_AT_decl_line   : 418
    <bc4>   DW_AT_decl_column : 26
    <bc5>   DW_AT_type        : <0xb30>
    <bc9>   DW_AT_external    : 1
    <bca>   DW_AT_declaration : 1
 <1><bcb>: Abbrev Number: 10 (DW_TAG_variable)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x5ce): iffflags
    <bd0>   DW_AT_decl_file   : 19
    <bd1>   DW_AT_decl_line   : 419
    <bd3>   DW_AT_decl_column : 26
    <bd4>   DW_AT_type        : <0xb30>
    <bd8>   DW_AT_external    : 1
    <bd9>   DW_AT_declaration : 1
 <1><bda>: Abbrev Number: 10 (DW_TAG_variable)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x82a): ip_type_of_services
    <bdf>   DW_AT_decl_file   : 19
    <be0>   DW_AT_decl_line   : 420
    <be2>   DW_AT_decl_column : 26
    <be3>   DW_AT_type        : <0xb30>
    <be7>   DW_AT_external    : 1
    <be8>   DW_AT_declaration : 1
 <1><be9>: Abbrev Number: 10 (DW_TAG_variable)
    <bea>   DW_AT_name        : (indirect string, offset: 0x441): ipc_private
    <bee>   DW_AT_decl_file   : 19
    <bef>   DW_AT_decl_line   : 421
    <bf1>   DW_AT_decl_column : 26
    <bf2>   DW_AT_type        : <0xb30>
    <bf6>   DW_AT_external    : 1
    <bf7>   DW_AT_declaration : 1
 <1><bf8>: Abbrev Number: 10 (DW_TAG_variable)
    <bf9>   DW_AT_name        : (indirect string, offset: 0xa6e): msg_flags
    <bfd>   DW_AT_decl_file   : 19
    <bfe>   DW_AT_decl_line   : 422
    <c00>   DW_AT_decl_column : 26
    <c01>   DW_AT_type        : <0xb30>
    <c05>   DW_AT_external    : 1
    <c06>   DW_AT_declaration : 1
 <1><c07>: Abbrev Number: 10 (DW_TAG_variable)
    <c08>   DW_AT_name        : (indirect string, offset: 0x278): netlink_protocols
    <c0c>   DW_AT_decl_file   : 19
    <c0d>   DW_AT_decl_line   : 423
    <c0f>   DW_AT_decl_column : 26
    <c10>   DW_AT_type        : <0xb30>
    <c14>   DW_AT_external    : 1
    <c15>   DW_AT_declaration : 1
 <1><c16>: Abbrev Number: 10 (DW_TAG_variable)
    <c17>   DW_AT_name        : (indirect string, offset: 0xc7e): nl_bridge_vlan_flags
    <c1b>   DW_AT_decl_file   : 19
    <c1c>   DW_AT_decl_line   : 424
    <c1e>   DW_AT_decl_column : 26
    <c1f>   DW_AT_type        : <0xb30>
    <c23>   DW_AT_external    : 1
    <c24>   DW_AT_declaration : 1
 <1><c25>: Abbrev Number: 10 (DW_TAG_variable)
    <c26>   DW_AT_name        : (indirect string, offset: 0xbff): nl_netfilter_msg_types
    <c2a>   DW_AT_decl_file   : 19
    <c2b>   DW_AT_decl_line   : 425
    <c2d>   DW_AT_decl_column : 26
    <c2e>   DW_AT_type        : <0xb30>
    <c32>   DW_AT_external    : 1
    <c33>   DW_AT_declaration : 1
 <1><c34>: Abbrev Number: 10 (DW_TAG_variable)
    <c35>   DW_AT_name        : (indirect string, offset: 0xd8c): nl_route_types
    <c39>   DW_AT_decl_file   : 19
    <c3a>   DW_AT_decl_line   : 426
    <c3c>   DW_AT_decl_column : 26
    <c3d>   DW_AT_type        : <0xb30>
    <c41>   DW_AT_external    : 1
    <c42>   DW_AT_declaration : 1
 <1><c43>: Abbrev Number: 10 (DW_TAG_variable)
    <c44>   DW_AT_name        : (indirect string, offset: 0x83e): open_access_modes
    <c48>   DW_AT_decl_file   : 19
    <c49>   DW_AT_decl_line   : 427
    <c4b>   DW_AT_decl_column : 26
    <c4c>   DW_AT_type        : <0xb30>
    <c50>   DW_AT_external    : 1
    <c51>   DW_AT_declaration : 1
 <1><c52>: Abbrev Number: 10 (DW_TAG_variable)
    <c53>   DW_AT_name        : (indirect string, offset: 0x864): open_mode_flags
    <c57>   DW_AT_decl_file   : 19
    <c58>   DW_AT_decl_line   : 428
    <c5a>   DW_AT_decl_column : 26
    <c5b>   DW_AT_type        : <0xb30>
    <c5f>   DW_AT_external    : 1
    <c60>   DW_AT_declaration : 1
 <1><c61>: Abbrev Number: 10 (DW_TAG_variable)
    <c62>   DW_AT_name        : (indirect string, offset: 0xb74): perf_type_id
    <c66>   DW_AT_decl_file   : 19
    <c67>   DW_AT_decl_line   : 429
    <c69>   DW_AT_decl_column : 26
    <c6a>   DW_AT_type        : <0xb30>
    <c6e>   DW_AT_external    : 1
    <c6f>   DW_AT_declaration : 1
 <1><c70>: Abbrev Number: 10 (DW_TAG_variable)
    <c71>   DW_AT_name        : (indirect string, offset: 0x3a9): pollflags
    <c75>   DW_AT_decl_file   : 19
    <c76>   DW_AT_decl_line   : 430
    <c78>   DW_AT_decl_column : 26
    <c79>   DW_AT_type        : <0xb30>
    <c7d>   DW_AT_external    : 1
    <c7e>   DW_AT_declaration : 1
 <1><c7f>: Abbrev Number: 10 (DW_TAG_variable)
    <c80>   DW_AT_name        : (indirect string, offset: 0x28a): ptrace_cmds
    <c84>   DW_AT_decl_file   : 19
    <c85>   DW_AT_decl_line   : 431
    <c87>   DW_AT_decl_column : 26
    <c88>   DW_AT_type        : <0xb30>
    <c8c>   DW_AT_external    : 1
    <c8d>   DW_AT_declaration : 1
 <1><c8e>: Abbrev Number: 10 (DW_TAG_variable)
    <c8f>   DW_AT_name        : (indirect string, offset: 0xb81): resource_flags
    <c93>   DW_AT_decl_file   : 19
    <c94>   DW_AT_decl_line   : 432
    <c96>   DW_AT_decl_column : 26
    <c97>   DW_AT_type        : <0xb30>
    <c9b>   DW_AT_external    : 1
    <c9c>   DW_AT_declaration : 1
 <1><c9d>: Abbrev Number: 10 (DW_TAG_variable)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x118e): route_nexthop_flags
    <ca2>   DW_AT_decl_file   : 19
    <ca3>   DW_AT_decl_line   : 433
    <ca5>   DW_AT_decl_column : 26
    <ca6>   DW_AT_type        : <0xb30>
    <caa>   DW_AT_external    : 1
    <cab>   DW_AT_declaration : 1
 <1><cac>: Abbrev Number: 10 (DW_TAG_variable)
    <cad>   DW_AT_name        : (indirect string, offset: 0x602): routing_protocols
    <cb1>   DW_AT_decl_file   : 19
    <cb2>   DW_AT_decl_line   : 434
    <cb4>   DW_AT_decl_column : 26
    <cb5>   DW_AT_type        : <0xb30>
    <cb9>   DW_AT_external    : 1
    <cba>   DW_AT_declaration : 1
 <1><cbb>: Abbrev Number: 10 (DW_TAG_variable)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x432): routing_scopes
    <cc0>   DW_AT_decl_file   : 19
    <cc1>   DW_AT_decl_line   : 435
    <cc3>   DW_AT_decl_column : 26
    <cc4>   DW_AT_type        : <0xb30>
    <cc8>   DW_AT_external    : 1
    <cc9>   DW_AT_declaration : 1
 <1><cca>: Abbrev Number: 10 (DW_TAG_variable)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x874): routing_table_ids
    <ccf>   DW_AT_decl_file   : 19
    <cd0>   DW_AT_decl_line   : 436
    <cd2>   DW_AT_decl_column : 26
    <cd3>   DW_AT_type        : <0xb30>
    <cd7>   DW_AT_external    : 1
    <cd8>   DW_AT_declaration : 1
 <1><cd9>: Abbrev Number: 10 (DW_TAG_variable)
    <cda>   DW_AT_name        : (indirect string, offset: 0x5ba): routing_types
    <cde>   DW_AT_decl_file   : 19
    <cdf>   DW_AT_decl_line   : 437
    <ce1>   DW_AT_decl_column : 26
    <ce2>   DW_AT_type        : <0xb30>
    <ce6>   DW_AT_external    : 1
    <ce7>   DW_AT_declaration : 1
 <1><ce8>: Abbrev Number: 10 (DW_TAG_variable)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x915): rwf_flags
    <ced>   DW_AT_decl_file   : 19
    <cee>   DW_AT_decl_line   : 438
    <cf0>   DW_AT_decl_column : 26
    <cf1>   DW_AT_type        : <0xb30>
    <cf5>   DW_AT_external    : 1
    <cf6>   DW_AT_declaration : 1
 <1><cf7>: Abbrev Number: 10 (DW_TAG_variable)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xcfd): seccomp_filter_flags
    <cfc>   DW_AT_decl_file   : 19
    <cfd>   DW_AT_decl_line   : 439
    <cff>   DW_AT_decl_column : 26
    <d00>   DW_AT_type        : <0xb30>
    <d04>   DW_AT_external    : 1
    <d05>   DW_AT_declaration : 1
 <1><d06>: Abbrev Number: 10 (DW_TAG_variable)
    <d07>   DW_AT_name        : (indirect string, offset: 0x501): seccomp_ret_action
    <d0b>   DW_AT_decl_file   : 19
    <d0c>   DW_AT_decl_line   : 440
    <d0e>   DW_AT_decl_column : 26
    <d0f>   DW_AT_type        : <0xb30>
    <d13>   DW_AT_external    : 1
    <d14>   DW_AT_declaration : 1
 <1><d15>: Abbrev Number: 10 (DW_TAG_variable)
    <d16>   DW_AT_name        : (indirect string, offset: 0x47f): setns_types
    <d1a>   DW_AT_decl_file   : 19
    <d1b>   DW_AT_decl_line   : 441
    <d1d>   DW_AT_decl_column : 26
    <d1e>   DW_AT_type        : <0xb30>
    <d22>   DW_AT_external    : 1
    <d23>   DW_AT_declaration : 1
 <1><d24>: Abbrev Number: 10 (DW_TAG_variable)
    <d25>   DW_AT_name        : (indirect string, offset: 0x38a): sg_io_info
    <d29>   DW_AT_decl_file   : 19
    <d2a>   DW_AT_decl_line   : 442
    <d2c>   DW_AT_decl_column : 26
    <d2d>   DW_AT_type        : <0xb30>
    <d31>   DW_AT_external    : 1
    <d32>   DW_AT_declaration : 1
 <1><d33>: Abbrev Number: 10 (DW_TAG_variable)
    <d34>   DW_AT_name        : (indirect string, offset: 0xf4f): socketlayers
    <d38>   DW_AT_decl_file   : 19
    <d39>   DW_AT_decl_line   : 443
    <d3b>   DW_AT_decl_column : 26
    <d3c>   DW_AT_type        : <0xb30>
    <d40>   DW_AT_external    : 1
    <d41>   DW_AT_declaration : 1
 <1><d42>: Abbrev Number: 10 (DW_TAG_variable)
    <d43>   DW_AT_name        : (indirect string, offset: 0x12d): socktypes
    <d47>   DW_AT_decl_file   : 19
    <d48>   DW_AT_decl_line   : 444
    <d4a>   DW_AT_decl_column : 26
    <d4b>   DW_AT_type        : <0xb30>
    <d4f>   DW_AT_external    : 1
    <d50>   DW_AT_declaration : 1
 <1><d51>: Abbrev Number: 10 (DW_TAG_variable)
    <d52>   DW_AT_name        : (indirect string, offset: 0x960): tcp_state_flags
    <d56>   DW_AT_decl_file   : 19
    <d57>   DW_AT_decl_line   : 445
    <d59>   DW_AT_decl_column : 26
    <d5a>   DW_AT_type        : <0xb30>
    <d5e>   DW_AT_external    : 1
    <d5f>   DW_AT_declaration : 1
 <1><d60>: Abbrev Number: 10 (DW_TAG_variable)
    <d61>   DW_AT_name        : (indirect string, offset: 0xb46): tcp_states
    <d65>   DW_AT_decl_file   : 19
    <d66>   DW_AT_decl_line   : 446
    <d68>   DW_AT_decl_column : 26
    <d69>   DW_AT_type        : <0xb30>
    <d6d>   DW_AT_external    : 1
    <d6e>   DW_AT_declaration : 1
 <1><d6f>: Abbrev Number: 10 (DW_TAG_variable)
    <d70>   DW_AT_name        : (indirect string, offset: 0x32d): whence_codes
    <d74>   DW_AT_decl_file   : 19
    <d75>   DW_AT_decl_line   : 447
    <d77>   DW_AT_decl_column : 26
    <d78>   DW_AT_type        : <0xb30>
    <d7c>   DW_AT_external    : 1
    <d7d>   DW_AT_declaration : 1
 <1><d7e>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d7f>   DW_AT_encoding    : 7	(unsigned)
    <d80>   DW_AT_byte_size   : 4
    <d81>   DW_AT_type        : <0x2b>
    <d85>   DW_AT_decl_file   : 19
    <d86>   DW_AT_decl_line   : 508
    <d88>   DW_AT_decl_column : 14
    <d89>   DW_AT_sibling     : <0xda0>
 <2><d8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x859): CFLAG_NONE
    <d92>   DW_AT_const_value : 0
 <2><d93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0xa78): CFLAG_ONLY_STATS
    <d98>   DW_AT_const_value : 1
 <2><d99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x6c8): CFLAG_BOTH
    <d9e>   DW_AT_const_value : 2
 <2><d9f>: Abbrev Number: 0
 <1><da0>: Abbrev Number: 28 (DW_TAG_typedef)
    <da1>   DW_AT_name        : (indirect string, offset: 0x11ad): cflag_t
    <da5>   DW_AT_decl_file   : 19
    <da6>   DW_AT_decl_line   : 512
    <da8>   DW_AT_decl_column : 3
    <da9>   DW_AT_type        : <0xd7e>
 <1><dad>: Abbrev Number: 10 (DW_TAG_variable)
    <dae>   DW_AT_name        : (indirect string, offset: 0xa45): cflag
    <db2>   DW_AT_decl_file   : 19
    <db3>   DW_AT_decl_line   : 513
    <db5>   DW_AT_decl_column : 16
    <db6>   DW_AT_type        : <0xda0>
    <dba>   DW_AT_external    : 1
    <dbb>   DW_AT_declaration : 1
 <1><dbc>: Abbrev Number: 10 (DW_TAG_variable)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xecf): Tflag
    <dc1>   DW_AT_decl_file   : 19
    <dc2>   DW_AT_decl_line   : 514
    <dc4>   DW_AT_decl_column : 13
    <dc5>   DW_AT_type        : <0x52d>
    <dc9>   DW_AT_external    : 1
    <dca>   DW_AT_declaration : 1
 <1><dcb>: Abbrev Number: 10 (DW_TAG_variable)
    <dcc>   DW_AT_name        : (indirect string, offset: 0xe4f): Tflag_scale
    <dd0>   DW_AT_decl_file   : 19
    <dd1>   DW_AT_decl_line   : 515
    <dd3>   DW_AT_decl_column : 12
    <dd4>   DW_AT_type        : <0x70>
    <dd8>   DW_AT_external    : 1
    <dd9>   DW_AT_declaration : 1
 <1><dda>: Abbrev Number: 10 (DW_TAG_variable)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x25c): Tflag_width
    <ddf>   DW_AT_decl_file   : 19
    <de0>   DW_AT_decl_line   : 516
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0x70>
    <de7>   DW_AT_external    : 1
    <de8>   DW_AT_declaration : 1
 <1><de9>: Abbrev Number: 10 (DW_TAG_variable)
    <dea>   DW_AT_name        : (indirect string, offset: 0x8ad): iflag
    <dee>   DW_AT_decl_file   : 19
    <def>   DW_AT_decl_line   : 517
    <df1>   DW_AT_decl_column : 13
    <df2>   DW_AT_type        : <0x52d>
    <df6>   DW_AT_external    : 1
    <df7>   DW_AT_declaration : 1
 <1><df8>: Abbrev Number: 10 (DW_TAG_variable)
    <df9>   DW_AT_name        : (indirect string, offset: 0x67f): count_wallclock
    <dfd>   DW_AT_decl_file   : 19
    <dfe>   DW_AT_decl_line   : 518
    <e00>   DW_AT_decl_column : 13
    <e01>   DW_AT_type        : <0x52d>
    <e05>   DW_AT_external    : 1
    <e06>   DW_AT_declaration : 1
 <1><e07>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e08>   DW_AT_name        : (indirect string, offset: 0x1c5): path_set_item
    <e0c>   DW_AT_byte_size   : 4
    <e0d>   DW_AT_decl_file   : 19
    <e0e>   DW_AT_decl_line   : 520
    <e10>   DW_AT_decl_column : 8
    <e11>   DW_AT_sibling     : <0xe26>
 <2><e15>: Abbrev Number: 22 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x64f): path
    <e1a>   DW_AT_decl_file   : 19
    <e1b>   DW_AT_decl_line   : 521
    <e1d>   DW_AT_decl_column : 14
    <e1e>   DW_AT_type        : <0x1e1>
    <e22>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e25>: Abbrev Number: 0
 <1><e26>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e27>   DW_AT_name        : (indirect string, offset: 0x676): path_set
    <e2b>   DW_AT_byte_size   : 12
    <e2c>   DW_AT_decl_file   : 19
    <e2d>   DW_AT_decl_line   : 525
    <e2f>   DW_AT_decl_column : 15
    <e30>   DW_AT_sibling     : <0xe65>
 <2><e34>: Abbrev Number: 22 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0xb9b): paths_selected
    <e39>   DW_AT_decl_file   : 19
    <e3a>   DW_AT_decl_line   : 526
    <e3c>   DW_AT_decl_column : 24
    <e3d>   DW_AT_type        : <0xe65>
    <e41>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e44>: Abbrev Number: 22 (DW_TAG_member)
    <e45>   DW_AT_name        : (indirect string, offset: 0x544): num_selected
    <e49>   DW_AT_decl_file   : 19
    <e4a>   DW_AT_decl_line   : 527
    <e4c>   DW_AT_decl_column : 9
    <e4d>   DW_AT_type        : <0x13a>
    <e51>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e54>: Abbrev Number: 22 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x99d): size
    <e59>   DW_AT_decl_file   : 19
    <e5a>   DW_AT_decl_line   : 528
    <e5c>   DW_AT_decl_column : 9
    <e5d>   DW_AT_type        : <0x13a>
    <e61>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e64>: Abbrev Number: 0
 <1><e65>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e66>   DW_AT_byte_size   : 4
    <e67>   DW_AT_type        : <0xe07>
 <1><e6b>: Abbrev Number: 10 (DW_TAG_variable)
    <e6c>   DW_AT_name        : (indirect string, offset: 0x305): global_path_set
    <e70>   DW_AT_decl_file   : 19
    <e71>   DW_AT_decl_line   : 529
    <e73>   DW_AT_decl_column : 3
    <e74>   DW_AT_type        : <0xe26>
    <e78>   DW_AT_external    : 1
    <e79>   DW_AT_declaration : 1
 <1><e7a>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7b>   DW_AT_name        : (indirect string, offset: 0xc73): xflag_opts
    <e7f>   DW_AT_encoding    : 7	(unsigned)
    <e80>   DW_AT_byte_size   : 4
    <e81>   DW_AT_type        : <0x2b>
    <e85>   DW_AT_decl_file   : 19
    <e86>   DW_AT_decl_line   : 531
    <e88>   DW_AT_decl_column : 6
    <e89>   DW_AT_sibling     : <0xeac>
 <2><e8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x1b9): HEXSTR_NONE
    <e92>   DW_AT_const_value : 0
 <2><e93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0x10da): HEXSTR_NON_ASCII
    <e98>   DW_AT_const_value : 1
 <2><e99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x532): HEXSTR_ALL
    <e9e>   DW_AT_const_value : 2
 <2><e9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x11c9): HEXSTR_NON_ASCII_CHARS
    <ea4>   DW_AT_const_value : 3
 <2><ea5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xdb1): NUM_HEXSTR_OPTS
    <eaa>   DW_AT_const_value : 4
 <2><eab>: Abbrev Number: 0
 <1><eac>: Abbrev Number: 10 (DW_TAG_variable)
    <ead>   DW_AT_name        : (indirect string, offset: 0x2ce): xflag
    <eb1>   DW_AT_decl_file   : 19
    <eb2>   DW_AT_decl_line   : 544
    <eb4>   DW_AT_decl_column : 17
    <eb5>   DW_AT_type        : <0x2b>
    <eb9>   DW_AT_external    : 1
    <eba>   DW_AT_declaration : 1
 <1><ebb>: Abbrev Number: 10 (DW_TAG_variable)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x107b): followfork
    <ec0>   DW_AT_decl_file   : 19
    <ec1>   DW_AT_decl_line   : 545
    <ec3>   DW_AT_decl_column : 13
    <ec4>   DW_AT_type        : <0x52d>
    <ec8>   DW_AT_external    : 1
    <ec9>   DW_AT_declaration : 1
 <1><eca>: Abbrev Number: 10 (DW_TAG_variable)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x145): output_separately
    <ecf>   DW_AT_decl_file   : 19
    <ed0>   DW_AT_decl_line   : 546
    <ed2>   DW_AT_decl_column : 13
    <ed3>   DW_AT_type        : <0x52d>
    <ed7>   DW_AT_external    : 1
    <ed8>   DW_AT_declaration : 1
 <1><ed9>: Abbrev Number: 10 (DW_TAG_variable)
    <eda>   DW_AT_name        : (indirect string, offset: 0x614): stack_trace_enabled
    <ede>   DW_AT_decl_file   : 19
    <edf>   DW_AT_decl_line   : 549
    <ee1>   DW_AT_decl_column : 13
    <ee2>   DW_AT_type        : <0x52d>
    <ee6>   DW_AT_external    : 1
    <ee7>   DW_AT_declaration : 1
 <1><ee8>: Abbrev Number: 10 (DW_TAG_variable)
    <ee9>   DW_AT_name        : (indirect string, offset: 0xf5c): ptrace_setoptions
    <eed>   DW_AT_decl_file   : 19
    <eee>   DW_AT_decl_line   : 553
    <ef0>   DW_AT_decl_column : 17
    <ef1>   DW_AT_type        : <0x2b>
    <ef5>   DW_AT_external    : 1
    <ef6>   DW_AT_declaration : 1
 <1><ef7>: Abbrev Number: 10 (DW_TAG_variable)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x9): max_strlen
    <efc>   DW_AT_decl_file   : 19
    <efd>   DW_AT_decl_line   : 554
    <eff>   DW_AT_decl_column : 17
    <f00>   DW_AT_type        : <0x2b>
    <f04>   DW_AT_external    : 1
    <f05>   DW_AT_declaration : 1
 <1><f06>: Abbrev Number: 10 (DW_TAG_variable)
    <f07>   DW_AT_name        : (indirect string, offset: 0x894): os_release
    <f0b>   DW_AT_decl_file   : 19
    <f0c>   DW_AT_decl_line   : 555
    <f0e>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0x2b>
    <f13>   DW_AT_external    : 1
    <f14>   DW_AT_declaration : 1
 <1><f15>: Abbrev Number: 10 (DW_TAG_variable)
    <f16>   DW_AT_name        : (indirect string, offset: 0x951): xlat_verbosity
    <f1a>   DW_AT_decl_file   : 19
    <f1b>   DW_AT_decl_line   : 917
    <f1d>   DW_AT_decl_column : 24
    <f1e>   DW_AT_type        : <0xa53>
    <f22>   DW_AT_external    : 1
    <f23>   DW_AT_declaration : 1
 <1><f24>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f25>   DW_AT_name        : (indirect string, offset: 0x97b): xlat_style_private_flag_bits
    <f29>   DW_AT_encoding    : 7	(unsigned)
    <f2a>   DW_AT_byte_size   : 4
    <f2b>   DW_AT_type        : <0x2b>
    <f2f>   DW_AT_decl_file   : 19
    <f30>   DW_AT_decl_line   : 937
    <f32>   DW_AT_decl_column : 6
    <f33>   DW_AT_sibling     : <0xf50>
 <2><f37>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0xaf2): PAF_PRINT_INDICES_BIT
    <f3c>   DW_AT_const_value : 5
 <2><f3d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x2e2): PAF_ARRAY_TRUNCATED_BIT
    <f42>   DW_AT_const_value : 6
 <2><f43>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x1114): PXF_DEFAULT_STR_BIT
    <f48>   DW_AT_const_value : 7
 <2><f49>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xd1c): SPFF_AUXSTR_MODE_BIT
    <f4e>   DW_AT_const_value : 8
 <2><f4f>: Abbrev Number: 0
 <1><f50>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f51>   DW_AT_name        : (indirect string, offset: 0x8f): find_xlat_flag_bits
    <f55>   DW_AT_encoding    : 7	(unsigned)
    <f56>   DW_AT_byte_size   : 4
    <f57>   DW_AT_type        : <0x2b>
    <f5b>   DW_AT_decl_file   : 19
    <f5c>   DW_AT_decl_line   : 1441
    <f5e>   DW_AT_decl_column : 6
    <f5f>   DW_AT_sibling     : <0xf6a>
 <2><f63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f64>   DW_AT_name        : (indirect string, offset: 0x8ce): FXL_CASE_SENSITIVE_BIT
    <f68>   DW_AT_const_value : 0
 <2><f69>: Abbrev Number: 0
 <1><f6a>: Abbrev Number: 10 (DW_TAG_variable)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x10eb): printing_tcp
    <f6f>   DW_AT_decl_file   : 19
    <f70>   DW_AT_decl_line   : 1687
    <f72>   DW_AT_decl_column : 20
    <f73>   DW_AT_type        : <0x609>
    <f77>   DW_AT_external    : 1
    <f78>   DW_AT_declaration : 1
 <1><f79>: Abbrev Number: 10 (DW_TAG_variable)
    <f7a>   DW_AT_name        : (indirect string, offset: 0xf89): errnoent
    <f7e>   DW_AT_decl_file   : 19
    <f7f>   DW_AT_decl_line   : 1885
    <f81>   DW_AT_decl_column : 26
    <f82>   DW_AT_type        : <0x461>
    <f86>   DW_AT_external    : 1
    <f87>   DW_AT_declaration : 1
 <1><f88>: Abbrev Number: 10 (DW_TAG_variable)
    <f89>   DW_AT_name        : (indirect string, offset: 0xb11): signalent
    <f8d>   DW_AT_decl_file   : 19
    <f8e>   DW_AT_decl_line   : 1886
    <f90>   DW_AT_decl_column : 26
    <f91>   DW_AT_type        : <0x461>
    <f95>   DW_AT_external    : 1
    <f96>   DW_AT_declaration : 1
 <1><f97>: Abbrev Number: 10 (DW_TAG_variable)
    <f98>   DW_AT_name        : (indirect string, offset: 0x11b5): nerrnos
    <f9c>   DW_AT_decl_file   : 19
    <f9d>   DW_AT_decl_line   : 1887
    <f9f>   DW_AT_decl_column : 27
    <fa0>   DW_AT_type        : <0x32>
    <fa4>   DW_AT_external    : 1
    <fa5>   DW_AT_declaration : 1
 <1><fa6>: Abbrev Number: 10 (DW_TAG_variable)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x4c7): nsignals
    <fab>   DW_AT_decl_file   : 19
    <fac>   DW_AT_decl_line   : 1888
    <fae>   DW_AT_decl_column : 27
    <faf>   DW_AT_type        : <0x32>
    <fb3>   DW_AT_external    : 1
    <fb4>   DW_AT_declaration : 1
 <1><fb5>: Abbrev Number: 15 (DW_TAG_array_type)
    <fb6>   DW_AT_type        : <0x872>
    <fba>   DW_AT_sibling     : <0xfc0>
 <2><fbe>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fbf>: Abbrev Number: 0
 <1><fc0>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc1>   DW_AT_type        : <0xfb5>
 <1><fc5>: Abbrev Number: 10 (DW_TAG_variable)
    <fc6>   DW_AT_name        : (indirect string, offset: 0x1086): sysent0
    <fca>   DW_AT_decl_file   : 19
    <fcb>   DW_AT_decl_line   : 1890
    <fcd>   DW_AT_decl_column : 28
    <fce>   DW_AT_type        : <0xfc0>
    <fd2>   DW_AT_external    : 1
    <fd3>   DW_AT_declaration : 1
 <1><fd4>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd5>   DW_AT_type        : <0x8d9>
    <fd9>   DW_AT_sibling     : <0xfdf>
 <2><fdd>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fde>: Abbrev Number: 0
 <1><fdf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe0>   DW_AT_type        : <0xfd4>
 <1><fe4>: Abbrev Number: 10 (DW_TAG_variable)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xf0a): ioctlent0
    <fe9>   DW_AT_decl_file   : 19
    <fea>   DW_AT_decl_line   : 1891
    <fec>   DW_AT_decl_column : 30
    <fed>   DW_AT_type        : <0xfdf>
    <ff1>   DW_AT_external    : 1
    <ff2>   DW_AT_declaration : 1
 <1><ff3>: Abbrev Number: 10 (DW_TAG_variable)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x4d8): personality_names
    <ff8>   DW_AT_decl_file   : 19
    <ff9>   DW_AT_decl_line   : 1893
    <ffb>   DW_AT_decl_column : 26
    <ffc>   DW_AT_type        : <0x461>
    <1000>   DW_AT_external    : 1
    <1001>   DW_AT_declaration : 1
 <1><1002>: Abbrev Number: 10 (DW_TAG_variable)
    <1003>   DW_AT_name        : (indirect string, offset: 0x21c): sysent
    <1007>   DW_AT_decl_file   : 19
    <1008>   DW_AT_decl_line   : 1896
    <100a>   DW_AT_decl_column : 29
    <100b>   DW_AT_type        : <0x9be>
    <100f>   DW_AT_external    : 1
    <1010>   DW_AT_declaration : 1
 <1><1011>: Abbrev Number: 10 (DW_TAG_variable)
    <1012>   DW_AT_name        : (indirect string, offset: 0xbf6): ioctlent
    <1016>   DW_AT_decl_file   : 19
    <1017>   DW_AT_decl_line   : 1897
    <1019>   DW_AT_decl_column : 31
    <101a>   DW_AT_type        : <0x1020>
    <101e>   DW_AT_external    : 1
    <101f>   DW_AT_declaration : 1
 <1><1020>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1021>   DW_AT_byte_size   : 4
    <1022>   DW_AT_type        : <0x8d9>
 <1><1026>: Abbrev Number: 10 (DW_TAG_variable)
    <1027>   DW_AT_name        : (indirect string, offset: 0x10d0): nsyscalls
    <102b>   DW_AT_decl_file   : 19
    <102c>   DW_AT_decl_line   : 1903
    <102e>   DW_AT_decl_column : 17
    <102f>   DW_AT_type        : <0x2b>
    <1033>   DW_AT_external    : 1
    <1034>   DW_AT_declaration : 1
 <1><1035>: Abbrev Number: 10 (DW_TAG_variable)
    <1036>   DW_AT_name        : (indirect string, offset: 0x207): nioctlents
    <103a>   DW_AT_decl_file   : 19
    <103b>   DW_AT_decl_line   : 1904
    <103d>   DW_AT_decl_column : 17
    <103e>   DW_AT_type        : <0x2b>
    <1042>   DW_AT_external    : 1
    <1043>   DW_AT_declaration : 1
 <1><1044>: Abbrev Number: 15 (DW_TAG_array_type)
    <1045>   DW_AT_type        : <0x32>
    <1049>   DW_AT_sibling     : <0x1054>
 <2><104d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <104e>   DW_AT_type        : <0x2b>
    <1052>   DW_AT_upper_bound : 2
 <2><1053>: Abbrev Number: 0
 <1><1054>: Abbrev Number: 3 (DW_TAG_const_type)
    <1055>   DW_AT_type        : <0x1044>
 <1><1059>: Abbrev Number: 10 (DW_TAG_variable)
    <105a>   DW_AT_name        : (indirect string, offset: 0xa9d): nsyscall_vec
    <105e>   DW_AT_decl_file   : 19
    <105f>   DW_AT_decl_line   : 1906
    <1061>   DW_AT_decl_column : 27
    <1062>   DW_AT_type        : <0x1054>
    <1066>   DW_AT_external    : 1
    <1067>   DW_AT_declaration : 1
 <1><1068>: Abbrev Number: 15 (DW_TAG_array_type)
    <1069>   DW_AT_type        : <0x9c4>
    <106d>   DW_AT_sibling     : <0x1078>
 <2><1071>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1072>   DW_AT_type        : <0x2b>
    <1076>   DW_AT_upper_bound : 2
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 3 (DW_TAG_const_type)
    <1079>   DW_AT_type        : <0x1068>
 <1><107d>: Abbrev Number: 10 (DW_TAG_variable)
    <107e>   DW_AT_name        : (indirect string, offset: 0xdcc): sysent_vec
    <1082>   DW_AT_decl_file   : 19
    <1083>   DW_AT_decl_line   : 1907
    <1085>   DW_AT_decl_column : 35
    <1086>   DW_AT_type        : <0x1078>
    <108a>   DW_AT_external    : 1
    <108b>   DW_AT_declaration : 1
 <1><108c>: Abbrev Number: 10 (DW_TAG_variable)
    <108d>   DW_AT_name        : (indirect string, offset: 0x654): inject_vec
    <1091>   DW_AT_decl_file   : 19
    <1092>   DW_AT_decl_line   : 1908
    <1094>   DW_AT_decl_column : 28
    <1095>   DW_AT_type        : <0x9c9>
    <1099>   DW_AT_external    : 1
    <109a>   DW_AT_declaration : 1
 <1><109b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <109c>   DW_AT_name        : (indirect string, offset: 0xa61): audit_arch_t
    <10a0>   DW_AT_byte_size   : 8
    <10a1>   DW_AT_decl_file   : 19
    <10a2>   DW_AT_decl_line   : 1910
    <10a4>   DW_AT_decl_column : 8
    <10a5>   DW_AT_sibling     : <0x10ca>
 <2><10a9>: Abbrev Number: 22 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0xe4a): arch
    <10ae>   DW_AT_decl_file   : 19
    <10af>   DW_AT_decl_line   : 1911
    <10b1>   DW_AT_decl_column : 15
    <10b2>   DW_AT_type        : <0x2b>
    <10b6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b9>: Abbrev Number: 22 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0xcb6): flag
    <10be>   DW_AT_decl_file   : 19
    <10bf>   DW_AT_decl_line   : 1912
    <10c1>   DW_AT_decl_column : 15
    <10c2>   DW_AT_type        : <0x2b>
    <10c6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c9>: Abbrev Number: 0
 <1><10ca>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cb>   DW_AT_type        : <0x109b>
 <1><10cf>: Abbrev Number: 15 (DW_TAG_array_type)
    <10d0>   DW_AT_type        : <0x10ca>
    <10d4>   DW_AT_sibling     : <0x10df>
 <2><10d8>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d9>   DW_AT_type        : <0x2b>
    <10dd>   DW_AT_upper_bound : 2
 <2><10de>: Abbrev Number: 0
 <1><10df>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e0>   DW_AT_type        : <0x10cf>
 <1><10e4>: Abbrev Number: 10 (DW_TAG_variable)
    <10e5>   DW_AT_name        : (indirect string, offset: 0xf40): audit_arch_vec
    <10e9>   DW_AT_decl_file   : 19
    <10ea>   DW_AT_decl_line   : 1915
    <10ec>   DW_AT_decl_column : 34
    <10ed>   DW_AT_type        : <0x10df>
    <10f1>   DW_AT_external    : 1
    <10f2>   DW_AT_declaration : 1
 <1><10f3>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f4>   DW_AT_byte_size   : 180
    <10f5>   DW_AT_decl_file   : 21
    <10f6>   DW_AT_decl_line   : 2
    <10f7>   DW_AT_decl_column : 9
    <10f8>   DW_AT_sibling     : <0x13ad>
 <2><10fc>: Abbrev Number: 9 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0xea7): block_ioctl
    <1101>   DW_AT_decl_file   : 21
    <1102>   DW_AT_decl_line   : 3
    <1103>   DW_AT_decl_column : 8
    <1104>   DW_AT_type        : <0x13c7>
    <1108>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110b>: Abbrev Number: 9 (DW_TAG_member)
    <110c>   DW_AT_name        : (indirect string, offset: 0x250): btrfs_ioctl
    <1110>   DW_AT_decl_file   : 21
    <1111>   DW_AT_decl_line   : 6
    <1112>   DW_AT_decl_column : 8
    <1113>   DW_AT_type        : <0x13c7>
    <1117>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111a>: Abbrev Number: 9 (DW_TAG_member)
    <111b>   DW_AT_name        : (indirect string, offset: 0x69a): evdev_write_ioctl_mpers
    <111f>   DW_AT_decl_file   : 21
    <1120>   DW_AT_decl_line   : 9
    <1121>   DW_AT_decl_column : 8
    <1122>   DW_AT_type        : <0x13c7>
    <1126>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1129>: Abbrev Number: 9 (DW_TAG_member)
    <112a>   DW_AT_name        : (indirect string, offset: 0x816): get_sock_fprog_size
    <112e>   DW_AT_decl_file   : 21
    <112f>   DW_AT_decl_line   : 12
    <1130>   DW_AT_decl_column : 17
    <1131>   DW_AT_type        : <0x13d3>
    <1135>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1138>: Abbrev Number: 9 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0x8be): fetch_bpf_fprog
    <113d>   DW_AT_decl_file   : 21
    <113e>   DW_AT_decl_line   : 15
    <113f>   DW_AT_decl_column : 10
    <1140>   DW_AT_type        : <0x13f3>
    <1144>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1147>: Abbrev Number: 9 (DW_TAG_member)
    <1148>   DW_AT_name        : (indirect string, offset: 0x803): fetch_struct_flock
    <114c>   DW_AT_decl_file   : 21
    <114d>   DW_AT_decl_line   : 18
    <114e>   DW_AT_decl_column : 10
    <114f>   DW_AT_type        : <0x13f3>
    <1153>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1156>: Abbrev Number: 9 (DW_TAG_member)
    <1157>   DW_AT_name        : (indirect string, offset: 0x1054): fetch_struct_flock64
    <115b>   DW_AT_decl_file   : 21
    <115c>   DW_AT_decl_line   : 21
    <115d>   DW_AT_decl_column : 10
    <115e>   DW_AT_type        : <0x13f3>
