Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x17e8 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x627): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x466): mpers-m32/msqid_ds_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xf38): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3e2): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1096): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0xa1e): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x385): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x277): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe8c): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4cb): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x919): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf89): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x949): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7ed): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xc08): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xc3e): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2ec): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd94): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xcff): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x42e): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x491): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x391): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xc29): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0x1031): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe9c): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x42): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xbb1): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x116a): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xec7): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xb64): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0x105a): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x2a3): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x3da): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x1080): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x7c0): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xcee): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xbee): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x399): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0xaac): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x51a): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xfde): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x842): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x12d): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x10cf): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x996): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0xa07): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xe2c): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1be): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xd51): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x5c2): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x210): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x1045): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x82e): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x8bb): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x243): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xeed): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xd61): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x16e): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x758): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xaf6): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x1064): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3fe): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xcc4): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0xa63): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xad0): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x85c): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xb84): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x4c0): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x338): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x3ad): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x588): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0x10a9): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xe85): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x24f): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x59c): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x290): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xefc): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x731): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xc69): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1ab): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xf70): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x3a2): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xa55): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x1119): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x505): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x1005): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0xa6f): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x440): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0x267): __kernel_mode_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 11
    <528>   DW_AT_decl_column : 24
    <529>   DW_AT_type        : <0x24>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0xb3a): __kernel_long_t
    <532>   DW_AT_decl_file   : 15
    <533>   DW_AT_decl_line   : 15
    <534>   DW_AT_decl_column : 15
    <535>   DW_AT_type        : <0xae>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x577): __kernel_ulong_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 23
    <541>   DW_AT_type        : <0x37>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x258): __kernel_pid_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 28
    <54c>   DW_AT_decl_column : 14
    <54d>   DW_AT_type        : <0x64>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x6ff): __kernel_uid32_t
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 49
    <558>   DW_AT_decl_column : 22
    <559>   DW_AT_type        : <0x2b>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x607): __kernel_gid32_t
    <562>   DW_AT_decl_file   : 15
    <563>   DW_AT_decl_line   : 50
    <564>   DW_AT_decl_column : 22
    <565>   DW_AT_type        : <0x2b>
 <1><569>: Abbrev Number: 4 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x40c): kernel_long_t
    <56e>   DW_AT_decl_file   : 16
    <56f>   DW_AT_decl_line   : 16
    <570>   DW_AT_decl_column : 25
    <571>   DW_AT_type        : <0x52d>
 <1><575>: Abbrev Number: 4 (DW_TAG_typedef)
    <576>   DW_AT_name        : (indirect string, offset: 0x93a): kernel_ulong_t
    <57a>   DW_AT_decl_file   : 16
    <57b>   DW_AT_decl_line   : 17
    <57c>   DW_AT_decl_column : 26
    <57d>   DW_AT_type        : <0x539>
 <1><581>: Abbrev Number: 3 (DW_TAG_const_type)
    <582>   DW_AT_type        : <0x575>
 <1><586>: Abbrev Number: 8 (DW_TAG_structure_type)
    <587>   DW_AT_name        : (indirect string, offset: 0xc87): list_item
    <58b>   DW_AT_byte_size   : 8
    <58c>   DW_AT_decl_file   : 17
    <58d>   DW_AT_decl_line   : 92
    <58e>   DW_AT_decl_column : 8
    <58f>   DW_AT_sibling     : <0x5b2>
 <2><593>: Abbrev Number: 9 (DW_TAG_member)
    <594>   DW_AT_name        : (indirect string, offset: 0x1165): prev
    <598>   DW_AT_decl_file   : 17
    <599>   DW_AT_decl_line   : 93
    <59a>   DW_AT_decl_column : 20
    <59b>   DW_AT_type        : <0x5b2>
    <59f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a2>: Abbrev Number: 9 (DW_TAG_member)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x1154): next
    <5a7>   DW_AT_decl_file   : 17
    <5a8>   DW_AT_decl_line   : 94
    <5a9>   DW_AT_decl_column : 20
    <5aa>   DW_AT_type        : <0x5b2>
    <5ae>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b1>: Abbrev Number: 0
 <1><5b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5b3>   DW_AT_byte_size   : 4
    <5b4>   DW_AT_type        : <0x586>
 <1><5b8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x912): sysent
    <5bd>   DW_AT_byte_size   : 20
    <5be>   DW_AT_decl_file   : 18
    <5bf>   DW_AT_decl_line   : 13
    <5c0>   DW_AT_decl_column : 16
    <5c1>   DW_AT_sibling     : <0x611>
 <2><5c5>: Abbrev Number: 9 (DW_TAG_member)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x10c0): nargs
    <5ca>   DW_AT_decl_file   : 18
    <5cb>   DW_AT_decl_line   : 14
    <5cc>   DW_AT_decl_column : 11
    <5cd>   DW_AT_type        : <0x2b>
    <5d1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d4>: Abbrev Number: 9 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0xa14): sys_flags
    <5d9>   DW_AT_decl_file   : 18
    <5da>   DW_AT_decl_line   : 15
    <5db>   DW_AT_decl_column : 6
    <5dc>   DW_AT_type        : <0x64>
    <5e0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e3>: Abbrev Number: 18 (DW_TAG_member)
    <5e4>   DW_AT_name        : sen
    <5e8>   DW_AT_decl_file   : 18
    <5e9>   DW_AT_decl_line   : 16
    <5ea>   DW_AT_decl_column : 6
    <5eb>   DW_AT_type        : <0x64>
    <5ef>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f2>: Abbrev Number: 9 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0x32f): sys_func
    <5f7>   DW_AT_decl_file   : 18
    <5f8>   DW_AT_decl_line   : 17
    <5f9>   DW_AT_decl_column : 8
    <5fa>   DW_AT_type        : <0x867>
    <5fe>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><601>: Abbrev Number: 9 (DW_TAG_member)
    <602>   DW_AT_name        : (indirect string, offset: 0x29a): sys_name
    <606>   DW_AT_decl_file   : 18
    <607>   DW_AT_decl_line   : 18
    <608>   DW_AT_decl_column : 14
    <609>   DW_AT_type        : <0x1c9>
    <60d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><610>: Abbrev Number: 0
 <1><611>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <612>   DW_AT_prototyped  : 1
    <613>   DW_AT_type        : <0x64>
    <617>   DW_AT_sibling     : <0x621>
 <2><61b>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <61c>   DW_AT_type        : <0x621>
 <2><620>: Abbrev Number: 0
 <1><621>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <622>   DW_AT_byte_size   : 4
    <623>   DW_AT_type        : <0x62c>
 <1><627>: Abbrev Number: 3 (DW_TAG_const_type)
    <628>   DW_AT_type        : <0x621>
 <1><62c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <62d>   DW_AT_name        : tcb
    <631>   DW_AT_byte_size   : 200
    <632>   DW_AT_decl_file   : 19
    <633>   DW_AT_decl_line   : 262
    <635>   DW_AT_decl_column : 8
    <636>   DW_AT_sibling     : <0x867>
 <2><63a>: Abbrev Number: 22 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x514): flags
    <63f>   DW_AT_decl_file   : 19
    <640>   DW_AT_decl_line   : 263
    <642>   DW_AT_decl_column : 6
    <643>   DW_AT_type        : <0x64>
    <647>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><64a>: Abbrev Number: 23 (DW_TAG_member)
    <64b>   DW_AT_name        : pid
    <64f>   DW_AT_decl_file   : 19
    <650>   DW_AT_decl_line   : 264
    <652>   DW_AT_decl_column : 6
    <653>   DW_AT_type        : <0x64>
    <657>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><65a>: Abbrev Number: 22 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x57): qual_flg
    <65f>   DW_AT_decl_file   : 19
    <660>   DW_AT_decl_line   : 265
    <662>   DW_AT_decl_column : 6
    <663>   DW_AT_type        : <0x64>
    <667>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><66a>: Abbrev Number: 22 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x3c6): currpers
    <66f>   DW_AT_decl_file   : 19
    <670>   DW_AT_decl_line   : 267
    <672>   DW_AT_decl_column : 15
    <673>   DW_AT_type        : <0x2b>
    <677>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><67a>: Abbrev Number: 22 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0xbe6): u_error
    <67f>   DW_AT_decl_file   : 19
    <680>   DW_AT_decl_line   : 269
    <682>   DW_AT_decl_column : 16
    <683>   DW_AT_type        : <0x37>
    <687>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><68a>: Abbrev Number: 22 (DW_TAG_member)
    <68b>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <68f>   DW_AT_decl_file   : 19
    <690>   DW_AT_decl_line   : 270
    <692>   DW_AT_decl_column : 17
    <693>   DW_AT_type        : <0x575>
    <697>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><69a>: Abbrev Number: 22 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0xc1f): true_scno
    <69f>   DW_AT_decl_file   : 19
    <6a0>   DW_AT_decl_line   : 271
    <6a2>   DW_AT_decl_column : 17
    <6a3>   DW_AT_type        : <0x575>
    <6a7>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6aa>: Abbrev Number: 22 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x195): u_arg
    <6af>   DW_AT_decl_file   : 19
    <6b0>   DW_AT_decl_line   : 272
    <6b2>   DW_AT_decl_column : 17
    <6b3>   DW_AT_type        : <0x997>
    <6b7>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6ba>: Abbrev Number: 22 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0xa2b): u_rval
    <6bf>   DW_AT_decl_file   : 19
    <6c0>   DW_AT_decl_line   : 273
    <6c2>   DW_AT_decl_column : 16
    <6c3>   DW_AT_type        : <0x569>
    <6c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6ca>: Abbrev Number: 22 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0xb56): sys_func_rval
    <6cf>   DW_AT_decl_file   : 19
    <6d0>   DW_AT_decl_line   : 274
    <6d2>   DW_AT_decl_column : 6
    <6d3>   DW_AT_type        : <0x64>
    <6d7>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6da>: Abbrev Number: 22 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xd7b): curcol
    <6df>   DW_AT_decl_file   : 19
    <6e0>   DW_AT_decl_line   : 275
    <6e2>   DW_AT_decl_column : 6
    <6e3>   DW_AT_type        : <0x64>
    <6e7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ea>: Abbrev Number: 22 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0xa3d): outf
    <6ef>   DW_AT_decl_file   : 19
    <6f0>   DW_AT_decl_line   : 276
    <6f2>   DW_AT_decl_column : 8
    <6f3>   DW_AT_type        : <0x40e>
    <6f7>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6fa>: Abbrev Number: 22 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0xfaf): staged_output_data
    <6ff>   DW_AT_decl_file   : 19
    <700>   DW_AT_decl_line   : 277
    <702>   DW_AT_decl_column : 29
    <703>   DW_AT_type        : <0x9ad>
    <707>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><70a>: Abbrev Number: 22 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0xb21): auxstr
    <70f>   DW_AT_decl_file   : 19
    <710>   DW_AT_decl_line   : 279
    <712>   DW_AT_decl_column : 14
    <713>   DW_AT_type        : <0x1c9>
    <717>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><71a>: Abbrev Number: 22 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x174): _priv_data
    <71f>   DW_AT_decl_file   : 19
    <720>   DW_AT_decl_line   : 280
    <722>   DW_AT_decl_column : 8
    <723>   DW_AT_type        : <0xcd>
    <727>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><72a>: Abbrev Number: 22 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0xcb4): _free_priv_data
    <72f>   DW_AT_decl_file   : 19
    <730>   DW_AT_decl_line   : 281
    <732>   DW_AT_decl_column : 9
    <733>   DW_AT_type        : <0x9bf>
    <737>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><73a>: Abbrev Number: 22 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x185): s_ent
    <73f>   DW_AT_decl_file   : 19
    <740>   DW_AT_decl_line   : 282
    <742>   DW_AT_decl_column : 23
    <743>   DW_AT_type        : <0x9c5>
    <747>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><74a>: Abbrev Number: 22 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x30): s_prev_ent
    <74f>   DW_AT_decl_file   : 19
    <750>   DW_AT_decl_line   : 285
    <752>   DW_AT_decl_column : 23
    <753>   DW_AT_type        : <0x9c5>
    <757>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x3bb): inject_vec
    <75f>   DW_AT_decl_file   : 19
    <760>   DW_AT_decl_line   : 286
    <762>   DW_AT_decl_column : 22
    <763>   DW_AT_type        : <0x9d0>
    <767>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><76a>: Abbrev Number: 22 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x865): stime
    <76f>   DW_AT_decl_file   : 19
    <770>   DW_AT_decl_line   : 287
    <772>   DW_AT_decl_column : 18
    <773>   DW_AT_type        : <0x133>
    <777>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><77a>: Abbrev Number: 22 (DW_TAG_member)
    <77b>   DW_AT_name        : (indirect string, offset: 0x3cf): ltime
    <77f>   DW_AT_decl_file   : 19
    <780>   DW_AT_decl_line   : 288
    <782>   DW_AT_decl_column : 18
    <783>   DW_AT_type        : <0x133>
    <787>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><78a>: Abbrev Number: 22 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0x1087): atime
    <78f>   DW_AT_decl_file   : 19
    <790>   DW_AT_decl_line   : 289
    <792>   DW_AT_decl_column : 18
    <793>   DW_AT_type        : <0x133>
    <797>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><79a>: Abbrev Number: 22 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x50e): etime
    <79f>   DW_AT_decl_file   : 19
    <7a0>   DW_AT_decl_line   : 290
    <7a2>   DW_AT_decl_column : 18
    <7a3>   DW_AT_type        : <0x133>
    <7a7>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7ab>: Abbrev Number: 22 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0xde9): delay_expiration_time
    <7b0>   DW_AT_decl_file   : 19
    <7b1>   DW_AT_decl_line   : 291
    <7b3>   DW_AT_decl_column : 18
    <7b4>   DW_AT_type        : <0x133>
    <7b8>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7bc>: Abbrev Number: 22 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x3b): pid_ns
    <7c1>   DW_AT_decl_file   : 19
    <7c2>   DW_AT_decl_line   : 298
    <7c4>   DW_AT_decl_column : 15
    <7c5>   DW_AT_type        : <0x2b>
    <7c9>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7cd>: Abbrev Number: 22 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xfeb): last_dirfd
    <7d2>   DW_AT_decl_file   : 19
    <7d3>   DW_AT_decl_line   : 301
    <7d5>   DW_AT_decl_column : 6
    <7d6>   DW_AT_type        : <0x64>
    <7da>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7de>: Abbrev Number: 22 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0x1011): mmap_cache
    <7e3>   DW_AT_decl_file   : 19
    <7e4>   DW_AT_decl_line   : 304
    <7e6>   DW_AT_decl_column : 23
    <7e7>   DW_AT_type        : <0x9ec>
    <7eb>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7ef>: Abbrev Number: 22 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xbf5): wait_data_idx
    <7f4>   DW_AT_decl_file   : 19
    <7f5>   DW_AT_decl_line   : 311
    <7f7>   DW_AT_decl_column : 9
    <7f8>   DW_AT_type        : <0x122>
    <7fc>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><800>: Abbrev Number: 22 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0xb28): delayed_wait_data
    <805>   DW_AT_decl_file   : 19
    <806>   DW_AT_decl_line   : 313
    <808>   DW_AT_decl_column : 24
    <809>   DW_AT_type        : <0x9f8>
    <80d>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><811>: Abbrev Number: 22 (DW_TAG_member)
    <812>   DW_AT_name        : (indirect string, offset: 0xba7): wait_list
    <816>   DW_AT_decl_file   : 19
    <817>   DW_AT_decl_line   : 314
    <819>   DW_AT_decl_column : 19
    <81a>   DW_AT_type        : <0x586>
    <81e>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><822>: Abbrev Number: 22 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0x749): vcpu_info_list
    <827>   DW_AT_decl_file   : 19
    <828>   DW_AT_decl_line   : 318
    <82a>   DW_AT_decl_column : 20
    <82b>   DW_AT_type        : <0xa04>
    <82f>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><833>: Abbrev Number: 22 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0xd46): unwind_ctx
    <838>   DW_AT_decl_file   : 19
    <839>   DW_AT_decl_line   : 322
    <83b>   DW_AT_decl_column : 8
    <83c>   DW_AT_type        : <0xcd>
    <840>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><844>: Abbrev Number: 22 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0x4f8): unwind_queue
    <849>   DW_AT_decl_file   : 19
    <84a>   DW_AT_decl_line   : 323
    <84c>   DW_AT_decl_column : 25
    <84d>   DW_AT_type        : <0xa10>
    <851>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><855>: Abbrev Number: 22 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x169): comm
    <85a>   DW_AT_decl_file   : 19
    <85b>   DW_AT_decl_line   : 327
    <85d>   DW_AT_decl_column : 7
    <85e>   DW_AT_type        : <0xa16>
    <862>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><866>: Abbrev Number: 0
 <1><867>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <868>   DW_AT_byte_size   : 4
    <869>   DW_AT_type        : <0x611>
 <1><86d>: Abbrev Number: 4 (DW_TAG_typedef)
    <86e>   DW_AT_name        : (indirect string, offset: 0x569): struct_sysent
    <872>   DW_AT_decl_file   : 18
    <873>   DW_AT_decl_line   : 19
    <874>   DW_AT_decl_column : 3
    <875>   DW_AT_type        : <0x5b8>
 <1><879>: Abbrev Number: 3 (DW_TAG_const_type)
    <87a>   DW_AT_type        : <0x86d>
 <1><87e>: Abbrev Number: 11 (DW_TAG_variable)
    <87f>   DW_AT_name        : (indirect string, offset: 0xdd5): current_personality
    <883>   DW_AT_decl_file   : 19
    <884>   DW_AT_decl_line   : 158
    <885>   DW_AT_decl_column : 17
    <886>   DW_AT_type        : <0x2b>
    <88a>   DW_AT_external    : 1
    <88b>   DW_AT_declaration : 1
 <1><88c>: Abbrev Number: 11 (DW_TAG_variable)
    <88d>   DW_AT_name        : (indirect string, offset: 0x8aa): current_wordsize
    <891>   DW_AT_decl_file   : 19
    <892>   DW_AT_decl_line   : 171
    <893>   DW_AT_decl_column : 17
    <894>   DW_AT_type        : <0x2b>
    <898>   DW_AT_external    : 1
    <899>   DW_AT_declaration : 1
 <1><89a>: Abbrev Number: 11 (DW_TAG_variable)
    <89b>   DW_AT_name        : (indirect string, offset: 0xaff): current_klongsize
    <89f>   DW_AT_decl_file   : 19
    <8a0>   DW_AT_decl_line   : 176
    <8a1>   DW_AT_decl_column : 17
    <8a2>   DW_AT_type        : <0x2b>
    <8a6>   DW_AT_external    : 1
    <8a7>   DW_AT_declaration : 1
 <1><8a8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xd1d): ioctlent
    <8ad>   DW_AT_byte_size   : 8
    <8ae>   DW_AT_decl_file   : 19
    <8af>   DW_AT_decl_line   : 217
    <8b0>   DW_AT_decl_column : 16
    <8b1>   DW_AT_sibling     : <0x8d4>
 <2><8b5>: Abbrev Number: 9 (DW_TAG_member)
    <8b6>   DW_AT_name        : (indirect string, offset: 0xfd7): symbol
    <8ba>   DW_AT_decl_file   : 19
    <8bb>   DW_AT_decl_line   : 218
    <8bc>   DW_AT_decl_column : 14
    <8bd>   DW_AT_type        : <0x1c9>
    <8c1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c4>: Abbrev Number: 9 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0xd9e): code
    <8c9>   DW_AT_decl_file   : 19
    <8ca>   DW_AT_decl_line   : 219
    <8cb>   DW_AT_decl_column : 15
    <8cc>   DW_AT_type        : <0x2b>
    <8d0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d3>: Abbrev Number: 0
 <1><8d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xcde): struct_ioctlent
    <8d9>   DW_AT_decl_file   : 19
    <8da>   DW_AT_decl_line   : 220
    <8db>   DW_AT_decl_column : 3
    <8dc>   DW_AT_type        : <0x8a8>
 <1><8e0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8e1>   DW_AT_type        : <0x8d4>
 <1><8e5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x89e): inject_data
    <8ea>   DW_AT_byte_size   : 10
    <8eb>   DW_AT_decl_file   : 19
    <8ec>   DW_AT_decl_line   : 241
    <8ed>   DW_AT_decl_column : 8
    <8ee>   DW_AT_sibling     : <0x94d>
 <2><8f2>: Abbrev Number: 9 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x514): flags
    <8f7>   DW_AT_decl_file   : 19
    <8f8>   DW_AT_decl_line   : 242
    <8f9>   DW_AT_decl_column : 10
    <8fa>   DW_AT_type        : <0xf2>
    <8fe>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><901>: Abbrev Number: 9 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x9c8): signo
    <906>   DW_AT_decl_file   : 19
    <907>   DW_AT_decl_line   : 243
    <908>   DW_AT_decl_column : 10
    <909>   DW_AT_type        : <0xf2>
    <90d>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><910>: Abbrev Number: 9 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0xfb): rval_idx
    <915>   DW_AT_decl_file   : 19
    <916>   DW_AT_decl_line   : 244
    <917>   DW_AT_decl_column : 11
    <918>   DW_AT_type        : <0xfe>
    <91c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><91f>: Abbrev Number: 9 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0xd71): delay_idx
    <924>   DW_AT_decl_file   : 19
    <925>   DW_AT_decl_line   : 245
    <926>   DW_AT_decl_column : 11
    <927>   DW_AT_type        : <0xfe>
    <92b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><92e>: Abbrev Number: 9 (DW_TAG_member)
    <92f>   DW_AT_name        : (indirect string, offset: 0x5b4): poke_idx
    <933>   DW_AT_decl_file   : 19
    <934>   DW_AT_decl_line   : 246
    <935>   DW_AT_decl_column : 11
    <936>   DW_AT_type        : <0xfe>
    <93a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><93d>: Abbrev Number: 9 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <942>   DW_AT_decl_file   : 19
    <943>   DW_AT_decl_line   : 247
    <944>   DW_AT_decl_column : 11
    <945>   DW_AT_type        : <0xfe>
    <949>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><94c>: Abbrev Number: 0
 <1><94d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <94e>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <952>   DW_AT_byte_size   : 16
    <953>   DW_AT_decl_file   : 19
    <954>   DW_AT_decl_line   : 250
    <955>   DW_AT_decl_column : 8
    <956>   DW_AT_sibling     : <0x997>
 <2><95a>: Abbrev Number: 9 (DW_TAG_member)
    <95b>   DW_AT_name        : (indirect string, offset: 0xaca): first
    <95f>   DW_AT_decl_file   : 19
    <960>   DW_AT_decl_line   : 251
    <961>   DW_AT_decl_column : 11
    <962>   DW_AT_type        : <0xfe>
    <966>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><969>: Abbrev Number: 9 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0x118e): last
    <96e>   DW_AT_decl_file   : 19
    <96f>   DW_AT_decl_line   : 252
    <970>   DW_AT_decl_column : 11
    <971>   DW_AT_type        : <0xfe>
    <975>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><978>: Abbrev Number: 9 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0x3d5): step
    <97d>   DW_AT_decl_file   : 19
    <97e>   DW_AT_decl_line   : 253
    <97f>   DW_AT_decl_column : 11
    <980>   DW_AT_type        : <0xfe>
    <984>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><987>: Abbrev Number: 9 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0x1159): data
    <98c>   DW_AT_decl_file   : 19
    <98d>   DW_AT_decl_line   : 254
    <98e>   DW_AT_decl_column : 21
    <98f>   DW_AT_type        : <0x8e5>
    <993>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 15 (DW_TAG_array_type)
    <998>   DW_AT_type        : <0x575>
    <99c>   DW_AT_sibling     : <0x9a7>
 <2><9a0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9a1>   DW_AT_type        : <0x2b>
    <9a5>   DW_AT_upper_bound : 5
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9a8>   DW_AT_name        : (indirect string, offset: 0xfaf): staged_output_data
    <9ac>   DW_AT_declaration : 1
 <1><9ad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ae>   DW_AT_byte_size   : 4
    <9af>   DW_AT_type        : <0x9a7>
 <1><9b3>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b4>   DW_AT_prototyped  : 1
    <9b5>   DW_AT_sibling     : <0x9bf>
 <2><9b9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ba>   DW_AT_type        : <0xcd>
 <2><9be>: Abbrev Number: 0
 <1><9bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c0>   DW_AT_byte_size   : 4
    <9c1>   DW_AT_type        : <0x9b3>
 <1><9c5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c6>   DW_AT_byte_size   : 4
    <9c7>   DW_AT_type        : <0x879>
 <1><9cb>: Abbrev Number: 3 (DW_TAG_const_type)
    <9cc>   DW_AT_type        : <0x9c5>
 <1><9d0>: Abbrev Number: 15 (DW_TAG_array_type)
    <9d1>   DW_AT_type        : <0x9e0>
    <9d5>   DW_AT_sibling     : <0x9e0>
 <2><9d9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9da>   DW_AT_type        : <0x2b>
    <9de>   DW_AT_upper_bound : 2
 <2><9df>: Abbrev Number: 0
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x94d>
 <1><9e6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e7>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <9eb>   DW_AT_declaration : 1
 <1><9ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9e6>
 <1><9f2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x3f0): tcb_wait_data
    <9f7>   DW_AT_declaration : 1
 <1><9f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
    <9fa>   DW_AT_type        : <0x9f2>
 <1><9fe>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x15f): vcpu_info
    <a03>   DW_AT_declaration : 1
 <1><a04>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a05>   DW_AT_byte_size   : 4
    <a06>   DW_AT_type        : <0x9fe>
 <1><a0a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a0b>   DW_AT_name        : (indirect string, offset: 0xf93): unwind_queue_t
    <a0f>   DW_AT_declaration : 1
 <1><a10>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a11>   DW_AT_byte_size   : 4
    <a12>   DW_AT_type        : <0xa0a>
 <1><a16>: Abbrev Number: 15 (DW_TAG_array_type)
    <a17>   DW_AT_type        : <0xe6>
    <a1b>   DW_AT_sibling     : <0xa26>
 <2><a1f>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a20>   DW_AT_type        : <0x2b>
    <a24>   DW_AT_upper_bound : 15
 <2><a25>: Abbrev Number: 0
 <1><a26>: Abbrev Number: 10 (DW_TAG_variable)
    <a27>   DW_AT_name        : (indirect string, offset: 0xc32): stub_sysent
    <a2b>   DW_AT_decl_file   : 19
    <a2c>   DW_AT_decl_line   : 400
    <a2e>   DW_AT_decl_column : 28
    <a2f>   DW_AT_type        : <0x879>
    <a33>   DW_AT_external    : 1
    <a34>   DW_AT_declaration : 1
 <1><a35>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a36>   DW_AT_name        : (indirect string, offset: 0x113c): xlat_type
    <a3a>   DW_AT_encoding    : 7	(unsigned)
    <a3b>   DW_AT_byte_size   : 4
    <a3c>   DW_AT_type        : <0x2b>
    <a40>   DW_AT_decl_file   : 20
    <a41>   DW_AT_decl_line   : 13
    <a42>   DW_AT_decl_column : 6
    <a43>   DW_AT_sibling     : <0xa5a>
 <2><a47>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0x2f5): XT_NORMAL
    <a4c>   DW_AT_const_value : 0
 <2><a4d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xcf5): XT_SORTED
    <a52>   DW_AT_const_value : 1
 <2><a53>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0xe61): XT_INDEXED
    <a58>   DW_AT_const_value : 2
 <2><a59>: Abbrev Number: 0
 <1><a5a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xc5e): xlat_style
    <a5f>   DW_AT_encoding    : 7	(unsigned)
    <a60>   DW_AT_byte_size   : 4
    <a61>   DW_AT_type        : <0x2b>
    <a65>   DW_AT_decl_file   : 20
    <a66>   DW_AT_decl_line   : 19
    <a67>   DW_AT_decl_column : 6
    <a68>   DW_AT_sibling     : <0xa97>
 <2><a6c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a71>   DW_AT_const_value : 0
 <2><a72>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0xc91): XLAT_STYLE_RAW
    <a77>   DW_AT_const_value : 1
 <2><a78>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x1107): XLAT_STYLE_ABBREV
    <a7d>   DW_AT_const_value : 2
 <2><a7e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x31c): XLAT_STYLE_VERBOSE
    <a83>   DW_AT_const_value : 3
 <2><a84>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a85>   DW_AT_name        : (indirect string, offset: 0x1a): XLAT_STYLE_FMT_X
    <a89>   DW_AT_const_value : 0
 <2><a8a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x9): XLAT_STYLE_FMT_U
    <a8f>   DW_AT_const_value : 4
 <2><a90>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a91>   DW_AT_name        : (indirect string, offset: 0x117d): XLAT_STYLE_FMT_D
    <a95>   DW_AT_const_value : 8
 <2><a96>: Abbrev Number: 0
 <1><a97>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a98>   DW_AT_name        : (indirect string, offset: 0x358): xlat_data
    <a9c>   DW_AT_byte_size   : 12
    <a9d>   DW_AT_decl_file   : 20
    <a9e>   DW_AT_decl_line   : 51
    <a9f>   DW_AT_decl_column : 8
    <aa0>   DW_AT_sibling     : <0xac3>
 <2><aa4>: Abbrev Number: 18 (DW_TAG_member)
    <aa5>   DW_AT_name        : val
    <aa9>   DW_AT_decl_file   : 20
    <aaa>   DW_AT_decl_line   : 52
    <aab>   DW_AT_decl_column : 11
    <aac>   DW_AT_type        : <0x116>
    <ab0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab3>: Abbrev Number: 18 (DW_TAG_member)
    <ab4>   DW_AT_name        : str
    <ab8>   DW_AT_decl_file   : 20
    <ab9>   DW_AT_decl_line   : 53
    <aba>   DW_AT_decl_column : 14
    <abb>   DW_AT_type        : <0x1c9>
    <abf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ac2>: Abbrev Number: 0
 <1><ac3>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac4>   DW_AT_type        : <0xa97>
 <1><ac8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x2b): xlat
    <acd>   DW_AT_byte_size   : 24
    <ace>   DW_AT_decl_file   : 20
    <acf>   DW_AT_decl_line   : 56
    <ad0>   DW_AT_decl_column : 8
    <ad1>   DW_AT_sibling     : <0xb21>
 <2><ad5>: Abbrev Number: 9 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x1159): data
    <ada>   DW_AT_decl_file   : 20
    <adb>   DW_AT_decl_line   : 57
    <adc>   DW_AT_decl_column : 26
    <add>   DW_AT_type        : <0xb26>
    <ae1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae4>: Abbrev Number: 9 (DW_TAG_member)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x906): flags_strsz
    <ae9>   DW_AT_decl_file   : 20
    <aea>   DW_AT_decl_line   : 58
    <aeb>   DW_AT_decl_column : 9
    <aec>   DW_AT_type        : <0x122>
    <af0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af3>: Abbrev Number: 9 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0xc03): size
    <af8>   DW_AT_decl_file   : 20
    <af9>   DW_AT_decl_line   : 59
    <afa>   DW_AT_decl_column : 11
    <afb>   DW_AT_type        : <0x10a>
    <aff>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b02>: Abbrev Number: 9 (DW_TAG_member)
    <b03>   DW_AT_name        : (indirect string, offset: 0x190): type
    <b07>   DW_AT_decl_file   : 20
    <b08>   DW_AT_decl_line   : 60
    <b09>   DW_AT_decl_column : 17
    <b0a>   DW_AT_type        : <0xa35>
    <b0e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b11>: Abbrev Number: 9 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0x79d): flags_mask
    <b16>   DW_AT_decl_file   : 20
    <b17>   DW_AT_decl_line   : 61
    <b18>   DW_AT_decl_column : 11
    <b19>   DW_AT_type        : <0x116>
    <b1d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b20>: Abbrev Number: 0
 <1><b21>: Abbrev Number: 3 (DW_TAG_const_type)
    <b22>   DW_AT_type        : <0xac8>
 <1><b26>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b27>   DW_AT_byte_size   : 4
    <b28>   DW_AT_type        : <0xac3>
 <1><b2c>: Abbrev Number: 15 (DW_TAG_array_type)
    <b2d>   DW_AT_type        : <0xb21>
    <b31>   DW_AT_sibling     : <0xb37>
 <2><b35>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b36>: Abbrev Number: 0
 <1><b37>: Abbrev Number: 3 (DW_TAG_const_type)
    <b38>   DW_AT_type        : <0xb2c>
 <1><b3c>: Abbrev Number: 10 (DW_TAG_variable)
    <b3d>   DW_AT_name        : (indirect string, offset: 0xeda): addrfams
    <b41>   DW_AT_decl_file   : 19
    <b42>   DW_AT_decl_line   : 406
    <b44>   DW_AT_decl_column : 26
    <b45>   DW_AT_type        : <0xb37>
    <b49>   DW_AT_external    : 1
    <b4a>   DW_AT_declaration : 1
 <1><b4b>: Abbrev Number: 10 (DW_TAG_variable)
    <b4c>   DW_AT_name        : (indirect string, offset: 0xdae): arp_hardware_types
    <b50>   DW_AT_decl_file   : 19
    <b51>   DW_AT_decl_line   : 407
    <b53>   DW_AT_decl_column : 26
    <b54>   DW_AT_type        : <0xb37>
    <b58>   DW_AT_external    : 1
    <b59>   DW_AT_declaration : 1
 <1><b5a>: Abbrev Number: 10 (DW_TAG_variable)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x108d): at_flags
    <b5f>   DW_AT_decl_file   : 19
    <b60>   DW_AT_decl_line   : 408
    <b62>   DW_AT_decl_column : 26
    <b63>   DW_AT_type        : <0xb37>
    <b67>   DW_AT_external    : 1
    <b68>   DW_AT_declaration : 1
 <1><b69>: Abbrev Number: 10 (DW_TAG_variable)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x4d6): clocknames
    <b6e>   DW_AT_decl_file   : 19
    <b6f>   DW_AT_decl_line   : 409
    <b71>   DW_AT_decl_column : 26
    <b72>   DW_AT_type        : <0xb37>
    <b76>   DW_AT_external    : 1
    <b77>   DW_AT_declaration : 1
 <1><b78>: Abbrev Number: 10 (DW_TAG_variable)
    <b79>   DW_AT_name        : (indirect string, offset: 0x104d): dirent_types
    <b7d>   DW_AT_decl_file   : 19
    <b7e>   DW_AT_decl_line   : 410
    <b80>   DW_AT_decl_column : 26
    <b81>   DW_AT_type        : <0xb37>
    <b85>   DW_AT_external    : 1
    <b86>   DW_AT_declaration : 1
 <1><b87>: Abbrev Number: 10 (DW_TAG_variable)
    <b88>   DW_AT_name        : (indirect string, offset: 0x957): ethernet_protocols
    <b8c>   DW_AT_decl_file   : 19
    <b8d>   DW_AT_decl_line   : 411
    <b8f>   DW_AT_decl_column : 26
    <b90>   DW_AT_type        : <0xb37>
    <b94>   DW_AT_external    : 1
    <b95>   DW_AT_declaration : 1
 <1><b96>: Abbrev Number: 10 (DW_TAG_variable)
    <b97>   DW_AT_name        : (indirect string, offset: 0x618): inet_protocols
    <b9b>   DW_AT_decl_file   : 19
    <b9c>   DW_AT_decl_line   : 412
    <b9e>   DW_AT_decl_column : 26
    <b9f>   DW_AT_type        : <0xb37>
    <ba3>   DW_AT_external    : 1
    <ba4>   DW_AT_declaration : 1
 <1><ba5>: Abbrev Number: 10 (DW_TAG_variable)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x2e2): evdev_abs
    <baa>   DW_AT_decl_file   : 19
    <bab>   DW_AT_decl_line   : 413
    <bad>   DW_AT_decl_column : 26
    <bae>   DW_AT_type        : <0xb37>
    <bb2>   DW_AT_external    : 1
    <bb3>   DW_AT_declaration : 1
 <1><bb4>: Abbrev Number: 10 (DW_TAG_variable)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x792): audit_arch
    <bb9>   DW_AT_decl_file   : 19
    <bba>   DW_AT_decl_line   : 414
    <bbc>   DW_AT_decl_column : 26
    <bbd>   DW_AT_type        : <0xb37>
    <bc1>   DW_AT_external    : 1
    <bc2>   DW_AT_declaration : 1
 <1><bc3>: Abbrev Number: 10 (DW_TAG_variable)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bc8>   DW_AT_decl_file   : 19
    <bc9>   DW_AT_decl_line   : 415
    <bcb>   DW_AT_decl_column : 26
    <bcc>   DW_AT_type        : <0xb37>
    <bd0>   DW_AT_external    : 1
    <bd1>   DW_AT_declaration : 1
 <1><bd2>: Abbrev Number: 10 (DW_TAG_variable)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x4b7): iffflags
    <bd7>   DW_AT_decl_file   : 19
    <bd8>   DW_AT_decl_line   : 416
    <bda>   DW_AT_decl_column : 26
    <bdb>   DW_AT_type        : <0xb37>
    <bdf>   DW_AT_external    : 1
    <be0>   DW_AT_declaration : 1
 <1><be1>: Abbrev Number: 10 (DW_TAG_variable)
    <be2>   DW_AT_name        : (indirect string, offset: 0xca0): ip_type_of_services
    <be6>   DW_AT_decl_file   : 19
    <be7>   DW_AT_decl_line   : 417
    <be9>   DW_AT_decl_column : 26
    <bea>   DW_AT_type        : <0xb37>
    <bee>   DW_AT_external    : 1
    <bef>   DW_AT_declaration : 1
 <1><bf0>: Abbrev Number: 10 (DW_TAG_variable)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x725): ipc_private
    <bf5>   DW_AT_decl_file   : 19
    <bf6>   DW_AT_decl_line   : 418
    <bf8>   DW_AT_decl_column : 26
    <bf9>   DW_AT_type        : <0xb37>
    <bfd>   DW_AT_external    : 1
    <bfe>   DW_AT_declaration : 1
 <1><bff>: Abbrev Number: 10 (DW_TAG_variable)
    <c00>   DW_AT_name        : (indirect string, offset: 0x343): msg_flags
    <c04>   DW_AT_decl_file   : 19
    <c05>   DW_AT_decl_line   : 419
    <c07>   DW_AT_decl_column : 26
    <c08>   DW_AT_type        : <0xb37>
    <c0c>   DW_AT_external    : 1
    <c0d>   DW_AT_declaration : 1
 <1><c0e>: Abbrev Number: 10 (DW_TAG_variable)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x104): netlink_protocols
    <c13>   DW_AT_decl_file   : 19
    <c14>   DW_AT_decl_line   : 420
    <c16>   DW_AT_decl_column : 26
    <c17>   DW_AT_type        : <0xb37>
    <c1b>   DW_AT_external    : 1
    <c1c>   DW_AT_declaration : 1
 <1><c1d>: Abbrev Number: 10 (DW_TAG_variable)
    <c1e>   DW_AT_name        : (indirect string, offset: 0xfc2): nl_bridge_vlan_flags
    <c22>   DW_AT_decl_file   : 19
    <c23>   DW_AT_decl_line   : 421
    <c25>   DW_AT_decl_column : 26
    <c26>   DW_AT_type        : <0xb37>
    <c2a>   DW_AT_external    : 1
    <c2b>   DW_AT_declaration : 1
 <1><c2c>: Abbrev Number: 10 (DW_TAG_variable)
    <c2d>   DW_AT_name        : (indirect string, offset: 0xe4a): nl_netfilter_msg_types
    <c31>   DW_AT_decl_file   : 19
    <c32>   DW_AT_decl_line   : 422
    <c34>   DW_AT_decl_column : 26
    <c35>   DW_AT_type        : <0xb37>
    <c39>   DW_AT_external    : 1
    <c3a>   DW_AT_declaration : 1
 <1><c3b>: Abbrev Number: 10 (DW_TAG_variable)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x220): nl_route_types
    <c40>   DW_AT_decl_file   : 19
    <c41>   DW_AT_decl_line   : 423
    <c43>   DW_AT_decl_column : 26
    <c44>   DW_AT_type        : <0xb37>
    <c48>   DW_AT_external    : 1
    <c49>   DW_AT_declaration : 1
 <1><c4a>: Abbrev Number: 10 (DW_TAG_variable)
    <c4b>   DW_AT_name        : (indirect string, offset: 0xf11): open_access_modes
    <c4f>   DW_AT_decl_file   : 19
    <c50>   DW_AT_decl_line   : 424
    <c52>   DW_AT_decl_column : 26
    <c53>   DW_AT_type        : <0xb37>
    <c57>   DW_AT_external    : 1
    <c58>   DW_AT_declaration : 1
 <1><c59>: Abbrev Number: 10 (DW_TAG_variable)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c5e>   DW_AT_decl_file   : 19
    <c5f>   DW_AT_decl_line   : 425
    <c61>   DW_AT_decl_column : 26
    <c62>   DW_AT_type        : <0xb37>
    <c66>   DW_AT_external    : 1
    <c67>   DW_AT_declaration : 1
 <1><c68>: Abbrev Number: 10 (DW_TAG_variable)
    <c69>   DW_AT_name        : (indirect string, offset: 0xcd1): perf_type_id
    <c6d>   DW_AT_decl_file   : 19
    <c6e>   DW_AT_decl_line   : 426
    <c70>   DW_AT_decl_column : 26
    <c71>   DW_AT_type        : <0xb37>
    <c75>   DW_AT_external    : 1
    <c76>   DW_AT_declaration : 1
 <1><c77>: Abbrev Number: 10 (DW_TAG_variable)
    <c78>   DW_AT_name        : (indirect string, offset: 0xee3): pollflags
    <c7c>   DW_AT_decl_file   : 19
    <c7d>   DW_AT_decl_line   : 427
    <c7f>   DW_AT_decl_column : 26
    <c80>   DW_AT_type        : <0xb37>
    <c84>   DW_AT_external    : 1
    <c85>   DW_AT_declaration : 1
 <1><c86>: Abbrev Number: 10 (DW_TAG_variable)
    <c87>   DW_AT_name        : (indirect string, offset: 0x5a8): ptrace_cmds
    <c8b>   DW_AT_decl_file   : 19
    <c8c>   DW_AT_decl_line   : 428
    <c8e>   DW_AT_decl_column : 26
    <c8f>   DW_AT_type        : <0xb37>
    <c93>   DW_AT_external    : 1
    <c94>   DW_AT_declaration : 1
 <1><c95>: Abbrev Number: 10 (DW_TAG_variable)
    <c96>   DW_AT_name        : (indirect string, offset: 0x88f): resource_flags
    <c9a>   DW_AT_decl_file   : 19
    <c9b>   DW_AT_decl_line   : 429
    <c9d>   DW_AT_decl_column : 26
    <c9e>   DW_AT_type        : <0xb37>
    <ca2>   DW_AT_external    : 1
    <ca3>   DW_AT_declaration : 1
 <1><ca4>: Abbrev Number: 10 (DW_TAG_variable)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x2b8): route_nexthop_flags
    <ca9>   DW_AT_decl_file   : 19
    <caa>   DW_AT_decl_line   : 430
    <cac>   DW_AT_decl_column : 26
    <cad>   DW_AT_type        : <0xb37>
    <cb1>   DW_AT_external    : 1
    <cb2>   DW_AT_declaration : 1
 <1><cb3>: Abbrev Number: 10 (DW_TAG_variable)
    <cb4>   DW_AT_name        : (indirect string, offset: 0xf4d): routing_protocols
    <cb8>   DW_AT_decl_file   : 19
    <cb9>   DW_AT_decl_line   : 431
    <cbb>   DW_AT_decl_column : 26
    <cbc>   DW_AT_type        : <0xb37>
    <cc0>   DW_AT_external    : 1
    <cc1>   DW_AT_declaration : 1
 <1><cc2>: Abbrev Number: 10 (DW_TAG_variable)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x4a8): routing_scopes
    <cc7>   DW_AT_decl_file   : 19
    <cc8>   DW_AT_decl_line   : 432
    <cca>   DW_AT_decl_column : 26
    <ccb>   DW_AT_type        : <0xb37>
    <ccf>   DW_AT_external    : 1
    <cd0>   DW_AT_declaration : 1
 <1><cd1>: Abbrev Number: 10 (DW_TAG_variable)
    <cd2>   DW_AT_name        : (indirect string, offset: 0xe38): routing_table_ids
    <cd6>   DW_AT_decl_file   : 19
    <cd7>   DW_AT_decl_line   : 433
    <cd9>   DW_AT_decl_column : 26
    <cda>   DW_AT_type        : <0xb37>
    <cde>   DW_AT_external    : 1
    <cdf>   DW_AT_declaration : 1
 <1><ce0>: Abbrev Number: 10 (DW_TAG_variable)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x6f1): routing_types
    <ce5>   DW_AT_decl_file   : 19
    <ce6>   DW_AT_decl_line   : 434
    <ce8>   DW_AT_decl_column : 26
    <ce9>   DW_AT_type        : <0xb37>
    <ced>   DW_AT_external    : 1
    <cee>   DW_AT_declaration : 1
 <1><cef>: Abbrev Number: 10 (DW_TAG_variable)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x1b4): rwf_flags
    <cf4>   DW_AT_decl_file   : 19
    <cf5>   DW_AT_decl_line   : 435
    <cf7>   DW_AT_decl_column : 26
    <cf8>   DW_AT_type        : <0xb37>
    <cfc>   DW_AT_external    : 1
    <cfd>   DW_AT_declaration : 1
 <1><cfe>: Abbrev Number: 10 (DW_TAG_variable)
    <cff>   DW_AT_name        : (indirect string, offset: 0x8c7): seccomp_filter_flags
    <d03>   DW_AT_decl_file   : 19
    <d04>   DW_AT_decl_line   : 436
    <d06>   DW_AT_decl_column : 26
    <d07>   DW_AT_type        : <0xb37>
    <d0b>   DW_AT_external    : 1
    <d0c>   DW_AT_declaration : 1
 <1><d0d>: Abbrev Number: 10 (DW_TAG_variable)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x2ff): seccomp_ret_action
    <d12>   DW_AT_decl_file   : 19
    <d13>   DW_AT_decl_line   : 437
    <d15>   DW_AT_decl_column : 26
    <d16>   DW_AT_type        : <0xb37>
    <d1a>   DW_AT_external    : 1
    <d1b>   DW_AT_declaration : 1
 <1><d1c>: Abbrev Number: 10 (DW_TAG_variable)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x45a): setns_types
    <d21>   DW_AT_decl_file   : 19
    <d22>   DW_AT_decl_line   : 438
    <d24>   DW_AT_decl_column : 26
    <d25>   DW_AT_type        : <0xb37>
    <d29>   DW_AT_external    : 1
    <d2a>   DW_AT_declaration : 1
 <1><d2b>: Abbrev Number: 10 (DW_TAG_variable)
    <d2c>   DW_AT_name        : (indirect string, offset: 0xecf): sg_io_info
    <d30>   DW_AT_decl_file   : 19
    <d31>   DW_AT_decl_line   : 439
    <d33>   DW_AT_decl_column : 26
    <d34>   DW_AT_type        : <0xb37>
    <d38>   DW_AT_external    : 1
    <d39>   DW_AT_declaration : 1
 <1><d3a>: Abbrev Number: 10 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0xc46): socketlayers
    <d3f>   DW_AT_decl_file   : 19
    <d40>   DW_AT_decl_line   : 440
    <d42>   DW_AT_decl_column : 26
    <d43>   DW_AT_type        : <0xb37>
    <d47>   DW_AT_external    : 1
    <d48>   DW_AT_declaration : 1
 <1><d49>: Abbrev Number: 10 (DW_TAG_variable)
    <d4a>   DW_AT_name        : (indirect string, offset: 0xe22): socktypes
    <d4e>   DW_AT_decl_file   : 19
    <d4f>   DW_AT_decl_line   : 441
    <d51>   DW_AT_decl_column : 26
    <d52>   DW_AT_type        : <0xb37>
    <d56>   DW_AT_external    : 1
    <d57>   DW_AT_declaration : 1
 <1><d58>: Abbrev Number: 10 (DW_TAG_variable)
    <d59>   DW_AT_name        : (indirect string, offset: 0xb11): tcp_state_flags
    <d5d>   DW_AT_decl_file   : 19
    <d5e>   DW_AT_decl_line   : 442
    <d60>   DW_AT_decl_column : 26
    <d61>   DW_AT_type        : <0xb37>
    <d65>   DW_AT_external    : 1
    <d66>   DW_AT_declaration : 1
 <1><d67>: Abbrev Number: 10 (DW_TAG_variable)
    <d68>   DW_AT_name        : (indirect string, offset: 0x7c7): tcp_states
    <d6c>   DW_AT_decl_file   : 19
    <d6d>   DW_AT_decl_line   : 443
    <d6f>   DW_AT_decl_column : 26
    <d70>   DW_AT_type        : <0xb37>
    <d74>   DW_AT_external    : 1
    <d75>   DW_AT_declaration : 1
 <1><d76>: Abbrev Number: 10 (DW_TAG_variable)
    <d77>   DW_AT_name        : (indirect string, offset: 0x10ea): whence_codes
    <d7b>   DW_AT_decl_file   : 19
    <d7c>   DW_AT_decl_line   : 444
    <d7e>   DW_AT_decl_column : 26
    <d7f>   DW_AT_type        : <0xb37>
    <d83>   DW_AT_external    : 1
    <d84>   DW_AT_declaration : 1
 <1><d85>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d86>   DW_AT_encoding    : 7	(unsigned)
    <d87>   DW_AT_byte_size   : 4
    <d88>   DW_AT_type        : <0x2b>
    <d8c>   DW_AT_decl_file   : 19
    <d8d>   DW_AT_decl_line   : 505
    <d8f>   DW_AT_decl_column : 14
    <d90>   DW_AT_sibling     : <0xda7>
 <2><d94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d95>   DW_AT_name        : (indirect string, offset: 0xa32): CFLAG_NONE
    <d99>   DW_AT_const_value : 0
 <2><d9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x96a): CFLAG_ONLY_STATS
    <d9f>   DW_AT_const_value : 1
 <2><da0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da1>   DW_AT_name        : (indirect string, offset: 0xc53): CFLAG_BOTH
    <da5>   DW_AT_const_value : 2
 <2><da6>: Abbrev Number: 0
 <1><da7>: Abbrev Number: 28 (DW_TAG_typedef)
    <da8>   DW_AT_name        : (indirect string, offset: 0x119d): cflag_t
    <dac>   DW_AT_decl_file   : 19
    <dad>   DW_AT_decl_line   : 509
    <daf>   DW_AT_decl_column : 3
    <db0>   DW_AT_type        : <0xd85>
 <1><db4>: Abbrev Number: 10 (DW_TAG_variable)
    <db5>   DW_AT_name        : (indirect string, offset: 0xd6b): cflag
    <db9>   DW_AT_decl_file   : 19
    <dba>   DW_AT_decl_line   : 510
    <dbc>   DW_AT_decl_column : 16
    <dbd>   DW_AT_type        : <0xda7>
    <dc1>   DW_AT_external    : 1
    <dc2>   DW_AT_declaration : 1
 <1><dc3>: Abbrev Number: 10 (DW_TAG_variable)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x17f): Tflag
    <dc8>   DW_AT_decl_file   : 19
    <dc9>   DW_AT_decl_line   : 511
    <dcb>   DW_AT_decl_column : 13
    <dcc>   DW_AT_type        : <0x515>
    <dd0>   DW_AT_external    : 1
    <dd1>   DW_AT_declaration : 1
 <1><dd2>: Abbrev Number: 10 (DW_TAG_variable)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x836): Tflag_scale
    <dd7>   DW_AT_decl_file   : 19
    <dd8>   DW_AT_decl_line   : 512
    <dda>   DW_AT_decl_column : 12
    <ddb>   DW_AT_type        : <0x64>
    <ddf>   DW_AT_external    : 1
    <de0>   DW_AT_declaration : 1
 <1><de1>: Abbrev Number: 10 (DW_TAG_variable)
    <de2>   DW_AT_name        : (indirect string, offset: 0x8dc): Tflag_width
    <de6>   DW_AT_decl_file   : 19
    <de7>   DW_AT_decl_line   : 513
    <de9>   DW_AT_decl_column : 12
    <dea>   DW_AT_type        : <0x64>
    <dee>   DW_AT_external    : 1
    <def>   DW_AT_declaration : 1
 <1><df0>: Abbrev Number: 10 (DW_TAG_variable)
    <df1>   DW_AT_name        : (indirect string, offset: 0xec1): iflag
    <df5>   DW_AT_decl_file   : 19
    <df6>   DW_AT_decl_line   : 514
    <df8>   DW_AT_decl_column : 13
    <df9>   DW_AT_type        : <0x515>
    <dfd>   DW_AT_external    : 1
    <dfe>   DW_AT_declaration : 1
 <1><dff>: Abbrev Number: 10 (DW_TAG_variable)
    <e00>   DW_AT_name        : (indirect string, offset: 0x5e8): count_wallclock
    <e04>   DW_AT_decl_file   : 19
    <e05>   DW_AT_decl_line   : 515
    <e07>   DW_AT_decl_column : 13
    <e08>   DW_AT_type        : <0x515>
    <e0c>   DW_AT_external    : 1
    <e0d>   DW_AT_declaration : 1
 <1><e0e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x49): path_set_item
    <e13>   DW_AT_byte_size   : 4
    <e14>   DW_AT_decl_file   : 19
    <e15>   DW_AT_decl_line   : 517
    <e17>   DW_AT_decl_column : 8
    <e18>   DW_AT_sibling     : <0xe2d>
 <2><e1c>: Abbrev Number: 22 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e21>   DW_AT_decl_file   : 19
    <e22>   DW_AT_decl_line   : 518
    <e24>   DW_AT_decl_column : 14
    <e25>   DW_AT_type        : <0x1c9>
    <e29>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e2c>: Abbrev Number: 0
 <1><e2d>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x7d2): path_set
    <e32>   DW_AT_byte_size   : 12
    <e33>   DW_AT_decl_file   : 19
    <e34>   DW_AT_decl_line   : 522
    <e36>   DW_AT_decl_column : 15
    <e37>   DW_AT_sibling     : <0xe6c>
 <2><e3b>: Abbrev Number: 22 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x760): paths_selected
    <e40>   DW_AT_decl_file   : 19
    <e41>   DW_AT_decl_line   : 523
    <e43>   DW_AT_decl_column : 24
    <e44>   DW_AT_type        : <0xe6c>
    <e48>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e4b>: Abbrev Number: 22 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x10dd): num_selected
    <e50>   DW_AT_decl_file   : 19
    <e51>   DW_AT_decl_line   : 524
    <e53>   DW_AT_decl_column : 9
    <e54>   DW_AT_type        : <0x122>
    <e58>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e5b>: Abbrev Number: 22 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0xc03): size
    <e60>   DW_AT_decl_file   : 19
    <e61>   DW_AT_decl_line   : 525
    <e63>   DW_AT_decl_column : 9
    <e64>   DW_AT_type        : <0x122>
    <e68>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e6b>: Abbrev Number: 0
 <1><e6c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6d>   DW_AT_byte_size   : 4
    <e6e>   DW_AT_type        : <0xe0e>
 <1><e72>: Abbrev Number: 10 (DW_TAG_variable)
    <e73>   DW_AT_name        : (indirect string, offset: 0x112c): global_path_set
    <e77>   DW_AT_decl_file   : 19
    <e78>   DW_AT_decl_line   : 526
    <e7a>   DW_AT_decl_column : 3
    <e7b>   DW_AT_type        : <0xe2d>
    <e7f>   DW_AT_external    : 1
    <e80>   DW_AT_declaration : 1
 <1><e81>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e82>   DW_AT_name        : (indirect string, offset: 0x103a): xflag_opts
    <e86>   DW_AT_encoding    : 7	(unsigned)
    <e87>   DW_AT_byte_size   : 4
    <e88>   DW_AT_type        : <0x2b>
    <e8c>   DW_AT_decl_file   : 19
    <e8d>   DW_AT_decl_line   : 528
    <e8f>   DW_AT_decl_column : 6
    <e90>   DW_AT_sibling     : <0xeb3>
 <2><e94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0xabe): HEXSTR_NONE
    <e99>   DW_AT_const_value : 0
 <2><e9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x106f): HEXSTR_NON_ASCII
    <e9f>   DW_AT_const_value : 1
 <2><ea0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x9b3): HEXSTR_ALL
    <ea5>   DW_AT_const_value : 2
 <2><ea6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x6da): HEXSTR_NON_ASCII_CHARS
    <eab>   DW_AT_const_value : 3
 <2><eac>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ead>   DW_AT_name        : (indirect string, offset: 0x10f7): NUM_HEXSTR_OPTS
    <eb1>   DW_AT_const_value : 4
 <2><eb2>: Abbrev Number: 0
 <1><eb3>: Abbrev Number: 10 (DW_TAG_variable)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xe96): xflag
    <eb8>   DW_AT_decl_file   : 19
    <eb9>   DW_AT_decl_line   : 541
    <ebb>   DW_AT_decl_column : 17
    <ebc>   DW_AT_type        : <0x2b>
    <ec0>   DW_AT_external    : 1
    <ec1>   DW_AT_declaration : 1
 <1><ec2>: Abbrev Number: 10 (DW_TAG_variable)
    <ec3>   DW_AT_name        : (indirect string, offset: 0xd26): followfork
    <ec7>   DW_AT_decl_file   : 19
    <ec8>   DW_AT_decl_line   : 542
    <eca>   DW_AT_decl_column : 13
    <ecb>   DW_AT_type        : <0x515>
    <ecf>   DW_AT_external    : 1
    <ed0>   DW_AT_declaration : 1
 <1><ed1>: Abbrev Number: 10 (DW_TAG_variable)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x362): output_separately
    <ed6>   DW_AT_decl_file   : 19
    <ed7>   DW_AT_decl_line   : 543
    <ed9>   DW_AT_decl_column : 13
    <eda>   DW_AT_type        : <0x515>
    <ede>   DW_AT_external    : 1
    <edf>   DW_AT_declaration : 1
 <1><ee0>: Abbrev Number: 10 (DW_TAG_variable)
    <ee1>   DW_AT_name        : (indirect string, offset: 0x22f): stack_trace_enabled
    <ee5>   DW_AT_decl_file   : 19
    <ee6>   DW_AT_decl_line   : 546
    <ee8>   DW_AT_decl_column : 13
    <ee9>   DW_AT_type        : <0x515>
    <eed>   DW_AT_external    : 1
    <eee>   DW_AT_declaration : 1
 <1><eef>: Abbrev Number: 10 (DW_TAG_variable)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x6be): ptrace_setoptions
    <ef4>   DW_AT_decl_file   : 19
    <ef5>   DW_AT_decl_line   : 550
    <ef7>   DW_AT_decl_column : 17
    <ef8>   DW_AT_type        : <0x2b>
    <efc>   DW_AT_external    : 1
    <efd>   DW_AT_declaration : 1
 <1><efe>: Abbrev Number: 10 (DW_TAG_variable)
    <eff>   DW_AT_name        : (indirect string, offset: 0xab3): max_strlen
    <f03>   DW_AT_decl_file   : 19
    <f04>   DW_AT_decl_line   : 551
    <f06>   DW_AT_decl_column : 17
    <f07>   DW_AT_type        : <0x2b>
    <f0b>   DW_AT_external    : 1
    <f0c>   DW_AT_declaration : 1
 <1><f0d>: Abbrev Number: 10 (DW_TAG_variable)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xaeb): os_release
    <f12>   DW_AT_decl_file   : 19
    <f13>   DW_AT_decl_line   : 552
    <f15>   DW_AT_decl_column : 17
    <f16>   DW_AT_type        : <0x2b>
    <f1a>   DW_AT_external    : 1
    <f1b>   DW_AT_declaration : 1
 <1><f1c>: Abbrev Number: 10 (DW_TAG_variable)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x76f): xlat_verbosity
    <f21>   DW_AT_decl_file   : 19
    <f22>   DW_AT_decl_line   : 914
    <f24>   DW_AT_decl_column : 24
    <f25>   DW_AT_type        : <0xa5a>
    <f29>   DW_AT_external    : 1
    <f2a>   DW_AT_declaration : 1
 <1><f2b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x5cb): xlat_style_private_flag_bits
    <f30>   DW_AT_encoding    : 7	(unsigned)
    <f31>   DW_AT_byte_size   : 4
    <f32>   DW_AT_type        : <0x2b>
    <f36>   DW_AT_decl_file   : 19
    <f37>   DW_AT_decl_line   : 934
    <f39>   DW_AT_decl_column : 6
    <f3a>   DW_AT_sibling     : <0xf57>
 <2><f3e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x2cc): PAF_PRINT_INDICES_BIT
    <f43>   DW_AT_const_value : 5
 <2><f44>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0xbba): PAF_ARRAY_TRUNCATED_BIT
    <f49>   DW_AT_const_value : 6
 <2><f4a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x41a): PXF_DEFAULT_STR_BIT
    <f4f>   DW_AT_const_value : 7
 <2><f50>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f51>   DW_AT_name        : (indirect string, offset: 0xd08): SPFF_AUXSTR_MODE_BIT
    <f55>   DW_AT_const_value : 8
 <2><f56>: Abbrev Number: 0
 <1><f57>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f58>   DW_AT_name        : (indirect string, offset: 0xdc1): find_xlat_flag_bits
    <f5c>   DW_AT_encoding    : 7	(unsigned)
    <f5d>   DW_AT_byte_size   : 4
    <f5e>   DW_AT_type        : <0x2b>
    <f62>   DW_AT_decl_file   : 19
    <f63>   DW_AT_decl_line   : 1438
    <f65>   DW_AT_decl_column : 6
    <f66>   DW_AT_sibling     : <0xf71>
 <2><f6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x9f0): FXL_CASE_SENSITIVE_BIT
    <f6f>   DW_AT_const_value : 0
 <2><f70>: Abbrev Number: 0
 <1><f71>: Abbrev Number: 10 (DW_TAG_variable)
    <f72>   DW_AT_name        : (indirect string, offset: 0xa84): printing_tcp
    <f76>   DW_AT_decl_file   : 19
    <f77>   DW_AT_decl_line   : 1684
    <f79>   DW_AT_decl_column : 20
    <f7a>   DW_AT_type        : <0x621>
    <f7e>   DW_AT_external    : 1
    <f7f>   DW_AT_declaration : 1
 <1><f80>: Abbrev Number: 10 (DW_TAG_variable)
    <f81>   DW_AT_name        : (indirect string, offset: 0x593): errnoent
    <f85>   DW_AT_decl_file   : 19
    <f86>   DW_AT_decl_line   : 1882
    <f88>   DW_AT_decl_column : 26
    <f89>   DW_AT_type        : <0x449>
    <f8d>   DW_AT_external    : 1
    <f8e>   DW_AT_declaration : 1
 <1><f8f>: Abbrev Number: 10 (DW_TAG_variable)
    <f90>   DW_AT_name        : (indirect string, offset: 0x8e8): signalent
    <f94>   DW_AT_decl_file   : 19
    <f95>   DW_AT_decl_line   : 1883
    <f97>   DW_AT_decl_column : 26
    <f98>   DW_AT_type        : <0x449>
    <f9c>   DW_AT_external    : 1
    <f9d>   DW_AT_declaration : 1
 <1><f9e>: Abbrev Number: 10 (DW_TAG_variable)
    <f9f>   DW_AT_name        : (indirect string, offset: 0xf09): nerrnos
    <fa3>   DW_AT_decl_file   : 19
    <fa4>   DW_AT_decl_line   : 1884
    <fa6>   DW_AT_decl_column : 27
    <fa7>   DW_AT_type        : <0x32>
    <fab>   DW_AT_external    : 1
    <fac>   DW_AT_declaration : 1
 <1><fad>: Abbrev Number: 10 (DW_TAG_variable)
    <fae>   DW_AT_name        : (indirect string, offset: 0x10c6): nsignals
    <fb2>   DW_AT_decl_file   : 19
    <fb3>   DW_AT_decl_line   : 1885
    <fb5>   DW_AT_decl_column : 27
    <fb6>   DW_AT_type        : <0x32>
    <fba>   DW_AT_external    : 1
    <fbb>   DW_AT_declaration : 1
 <1><fbc>: Abbrev Number: 15 (DW_TAG_array_type)
    <fbd>   DW_AT_type        : <0x879>
    <fc1>   DW_AT_sibling     : <0xfc7>
 <2><fc5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc6>: Abbrev Number: 0
 <1><fc7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc8>   DW_AT_type        : <0xfbc>
 <1><fcc>: Abbrev Number: 10 (DW_TAG_variable)
    <fcd>   DW_AT_name        : (indirect string, offset: 0xd8c): sysent0
    <fd1>   DW_AT_decl_file   : 19
    <fd2>   DW_AT_decl_line   : 1887
    <fd4>   DW_AT_decl_column : 28
    <fd5>   DW_AT_type        : <0xfc7>
    <fd9>   DW_AT_external    : 1
    <fda>   DW_AT_declaration : 1
 <1><fdb>: Abbrev Number: 15 (DW_TAG_array_type)
    <fdc>   DW_AT_type        : <0x8e0>
    <fe0>   DW_AT_sibling     : <0xfe6>
 <2><fe4>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fe5>: Abbrev Number: 0
 <1><fe6>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe7>   DW_AT_type        : <0xfdb>
 <1><feb>: Abbrev Number: 10 (DW_TAG_variable)
    <fec>   DW_AT_name        : (indirect string, offset: 0x1122): ioctlent0
    <ff0>   DW_AT_decl_file   : 19
    <ff1>   DW_AT_decl_line   : 1888
    <ff3>   DW_AT_decl_column : 30
    <ff4>   DW_AT_type        : <0xfe6>
    <ff8>   DW_AT_external    : 1
    <ff9>   DW_AT_declaration : 1
 <1><ffa>: Abbrev Number: 10 (DW_TAG_variable)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x496): personality_names
    <fff>   DW_AT_decl_file   : 19
    <1000>   DW_AT_decl_line   : 1890
    <1002>   DW_AT_decl_column : 26
    <1003>   DW_AT_type        : <0x449>
    <1007>   DW_AT_external    : 1
    <1008>   DW_AT_declaration : 1
 <1><1009>: Abbrev Number: 10 (DW_TAG_variable)
    <100a>   DW_AT_name        : (indirect string, offset: 0x912): sysent
    <100e>   DW_AT_decl_file   : 19
    <100f>   DW_AT_decl_line   : 1893
    <1011>   DW_AT_decl_column : 29
    <1012>   DW_AT_type        : <0x9c5>
    <1016>   DW_AT_external    : 1
    <1017>   DW_AT_declaration : 1
 <1><1018>: Abbrev Number: 10 (DW_TAG_variable)
    <1019>   DW_AT_name        : (indirect string, offset: 0xd1d): ioctlent
    <101d>   DW_AT_decl_file   : 19
    <101e>   DW_AT_decl_line   : 1894
    <1020>   DW_AT_decl_column : 31
    <1021>   DW_AT_type        : <0x1027>
    <1025>   DW_AT_external    : 1
    <1026>   DW_AT_declaration : 1
 <1><1027>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1028>   DW_AT_byte_size   : 4
    <1029>   DW_AT_type        : <0x8e0>
 <1><102d>: Abbrev Number: 10 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0x8fc): nsyscalls
    <1032>   DW_AT_decl_file   : 19
    <1033>   DW_AT_decl_line   : 1900
    <1035>   DW_AT_decl_column : 17
    <1036>   DW_AT_type        : <0x2b>
    <103a>   DW_AT_external    : 1
    <103b>   DW_AT_declaration : 1
 <1><103c>: Abbrev Number: 10 (DW_TAG_variable)
    <103d>   DW_AT_name        : (indirect string, offset: 0xf23): nioctlents
    <1041>   DW_AT_decl_file   : 19
    <1042>   DW_AT_decl_line   : 1901
    <1044>   DW_AT_decl_column : 17
    <1045>   DW_AT_type        : <0x2b>
    <1049>   DW_AT_external    : 1
    <104a>   DW_AT_declaration : 1
 <1><104b>: Abbrev Number: 15 (DW_TAG_array_type)
    <104c>   DW_AT_type        : <0x32>
    <1050>   DW_AT_sibling     : <0x105b>
 <2><1054>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1055>   DW_AT_type        : <0x2b>
    <1059>   DW_AT_upper_bound : 2
 <2><105a>: Abbrev Number: 0
 <1><105b>: Abbrev Number: 3 (DW_TAG_const_type)
    <105c>   DW_AT_type        : <0x104b>
 <1><1060>: Abbrev Number: 10 (DW_TAG_variable)
    <1061>   DW_AT_name        : (indirect string, offset: 0xfa2): nsyscall_vec
    <1065>   DW_AT_decl_file   : 19
    <1066>   DW_AT_decl_line   : 1903
    <1068>   DW_AT_decl_column : 27
    <1069>   DW_AT_type        : <0x105b>
    <106d>   DW_AT_external    : 1
    <106e>   DW_AT_declaration : 1
 <1><106f>: Abbrev Number: 15 (DW_TAG_array_type)
    <1070>   DW_AT_type        : <0x9cb>
    <1074>   DW_AT_sibling     : <0x107f>
 <2><1078>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1079>   DW_AT_type        : <0x2b>
    <107d>   DW_AT_upper_bound : 2
 <2><107e>: Abbrev Number: 0
 <1><107f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1080>   DW_AT_type        : <0x106f>
 <1><1084>: Abbrev Number: 10 (DW_TAG_variable)
    <1085>   DW_AT_name        : (indirect string, offset: 0x823): sysent_vec
    <1089>   DW_AT_decl_file   : 19
    <108a>   DW_AT_decl_line   : 1904
    <108c>   DW_AT_decl_column : 35
    <108d>   DW_AT_type        : <0x107f>
    <1091>   DW_AT_external    : 1
    <1092>   DW_AT_declaration : 1
 <1><1093>: Abbrev Number: 10 (DW_TAG_variable)
    <1094>   DW_AT_name        : (indirect string, offset: 0x3bb): inject_vec
    <1098>   DW_AT_decl_file   : 19
    <1099>   DW_AT_decl_line   : 1905
    <109b>   DW_AT_decl_column : 28
    <109c>   DW_AT_type        : <0x9d0>
    <10a0>   DW_AT_external    : 1
    <10a1>   DW_AT_declaration : 1
 <1><10a2>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a3>   DW_AT_name        : (indirect string, offset: 0xe15): audit_arch_t
    <10a7>   DW_AT_byte_size   : 8
    <10a8>   DW_AT_decl_file   : 19
    <10a9>   DW_AT_decl_line   : 1907
    <10ab>   DW_AT_decl_column : 8
    <10ac>   DW_AT_sibling     : <0x10d1>
 <2><10b0>: Abbrev Number: 22 (DW_TAG_member)
    <10b1>   DW_AT_name        : (indirect string, offset: 0x5bd): arch
    <10b5>   DW_AT_decl_file   : 19
    <10b6>   DW_AT_decl_line   : 1908
    <10b8>   DW_AT_decl_column : 15
    <10b9>   DW_AT_type        : <0x2b>
    <10bd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c0>: Abbrev Number: 22 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0xa6a): flag
    <10c5>   DW_AT_decl_file   : 19
    <10c6>   DW_AT_decl_line   : 1909
    <10c8>   DW_AT_decl_column : 15
    <10c9>   DW_AT_type        : <0x2b>
    <10cd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d0>: Abbrev Number: 0
 <1><10d1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d2>   DW_AT_type        : <0x10a2>
 <1><10d6>: Abbrev Number: 15 (DW_TAG_array_type)
    <10d7>   DW_AT_type        : <0x10d1>
    <10db>   DW_AT_sibling     : <0x10e6>
 <2><10df>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10e0>   DW_AT_type        : <0x2b>
    <10e4>   DW_AT_upper_bound : 2
 <2><10e5>: Abbrev Number: 0
 <1><10e6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e7>   DW_AT_type        : <0x10d6>
 <1><10eb>: Abbrev Number: 10 (DW_TAG_variable)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x9e1): audit_arch_vec
    <10f0>   DW_AT_decl_file   : 19
    <10f1>   DW_AT_decl_line   : 1912
    <10f3>   DW_AT_decl_column : 34
    <10f4>   DW_AT_type        : <0x10e6>
    <10f8>   DW_AT_external    : 1
    <10f9>   DW_AT_declaration : 1
 <1><10fa>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10fb>   DW_AT_byte_size   : 180
    <10fc>   DW_AT_decl_file   : 21
    <10fd>   DW_AT_decl_line   : 2
    <10fe>   DW_AT_decl_column : 9
    <10ff>   DW_AT_sibling     : <0x13b4>
 <2><1103>: Abbrev Number: 9 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0x1cc): block_ioctl
    <1108>   DW_AT_decl_file   : 21
    <1109>   DW_AT_decl_line   : 3
    <110a>   DW_AT_decl_column : 8
    <110b>   DW_AT_type        : <0x13ce>
    <110f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1112>: Abbrev Number: 9 (DW_TAG_member)
    <1113>   DW_AT_name        : (indirect string, offset: 0xb4a): btrfs_ioctl
    <1117>   DW_AT_decl_file   : 21
    <1118>   DW_AT_decl_line   : 6
    <1119>   DW_AT_decl_column : 8
    <111a>   DW_AT_type        : <0x13ce>
    <111e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1121>: Abbrev Number: 9 (DW_TAG_member)
    <1122>   DW_AT_name        : (indirect string, offset: 0x7a8): evdev_write_ioctl_mpers
    <1126>   DW_AT_decl_file   : 21
    <1127>   DW_AT_decl_line   : 9
    <1128>   DW_AT_decl_column : 8
    <1129>   DW_AT_type        : <0x13ce>
    <112d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1130>: Abbrev Number: 9 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0x77e): get_sock_fprog_size
    <1135>   DW_AT_decl_file   : 21
    <1136>   DW_AT_decl_line   : 12
    <1137>   DW_AT_decl_column : 17
    <1138>   DW_AT_type        : <0x13da>
    <113c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><113f>: Abbrev Number: 9 (DW_TAG_member)
    <1140>   DW_AT_name        : (indirect string, offset: 0x19b): fetch_bpf_fprog
    <1144>   DW_AT_decl_file   : 21
    <1145>   DW_AT_decl_line   : 15
    <1146>   DW_AT_decl_column : 10
    <1147>   DW_AT_type        : <0x13fa>
