Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1782 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5fb): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3f3): mpers-m32/semid_ds_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xed8): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3bb): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1040): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9e2): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x35e): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x269): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe36): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4ae): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8e8): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf33): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x918): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7c2): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbb2): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbe8): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2da): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd3e): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xca9): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x428): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x474): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x36a): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xbd3): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xfdb): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe46): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb5b): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x1123): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe71): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xb1d): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0x1004): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x291): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x3b3): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x102a): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x795): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc98): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xb98): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x372): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0xa65): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4fd): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xf88): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x803): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x12e): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x1079): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x95a): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x9cb): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xdd6): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1bf): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xcfb): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xb6): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x596): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x211): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xfef): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x7ef): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x894): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x244): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe97): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xd0b): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x16f): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x72d): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xaaf): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x100e): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3d7): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xc6e): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0xa27): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xa89): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x81d): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xb3d): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x4a3): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x31c): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x79): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x386): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x55c): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0x1053): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xe2f): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x250): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x570): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x27e): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xea6): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x706): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xc13): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1ac): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xf1a): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x37b): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xa19): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x10d2): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4e8): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xfaf): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0xa33): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x43a): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0x259): __kernel_mode_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 11
    <528>   DW_AT_decl_column : 24
    <529>   DW_AT_type        : <0x24>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0xaf3): __kernel_long_t
    <532>   DW_AT_decl_file   : 15
    <533>   DW_AT_decl_line   : 15
    <534>   DW_AT_decl_column : 15
    <535>   DW_AT_type        : <0xae>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x54b): __kernel_ulong_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 23
    <541>   DW_AT_type        : <0x37>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x6c9): __kernel_uid32_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 49
    <54c>   DW_AT_decl_column : 22
    <54d>   DW_AT_type        : <0x2b>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x5db): __kernel_gid32_t
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 50
    <558>   DW_AT_decl_column : 22
    <559>   DW_AT_type        : <0x2b>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x3e5): kernel_long_t
    <562>   DW_AT_decl_file   : 16
    <563>   DW_AT_decl_line   : 16
    <564>   DW_AT_decl_column : 25
    <565>   DW_AT_type        : <0x52d>
 <1><569>: Abbrev Number: 4 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x909): kernel_ulong_t
    <56e>   DW_AT_decl_file   : 16
    <56f>   DW_AT_decl_line   : 17
    <570>   DW_AT_decl_column : 26
    <571>   DW_AT_type        : <0x539>
 <1><575>: Abbrev Number: 3 (DW_TAG_const_type)
    <576>   DW_AT_type        : <0x569>
 <1><57a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <57b>   DW_AT_name        : (indirect string, offset: 0xc31): list_item
    <57f>   DW_AT_byte_size   : 8
    <580>   DW_AT_decl_file   : 17
    <581>   DW_AT_decl_line   : 92
    <582>   DW_AT_decl_column : 8
    <583>   DW_AT_sibling     : <0x5a6>
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x111e): prev
    <58c>   DW_AT_decl_file   : 17
    <58d>   DW_AT_decl_line   : 93
    <58e>   DW_AT_decl_column : 20
    <58f>   DW_AT_type        : <0x5a6>
    <593>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><596>: Abbrev Number: 9 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0x110d): next
    <59b>   DW_AT_decl_file   : 17
    <59c>   DW_AT_decl_line   : 94
    <59d>   DW_AT_decl_column : 20
    <59e>   DW_AT_type        : <0x5a6>
    <5a2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5a5>: Abbrev Number: 0
 <1><5a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a7>   DW_AT_byte_size   : 4
    <5a8>   DW_AT_type        : <0x57a>
 <1><5ac>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8e1): sysent
    <5b1>   DW_AT_byte_size   : 20
    <5b2>   DW_AT_decl_file   : 18
    <5b3>   DW_AT_decl_line   : 13
    <5b4>   DW_AT_decl_column : 16
    <5b5>   DW_AT_sibling     : <0x605>
 <2><5b9>: Abbrev Number: 9 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x106a): nargs
    <5be>   DW_AT_decl_file   : 18
    <5bf>   DW_AT_decl_line   : 14
    <5c0>   DW_AT_decl_column : 11
    <5c1>   DW_AT_type        : <0x2b>
    <5c5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x9d8): sys_flags
    <5cd>   DW_AT_decl_file   : 18
    <5ce>   DW_AT_decl_line   : 15
    <5cf>   DW_AT_decl_column : 6
    <5d0>   DW_AT_type        : <0x64>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5d7>: Abbrev Number: 18 (DW_TAG_member)
    <5d8>   DW_AT_name        : sen
    <5dc>   DW_AT_decl_file   : 18
    <5dd>   DW_AT_decl_line   : 16
    <5de>   DW_AT_decl_column : 6
    <5df>   DW_AT_type        : <0x64>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5e6>: Abbrev Number: 9 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x313): sys_func
    <5eb>   DW_AT_decl_file   : 18
    <5ec>   DW_AT_decl_line   : 17
    <5ed>   DW_AT_decl_column : 8
    <5ee>   DW_AT_type        : <0x85b>
    <5f2>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5f5>: Abbrev Number: 9 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x288): sys_name
    <5fa>   DW_AT_decl_file   : 18
    <5fb>   DW_AT_decl_line   : 18
    <5fc>   DW_AT_decl_column : 14
    <5fd>   DW_AT_type        : <0x1c9>
    <601>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <606>   DW_AT_prototyped  : 1
    <607>   DW_AT_type        : <0x64>
    <60b>   DW_AT_sibling     : <0x615>
 <2><60f>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <610>   DW_AT_type        : <0x615>
 <2><614>: Abbrev Number: 0
 <1><615>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <616>   DW_AT_byte_size   : 4
    <617>   DW_AT_type        : <0x620>
 <1><61b>: Abbrev Number: 3 (DW_TAG_const_type)
    <61c>   DW_AT_type        : <0x615>
 <1><620>: Abbrev Number: 21 (DW_TAG_structure_type)
    <621>   DW_AT_name        : tcb
    <625>   DW_AT_byte_size   : 200
    <626>   DW_AT_decl_file   : 19
    <627>   DW_AT_decl_line   : 262
    <629>   DW_AT_decl_column : 8
    <62a>   DW_AT_sibling     : <0x85b>
 <2><62e>: Abbrev Number: 22 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x4f7): flags
    <633>   DW_AT_decl_file   : 19
    <634>   DW_AT_decl_line   : 263
    <636>   DW_AT_decl_column : 6
    <637>   DW_AT_type        : <0x64>
    <63b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><63e>: Abbrev Number: 23 (DW_TAG_member)
    <63f>   DW_AT_name        : pid
    <643>   DW_AT_decl_file   : 19
    <644>   DW_AT_decl_line   : 264
    <646>   DW_AT_decl_column : 6
    <647>   DW_AT_type        : <0x64>
    <64b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><64e>: Abbrev Number: 22 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x58): qual_flg
    <653>   DW_AT_decl_file   : 19
    <654>   DW_AT_decl_line   : 265
    <656>   DW_AT_decl_column : 6
    <657>   DW_AT_type        : <0x64>
    <65b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><65e>: Abbrev Number: 22 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x39f): currpers
    <663>   DW_AT_decl_file   : 19
    <664>   DW_AT_decl_line   : 267
    <666>   DW_AT_decl_column : 15
    <667>   DW_AT_type        : <0x2b>
    <66b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><66e>: Abbrev Number: 22 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0xb90): u_error
    <673>   DW_AT_decl_file   : 19
    <674>   DW_AT_decl_line   : 269
    <676>   DW_AT_decl_column : 16
    <677>   DW_AT_type        : <0x37>
    <67b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><67e>: Abbrev Number: 22 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x18c): scno
    <683>   DW_AT_decl_file   : 19
    <684>   DW_AT_decl_line   : 270
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0x569>
    <68b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><68e>: Abbrev Number: 22 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0xbc9): true_scno
    <693>   DW_AT_decl_file   : 19
    <694>   DW_AT_decl_line   : 271
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x569>
    <69b>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><69e>: Abbrev Number: 22 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x196): u_arg
    <6a3>   DW_AT_decl_file   : 19
    <6a4>   DW_AT_decl_line   : 272
    <6a6>   DW_AT_decl_column : 17
    <6a7>   DW_AT_type        : <0x98b>
    <6ab>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6ae>: Abbrev Number: 22 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x9ef): u_rval
    <6b3>   DW_AT_decl_file   : 19
    <6b4>   DW_AT_decl_line   : 273
    <6b6>   DW_AT_decl_column : 16
    <6b7>   DW_AT_type        : <0x55d>
    <6bb>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6be>: Abbrev Number: 22 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xb0f): sys_func_rval
    <6c3>   DW_AT_decl_file   : 19
    <6c4>   DW_AT_decl_line   : 274
    <6c6>   DW_AT_decl_column : 6
    <6c7>   DW_AT_type        : <0x64>
    <6cb>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6ce>: Abbrev Number: 22 (DW_TAG_member)
    <6cf>   DW_AT_name        : (indirect string, offset: 0xd25): curcol
    <6d3>   DW_AT_decl_file   : 19
    <6d4>   DW_AT_decl_line   : 275
    <6d6>   DW_AT_decl_column : 6
    <6d7>   DW_AT_type        : <0x64>
    <6db>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6de>: Abbrev Number: 22 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0xa01): outf
    <6e3>   DW_AT_decl_file   : 19
    <6e4>   DW_AT_decl_line   : 276
    <6e6>   DW_AT_decl_column : 8
    <6e7>   DW_AT_type        : <0x40e>
    <6eb>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ee>: Abbrev Number: 22 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0xf59): staged_output_data
    <6f3>   DW_AT_decl_file   : 19
    <6f4>   DW_AT_decl_line   : 277
    <6f6>   DW_AT_decl_column : 29
    <6f7>   DW_AT_type        : <0x9a1>
    <6fb>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6fe>: Abbrev Number: 22 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xada): auxstr
    <703>   DW_AT_decl_file   : 19
    <704>   DW_AT_decl_line   : 279
    <706>   DW_AT_decl_column : 14
    <707>   DW_AT_type        : <0x1c9>
    <70b>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><70e>: Abbrev Number: 22 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x175): _priv_data
    <713>   DW_AT_decl_file   : 19
    <714>   DW_AT_decl_line   : 280
    <716>   DW_AT_decl_column : 8
    <717>   DW_AT_type        : <0xcd>
    <71b>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><71e>: Abbrev Number: 22 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0xc5e): _free_priv_data
    <723>   DW_AT_decl_file   : 19
    <724>   DW_AT_decl_line   : 281
    <726>   DW_AT_decl_column : 9
    <727>   DW_AT_type        : <0x9b3>
    <72b>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><72e>: Abbrev Number: 22 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x186): s_ent
    <733>   DW_AT_decl_file   : 19
    <734>   DW_AT_decl_line   : 282
    <736>   DW_AT_decl_column : 23
    <737>   DW_AT_type        : <0x9b9>
    <73b>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><73e>: Abbrev Number: 22 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <743>   DW_AT_decl_file   : 19
    <744>   DW_AT_decl_line   : 285
    <746>   DW_AT_decl_column : 23
    <747>   DW_AT_type        : <0x9b9>
    <74b>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><74e>: Abbrev Number: 22 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x394): inject_vec
    <753>   DW_AT_decl_file   : 19
    <754>   DW_AT_decl_line   : 286
    <756>   DW_AT_decl_column : 22
    <757>   DW_AT_type        : <0x9c4>
    <75b>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><75e>: Abbrev Number: 22 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x835): stime
    <763>   DW_AT_decl_file   : 19
    <764>   DW_AT_decl_line   : 287
    <766>   DW_AT_decl_column : 18
    <767>   DW_AT_type        : <0x133>
    <76b>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><76e>: Abbrev Number: 22 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x3a8): ltime
    <773>   DW_AT_decl_file   : 19
    <774>   DW_AT_decl_line   : 288
    <776>   DW_AT_decl_column : 18
    <777>   DW_AT_type        : <0x133>
    <77b>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><77e>: Abbrev Number: 22 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x1031): atime
    <783>   DW_AT_decl_file   : 19
    <784>   DW_AT_decl_line   : 289
    <786>   DW_AT_decl_column : 18
    <787>   DW_AT_type        : <0x133>
    <78b>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><78e>: Abbrev Number: 22 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0x4f1): etime
    <793>   DW_AT_decl_file   : 19
    <794>   DW_AT_decl_line   : 290
    <796>   DW_AT_decl_column : 18
    <797>   DW_AT_type        : <0x133>
    <79b>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><79f>: Abbrev Number: 22 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0xd93): delay_expiration_time
    <7a4>   DW_AT_decl_file   : 19
    <7a5>   DW_AT_decl_line   : 291
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x133>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7b0>: Abbrev Number: 22 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7b5>   DW_AT_decl_file   : 19
    <7b6>   DW_AT_decl_line   : 298
    <7b8>   DW_AT_decl_column : 15
    <7b9>   DW_AT_type        : <0x2b>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7c1>: Abbrev Number: 22 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0xf95): last_dirfd
    <7c6>   DW_AT_decl_file   : 19
    <7c7>   DW_AT_decl_line   : 301
    <7c9>   DW_AT_decl_column : 6
    <7ca>   DW_AT_type        : <0x64>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7d2>: Abbrev Number: 22 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0xfbb): mmap_cache
    <7d7>   DW_AT_decl_file   : 19
    <7d8>   DW_AT_decl_line   : 304
    <7da>   DW_AT_decl_column : 23
    <7db>   DW_AT_type        : <0x9e0>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7e3>: Abbrev Number: 22 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xb9f): wait_data_idx
    <7e8>   DW_AT_decl_file   : 19
    <7e9>   DW_AT_decl_line   : 311
    <7eb>   DW_AT_decl_column : 9
    <7ec>   DW_AT_type        : <0x122>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7f4>: Abbrev Number: 22 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xae1): delayed_wait_data
    <7f9>   DW_AT_decl_file   : 19
    <7fa>   DW_AT_decl_line   : 313
    <7fc>   DW_AT_decl_column : 24
    <7fd>   DW_AT_type        : <0x9ec>
    <801>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><805>: Abbrev Number: 22 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xb51): wait_list
    <80a>   DW_AT_decl_file   : 19
    <80b>   DW_AT_decl_line   : 314
    <80d>   DW_AT_decl_column : 19
    <80e>   DW_AT_type        : <0x57a>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><816>: Abbrev Number: 22 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x71e): vcpu_info_list
    <81b>   DW_AT_decl_file   : 19
    <81c>   DW_AT_decl_line   : 318
    <81e>   DW_AT_decl_column : 20
    <81f>   DW_AT_type        : <0x9f8>
    <823>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><827>: Abbrev Number: 22 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0xcf0): unwind_ctx
    <82c>   DW_AT_decl_file   : 19
    <82d>   DW_AT_decl_line   : 322
    <82f>   DW_AT_decl_column : 8
    <830>   DW_AT_type        : <0xcd>
    <834>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><838>: Abbrev Number: 22 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x4db): unwind_queue
    <83d>   DW_AT_decl_file   : 19
    <83e>   DW_AT_decl_line   : 323
    <840>   DW_AT_decl_column : 25
    <841>   DW_AT_type        : <0xa04>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><849>: Abbrev Number: 22 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x16a): comm
    <84e>   DW_AT_decl_file   : 19
    <84f>   DW_AT_decl_line   : 327
    <851>   DW_AT_decl_column : 7
    <852>   DW_AT_type        : <0xa0a>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><85a>: Abbrev Number: 0
 <1><85b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <85c>   DW_AT_byte_size   : 4
    <85d>   DW_AT_type        : <0x605>
 <1><861>: Abbrev Number: 4 (DW_TAG_typedef)
    <862>   DW_AT_name        : (indirect string, offset: 0x53d): struct_sysent
    <866>   DW_AT_decl_file   : 18
    <867>   DW_AT_decl_line   : 19
    <868>   DW_AT_decl_column : 3
    <869>   DW_AT_type        : <0x5ac>
 <1><86d>: Abbrev Number: 3 (DW_TAG_const_type)
    <86e>   DW_AT_type        : <0x861>
 <1><872>: Abbrev Number: 11 (DW_TAG_variable)
    <873>   DW_AT_name        : (indirect string, offset: 0xd7f): current_personality
    <877>   DW_AT_decl_file   : 19
    <878>   DW_AT_decl_line   : 158
    <879>   DW_AT_decl_column : 17
    <87a>   DW_AT_type        : <0x2b>
    <87e>   DW_AT_external    : 1
    <87f>   DW_AT_declaration : 1
 <1><880>: Abbrev Number: 11 (DW_TAG_variable)
    <881>   DW_AT_name        : (indirect string, offset: 0x883): current_wordsize
    <885>   DW_AT_decl_file   : 19
    <886>   DW_AT_decl_line   : 171
    <887>   DW_AT_decl_column : 17
    <888>   DW_AT_type        : <0x2b>
    <88c>   DW_AT_external    : 1
    <88d>   DW_AT_declaration : 1
 <1><88e>: Abbrev Number: 11 (DW_TAG_variable)
    <88f>   DW_AT_name        : (indirect string, offset: 0xab8): current_klongsize
    <893>   DW_AT_decl_file   : 19
    <894>   DW_AT_decl_line   : 176
    <895>   DW_AT_decl_column : 17
    <896>   DW_AT_type        : <0x2b>
    <89a>   DW_AT_external    : 1
    <89b>   DW_AT_declaration : 1
 <1><89c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <89d>   DW_AT_name        : (indirect string, offset: 0xcc7): ioctlent
    <8a1>   DW_AT_byte_size   : 8
    <8a2>   DW_AT_decl_file   : 19
    <8a3>   DW_AT_decl_line   : 217
    <8a4>   DW_AT_decl_column : 16
    <8a5>   DW_AT_sibling     : <0x8c8>
 <2><8a9>: Abbrev Number: 9 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xf81): symbol
    <8ae>   DW_AT_decl_file   : 19
    <8af>   DW_AT_decl_line   : 218
    <8b0>   DW_AT_decl_column : 14
    <8b1>   DW_AT_type        : <0x1c9>
    <8b5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b8>: Abbrev Number: 9 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xd48): code
    <8bd>   DW_AT_decl_file   : 19
    <8be>   DW_AT_decl_line   : 219
    <8bf>   DW_AT_decl_column : 15
    <8c0>   DW_AT_type        : <0x2b>
    <8c4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8c7>: Abbrev Number: 0
 <1><8c8>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c9>   DW_AT_name        : (indirect string, offset: 0xc88): struct_ioctlent
    <8cd>   DW_AT_decl_file   : 19
    <8ce>   DW_AT_decl_line   : 220
    <8cf>   DW_AT_decl_column : 3
    <8d0>   DW_AT_type        : <0x89c>
 <1><8d4>: Abbrev Number: 3 (DW_TAG_const_type)
    <8d5>   DW_AT_type        : <0x8c8>
 <1><8d9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8da>   DW_AT_name        : (indirect string, offset: 0x877): inject_data
    <8de>   DW_AT_byte_size   : 10
    <8df>   DW_AT_decl_file   : 19
    <8e0>   DW_AT_decl_line   : 241
    <8e1>   DW_AT_decl_column : 8
    <8e2>   DW_AT_sibling     : <0x941>
 <2><8e6>: Abbrev Number: 9 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x4f7): flags
    <8eb>   DW_AT_decl_file   : 19
    <8ec>   DW_AT_decl_line   : 242
    <8ed>   DW_AT_decl_column : 10
    <8ee>   DW_AT_type        : <0xf2>
    <8f2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f5>: Abbrev Number: 9 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x98c): signo
    <8fa>   DW_AT_decl_file   : 19
    <8fb>   DW_AT_decl_line   : 243
    <8fc>   DW_AT_decl_column : 10
    <8fd>   DW_AT_type        : <0xf2>
    <901>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><904>: Abbrev Number: 9 (DW_TAG_member)
    <905>   DW_AT_name        : (indirect string, offset: 0xfc): rval_idx
    <909>   DW_AT_decl_file   : 19
    <90a>   DW_AT_decl_line   : 244
    <90b>   DW_AT_decl_column : 11
    <90c>   DW_AT_type        : <0xfe>
    <910>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><913>: Abbrev Number: 9 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0xd1b): delay_idx
    <918>   DW_AT_decl_file   : 19
    <919>   DW_AT_decl_line   : 245
    <91a>   DW_AT_decl_column : 11
    <91b>   DW_AT_type        : <0xfe>
    <91f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><922>: Abbrev Number: 9 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0x588): poke_idx
    <927>   DW_AT_decl_file   : 19
    <928>   DW_AT_decl_line   : 246
    <929>   DW_AT_decl_column : 11
    <92a>   DW_AT_type        : <0xfe>
    <92e>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><931>: Abbrev Number: 9 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x18c): scno
    <936>   DW_AT_decl_file   : 19
    <937>   DW_AT_decl_line   : 247
    <938>   DW_AT_decl_column : 11
    <939>   DW_AT_type        : <0xfe>
    <93d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><940>: Abbrev Number: 0
 <1><941>: Abbrev Number: 8 (DW_TAG_structure_type)
    <942>   DW_AT_name        : (indirect string, offset: 0xdd): inject_opts
    <946>   DW_AT_byte_size   : 16
    <947>   DW_AT_decl_file   : 19
    <948>   DW_AT_decl_line   : 250
    <949>   DW_AT_decl_column : 8
    <94a>   DW_AT_sibling     : <0x98b>
 <2><94e>: Abbrev Number: 9 (DW_TAG_member)
    <94f>   DW_AT_name        : (indirect string, offset: 0xa83): first
    <953>   DW_AT_decl_file   : 19
    <954>   DW_AT_decl_line   : 251
    <955>   DW_AT_decl_column : 11
    <956>   DW_AT_type        : <0xfe>
    <95a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><95d>: Abbrev Number: 9 (DW_TAG_member)
    <95e>   DW_AT_name        : (indirect string, offset: 0x1147): last
    <962>   DW_AT_decl_file   : 19
    <963>   DW_AT_decl_line   : 252
    <964>   DW_AT_decl_column : 11
    <965>   DW_AT_type        : <0xfe>
    <969>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><96c>: Abbrev Number: 9 (DW_TAG_member)
    <96d>   DW_AT_name        : (indirect string, offset: 0x3ae): step
    <971>   DW_AT_decl_file   : 19
    <972>   DW_AT_decl_line   : 253
    <973>   DW_AT_decl_column : 11
    <974>   DW_AT_type        : <0xfe>
    <978>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><97b>: Abbrev Number: 9 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0x1112): data
    <980>   DW_AT_decl_file   : 19
    <981>   DW_AT_decl_line   : 254
    <982>   DW_AT_decl_column : 21
    <983>   DW_AT_type        : <0x8d9>
    <987>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><98a>: Abbrev Number: 0
 <1><98b>: Abbrev Number: 15 (DW_TAG_array_type)
    <98c>   DW_AT_type        : <0x569>
    <990>   DW_AT_sibling     : <0x99b>
 <2><994>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <995>   DW_AT_type        : <0x2b>
    <999>   DW_AT_upper_bound : 5
 <2><99a>: Abbrev Number: 0
 <1><99b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <99c>   DW_AT_name        : (indirect string, offset: 0xf59): staged_output_data
    <9a0>   DW_AT_declaration : 1
 <1><9a1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a2>   DW_AT_byte_size   : 4
    <9a3>   DW_AT_type        : <0x99b>
 <1><9a7>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a8>   DW_AT_prototyped  : 1
    <9a9>   DW_AT_sibling     : <0x9b3>
 <2><9ad>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ae>   DW_AT_type        : <0xcd>
 <2><9b2>: Abbrev Number: 0
 <1><9b3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b4>   DW_AT_byte_size   : 4
    <9b5>   DW_AT_type        : <0x9a7>
 <1><9b9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ba>   DW_AT_byte_size   : 4
    <9bb>   DW_AT_type        : <0x86d>
 <1><9bf>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c0>   DW_AT_type        : <0x9b9>
 <1><9c4>: Abbrev Number: 15 (DW_TAG_array_type)
    <9c5>   DW_AT_type        : <0x9d4>
    <9c9>   DW_AT_sibling     : <0x9d4>
 <2><9cd>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9ce>   DW_AT_type        : <0x2b>
    <9d2>   DW_AT_upper_bound : 2
 <2><9d3>: Abbrev Number: 0
 <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x941>
 <1><9da>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0xa9): mmap_cache_t
    <9df>   DW_AT_declaration : 1
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9da>
 <1><9e6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x3c9): tcb_wait_data
    <9eb>   DW_AT_declaration : 1
 <1><9ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9e6>
 <1><9f2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x160): vcpu_info
    <9f7>   DW_AT_declaration : 1
 <1><9f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
    <9fa>   DW_AT_type        : <0x9f2>
 <1><9fe>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ff>   DW_AT_name        : (indirect string, offset: 0xf3d): unwind_queue_t
    <a03>   DW_AT_declaration : 1
 <1><a04>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a05>   DW_AT_byte_size   : 4
    <a06>   DW_AT_type        : <0x9fe>
 <1><a0a>: Abbrev Number: 15 (DW_TAG_array_type)
    <a0b>   DW_AT_type        : <0xe6>
    <a0f>   DW_AT_sibling     : <0xa1a>
 <2><a13>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a14>   DW_AT_type        : <0x2b>
    <a18>   DW_AT_upper_bound : 15
 <2><a19>: Abbrev Number: 0
 <1><a1a>: Abbrev Number: 10 (DW_TAG_variable)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xbdc): stub_sysent
    <a1f>   DW_AT_decl_file   : 19
    <a20>   DW_AT_decl_line   : 400
    <a22>   DW_AT_decl_column : 28
    <a23>   DW_AT_type        : <0x86d>
    <a27>   DW_AT_external    : 1
    <a28>   DW_AT_declaration : 1
 <1><a29>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x10f5): xlat_type
    <a2e>   DW_AT_encoding    : 7	(unsigned)
    <a2f>   DW_AT_byte_size   : 4
    <a30>   DW_AT_type        : <0x2b>
    <a34>   DW_AT_decl_file   : 20
    <a35>   DW_AT_decl_line   : 13
    <a36>   DW_AT_decl_column : 6
    <a37>   DW_AT_sibling     : <0xa4e>
 <2><a3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x2e3): XT_NORMAL
    <a40>   DW_AT_const_value : 0
 <2><a41>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0xc9f): XT_SORTED
    <a46>   DW_AT_const_value : 1
 <2><a47>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0xe0b): XT_INDEXED
    <a4c>   DW_AT_const_value : 2
 <2><a4d>: Abbrev Number: 0
 <1><a4e>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xc08): xlat_style
    <a53>   DW_AT_encoding    : 7	(unsigned)
    <a54>   DW_AT_byte_size   : 4
    <a55>   DW_AT_type        : <0x2b>
    <a59>   DW_AT_decl_file   : 20
    <a5a>   DW_AT_decl_line   : 19
    <a5b>   DW_AT_decl_column : 6
    <a5c>   DW_AT_sibling     : <0xa8b>
 <2><a60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0xe9): XLAT_STYLE_DEFAULT
    <a65>   DW_AT_const_value : 0
 <2><a66>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0xc3b): XLAT_STYLE_RAW
    <a6b>   DW_AT_const_value : 1
 <2><a6c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x10c0): XLAT_STYLE_ABBREV
    <a71>   DW_AT_const_value : 2
 <2><a72>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x300): XLAT_STYLE_VERBOSE
    <a77>   DW_AT_const_value : 3
 <2><a78>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a7d>   DW_AT_const_value : 0
 <2><a7e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a83>   DW_AT_const_value : 4
 <2><a84>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a85>   DW_AT_name        : (indirect string, offset: 0x1136): XLAT_STYLE_FMT_D
    <a89>   DW_AT_const_value : 8
 <2><a8a>: Abbrev Number: 0
 <1><a8b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x331): xlat_data
    <a90>   DW_AT_byte_size   : 12
    <a91>   DW_AT_decl_file   : 20
    <a92>   DW_AT_decl_line   : 51
    <a93>   DW_AT_decl_column : 8
    <a94>   DW_AT_sibling     : <0xab7>
 <2><a98>: Abbrev Number: 18 (DW_TAG_member)
    <a99>   DW_AT_name        : val
    <a9d>   DW_AT_decl_file   : 20
    <a9e>   DW_AT_decl_line   : 52
    <a9f>   DW_AT_decl_column : 11
    <aa0>   DW_AT_type        : <0x116>
    <aa4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aa7>: Abbrev Number: 18 (DW_TAG_member)
    <aa8>   DW_AT_name        : str
    <aac>   DW_AT_decl_file   : 20
    <aad>   DW_AT_decl_line   : 53
    <aae>   DW_AT_decl_column : 14
    <aaf>   DW_AT_type        : <0x1c9>
    <ab3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ab6>: Abbrev Number: 0
 <1><ab7>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab8>   DW_AT_type        : <0xa8b>
 <1><abc>: Abbrev Number: 8 (DW_TAG_structure_type)
    <abd>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ac1>   DW_AT_byte_size   : 24
    <ac2>   DW_AT_decl_file   : 20
    <ac3>   DW_AT_decl_line   : 56
    <ac4>   DW_AT_decl_column : 8
    <ac5>   DW_AT_sibling     : <0xb15>
 <2><ac9>: Abbrev Number: 9 (DW_TAG_member)
    <aca>   DW_AT_name        : (indirect string, offset: 0x1112): data
    <ace>   DW_AT_decl_file   : 20
    <acf>   DW_AT_decl_line   : 57
    <ad0>   DW_AT_decl_column : 26
    <ad1>   DW_AT_type        : <0xb1a>
    <ad5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad8>: Abbrev Number: 9 (DW_TAG_member)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x8d5): flags_strsz
    <add>   DW_AT_decl_file   : 20
    <ade>   DW_AT_decl_line   : 58
    <adf>   DW_AT_decl_column : 9
    <ae0>   DW_AT_type        : <0x122>
    <ae4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ae7>: Abbrev Number: 9 (DW_TAG_member)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xbad): size
    <aec>   DW_AT_decl_file   : 20
    <aed>   DW_AT_decl_line   : 59
    <aee>   DW_AT_decl_column : 11
    <aef>   DW_AT_type        : <0x10a>
    <af3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af6>: Abbrev Number: 9 (DW_TAG_member)
    <af7>   DW_AT_name        : (indirect string, offset: 0x191): type
    <afb>   DW_AT_decl_file   : 20
    <afc>   DW_AT_decl_line   : 60
    <afd>   DW_AT_decl_column : 17
    <afe>   DW_AT_type        : <0xa29>
    <b02>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b05>: Abbrev Number: 9 (DW_TAG_member)
    <b06>   DW_AT_name        : (indirect string, offset: 0x772): flags_mask
    <b0a>   DW_AT_decl_file   : 20
    <b0b>   DW_AT_decl_line   : 61
    <b0c>   DW_AT_decl_column : 11
    <b0d>   DW_AT_type        : <0x116>
    <b11>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b14>: Abbrev Number: 0
 <1><b15>: Abbrev Number: 3 (DW_TAG_const_type)
    <b16>   DW_AT_type        : <0xabc>
 <1><b1a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b1b>   DW_AT_byte_size   : 4
    <b1c>   DW_AT_type        : <0xab7>
 <1><b20>: Abbrev Number: 15 (DW_TAG_array_type)
    <b21>   DW_AT_type        : <0xb15>
    <b25>   DW_AT_sibling     : <0xb2b>
 <2><b29>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b2a>: Abbrev Number: 0
 <1><b2b>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2c>   DW_AT_type        : <0xb20>
 <1><b30>: Abbrev Number: 10 (DW_TAG_variable)
    <b31>   DW_AT_name        : (indirect string, offset: 0xe84): addrfams
    <b35>   DW_AT_decl_file   : 19
    <b36>   DW_AT_decl_line   : 406
    <b38>   DW_AT_decl_column : 26
    <b39>   DW_AT_type        : <0xb2b>
    <b3d>   DW_AT_external    : 1
    <b3e>   DW_AT_declaration : 1
 <1><b3f>: Abbrev Number: 10 (DW_TAG_variable)
    <b40>   DW_AT_name        : (indirect string, offset: 0xd58): arp_hardware_types
    <b44>   DW_AT_decl_file   : 19
    <b45>   DW_AT_decl_line   : 407
    <b47>   DW_AT_decl_column : 26
    <b48>   DW_AT_type        : <0xb2b>
    <b4c>   DW_AT_external    : 1
    <b4d>   DW_AT_declaration : 1
 <1><b4e>: Abbrev Number: 10 (DW_TAG_variable)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x1037): at_flags
    <b53>   DW_AT_decl_file   : 19
    <b54>   DW_AT_decl_line   : 408
    <b56>   DW_AT_decl_column : 26
    <b57>   DW_AT_type        : <0xb2b>
    <b5b>   DW_AT_external    : 1
    <b5c>   DW_AT_declaration : 1
 <1><b5d>: Abbrev Number: 10 (DW_TAG_variable)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x4b9): clocknames
    <b62>   DW_AT_decl_file   : 19
    <b63>   DW_AT_decl_line   : 409
    <b65>   DW_AT_decl_column : 26
    <b66>   DW_AT_type        : <0xb2b>
    <b6a>   DW_AT_external    : 1
    <b6b>   DW_AT_declaration : 1
 <1><b6c>: Abbrev Number: 10 (DW_TAG_variable)
    <b6d>   DW_AT_name        : (indirect string, offset: 0xff7): dirent_types
    <b71>   DW_AT_decl_file   : 19
    <b72>   DW_AT_decl_line   : 410
    <b74>   DW_AT_decl_column : 26
    <b75>   DW_AT_type        : <0xb2b>
    <b79>   DW_AT_external    : 1
    <b7a>   DW_AT_declaration : 1
 <1><b7b>: Abbrev Number: 10 (DW_TAG_variable)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x926): ethernet_protocols
    <b80>   DW_AT_decl_file   : 19
    <b81>   DW_AT_decl_line   : 411
    <b83>   DW_AT_decl_column : 26
    <b84>   DW_AT_type        : <0xb2b>
    <b88>   DW_AT_external    : 1
    <b89>   DW_AT_declaration : 1
 <1><b8a>: Abbrev Number: 10 (DW_TAG_variable)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x5ec): inet_protocols
    <b8f>   DW_AT_decl_file   : 19
    <b90>   DW_AT_decl_line   : 412
    <b92>   DW_AT_decl_column : 26
    <b93>   DW_AT_type        : <0xb2b>
    <b97>   DW_AT_external    : 1
    <b98>   DW_AT_declaration : 1
 <1><b99>: Abbrev Number: 10 (DW_TAG_variable)
    <b9a>   DW_AT_name        : (indirect string, offset: 0x2d0): evdev_abs
    <b9e>   DW_AT_decl_file   : 19
    <b9f>   DW_AT_decl_line   : 413
    <ba1>   DW_AT_decl_column : 26
    <ba2>   DW_AT_type        : <0xb2b>
    <ba6>   DW_AT_external    : 1
    <ba7>   DW_AT_declaration : 1
 <1><ba8>: Abbrev Number: 10 (DW_TAG_variable)
    <ba9>   DW_AT_name        : (indirect string, offset: 0x767): audit_arch
    <bad>   DW_AT_decl_file   : 19
    <bae>   DW_AT_decl_line   : 414
    <bb0>   DW_AT_decl_column : 26
    <bb1>   DW_AT_type        : <0xb2b>
    <bb5>   DW_AT_external    : 1
    <bb6>   DW_AT_declaration : 1
 <1><bb7>: Abbrev Number: 10 (DW_TAG_variable)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x95): evdev_ev
    <bbc>   DW_AT_decl_file   : 19
    <bbd>   DW_AT_decl_line   : 415
    <bbf>   DW_AT_decl_column : 26
    <bc0>   DW_AT_type        : <0xb2b>
    <bc4>   DW_AT_external    : 1
    <bc5>   DW_AT_declaration : 1
 <1><bc6>: Abbrev Number: 10 (DW_TAG_variable)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x49a): iffflags
    <bcb>   DW_AT_decl_file   : 19
    <bcc>   DW_AT_decl_line   : 416
    <bce>   DW_AT_decl_column : 26
    <bcf>   DW_AT_type        : <0xb2b>
    <bd3>   DW_AT_external    : 1
    <bd4>   DW_AT_declaration : 1
 <1><bd5>: Abbrev Number: 10 (DW_TAG_variable)
    <bd6>   DW_AT_name        : (indirect string, offset: 0xc4a): ip_type_of_services
    <bda>   DW_AT_decl_file   : 19
    <bdb>   DW_AT_decl_line   : 417
    <bdd>   DW_AT_decl_column : 26
    <bde>   DW_AT_type        : <0xb2b>
    <be2>   DW_AT_external    : 1
    <be3>   DW_AT_declaration : 1
 <1><be4>: Abbrev Number: 10 (DW_TAG_variable)
    <be5>   DW_AT_name        : (indirect string, offset: 0x6fa): ipc_private
    <be9>   DW_AT_decl_file   : 19
    <bea>   DW_AT_decl_line   : 418
    <bec>   DW_AT_decl_column : 26
    <bed>   DW_AT_type        : <0xb2b>
    <bf1>   DW_AT_external    : 1
    <bf2>   DW_AT_declaration : 1
 <1><bf3>: Abbrev Number: 10 (DW_TAG_variable)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x327): msg_flags
    <bf8>   DW_AT_decl_file   : 19
    <bf9>   DW_AT_decl_line   : 419
    <bfb>   DW_AT_decl_column : 26
    <bfc>   DW_AT_type        : <0xb2b>
    <c00>   DW_AT_external    : 1
    <c01>   DW_AT_declaration : 1
 <1><c02>: Abbrev Number: 10 (DW_TAG_variable)
    <c03>   DW_AT_name        : (indirect string, offset: 0x105): netlink_protocols
    <c07>   DW_AT_decl_file   : 19
    <c08>   DW_AT_decl_line   : 420
    <c0a>   DW_AT_decl_column : 26
    <c0b>   DW_AT_type        : <0xb2b>
    <c0f>   DW_AT_external    : 1
    <c10>   DW_AT_declaration : 1
 <1><c11>: Abbrev Number: 10 (DW_TAG_variable)
    <c12>   DW_AT_name        : (indirect string, offset: 0xf6c): nl_bridge_vlan_flags
    <c16>   DW_AT_decl_file   : 19
    <c17>   DW_AT_decl_line   : 421
    <c19>   DW_AT_decl_column : 26
    <c1a>   DW_AT_type        : <0xb2b>
    <c1e>   DW_AT_external    : 1
    <c1f>   DW_AT_declaration : 1
 <1><c20>: Abbrev Number: 10 (DW_TAG_variable)
    <c21>   DW_AT_name        : (indirect string, offset: 0xdf4): nl_netfilter_msg_types
    <c25>   DW_AT_decl_file   : 19
    <c26>   DW_AT_decl_line   : 422
    <c28>   DW_AT_decl_column : 26
    <c29>   DW_AT_type        : <0xb2b>
    <c2d>   DW_AT_external    : 1
    <c2e>   DW_AT_declaration : 1
 <1><c2f>: Abbrev Number: 10 (DW_TAG_variable)
    <c30>   DW_AT_name        : (indirect string, offset: 0x221): nl_route_types
    <c34>   DW_AT_decl_file   : 19
    <c35>   DW_AT_decl_line   : 423
    <c37>   DW_AT_decl_column : 26
    <c38>   DW_AT_type        : <0xb2b>
    <c3c>   DW_AT_external    : 1
    <c3d>   DW_AT_declaration : 1
 <1><c3e>: Abbrev Number: 10 (DW_TAG_variable)
    <c3f>   DW_AT_name        : (indirect string, offset: 0xebb): open_access_modes
    <c43>   DW_AT_decl_file   : 19
    <c44>   DW_AT_decl_line   : 424
    <c46>   DW_AT_decl_column : 26
    <c47>   DW_AT_type        : <0xb2b>
    <c4b>   DW_AT_external    : 1
    <c4c>   DW_AT_declaration : 1
 <1><c4d>: Abbrev Number: 10 (DW_TAG_variable)
    <c4e>   DW_AT_name        : (indirect string, offset: 0x85): open_mode_flags
    <c52>   DW_AT_decl_file   : 19
    <c53>   DW_AT_decl_line   : 425
    <c55>   DW_AT_decl_column : 26
    <c56>   DW_AT_type        : <0xb2b>
    <c5a>   DW_AT_external    : 1
    <c5b>   DW_AT_declaration : 1
 <1><c5c>: Abbrev Number: 10 (DW_TAG_variable)
    <c5d>   DW_AT_name        : (indirect string, offset: 0xc7b): perf_type_id
    <c61>   DW_AT_decl_file   : 19
    <c62>   DW_AT_decl_line   : 426
    <c64>   DW_AT_decl_column : 26
    <c65>   DW_AT_type        : <0xb2b>
    <c69>   DW_AT_external    : 1
    <c6a>   DW_AT_declaration : 1
 <1><c6b>: Abbrev Number: 10 (DW_TAG_variable)
    <c6c>   DW_AT_name        : (indirect string, offset: 0xe8d): pollflags
    <c70>   DW_AT_decl_file   : 19
    <c71>   DW_AT_decl_line   : 427
    <c73>   DW_AT_decl_column : 26
    <c74>   DW_AT_type        : <0xb2b>
    <c78>   DW_AT_external    : 1
    <c79>   DW_AT_declaration : 1
 <1><c7a>: Abbrev Number: 10 (DW_TAG_variable)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x57c): ptrace_cmds
    <c7f>   DW_AT_decl_file   : 19
    <c80>   DW_AT_decl_line   : 428
    <c82>   DW_AT_decl_column : 26
    <c83>   DW_AT_type        : <0xb2b>
    <c87>   DW_AT_external    : 1
    <c88>   DW_AT_declaration : 1
 <1><c89>: Abbrev Number: 10 (DW_TAG_variable)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x868): resource_flags
    <c8e>   DW_AT_decl_file   : 19
    <c8f>   DW_AT_decl_line   : 429
    <c91>   DW_AT_decl_column : 26
    <c92>   DW_AT_type        : <0xb2b>
    <c96>   DW_AT_external    : 1
    <c97>   DW_AT_declaration : 1
 <1><c98>: Abbrev Number: 10 (DW_TAG_variable)
    <c99>   DW_AT_name        : (indirect string, offset: 0x2a6): route_nexthop_flags
    <c9d>   DW_AT_decl_file   : 19
    <c9e>   DW_AT_decl_line   : 430
    <ca0>   DW_AT_decl_column : 26
    <ca1>   DW_AT_type        : <0xb2b>
    <ca5>   DW_AT_external    : 1
    <ca6>   DW_AT_declaration : 1
 <1><ca7>: Abbrev Number: 10 (DW_TAG_variable)
    <ca8>   DW_AT_name        : (indirect string, offset: 0xef7): routing_protocols
    <cac>   DW_AT_decl_file   : 19
    <cad>   DW_AT_decl_line   : 431
    <caf>   DW_AT_decl_column : 26
    <cb0>   DW_AT_type        : <0xb2b>
    <cb4>   DW_AT_external    : 1
    <cb5>   DW_AT_declaration : 1
 <1><cb6>: Abbrev Number: 10 (DW_TAG_variable)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x48b): routing_scopes
    <cbb>   DW_AT_decl_file   : 19
    <cbc>   DW_AT_decl_line   : 432
    <cbe>   DW_AT_decl_column : 26
    <cbf>   DW_AT_type        : <0xb2b>
    <cc3>   DW_AT_external    : 1
    <cc4>   DW_AT_declaration : 1
 <1><cc5>: Abbrev Number: 10 (DW_TAG_variable)
    <cc6>   DW_AT_name        : (indirect string, offset: 0xde2): routing_table_ids
    <cca>   DW_AT_decl_file   : 19
    <ccb>   DW_AT_decl_line   : 433
    <ccd>   DW_AT_decl_column : 26
    <cce>   DW_AT_type        : <0xb2b>
    <cd2>   DW_AT_external    : 1
    <cd3>   DW_AT_declaration : 1
 <1><cd4>: Abbrev Number: 10 (DW_TAG_variable)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x6bb): routing_types
    <cd9>   DW_AT_decl_file   : 19
    <cda>   DW_AT_decl_line   : 434
    <cdc>   DW_AT_decl_column : 26
    <cdd>   DW_AT_type        : <0xb2b>
    <ce1>   DW_AT_external    : 1
    <ce2>   DW_AT_declaration : 1
 <1><ce3>: Abbrev Number: 10 (DW_TAG_variable)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x1b5): rwf_flags
    <ce8>   DW_AT_decl_file   : 19
    <ce9>   DW_AT_decl_line   : 435
    <ceb>   DW_AT_decl_column : 26
    <cec>   DW_AT_type        : <0xb2b>
    <cf0>   DW_AT_external    : 1
    <cf1>   DW_AT_declaration : 1
 <1><cf2>: Abbrev Number: 10 (DW_TAG_variable)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x8a0): seccomp_filter_flags
    <cf7>   DW_AT_decl_file   : 19
    <cf8>   DW_AT_decl_line   : 436
    <cfa>   DW_AT_decl_column : 26
    <cfb>   DW_AT_type        : <0xb2b>
    <cff>   DW_AT_external    : 1
    <d00>   DW_AT_declaration : 1
 <1><d01>: Abbrev Number: 10 (DW_TAG_variable)
    <d02>   DW_AT_name        : (indirect string, offset: 0x2ed): seccomp_ret_action
    <d06>   DW_AT_decl_file   : 19
    <d07>   DW_AT_decl_line   : 437
    <d09>   DW_AT_decl_column : 26
    <d0a>   DW_AT_type        : <0xb2b>
    <d0e>   DW_AT_external    : 1
    <d0f>   DW_AT_declaration : 1
 <1><d10>: Abbrev Number: 10 (DW_TAG_variable)
    <d11>   DW_AT_name        : (indirect string, offset: 0x454): setns_types
    <d15>   DW_AT_decl_file   : 19
    <d16>   DW_AT_decl_line   : 438
    <d18>   DW_AT_decl_column : 26
    <d19>   DW_AT_type        : <0xb2b>
    <d1d>   DW_AT_external    : 1
    <d1e>   DW_AT_declaration : 1
 <1><d1f>: Abbrev Number: 10 (DW_TAG_variable)
    <d20>   DW_AT_name        : (indirect string, offset: 0xe79): sg_io_info
    <d24>   DW_AT_decl_file   : 19
    <d25>   DW_AT_decl_line   : 439
    <d27>   DW_AT_decl_column : 26
    <d28>   DW_AT_type        : <0xb2b>
    <d2c>   DW_AT_external    : 1
    <d2d>   DW_AT_declaration : 1
 <1><d2e>: Abbrev Number: 10 (DW_TAG_variable)
    <d2f>   DW_AT_name        : (indirect string, offset: 0xbf0): socketlayers
    <d33>   DW_AT_decl_file   : 19
    <d34>   DW_AT_decl_line   : 440
    <d36>   DW_AT_decl_column : 26
    <d37>   DW_AT_type        : <0xb2b>
    <d3b>   DW_AT_external    : 1
    <d3c>   DW_AT_declaration : 1
 <1><d3d>: Abbrev Number: 10 (DW_TAG_variable)
    <d3e>   DW_AT_name        : (indirect string, offset: 0xdcc): socktypes
    <d42>   DW_AT_decl_file   : 19
    <d43>   DW_AT_decl_line   : 441
    <d45>   DW_AT_decl_column : 26
    <d46>   DW_AT_type        : <0xb2b>
    <d4a>   DW_AT_external    : 1
    <d4b>   DW_AT_declaration : 1
 <1><d4c>: Abbrev Number: 10 (DW_TAG_variable)
    <d4d>   DW_AT_name        : (indirect string, offset: 0xaca): tcp_state_flags
    <d51>   DW_AT_decl_file   : 19
    <d52>   DW_AT_decl_line   : 442
    <d54>   DW_AT_decl_column : 26
    <d55>   DW_AT_type        : <0xb2b>
    <d59>   DW_AT_external    : 1
    <d5a>   DW_AT_declaration : 1
 <1><d5b>: Abbrev Number: 10 (DW_TAG_variable)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x79c): tcp_states
    <d60>   DW_AT_decl_file   : 19
    <d61>   DW_AT_decl_line   : 443
    <d63>   DW_AT_decl_column : 26
    <d64>   DW_AT_type        : <0xb2b>
    <d68>   DW_AT_external    : 1
    <d69>   DW_AT_declaration : 1
 <1><d6a>: Abbrev Number: 10 (DW_TAG_variable)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x1094): whence_codes
    <d6f>   DW_AT_decl_file   : 19
    <d70>   DW_AT_decl_line   : 444
    <d72>   DW_AT_decl_column : 26
    <d73>   DW_AT_type        : <0xb2b>
    <d77>   DW_AT_external    : 1
    <d78>   DW_AT_declaration : 1
 <1><d79>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d7a>   DW_AT_encoding    : 7	(unsigned)
    <d7b>   DW_AT_byte_size   : 4
    <d7c>   DW_AT_type        : <0x2b>
    <d80>   DW_AT_decl_file   : 19
    <d81>   DW_AT_decl_line   : 505
    <d83>   DW_AT_decl_column : 14
    <d84>   DW_AT_sibling     : <0xd9b>
 <2><d88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d89>   DW_AT_name        : (indirect string, offset: 0x9f6): CFLAG_NONE
    <d8d>   DW_AT_const_value : 0
 <2><d8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x939): CFLAG_ONLY_STATS
    <d93>   DW_AT_const_value : 1
 <2><d94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d95>   DW_AT_name        : (indirect string, offset: 0xbfd): CFLAG_BOTH
    <d99>   DW_AT_const_value : 2
 <2><d9a>: Abbrev Number: 0
 <1><d9b>: Abbrev Number: 28 (DW_TAG_typedef)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x114c): cflag_t
    <da0>   DW_AT_decl_file   : 19
    <da1>   DW_AT_decl_line   : 509
    <da3>   DW_AT_decl_column : 3
    <da4>   DW_AT_type        : <0xd79>
 <1><da8>: Abbrev Number: 10 (DW_TAG_variable)
    <da9>   DW_AT_name        : (indirect string, offset: 0xd15): cflag
    <dad>   DW_AT_decl_file   : 19
    <dae>   DW_AT_decl_line   : 510
    <db0>   DW_AT_decl_column : 16
    <db1>   DW_AT_type        : <0xd9b>
    <db5>   DW_AT_external    : 1
    <db6>   DW_AT_declaration : 1
 <1><db7>: Abbrev Number: 10 (DW_TAG_variable)
    <db8>   DW_AT_name        : (indirect string, offset: 0x180): Tflag
    <dbc>   DW_AT_decl_file   : 19
    <dbd>   DW_AT_decl_line   : 511
    <dbf>   DW_AT_decl_column : 13
    <dc0>   DW_AT_type        : <0x515>
    <dc4>   DW_AT_external    : 1
    <dc5>   DW_AT_declaration : 1
 <1><dc6>: Abbrev Number: 10 (DW_TAG_variable)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x7f7): Tflag_scale
    <dcb>   DW_AT_decl_file   : 19
    <dcc>   DW_AT_decl_line   : 512
    <dce>   DW_AT_decl_column : 12
    <dcf>   DW_AT_type        : <0x64>
    <dd3>   DW_AT_external    : 1
    <dd4>   DW_AT_declaration : 1
 <1><dd5>: Abbrev Number: 10 (DW_TAG_variable)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x8b5): Tflag_width
    <dda>   DW_AT_decl_file   : 19
    <ddb>   DW_AT_decl_line   : 513
    <ddd>   DW_AT_decl_column : 12
    <dde>   DW_AT_type        : <0x64>
    <de2>   DW_AT_external    : 1
    <de3>   DW_AT_declaration : 1
 <1><de4>: Abbrev Number: 10 (DW_TAG_variable)
    <de5>   DW_AT_name        : (indirect string, offset: 0xe6b): iflag
    <de9>   DW_AT_decl_file   : 19
    <dea>   DW_AT_decl_line   : 514
    <dec>   DW_AT_decl_column : 13
    <ded>   DW_AT_type        : <0x515>
    <df1>   DW_AT_external    : 1
    <df2>   DW_AT_declaration : 1
 <1><df3>: Abbrev Number: 10 (DW_TAG_variable)
    <df4>   DW_AT_name        : (indirect string, offset: 0x5bc): count_wallclock
    <df8>   DW_AT_decl_file   : 19
    <df9>   DW_AT_decl_line   : 515
    <dfb>   DW_AT_decl_column : 13
    <dfc>   DW_AT_type        : <0x515>
    <e00>   DW_AT_external    : 1
    <e01>   DW_AT_declaration : 1
 <1><e02>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e03>   DW_AT_name        : (indirect string, offset: 0x4a): path_set_item
    <e07>   DW_AT_byte_size   : 4
    <e08>   DW_AT_decl_file   : 19
    <e09>   DW_AT_decl_line   : 517
    <e0b>   DW_AT_decl_column : 8
    <e0c>   DW_AT_sibling     : <0xe21>
 <2><e10>: Abbrev Number: 22 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0xc3): path
    <e15>   DW_AT_decl_file   : 19
    <e16>   DW_AT_decl_line   : 518
    <e18>   DW_AT_decl_column : 14
    <e19>   DW_AT_type        : <0x1c9>
    <e1d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e20>: Abbrev Number: 0
 <1><e21>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e22>   DW_AT_name        : (indirect string, offset: 0x7a7): path_set
    <e26>   DW_AT_byte_size   : 12
    <e27>   DW_AT_decl_file   : 19
    <e28>   DW_AT_decl_line   : 522
    <e2a>   DW_AT_decl_column : 15
    <e2b>   DW_AT_sibling     : <0xe60>
 <2><e2f>: Abbrev Number: 22 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x735): paths_selected
    <e34>   DW_AT_decl_file   : 19
    <e35>   DW_AT_decl_line   : 523
    <e37>   DW_AT_decl_column : 24
    <e38>   DW_AT_type        : <0xe60>
    <e3c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3f>: Abbrev Number: 22 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0x1087): num_selected
    <e44>   DW_AT_decl_file   : 19
    <e45>   DW_AT_decl_line   : 524
    <e47>   DW_AT_decl_column : 9
    <e48>   DW_AT_type        : <0x122>
    <e4c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e4f>: Abbrev Number: 22 (DW_TAG_member)
    <e50>   DW_AT_name        : (indirect string, offset: 0xbad): size
    <e54>   DW_AT_decl_file   : 19
    <e55>   DW_AT_decl_line   : 525
    <e57>   DW_AT_decl_column : 9
    <e58>   DW_AT_type        : <0x122>
    <e5c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e5f>: Abbrev Number: 0
 <1><e60>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e61>   DW_AT_byte_size   : 4
    <e62>   DW_AT_type        : <0xe02>
 <1><e66>: Abbrev Number: 10 (DW_TAG_variable)
    <e67>   DW_AT_name        : (indirect string, offset: 0x10e5): global_path_set
    <e6b>   DW_AT_decl_file   : 19
    <e6c>   DW_AT_decl_line   : 526
    <e6e>   DW_AT_decl_column : 3
    <e6f>   DW_AT_type        : <0xe21>
    <e73>   DW_AT_external    : 1
    <e74>   DW_AT_declaration : 1
 <1><e75>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e76>   DW_AT_name        : (indirect string, offset: 0xfe4): xflag_opts
    <e7a>   DW_AT_encoding    : 7	(unsigned)
    <e7b>   DW_AT_byte_size   : 4
    <e7c>   DW_AT_type        : <0x2b>
    <e80>   DW_AT_decl_file   : 19
    <e81>   DW_AT_decl_line   : 528
    <e83>   DW_AT_decl_column : 6
    <e84>   DW_AT_sibling     : <0xea7>
 <2><e88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e89>   DW_AT_name        : (indirect string, offset: 0xa77): HEXSTR_NONE
    <e8d>   DW_AT_const_value : 0
 <2><e8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x1019): HEXSTR_NON_ASCII
    <e93>   DW_AT_const_value : 1
 <2><e94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x977): HEXSTR_ALL
    <e99>   DW_AT_const_value : 2
 <2><e9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x6a4): HEXSTR_NON_ASCII_CHARS
    <e9f>   DW_AT_const_value : 3
 <2><ea0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x10a1): NUM_HEXSTR_OPTS
    <ea5>   DW_AT_const_value : 4
 <2><ea6>: Abbrev Number: 0
 <1><ea7>: Abbrev Number: 10 (DW_TAG_variable)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xe40): xflag
    <eac>   DW_AT_decl_file   : 19
    <ead>   DW_AT_decl_line   : 541
    <eaf>   DW_AT_decl_column : 17
    <eb0>   DW_AT_type        : <0x2b>
    <eb4>   DW_AT_external    : 1
    <eb5>   DW_AT_declaration : 1
 <1><eb6>: Abbrev Number: 10 (DW_TAG_variable)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xcd0): followfork
    <ebb>   DW_AT_decl_file   : 19
    <ebc>   DW_AT_decl_line   : 542
    <ebe>   DW_AT_decl_column : 13
    <ebf>   DW_AT_type        : <0x515>
    <ec3>   DW_AT_external    : 1
    <ec4>   DW_AT_declaration : 1
 <1><ec5>: Abbrev Number: 10 (DW_TAG_variable)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x33b): output_separately
    <eca>   DW_AT_decl_file   : 19
    <ecb>   DW_AT_decl_line   : 543
    <ecd>   DW_AT_decl_column : 13
    <ece>   DW_AT_type        : <0x515>
    <ed2>   DW_AT_external    : 1
    <ed3>   DW_AT_declaration : 1
 <1><ed4>: Abbrev Number: 10 (DW_TAG_variable)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x230): stack_trace_enabled
    <ed9>   DW_AT_decl_file   : 19
    <eda>   DW_AT_decl_line   : 546
    <edc>   DW_AT_decl_column : 13
    <edd>   DW_AT_type        : <0x515>
    <ee1>   DW_AT_external    : 1
    <ee2>   DW_AT_declaration : 1
 <1><ee3>: Abbrev Number: 10 (DW_TAG_variable)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x692): ptrace_setoptions
    <ee8>   DW_AT_decl_file   : 19
    <ee9>   DW_AT_decl_line   : 550
    <eeb>   DW_AT_decl_column : 17
    <eec>   DW_AT_type        : <0x2b>
    <ef0>   DW_AT_external    : 1
    <ef1>   DW_AT_declaration : 1
 <1><ef2>: Abbrev Number: 10 (DW_TAG_variable)
    <ef3>   DW_AT_name        : (indirect string, offset: 0xa6c): max_strlen
    <ef7>   DW_AT_decl_file   : 19
    <ef8>   DW_AT_decl_line   : 551
    <efa>   DW_AT_decl_column : 17
    <efb>   DW_AT_type        : <0x2b>
    <eff>   DW_AT_external    : 1
    <f00>   DW_AT_declaration : 1
 <1><f01>: Abbrev Number: 10 (DW_TAG_variable)
    <f02>   DW_AT_name        : (indirect string, offset: 0xaa4): os_release
    <f06>   DW_AT_decl_file   : 19
    <f07>   DW_AT_decl_line   : 552
    <f09>   DW_AT_decl_column : 17
    <f0a>   DW_AT_type        : <0x2b>
    <f0e>   DW_AT_external    : 1
    <f0f>   DW_AT_declaration : 1
 <1><f10>: Abbrev Number: 10 (DW_TAG_variable)
    <f11>   DW_AT_name        : (indirect string, offset: 0x744): xlat_verbosity
    <f15>   DW_AT_decl_file   : 19
    <f16>   DW_AT_decl_line   : 914
    <f18>   DW_AT_decl_column : 24
    <f19>   DW_AT_type        : <0xa4e>
    <f1d>   DW_AT_external    : 1
    <f1e>   DW_AT_declaration : 1
 <1><f1f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f20>   DW_AT_name        : (indirect string, offset: 0x59f): xlat_style_private_flag_bits
    <f24>   DW_AT_encoding    : 7	(unsigned)
    <f25>   DW_AT_byte_size   : 4
    <f26>   DW_AT_type        : <0x2b>
    <f2a>   DW_AT_decl_file   : 19
    <f2b>   DW_AT_decl_line   : 934
    <f2d>   DW_AT_decl_column : 6
    <f2e>   DW_AT_sibling     : <0xf4b>
 <2><f32>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x2ba): PAF_PRINT_INDICES_BIT
    <f37>   DW_AT_const_value : 5
 <2><f38>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0xb64): PAF_ARRAY_TRUNCATED_BIT
    <f3d>   DW_AT_const_value : 6
 <2><f3e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x414): PXF_DEFAULT_STR_BIT
    <f43>   DW_AT_const_value : 7
 <2><f44>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0xcb2): SPFF_AUXSTR_MODE_BIT
    <f49>   DW_AT_const_value : 8
 <2><f4a>: Abbrev Number: 0
 <1><f4b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f4c>   DW_AT_name        : (indirect string, offset: 0xd6b): find_xlat_flag_bits
    <f50>   DW_AT_encoding    : 7	(unsigned)
    <f51>   DW_AT_byte_size   : 4
    <f52>   DW_AT_type        : <0x2b>
    <f56>   DW_AT_decl_file   : 19
    <f57>   DW_AT_decl_line   : 1438
    <f59>   DW_AT_decl_column : 6
    <f5a>   DW_AT_sibling     : <0xf65>
 <2><f5e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x9b4): FXL_CASE_SENSITIVE_BIT
    <f63>   DW_AT_const_value : 0
 <2><f64>: Abbrev Number: 0
 <1><f65>: Abbrev Number: 10 (DW_TAG_variable)
    <f66>   DW_AT_name        : (indirect string, offset: 0xa48): printing_tcp
    <f6a>   DW_AT_decl_file   : 19
    <f6b>   DW_AT_decl_line   : 1684
    <f6d>   DW_AT_decl_column : 20
    <f6e>   DW_AT_type        : <0x615>
    <f72>   DW_AT_external    : 1
    <f73>   DW_AT_declaration : 1
 <1><f74>: Abbrev Number: 10 (DW_TAG_variable)
    <f75>   DW_AT_name        : (indirect string, offset: 0x567): errnoent
    <f79>   DW_AT_decl_file   : 19
    <f7a>   DW_AT_decl_line   : 1882
    <f7c>   DW_AT_decl_column : 26
    <f7d>   DW_AT_type        : <0x449>
    <f81>   DW_AT_external    : 1
    <f82>   DW_AT_declaration : 1
 <1><f83>: Abbrev Number: 10 (DW_TAG_variable)
    <f84>   DW_AT_name        : (indirect string, offset: 0x8c1): signalent
    <f88>   DW_AT_decl_file   : 19
    <f89>   DW_AT_decl_line   : 1883
    <f8b>   DW_AT_decl_column : 26
    <f8c>   DW_AT_type        : <0x449>
    <f90>   DW_AT_external    : 1
    <f91>   DW_AT_declaration : 1
 <1><f92>: Abbrev Number: 10 (DW_TAG_variable)
    <f93>   DW_AT_name        : (indirect string, offset: 0xeb3): nerrnos
    <f97>   DW_AT_decl_file   : 19
    <f98>   DW_AT_decl_line   : 1884
    <f9a>   DW_AT_decl_column : 27
    <f9b>   DW_AT_type        : <0x32>
    <f9f>   DW_AT_external    : 1
    <fa0>   DW_AT_declaration : 1
 <1><fa1>: Abbrev Number: 10 (DW_TAG_variable)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x1070): nsignals
    <fa6>   DW_AT_decl_file   : 19
    <fa7>   DW_AT_decl_line   : 1885
    <fa9>   DW_AT_decl_column : 27
    <faa>   DW_AT_type        : <0x32>
    <fae>   DW_AT_external    : 1
    <faf>   DW_AT_declaration : 1
 <1><fb0>: Abbrev Number: 15 (DW_TAG_array_type)
    <fb1>   DW_AT_type        : <0x86d>
    <fb5>   DW_AT_sibling     : <0xfbb>
 <2><fb9>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fba>: Abbrev Number: 0
 <1><fbb>: Abbrev Number: 3 (DW_TAG_const_type)
    <fbc>   DW_AT_type        : <0xfb0>
 <1><fc0>: Abbrev Number: 10 (DW_TAG_variable)
    <fc1>   DW_AT_name        : (indirect string, offset: 0xd36): sysent0
    <fc5>   DW_AT_decl_file   : 19
    <fc6>   DW_AT_decl_line   : 1887
    <fc8>   DW_AT_decl_column : 28
    <fc9>   DW_AT_type        : <0xfbb>
    <fcd>   DW_AT_external    : 1
    <fce>   DW_AT_declaration : 1
 <1><fcf>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd0>   DW_AT_type        : <0x8d4>
    <fd4>   DW_AT_sibling     : <0xfda>
 <2><fd8>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd9>: Abbrev Number: 0
 <1><fda>: Abbrev Number: 3 (DW_TAG_const_type)
    <fdb>   DW_AT_type        : <0xfcf>
 <1><fdf>: Abbrev Number: 10 (DW_TAG_variable)
    <fe0>   DW_AT_name        : (indirect string, offset: 0x10db): ioctlent0
    <fe4>   DW_AT_decl_file   : 19
    <fe5>   DW_AT_decl_line   : 1888
    <fe7>   DW_AT_decl_column : 30
    <fe8>   DW_AT_type        : <0xfda>
    <fec>   DW_AT_external    : 1
    <fed>   DW_AT_declaration : 1
 <1><fee>: Abbrev Number: 10 (DW_TAG_variable)
    <fef>   DW_AT_name        : (indirect string, offset: 0x479): personality_names
    <ff3>   DW_AT_decl_file   : 19
    <ff4>   DW_AT_decl_line   : 1890
    <ff6>   DW_AT_decl_column : 26
    <ff7>   DW_AT_type        : <0x449>
    <ffb>   DW_AT_external    : 1
    <ffc>   DW_AT_declaration : 1
 <1><ffd>: Abbrev Number: 10 (DW_TAG_variable)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x8e1): sysent
    <1002>   DW_AT_decl_file   : 19
    <1003>   DW_AT_decl_line   : 1893
    <1005>   DW_AT_decl_column : 29
    <1006>   DW_AT_type        : <0x9b9>
    <100a>   DW_AT_external    : 1
    <100b>   DW_AT_declaration : 1
 <1><100c>: Abbrev Number: 10 (DW_TAG_variable)
    <100d>   DW_AT_name        : (indirect string, offset: 0xcc7): ioctlent
    <1011>   DW_AT_decl_file   : 19
    <1012>   DW_AT_decl_line   : 1894
    <1014>   DW_AT_decl_column : 31
    <1015>   DW_AT_type        : <0x101b>
    <1019>   DW_AT_external    : 1
    <101a>   DW_AT_declaration : 1
 <1><101b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <101c>   DW_AT_byte_size   : 4
    <101d>   DW_AT_type        : <0x8d4>
 <1><1021>: Abbrev Number: 10 (DW_TAG_variable)
    <1022>   DW_AT_name        : (indirect string, offset: 0x8cb): nsyscalls
    <1026>   DW_AT_decl_file   : 19
    <1027>   DW_AT_decl_line   : 1900
    <1029>   DW_AT_decl_column : 17
    <102a>   DW_AT_type        : <0x2b>
    <102e>   DW_AT_external    : 1
    <102f>   DW_AT_declaration : 1
 <1><1030>: Abbrev Number: 10 (DW_TAG_variable)
    <1031>   DW_AT_name        : (indirect string, offset: 0xecd): nioctlents
    <1035>   DW_AT_decl_file   : 19
    <1036>   DW_AT_decl_line   : 1901
    <1038>   DW_AT_decl_column : 17
    <1039>   DW_AT_type        : <0x2b>
    <103d>   DW_AT_external    : 1
    <103e>   DW_AT_declaration : 1
 <1><103f>: Abbrev Number: 15 (DW_TAG_array_type)
    <1040>   DW_AT_type        : <0x32>
    <1044>   DW_AT_sibling     : <0x104f>
 <2><1048>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1049>   DW_AT_type        : <0x2b>
    <104d>   DW_AT_upper_bound : 2
 <2><104e>: Abbrev Number: 0
 <1><104f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1050>   DW_AT_type        : <0x103f>
 <1><1054>: Abbrev Number: 10 (DW_TAG_variable)
    <1055>   DW_AT_name        : (indirect string, offset: 0xf4c): nsyscall_vec
    <1059>   DW_AT_decl_file   : 19
    <105a>   DW_AT_decl_line   : 1903
    <105c>   DW_AT_decl_column : 27
    <105d>   DW_AT_type        : <0x104f>
    <1061>   DW_AT_external    : 1
    <1062>   DW_AT_declaration : 1
 <1><1063>: Abbrev Number: 15 (DW_TAG_array_type)
    <1064>   DW_AT_type        : <0x9bf>
    <1068>   DW_AT_sibling     : <0x1073>
 <2><106c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <106d>   DW_AT_type        : <0x2b>
    <1071>   DW_AT_upper_bound : 2
 <2><1072>: Abbrev Number: 0
 <1><1073>: Abbrev Number: 3 (DW_TAG_const_type)
    <1074>   DW_AT_type        : <0x1063>
 <1><1078>: Abbrev Number: 10 (DW_TAG_variable)
    <1079>   DW_AT_name        : (indirect string, offset: 0x7e4): sysent_vec
    <107d>   DW_AT_decl_file   : 19
    <107e>   DW_AT_decl_line   : 1904
    <1080>   DW_AT_decl_column : 35
    <1081>   DW_AT_type        : <0x1073>
    <1085>   DW_AT_external    : 1
    <1086>   DW_AT_declaration : 1
 <1><1087>: Abbrev Number: 10 (DW_TAG_variable)
    <1088>   DW_AT_name        : (indirect string, offset: 0x394): inject_vec
    <108c>   DW_AT_decl_file   : 19
    <108d>   DW_AT_decl_line   : 1905
    <108f>   DW_AT_decl_column : 28
    <1090>   DW_AT_type        : <0x9c4>
    <1094>   DW_AT_external    : 1
    <1095>   DW_AT_declaration : 1
 <1><1096>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1097>   DW_AT_name        : (indirect string, offset: 0xdbf): audit_arch_t
    <109b>   DW_AT_byte_size   : 8
    <109c>   DW_AT_decl_file   : 19
    <109d>   DW_AT_decl_line   : 1907
    <109f>   DW_AT_decl_column : 8
    <10a0>   DW_AT_sibling     : <0x10c5>
 <2><10a4>: Abbrev Number: 22 (DW_TAG_member)
    <10a5>   DW_AT_name        : (indirect string, offset: 0x591): arch
    <10a9>   DW_AT_decl_file   : 19
    <10aa>   DW_AT_decl_line   : 1908
    <10ac>   DW_AT_decl_column : 15
    <10ad>   DW_AT_type        : <0x2b>
    <10b1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b4>: Abbrev Number: 22 (DW_TAG_member)
    <10b5>   DW_AT_name        : (indirect string, offset: 0xa2e): flag
    <10b9>   DW_AT_decl_file   : 19
    <10ba>   DW_AT_decl_line   : 1909
    <10bc>   DW_AT_decl_column : 15
    <10bd>   DW_AT_type        : <0x2b>
    <10c1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c4>: Abbrev Number: 0
 <1><10c5>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c6>   DW_AT_type        : <0x1096>
 <1><10ca>: Abbrev Number: 15 (DW_TAG_array_type)
    <10cb>   DW_AT_type        : <0x10c5>
    <10cf>   DW_AT_sibling     : <0x10da>
 <2><10d3>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d4>   DW_AT_type        : <0x2b>
    <10d8>   DW_AT_upper_bound : 2
 <2><10d9>: Abbrev Number: 0
 <1><10da>: Abbrev Number: 3 (DW_TAG_const_type)
    <10db>   DW_AT_type        : <0x10ca>
 <1><10df>: Abbrev Number: 10 (DW_TAG_variable)
    <10e0>   DW_AT_name        : (indirect string, offset: 0x9a5): audit_arch_vec
    <10e4>   DW_AT_decl_file   : 19
    <10e5>   DW_AT_decl_line   : 1912
    <10e7>   DW_AT_decl_column : 34
    <10e8>   DW_AT_type        : <0x10da>
    <10ec>   DW_AT_external    : 1
    <10ed>   DW_AT_declaration : 1
 <1><10ee>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10ef>   DW_AT_byte_size   : 180
    <10f0>   DW_AT_decl_file   : 21
    <10f1>   DW_AT_decl_line   : 2
    <10f2>   DW_AT_decl_column : 9
    <10f3>   DW_AT_sibling     : <0x13a8>
 <2><10f7>: Abbrev Number: 9 (DW_TAG_member)
    <10f8>   DW_AT_name        : (indirect string, offset: 0x1cd): block_ioctl
    <10fc>   DW_AT_decl_file   : 21
    <10fd>   DW_AT_decl_line   : 3
    <10fe>   DW_AT_decl_column : 8
    <10ff>   DW_AT_type        : <0x13c2>
    <1103>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1106>: Abbrev Number: 9 (DW_TAG_member)
    <1107>   DW_AT_name        : (indirect string, offset: 0xb03): btrfs_ioctl
    <110b>   DW_AT_decl_file   : 21
    <110c>   DW_AT_decl_line   : 6
    <110d>   DW_AT_decl_column : 8
    <110e>   DW_AT_type        : <0x13c2>
    <1112>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1115>: Abbrev Number: 9 (DW_TAG_member)
    <1116>   DW_AT_name        : (indirect string, offset: 0x77d): evdev_write_ioctl_mpers
    <111a>   DW_AT_decl_file   : 21
    <111b>   DW_AT_decl_line   : 9
    <111c>   DW_AT_decl_column : 8
    <111d>   DW_AT_type        : <0x13c2>
    <1121>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1124>: Abbrev Number: 9 (DW_TAG_member)
    <1125>   DW_AT_name        : (indirect string, offset: 0x753): get_sock_fprog_size
    <1129>   DW_AT_decl_file   : 21
    <112a>   DW_AT_decl_line   : 12
    <112b>   DW_AT_decl_column : 17
    <112c>   DW_AT_type        : <0x13ce>
    <1130>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1133>: Abbrev Number: 9 (DW_TAG_member)
    <1134>   DW_AT_name        : (indirect string, offset: 0x19c): fetch_bpf_fprog
    <1138>   DW_AT_decl_file   : 21
    <1139>   DW_AT_decl_line   : 15
    <113a>   DW_AT_decl_column : 10
    <113b>   DW_AT_type        : <0x13ee>
    <113f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1142>: Abbrev Number: 9 (DW_TAG_member)
    <1143>   DW_AT_name        : (indirect string, offset: 0x992): fetch_struct_flock
    <1147>   DW_AT_decl_file   : 21
    <1148>   DW_AT_decl_line   : 18
    <1149>   DW_AT_decl_column : 10
