Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1793 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5f3): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3ee): mpers-m32/semid_ds_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xed0): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x104a): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9da): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x359): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x264): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe2e): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4a6): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8e0): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf2b): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x910): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7ba): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbaa): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbe0): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2d5): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd36): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xca1): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x423): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x46f): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x365): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xbcb): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xfd3): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe3e): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb53): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x112d): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe69): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xb15): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0x100e): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x28c): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x3ae): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x1034): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x78d): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc90): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xb90): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x36d): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0xa5d): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4f5): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xf80): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x7fb): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x12e): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x1083): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x952): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x9c3): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xdce): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1bf): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xcf3): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xb6): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x58e): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x211): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xff9): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x7e7): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x88c): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x23f): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe8f): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xd03): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x16f): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x725): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xaa7): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x1018): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3d2): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xc66): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0xa1f): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xa81): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x815): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xb35): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x49b): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x317): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x79): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x381): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x554): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0x105d): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xe27): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x24b): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x568): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x279): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xe9e): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x6fe): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xc0b): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1ac): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xf12): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x376): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xa11): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x10dc): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4e0): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xfa7): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0xa2b): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x435): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0x254): __kernel_mode_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 11
    <528>   DW_AT_decl_column : 24
    <529>   DW_AT_type        : <0x24>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0xaeb): __kernel_long_t
    <532>   DW_AT_decl_file   : 15
    <533>   DW_AT_decl_line   : 15
    <534>   DW_AT_decl_column : 15
    <535>   DW_AT_type        : <0xae>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x543): __kernel_ulong_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 23
    <541>   DW_AT_type        : <0x37>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x6c1): __kernel_uid32_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 49
    <54c>   DW_AT_decl_column : 22
    <54d>   DW_AT_type        : <0x2b>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x5d3): __kernel_gid32_t
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 50
    <558>   DW_AT_decl_column : 22
    <559>   DW_AT_type        : <0x2b>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x3e0): kernel_long_t
    <562>   DW_AT_decl_file   : 16
    <563>   DW_AT_decl_line   : 16
    <564>   DW_AT_decl_column : 25
    <565>   DW_AT_type        : <0x52d>
 <1><569>: Abbrev Number: 4 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x901): kernel_ulong_t
    <56e>   DW_AT_decl_file   : 16
    <56f>   DW_AT_decl_line   : 17
    <570>   DW_AT_decl_column : 26
    <571>   DW_AT_type        : <0x539>
 <1><575>: Abbrev Number: 3 (DW_TAG_const_type)
    <576>   DW_AT_type        : <0x569>
 <1><57a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <57b>   DW_AT_name        : (indirect string, offset: 0xc29): list_item
    <57f>   DW_AT_byte_size   : 8
    <580>   DW_AT_decl_file   : 17
    <581>   DW_AT_decl_line   : 92
    <582>   DW_AT_decl_column : 8
    <583>   DW_AT_sibling     : <0x5a6>
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x1128): prev
    <58c>   DW_AT_decl_file   : 17
    <58d>   DW_AT_decl_line   : 93
    <58e>   DW_AT_decl_column : 20
    <58f>   DW_AT_type        : <0x5a6>
    <593>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><596>: Abbrev Number: 9 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0x1117): next
    <59b>   DW_AT_decl_file   : 17
    <59c>   DW_AT_decl_line   : 94
    <59d>   DW_AT_decl_column : 20
    <59e>   DW_AT_type        : <0x5a6>
    <5a2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5a5>: Abbrev Number: 0
 <1><5a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a7>   DW_AT_byte_size   : 4
    <5a8>   DW_AT_type        : <0x57a>
 <1><5ac>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8d9): sysent
    <5b1>   DW_AT_byte_size   : 20
    <5b2>   DW_AT_decl_file   : 18
    <5b3>   DW_AT_decl_line   : 13
    <5b4>   DW_AT_decl_column : 16
    <5b5>   DW_AT_sibling     : <0x605>
 <2><5b9>: Abbrev Number: 9 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x1074): nargs
    <5be>   DW_AT_decl_file   : 18
    <5bf>   DW_AT_decl_line   : 14
    <5c0>   DW_AT_decl_column : 11
    <5c1>   DW_AT_type        : <0x2b>
    <5c5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x9d0): sys_flags
    <5cd>   DW_AT_decl_file   : 18
    <5ce>   DW_AT_decl_line   : 15
    <5cf>   DW_AT_decl_column : 6
    <5d0>   DW_AT_type        : <0x64>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5d7>: Abbrev Number: 18 (DW_TAG_member)
    <5d8>   DW_AT_name        : sen
    <5dc>   DW_AT_decl_file   : 18
    <5dd>   DW_AT_decl_line   : 16
    <5de>   DW_AT_decl_column : 6
    <5df>   DW_AT_type        : <0x64>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5e6>: Abbrev Number: 9 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x30e): sys_func
    <5eb>   DW_AT_decl_file   : 18
    <5ec>   DW_AT_decl_line   : 17
    <5ed>   DW_AT_decl_column : 8
    <5ee>   DW_AT_type        : <0x86c>
    <5f2>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5f5>: Abbrev Number: 9 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x283): sys_name
    <5fa>   DW_AT_decl_file   : 18
    <5fb>   DW_AT_decl_line   : 18
    <5fc>   DW_AT_decl_column : 14
    <5fd>   DW_AT_type        : <0x1c9>
    <601>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <606>   DW_AT_prototyped  : 1
    <607>   DW_AT_type        : <0x64>
    <60b>   DW_AT_sibling     : <0x615>
 <2><60f>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <610>   DW_AT_type        : <0x615>
 <2><614>: Abbrev Number: 0
 <1><615>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <616>   DW_AT_byte_size   : 4
    <617>   DW_AT_type        : <0x620>
 <1><61b>: Abbrev Number: 3 (DW_TAG_const_type)
    <61c>   DW_AT_type        : <0x615>
 <1><620>: Abbrev Number: 21 (DW_TAG_structure_type)
    <621>   DW_AT_name        : tcb
    <625>   DW_AT_byte_size   : 204
    <626>   DW_AT_decl_file   : 19
    <627>   DW_AT_decl_line   : 262
    <629>   DW_AT_decl_column : 8
    <62a>   DW_AT_sibling     : <0x86c>
 <2><62e>: Abbrev Number: 22 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x4ef): flags
    <633>   DW_AT_decl_file   : 19
    <634>   DW_AT_decl_line   : 263
    <636>   DW_AT_decl_column : 6
    <637>   DW_AT_type        : <0x64>
    <63b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><63e>: Abbrev Number: 23 (DW_TAG_member)
    <63f>   DW_AT_name        : pid
    <643>   DW_AT_decl_file   : 19
    <644>   DW_AT_decl_line   : 264
    <646>   DW_AT_decl_column : 6
    <647>   DW_AT_type        : <0x64>
    <64b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><64e>: Abbrev Number: 22 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x58): qual_flg
    <653>   DW_AT_decl_file   : 19
    <654>   DW_AT_decl_line   : 265
    <656>   DW_AT_decl_column : 6
    <657>   DW_AT_type        : <0x64>
    <65b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><65e>: Abbrev Number: 22 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x39a): currpers
    <663>   DW_AT_decl_file   : 19
    <664>   DW_AT_decl_line   : 267
    <666>   DW_AT_decl_column : 15
    <667>   DW_AT_type        : <0x2b>
    <66b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><66e>: Abbrev Number: 22 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0xb88): u_error
    <673>   DW_AT_decl_file   : 19
    <674>   DW_AT_decl_line   : 269
    <676>   DW_AT_decl_column : 16
    <677>   DW_AT_type        : <0x37>
    <67b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><67e>: Abbrev Number: 22 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x18c): scno
    <683>   DW_AT_decl_file   : 19
    <684>   DW_AT_decl_line   : 270
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0x569>
    <68b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><68e>: Abbrev Number: 22 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0xbc1): true_scno
    <693>   DW_AT_decl_file   : 19
    <694>   DW_AT_decl_line   : 271
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x569>
    <69b>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><69e>: Abbrev Number: 22 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x196): u_arg
    <6a3>   DW_AT_decl_file   : 19
    <6a4>   DW_AT_decl_line   : 272
    <6a6>   DW_AT_decl_column : 17
    <6a7>   DW_AT_type        : <0x99c>
    <6ab>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6ae>: Abbrev Number: 22 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x9e7): u_rval
    <6b3>   DW_AT_decl_file   : 19
    <6b4>   DW_AT_decl_line   : 273
    <6b6>   DW_AT_decl_column : 16
    <6b7>   DW_AT_type        : <0x55d>
    <6bb>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6be>: Abbrev Number: 22 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xb07): sys_func_rval
    <6c3>   DW_AT_decl_file   : 19
    <6c4>   DW_AT_decl_line   : 274
    <6c6>   DW_AT_decl_column : 6
    <6c7>   DW_AT_type        : <0x64>
    <6cb>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6ce>: Abbrev Number: 22 (DW_TAG_member)
    <6cf>   DW_AT_name        : (indirect string, offset: 0xd1d): curcol
    <6d3>   DW_AT_decl_file   : 19
    <6d4>   DW_AT_decl_line   : 275
    <6d6>   DW_AT_decl_column : 6
    <6d7>   DW_AT_type        : <0x64>
    <6db>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6de>: Abbrev Number: 22 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0x9f9): outf
    <6e3>   DW_AT_decl_file   : 19
    <6e4>   DW_AT_decl_line   : 276
    <6e6>   DW_AT_decl_column : 8
    <6e7>   DW_AT_type        : <0x40e>
    <6eb>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ee>: Abbrev Number: 22 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0xf51): staged_output_data
    <6f3>   DW_AT_decl_file   : 19
    <6f4>   DW_AT_decl_line   : 277
    <6f6>   DW_AT_decl_column : 29
    <6f7>   DW_AT_type        : <0x9b2>
    <6fb>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6fe>: Abbrev Number: 22 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xad2): auxstr
    <703>   DW_AT_decl_file   : 19
    <704>   DW_AT_decl_line   : 279
    <706>   DW_AT_decl_column : 14
    <707>   DW_AT_type        : <0x1c9>
    <70b>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><70e>: Abbrev Number: 22 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x175): _priv_data
    <713>   DW_AT_decl_file   : 19
    <714>   DW_AT_decl_line   : 280
    <716>   DW_AT_decl_column : 8
    <717>   DW_AT_type        : <0xcd>
    <71b>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><71e>: Abbrev Number: 22 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0xc56): _free_priv_data
    <723>   DW_AT_decl_file   : 19
    <724>   DW_AT_decl_line   : 281
    <726>   DW_AT_decl_column : 9
    <727>   DW_AT_type        : <0x9c4>
    <72b>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><72e>: Abbrev Number: 22 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x186): s_ent
    <733>   DW_AT_decl_file   : 19
    <734>   DW_AT_decl_line   : 282
    <736>   DW_AT_decl_column : 23
    <737>   DW_AT_type        : <0x9ca>
    <73b>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><73e>: Abbrev Number: 22 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <743>   DW_AT_decl_file   : 19
    <744>   DW_AT_decl_line   : 285
    <746>   DW_AT_decl_column : 23
    <747>   DW_AT_type        : <0x9ca>
    <74b>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><74e>: Abbrev Number: 22 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x38f): inject_vec
    <753>   DW_AT_decl_file   : 19
    <754>   DW_AT_decl_line   : 286
    <756>   DW_AT_decl_column : 22
    <757>   DW_AT_type        : <0x9d5>
    <75b>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><75e>: Abbrev Number: 22 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x82d): stime
    <763>   DW_AT_decl_file   : 19
    <764>   DW_AT_decl_line   : 287
    <766>   DW_AT_decl_column : 18
    <767>   DW_AT_type        : <0x133>
    <76b>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><76e>: Abbrev Number: 22 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x3a3): ltime
    <773>   DW_AT_decl_file   : 19
    <774>   DW_AT_decl_line   : 288
    <776>   DW_AT_decl_column : 18
    <777>   DW_AT_type        : <0x133>
    <77b>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><77e>: Abbrev Number: 22 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x103b): atime
    <783>   DW_AT_decl_file   : 19
    <784>   DW_AT_decl_line   : 289
    <786>   DW_AT_decl_column : 18
    <787>   DW_AT_type        : <0x133>
    <78b>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><78e>: Abbrev Number: 22 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0x4e9): etime
    <793>   DW_AT_decl_file   : 19
    <794>   DW_AT_decl_line   : 290
    <796>   DW_AT_decl_column : 18
    <797>   DW_AT_type        : <0x133>
    <79b>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><79f>: Abbrev Number: 22 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0xd8b): delay_expiration_time
    <7a4>   DW_AT_decl_file   : 19
    <7a5>   DW_AT_decl_line   : 291
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x133>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7b0>: Abbrev Number: 22 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7b5>   DW_AT_decl_file   : 19
    <7b6>   DW_AT_decl_line   : 298
    <7b8>   DW_AT_decl_column : 15
    <7b9>   DW_AT_type        : <0x2b>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7c1>: Abbrev Number: 22 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0xf8d): last_dirfd
    <7c6>   DW_AT_decl_file   : 19
    <7c7>   DW_AT_decl_line   : 301
    <7c9>   DW_AT_decl_column : 6
    <7ca>   DW_AT_type        : <0x64>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7d2>: Abbrev Number: 22 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0xfb3): mmap_cache
    <7d7>   DW_AT_decl_file   : 19
    <7d8>   DW_AT_decl_line   : 304
    <7da>   DW_AT_decl_column : 23
    <7db>   DW_AT_type        : <0x9f1>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7e3>: Abbrev Number: 22 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xb97): wait_data_idx
    <7e8>   DW_AT_decl_file   : 19
    <7e9>   DW_AT_decl_line   : 311
    <7eb>   DW_AT_decl_column : 9
    <7ec>   DW_AT_type        : <0x122>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7f4>: Abbrev Number: 22 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xad9): delayed_wait_data
    <7f9>   DW_AT_decl_file   : 19
    <7fa>   DW_AT_decl_line   : 313
    <7fc>   DW_AT_decl_column : 24
    <7fd>   DW_AT_type        : <0x9fd>
    <801>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><805>: Abbrev Number: 22 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xb49): wait_list
    <80a>   DW_AT_decl_file   : 19
    <80b>   DW_AT_decl_line   : 314
    <80d>   DW_AT_decl_column : 19
    <80e>   DW_AT_type        : <0x57a>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><816>: Abbrev Number: 22 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x716): vcpu_info_list
    <81b>   DW_AT_decl_file   : 19
    <81c>   DW_AT_decl_line   : 318
    <81e>   DW_AT_decl_column : 20
    <81f>   DW_AT_type        : <0xa09>
    <823>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><827>: Abbrev Number: 22 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0xce8): unwind_ctx
    <82c>   DW_AT_decl_file   : 19
    <82d>   DW_AT_decl_line   : 322
    <82f>   DW_AT_decl_column : 8
    <830>   DW_AT_type        : <0xcd>
    <834>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><838>: Abbrev Number: 22 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x4d3): unwind_queue
    <83d>   DW_AT_decl_file   : 19
    <83e>   DW_AT_decl_line   : 323
    <840>   DW_AT_decl_column : 25
    <841>   DW_AT_type        : <0xa15>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><849>: Abbrev Number: 22 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x16a): comm
    <84e>   DW_AT_decl_file   : 19
    <84f>   DW_AT_decl_line   : 327
    <851>   DW_AT_decl_column : 7
    <852>   DW_AT_type        : <0xa1b>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><85a>: Abbrev Number: 22 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x221): start_prc
    <85f>   DW_AT_decl_file   : 19
    <860>   DW_AT_decl_line   : 329
    <862>   DW_AT_decl_column : 16
    <863>   DW_AT_type        : <0x37>
    <867>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><86b>: Abbrev Number: 0
 <1><86c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <86d>   DW_AT_byte_size   : 4
    <86e>   DW_AT_type        : <0x605>
 <1><872>: Abbrev Number: 4 (DW_TAG_typedef)
    <873>   DW_AT_name        : (indirect string, offset: 0x535): struct_sysent
    <877>   DW_AT_decl_file   : 18
    <878>   DW_AT_decl_line   : 19
    <879>   DW_AT_decl_column : 3
    <87a>   DW_AT_type        : <0x5ac>
 <1><87e>: Abbrev Number: 3 (DW_TAG_const_type)
    <87f>   DW_AT_type        : <0x872>
 <1><883>: Abbrev Number: 11 (DW_TAG_variable)
    <884>   DW_AT_name        : (indirect string, offset: 0xd77): current_personality
    <888>   DW_AT_decl_file   : 19
    <889>   DW_AT_decl_line   : 158
    <88a>   DW_AT_decl_column : 17
    <88b>   DW_AT_type        : <0x2b>
    <88f>   DW_AT_external    : 1
    <890>   DW_AT_declaration : 1
 <1><891>: Abbrev Number: 11 (DW_TAG_variable)
    <892>   DW_AT_name        : (indirect string, offset: 0x87b): current_wordsize
    <896>   DW_AT_decl_file   : 19
    <897>   DW_AT_decl_line   : 171
    <898>   DW_AT_decl_column : 17
    <899>   DW_AT_type        : <0x2b>
    <89d>   DW_AT_external    : 1
    <89e>   DW_AT_declaration : 1
 <1><89f>: Abbrev Number: 11 (DW_TAG_variable)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xab0): current_klongsize
    <8a4>   DW_AT_decl_file   : 19
    <8a5>   DW_AT_decl_line   : 176
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0x2b>
    <8ab>   DW_AT_external    : 1
    <8ac>   DW_AT_declaration : 1
 <1><8ad>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xcbf): ioctlent
    <8b2>   DW_AT_byte_size   : 8
    <8b3>   DW_AT_decl_file   : 19
    <8b4>   DW_AT_decl_line   : 217
    <8b5>   DW_AT_decl_column : 16
    <8b6>   DW_AT_sibling     : <0x8d9>
 <2><8ba>: Abbrev Number: 9 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xf79): symbol
    <8bf>   DW_AT_decl_file   : 19
    <8c0>   DW_AT_decl_line   : 218
    <8c1>   DW_AT_decl_column : 14
    <8c2>   DW_AT_type        : <0x1c9>
    <8c6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c9>: Abbrev Number: 9 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xd40): code
    <8ce>   DW_AT_decl_file   : 19
    <8cf>   DW_AT_decl_line   : 219
    <8d0>   DW_AT_decl_column : 15
    <8d1>   DW_AT_type        : <0x2b>
    <8d5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d8>: Abbrev Number: 0
 <1><8d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <8da>   DW_AT_name        : (indirect string, offset: 0xc80): struct_ioctlent
    <8de>   DW_AT_decl_file   : 19
    <8df>   DW_AT_decl_line   : 220
    <8e0>   DW_AT_decl_column : 3
    <8e1>   DW_AT_type        : <0x8ad>
 <1><8e5>: Abbrev Number: 3 (DW_TAG_const_type)
    <8e6>   DW_AT_type        : <0x8d9>
 <1><8ea>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x86f): inject_data
    <8ef>   DW_AT_byte_size   : 10
    <8f0>   DW_AT_decl_file   : 19
    <8f1>   DW_AT_decl_line   : 241
    <8f2>   DW_AT_decl_column : 8
    <8f3>   DW_AT_sibling     : <0x952>
 <2><8f7>: Abbrev Number: 9 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x4ef): flags
    <8fc>   DW_AT_decl_file   : 19
    <8fd>   DW_AT_decl_line   : 242
    <8fe>   DW_AT_decl_column : 10
    <8ff>   DW_AT_type        : <0xf2>
    <903>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><906>: Abbrev Number: 9 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x984): signo
    <90b>   DW_AT_decl_file   : 19
    <90c>   DW_AT_decl_line   : 243
    <90d>   DW_AT_decl_column : 10
    <90e>   DW_AT_type        : <0xf2>
    <912>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><915>: Abbrev Number: 9 (DW_TAG_member)
    <916>   DW_AT_name        : (indirect string, offset: 0xfc): rval_idx
    <91a>   DW_AT_decl_file   : 19
    <91b>   DW_AT_decl_line   : 244
    <91c>   DW_AT_decl_column : 11
    <91d>   DW_AT_type        : <0xfe>
    <921>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><924>: Abbrev Number: 9 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0xd13): delay_idx
    <929>   DW_AT_decl_file   : 19
    <92a>   DW_AT_decl_line   : 245
    <92b>   DW_AT_decl_column : 11
    <92c>   DW_AT_type        : <0xfe>
    <930>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><933>: Abbrev Number: 9 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0x580): poke_idx
    <938>   DW_AT_decl_file   : 19
    <939>   DW_AT_decl_line   : 246
    <93a>   DW_AT_decl_column : 11
    <93b>   DW_AT_type        : <0xfe>
    <93f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><942>: Abbrev Number: 9 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x18c): scno
    <947>   DW_AT_decl_file   : 19
    <948>   DW_AT_decl_line   : 247
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0xfe>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 8 (DW_TAG_structure_type)
    <953>   DW_AT_name        : (indirect string, offset: 0xdd): inject_opts
    <957>   DW_AT_byte_size   : 16
    <958>   DW_AT_decl_file   : 19
    <959>   DW_AT_decl_line   : 250
    <95a>   DW_AT_decl_column : 8
    <95b>   DW_AT_sibling     : <0x99c>
 <2><95f>: Abbrev Number: 9 (DW_TAG_member)
    <960>   DW_AT_name        : (indirect string, offset: 0xa7b): first
    <964>   DW_AT_decl_file   : 19
    <965>   DW_AT_decl_line   : 251
    <966>   DW_AT_decl_column : 11
    <967>   DW_AT_type        : <0xfe>
    <96b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><96e>: Abbrev Number: 9 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0x1151): last
    <973>   DW_AT_decl_file   : 19
    <974>   DW_AT_decl_line   : 252
    <975>   DW_AT_decl_column : 11
    <976>   DW_AT_type        : <0xfe>
    <97a>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><97d>: Abbrev Number: 9 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x3a9): step
    <982>   DW_AT_decl_file   : 19
    <983>   DW_AT_decl_line   : 253
    <984>   DW_AT_decl_column : 11
    <985>   DW_AT_type        : <0xfe>
    <989>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><98c>: Abbrev Number: 9 (DW_TAG_member)
    <98d>   DW_AT_name        : (indirect string, offset: 0x111c): data
    <991>   DW_AT_decl_file   : 19
    <992>   DW_AT_decl_line   : 254
    <993>   DW_AT_decl_column : 21
    <994>   DW_AT_type        : <0x8ea>
    <998>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><99b>: Abbrev Number: 0
 <1><99c>: Abbrev Number: 15 (DW_TAG_array_type)
    <99d>   DW_AT_type        : <0x569>
    <9a1>   DW_AT_sibling     : <0x9ac>
 <2><9a5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9a6>   DW_AT_type        : <0x2b>
    <9aa>   DW_AT_upper_bound : 5
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ad>   DW_AT_name        : (indirect string, offset: 0xf51): staged_output_data
    <9b1>   DW_AT_declaration : 1
 <1><9b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_type        : <0x9ac>
 <1><9b8>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b9>   DW_AT_prototyped  : 1
    <9ba>   DW_AT_sibling     : <0x9c4>
 <2><9be>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9bf>   DW_AT_type        : <0xcd>
 <2><9c3>: Abbrev Number: 0
 <1><9c4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c5>   DW_AT_byte_size   : 4
    <9c6>   DW_AT_type        : <0x9b8>
 <1><9ca>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_type        : <0x87e>
 <1><9d0>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d1>   DW_AT_type        : <0x9ca>
 <1><9d5>: Abbrev Number: 15 (DW_TAG_array_type)
    <9d6>   DW_AT_type        : <0x9e5>
    <9da>   DW_AT_sibling     : <0x9e5>
 <2><9de>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9df>   DW_AT_type        : <0x2b>
    <9e3>   DW_AT_upper_bound : 2
 <2><9e4>: Abbrev Number: 0
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x952>
 <1><9eb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xa9): mmap_cache_t
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x3c4): tcb_wait_data
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0x160): vcpu_info
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a10>   DW_AT_name        : (indirect string, offset: 0xf35): unwind_queue_t
    <a14>   DW_AT_declaration : 1
 <1><a15>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a16>   DW_AT_byte_size   : 4
    <a17>   DW_AT_type        : <0xa0f>
 <1><a1b>: Abbrev Number: 15 (DW_TAG_array_type)
    <a1c>   DW_AT_type        : <0xe6>
    <a20>   DW_AT_sibling     : <0xa2b>
 <2><a24>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a25>   DW_AT_type        : <0x2b>
    <a29>   DW_AT_upper_bound : 15
 <2><a2a>: Abbrev Number: 0
 <1><a2b>: Abbrev Number: 10 (DW_TAG_variable)
    <a2c>   DW_AT_name        : (indirect string, offset: 0xbd4): stub_sysent
    <a30>   DW_AT_decl_file   : 19
    <a31>   DW_AT_decl_line   : 403
    <a33>   DW_AT_decl_column : 28
    <a34>   DW_AT_type        : <0x87e>
    <a38>   DW_AT_external    : 1
    <a39>   DW_AT_declaration : 1
 <1><a3a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x10ff): xlat_type
    <a3f>   DW_AT_encoding    : 7	(unsigned)
    <a40>   DW_AT_byte_size   : 4
    <a41>   DW_AT_type        : <0x2b>
    <a45>   DW_AT_decl_file   : 20
    <a46>   DW_AT_decl_line   : 13
    <a47>   DW_AT_decl_column : 6
    <a48>   DW_AT_sibling     : <0xa5f>
 <2><a4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x2de): XT_NORMAL
    <a51>   DW_AT_const_value : 0
 <2><a52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0xc97): XT_SORTED
    <a57>   DW_AT_const_value : 1
 <2><a58>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0xe03): XT_INDEXED
    <a5d>   DW_AT_const_value : 2
 <2><a5e>: Abbrev Number: 0
 <1><a5f>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a60>   DW_AT_name        : (indirect string, offset: 0xc00): xlat_style
    <a64>   DW_AT_encoding    : 7	(unsigned)
    <a65>   DW_AT_byte_size   : 4
    <a66>   DW_AT_type        : <0x2b>
    <a6a>   DW_AT_decl_file   : 20
    <a6b>   DW_AT_decl_line   : 19
    <a6c>   DW_AT_decl_column : 6
    <a6d>   DW_AT_sibling     : <0xa9c>
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0xe9): XLAT_STYLE_DEFAULT
    <a76>   DW_AT_const_value : 0
 <2><a77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0xc33): XLAT_STYLE_RAW
    <a7c>   DW_AT_const_value : 1
 <2><a7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x10ca): XLAT_STYLE_ABBREV
    <a82>   DW_AT_const_value : 2
 <2><a83>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x2fb): XLAT_STYLE_VERBOSE
    <a88>   DW_AT_const_value : 3
 <2><a89>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a8e>   DW_AT_const_value : 0
 <2><a8f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a94>   DW_AT_const_value : 4
 <2><a95>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0x1140): XLAT_STYLE_FMT_D
    <a9a>   DW_AT_const_value : 8
 <2><a9b>: Abbrev Number: 0
 <1><a9c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x32c): xlat_data
    <aa1>   DW_AT_byte_size   : 12
    <aa2>   DW_AT_decl_file   : 20
    <aa3>   DW_AT_decl_line   : 51
    <aa4>   DW_AT_decl_column : 8
    <aa5>   DW_AT_sibling     : <0xac8>
 <2><aa9>: Abbrev Number: 18 (DW_TAG_member)
    <aaa>   DW_AT_name        : val
    <aae>   DW_AT_decl_file   : 20
    <aaf>   DW_AT_decl_line   : 52
    <ab0>   DW_AT_decl_column : 11
    <ab1>   DW_AT_type        : <0x116>
    <ab5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab8>: Abbrev Number: 18 (DW_TAG_member)
    <ab9>   DW_AT_name        : str
    <abd>   DW_AT_decl_file   : 20
    <abe>   DW_AT_decl_line   : 53
    <abf>   DW_AT_decl_column : 14
    <ac0>   DW_AT_type        : <0x1c9>
    <ac4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac9>   DW_AT_type        : <0xa9c>
 <1><acd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ace>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ad2>   DW_AT_byte_size   : 24
    <ad3>   DW_AT_decl_file   : 20
    <ad4>   DW_AT_decl_line   : 56
    <ad5>   DW_AT_decl_column : 8
    <ad6>   DW_AT_sibling     : <0xb26>
 <2><ada>: Abbrev Number: 9 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x111c): data
    <adf>   DW_AT_decl_file   : 20
    <ae0>   DW_AT_decl_line   : 57
    <ae1>   DW_AT_decl_column : 26
    <ae2>   DW_AT_type        : <0xb2b>
    <ae6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae9>: Abbrev Number: 9 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x8cd): flags_strsz
    <aee>   DW_AT_decl_file   : 20
    <aef>   DW_AT_decl_line   : 58
    <af0>   DW_AT_decl_column : 9
    <af1>   DW_AT_type        : <0x122>
    <af5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af8>: Abbrev Number: 9 (DW_TAG_member)
    <af9>   DW_AT_name        : (indirect string, offset: 0xba5): size
    <afd>   DW_AT_decl_file   : 20
    <afe>   DW_AT_decl_line   : 59
    <aff>   DW_AT_decl_column : 11
    <b00>   DW_AT_type        : <0x10a>
    <b04>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b07>: Abbrev Number: 9 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x191): type
    <b0c>   DW_AT_decl_file   : 20
    <b0d>   DW_AT_decl_line   : 60
    <b0e>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0xa3a>
    <b13>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b16>: Abbrev Number: 9 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x76a): flags_mask
    <b1b>   DW_AT_decl_file   : 20
    <b1c>   DW_AT_decl_line   : 61
    <b1d>   DW_AT_decl_column : 11
    <b1e>   DW_AT_type        : <0x116>
    <b22>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b25>: Abbrev Number: 0
 <1><b26>: Abbrev Number: 3 (DW_TAG_const_type)
    <b27>   DW_AT_type        : <0xacd>
 <1><b2b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b2c>   DW_AT_byte_size   : 4
    <b2d>   DW_AT_type        : <0xac8>
 <1><b31>: Abbrev Number: 15 (DW_TAG_array_type)
    <b32>   DW_AT_type        : <0xb26>
    <b36>   DW_AT_sibling     : <0xb3c>
 <2><b3a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b3b>: Abbrev Number: 0
 <1><b3c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b3d>   DW_AT_type        : <0xb31>
 <1><b41>: Abbrev Number: 10 (DW_TAG_variable)
    <b42>   DW_AT_name        : (indirect string, offset: 0xe7c): addrfams
    <b46>   DW_AT_decl_file   : 19
    <b47>   DW_AT_decl_line   : 409
    <b49>   DW_AT_decl_column : 26
    <b4a>   DW_AT_type        : <0xb3c>
    <b4e>   DW_AT_external    : 1
    <b4f>   DW_AT_declaration : 1
 <1><b50>: Abbrev Number: 10 (DW_TAG_variable)
    <b51>   DW_AT_name        : (indirect string, offset: 0xd50): arp_hardware_types
    <b55>   DW_AT_decl_file   : 19
    <b56>   DW_AT_decl_line   : 410
    <b58>   DW_AT_decl_column : 26
    <b59>   DW_AT_type        : <0xb3c>
    <b5d>   DW_AT_external    : 1
    <b5e>   DW_AT_declaration : 1
 <1><b5f>: Abbrev Number: 10 (DW_TAG_variable)
    <b60>   DW_AT_name        : (indirect string, offset: 0x1041): at_flags
    <b64>   DW_AT_decl_file   : 19
    <b65>   DW_AT_decl_line   : 411
    <b67>   DW_AT_decl_column : 26
    <b68>   DW_AT_type        : <0xb3c>
    <b6c>   DW_AT_external    : 1
    <b6d>   DW_AT_declaration : 1
 <1><b6e>: Abbrev Number: 10 (DW_TAG_variable)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x4b1): clocknames
    <b73>   DW_AT_decl_file   : 19
    <b74>   DW_AT_decl_line   : 412
    <b76>   DW_AT_decl_column : 26
    <b77>   DW_AT_type        : <0xb3c>
    <b7b>   DW_AT_external    : 1
    <b7c>   DW_AT_declaration : 1
 <1><b7d>: Abbrev Number: 10 (DW_TAG_variable)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x1001): dirent_types
    <b82>   DW_AT_decl_file   : 19
    <b83>   DW_AT_decl_line   : 413
    <b85>   DW_AT_decl_column : 26
    <b86>   DW_AT_type        : <0xb3c>
    <b8a>   DW_AT_external    : 1
    <b8b>   DW_AT_declaration : 1
 <1><b8c>: Abbrev Number: 10 (DW_TAG_variable)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x91e): ethernet_protocols
    <b91>   DW_AT_decl_file   : 19
    <b92>   DW_AT_decl_line   : 414
    <b94>   DW_AT_decl_column : 26
    <b95>   DW_AT_type        : <0xb3c>
    <b99>   DW_AT_external    : 1
    <b9a>   DW_AT_declaration : 1
 <1><b9b>: Abbrev Number: 10 (DW_TAG_variable)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x5e4): inet_protocols
    <ba0>   DW_AT_decl_file   : 19
    <ba1>   DW_AT_decl_line   : 415
    <ba3>   DW_AT_decl_column : 26
    <ba4>   DW_AT_type        : <0xb3c>
    <ba8>   DW_AT_external    : 1
    <ba9>   DW_AT_declaration : 1
 <1><baa>: Abbrev Number: 10 (DW_TAG_variable)
    <bab>   DW_AT_name        : (indirect string, offset: 0x2cb): evdev_abs
    <baf>   DW_AT_decl_file   : 19
    <bb0>   DW_AT_decl_line   : 416
    <bb2>   DW_AT_decl_column : 26
    <bb3>   DW_AT_type        : <0xb3c>
    <bb7>   DW_AT_external    : 1
    <bb8>   DW_AT_declaration : 1
 <1><bb9>: Abbrev Number: 10 (DW_TAG_variable)
    <bba>   DW_AT_name        : (indirect string, offset: 0x75f): audit_arch
    <bbe>   DW_AT_decl_file   : 19
    <bbf>   DW_AT_decl_line   : 417
    <bc1>   DW_AT_decl_column : 26
    <bc2>   DW_AT_type        : <0xb3c>
    <bc6>   DW_AT_external    : 1
    <bc7>   DW_AT_declaration : 1
 <1><bc8>: Abbrev Number: 10 (DW_TAG_variable)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x95): evdev_ev
    <bcd>   DW_AT_decl_file   : 19
    <bce>   DW_AT_decl_line   : 418
    <bd0>   DW_AT_decl_column : 26
    <bd1>   DW_AT_type        : <0xb3c>
    <bd5>   DW_AT_external    : 1
    <bd6>   DW_AT_declaration : 1
 <1><bd7>: Abbrev Number: 10 (DW_TAG_variable)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x492): iffflags
    <bdc>   DW_AT_decl_file   : 19
    <bdd>   DW_AT_decl_line   : 419
    <bdf>   DW_AT_decl_column : 26
    <be0>   DW_AT_type        : <0xb3c>
    <be4>   DW_AT_external    : 1
    <be5>   DW_AT_declaration : 1
 <1><be6>: Abbrev Number: 10 (DW_TAG_variable)
    <be7>   DW_AT_name        : (indirect string, offset: 0xc42): ip_type_of_services
    <beb>   DW_AT_decl_file   : 19
    <bec>   DW_AT_decl_line   : 420
    <bee>   DW_AT_decl_column : 26
    <bef>   DW_AT_type        : <0xb3c>
    <bf3>   DW_AT_external    : 1
    <bf4>   DW_AT_declaration : 1
 <1><bf5>: Abbrev Number: 10 (DW_TAG_variable)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x6f2): ipc_private
    <bfa>   DW_AT_decl_file   : 19
    <bfb>   DW_AT_decl_line   : 421
    <bfd>   DW_AT_decl_column : 26
    <bfe>   DW_AT_type        : <0xb3c>
    <c02>   DW_AT_external    : 1
    <c03>   DW_AT_declaration : 1
 <1><c04>: Abbrev Number: 10 (DW_TAG_variable)
    <c05>   DW_AT_name        : (indirect string, offset: 0x322): msg_flags
    <c09>   DW_AT_decl_file   : 19
    <c0a>   DW_AT_decl_line   : 422
    <c0c>   DW_AT_decl_column : 26
    <c0d>   DW_AT_type        : <0xb3c>
    <c11>   DW_AT_external    : 1
    <c12>   DW_AT_declaration : 1
 <1><c13>: Abbrev Number: 10 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x105): netlink_protocols
    <c18>   DW_AT_decl_file   : 19
    <c19>   DW_AT_decl_line   : 423
    <c1b>   DW_AT_decl_column : 26
    <c1c>   DW_AT_type        : <0xb3c>
    <c20>   DW_AT_external    : 1
    <c21>   DW_AT_declaration : 1
 <1><c22>: Abbrev Number: 10 (DW_TAG_variable)
    <c23>   DW_AT_name        : (indirect string, offset: 0xf64): nl_bridge_vlan_flags
    <c27>   DW_AT_decl_file   : 19
    <c28>   DW_AT_decl_line   : 424
    <c2a>   DW_AT_decl_column : 26
    <c2b>   DW_AT_type        : <0xb3c>
    <c2f>   DW_AT_external    : 1
    <c30>   DW_AT_declaration : 1
 <1><c31>: Abbrev Number: 10 (DW_TAG_variable)
    <c32>   DW_AT_name        : (indirect string, offset: 0xdec): nl_netfilter_msg_types
    <c36>   DW_AT_decl_file   : 19
    <c37>   DW_AT_decl_line   : 425
    <c39>   DW_AT_decl_column : 26
    <c3a>   DW_AT_type        : <0xb3c>
    <c3e>   DW_AT_external    : 1
    <c3f>   DW_AT_declaration : 1
 <1><c40>: Abbrev Number: 10 (DW_TAG_variable)
    <c41>   DW_AT_name        : (indirect string, offset: 0x474): nl_route_types
    <c45>   DW_AT_decl_file   : 19
    <c46>   DW_AT_decl_line   : 426
    <c48>   DW_AT_decl_column : 26
    <c49>   DW_AT_type        : <0xb3c>
    <c4d>   DW_AT_external    : 1
    <c4e>   DW_AT_declaration : 1
 <1><c4f>: Abbrev Number: 10 (DW_TAG_variable)
    <c50>   DW_AT_name        : (indirect string, offset: 0xeb3): open_access_modes
    <c54>   DW_AT_decl_file   : 19
    <c55>   DW_AT_decl_line   : 427
    <c57>   DW_AT_decl_column : 26
    <c58>   DW_AT_type        : <0xb3c>
    <c5c>   DW_AT_external    : 1
    <c5d>   DW_AT_declaration : 1
 <1><c5e>: Abbrev Number: 10 (DW_TAG_variable)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x85): open_mode_flags
    <c63>   DW_AT_decl_file   : 19
    <c64>   DW_AT_decl_line   : 428
    <c66>   DW_AT_decl_column : 26
    <c67>   DW_AT_type        : <0xb3c>
    <c6b>   DW_AT_external    : 1
    <c6c>   DW_AT_declaration : 1
 <1><c6d>: Abbrev Number: 10 (DW_TAG_variable)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xc73): perf_type_id
    <c72>   DW_AT_decl_file   : 19
    <c73>   DW_AT_decl_line   : 429
    <c75>   DW_AT_decl_column : 26
    <c76>   DW_AT_type        : <0xb3c>
    <c7a>   DW_AT_external    : 1
    <c7b>   DW_AT_declaration : 1
 <1><c7c>: Abbrev Number: 10 (DW_TAG_variable)
    <c7d>   DW_AT_name        : (indirect string, offset: 0xe85): pollflags
    <c81>   DW_AT_decl_file   : 19
    <c82>   DW_AT_decl_line   : 430
    <c84>   DW_AT_decl_column : 26
    <c85>   DW_AT_type        : <0xb3c>
    <c89>   DW_AT_external    : 1
    <c8a>   DW_AT_declaration : 1
 <1><c8b>: Abbrev Number: 10 (DW_TAG_variable)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x574): ptrace_cmds
    <c90>   DW_AT_decl_file   : 19
    <c91>   DW_AT_decl_line   : 431
    <c93>   DW_AT_decl_column : 26
    <c94>   DW_AT_type        : <0xb3c>
    <c98>   DW_AT_external    : 1
    <c99>   DW_AT_declaration : 1
 <1><c9a>: Abbrev Number: 10 (DW_TAG_variable)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x860): resource_flags
    <c9f>   DW_AT_decl_file   : 19
    <ca0>   DW_AT_decl_line   : 432
    <ca2>   DW_AT_decl_column : 26
    <ca3>   DW_AT_type        : <0xb3c>
    <ca7>   DW_AT_external    : 1
    <ca8>   DW_AT_declaration : 1
 <1><ca9>: Abbrev Number: 10 (DW_TAG_variable)
    <caa>   DW_AT_name        : (indirect string, offset: 0x2a1): route_nexthop_flags
    <cae>   DW_AT_decl_file   : 19
    <caf>   DW_AT_decl_line   : 433
    <cb1>   DW_AT_decl_column : 26
    <cb2>   DW_AT_type        : <0xb3c>
    <cb6>   DW_AT_external    : 1
    <cb7>   DW_AT_declaration : 1
 <1><cb8>: Abbrev Number: 10 (DW_TAG_variable)
    <cb9>   DW_AT_name        : (indirect string, offset: 0xeef): routing_protocols
    <cbd>   DW_AT_decl_file   : 19
    <cbe>   DW_AT_decl_line   : 434
    <cc0>   DW_AT_decl_column : 26
    <cc1>   DW_AT_type        : <0xb3c>
    <cc5>   DW_AT_external    : 1
    <cc6>   DW_AT_declaration : 1
 <1><cc7>: Abbrev Number: 10 (DW_TAG_variable)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x483): routing_scopes
    <ccc>   DW_AT_decl_file   : 19
    <ccd>   DW_AT_decl_line   : 435
    <ccf>   DW_AT_decl_column : 26
    <cd0>   DW_AT_type        : <0xb3c>
    <cd4>   DW_AT_external    : 1
    <cd5>   DW_AT_declaration : 1
 <1><cd6>: Abbrev Number: 10 (DW_TAG_variable)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xdda): routing_table_ids
    <cdb>   DW_AT_decl_file   : 19
    <cdc>   DW_AT_decl_line   : 436
    <cde>   DW_AT_decl_column : 26
    <cdf>   DW_AT_type        : <0xb3c>
    <ce3>   DW_AT_external    : 1
    <ce4>   DW_AT_declaration : 1
 <1><ce5>: Abbrev Number: 10 (DW_TAG_variable)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x6b3): routing_types
    <cea>   DW_AT_decl_file   : 19
    <ceb>   DW_AT_decl_line   : 437
    <ced>   DW_AT_decl_column : 26
    <cee>   DW_AT_type        : <0xb3c>
    <cf2>   DW_AT_external    : 1
    <cf3>   DW_AT_declaration : 1
 <1><cf4>: Abbrev Number: 10 (DW_TAG_variable)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x1b5): rwf_flags
    <cf9>   DW_AT_decl_file   : 19
    <cfa>   DW_AT_decl_line   : 438
    <cfc>   DW_AT_decl_column : 26
    <cfd>   DW_AT_type        : <0xb3c>
    <d01>   DW_AT_external    : 1
    <d02>   DW_AT_declaration : 1
 <1><d03>: Abbrev Number: 10 (DW_TAG_variable)
    <d04>   DW_AT_name        : (indirect string, offset: 0x898): seccomp_filter_flags
    <d08>   DW_AT_decl_file   : 19
    <d09>   DW_AT_decl_line   : 439
    <d0b>   DW_AT_decl_column : 26
    <d0c>   DW_AT_type        : <0xb3c>
    <d10>   DW_AT_external    : 1
    <d11>   DW_AT_declaration : 1
 <1><d12>: Abbrev Number: 10 (DW_TAG_variable)
    <d13>   DW_AT_name        : (indirect string, offset: 0x2e8): seccomp_ret_action
    <d17>   DW_AT_decl_file   : 19
    <d18>   DW_AT_decl_line   : 440
    <d1a>   DW_AT_decl_column : 26
    <d1b>   DW_AT_type        : <0xb3c>
    <d1f>   DW_AT_external    : 1
    <d20>   DW_AT_declaration : 1
 <1><d21>: Abbrev Number: 10 (DW_TAG_variable)
    <d22>   DW_AT_name        : (indirect string, offset: 0x44f): setns_types
    <d26>   DW_AT_decl_file   : 19
    <d27>   DW_AT_decl_line   : 441
    <d29>   DW_AT_decl_column : 26
    <d2a>   DW_AT_type        : <0xb3c>
    <d2e>   DW_AT_external    : 1
    <d2f>   DW_AT_declaration : 1
 <1><d30>: Abbrev Number: 10 (DW_TAG_variable)
    <d31>   DW_AT_name        : (indirect string, offset: 0xe71): sg_io_info
    <d35>   DW_AT_decl_file   : 19
    <d36>   DW_AT_decl_line   : 442
    <d38>   DW_AT_decl_column : 26
    <d39>   DW_AT_type        : <0xb3c>
    <d3d>   DW_AT_external    : 1
    <d3e>   DW_AT_declaration : 1
 <1><d3f>: Abbrev Number: 10 (DW_TAG_variable)
    <d40>   DW_AT_name        : (indirect string, offset: 0xbe8): socketlayers
    <d44>   DW_AT_decl_file   : 19
    <d45>   DW_AT_decl_line   : 443
    <d47>   DW_AT_decl_column : 26
    <d48>   DW_AT_type        : <0xb3c>
    <d4c>   DW_AT_external    : 1
    <d4d>   DW_AT_declaration : 1
 <1><d4e>: Abbrev Number: 10 (DW_TAG_variable)
    <d4f>   DW_AT_name        : (indirect string, offset: 0xdc4): socktypes
    <d53>   DW_AT_decl_file   : 19
    <d54>   DW_AT_decl_line   : 444
    <d56>   DW_AT_decl_column : 26
    <d57>   DW_AT_type        : <0xb3c>
    <d5b>   DW_AT_external    : 1
    <d5c>   DW_AT_declaration : 1
 <1><d5d>: Abbrev Number: 10 (DW_TAG_variable)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xac2): tcp_state_flags
    <d62>   DW_AT_decl_file   : 19
    <d63>   DW_AT_decl_line   : 445
    <d65>   DW_AT_decl_column : 26
    <d66>   DW_AT_type        : <0xb3c>
    <d6a>   DW_AT_external    : 1
    <d6b>   DW_AT_declaration : 1
 <1><d6c>: Abbrev Number: 10 (DW_TAG_variable)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x794): tcp_states
    <d71>   DW_AT_decl_file   : 19
    <d72>   DW_AT_decl_line   : 446
    <d74>   DW_AT_decl_column : 26
    <d75>   DW_AT_type        : <0xb3c>
    <d79>   DW_AT_external    : 1
    <d7a>   DW_AT_declaration : 1
 <1><d7b>: Abbrev Number: 10 (DW_TAG_variable)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x109e): whence_codes
    <d80>   DW_AT_decl_file   : 19
    <d81>   DW_AT_decl_line   : 447
    <d83>   DW_AT_decl_column : 26
    <d84>   DW_AT_type        : <0xb3c>
    <d88>   DW_AT_external    : 1
    <d89>   DW_AT_declaration : 1
 <1><d8a>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d8b>   DW_AT_encoding    : 7	(unsigned)
    <d8c>   DW_AT_byte_size   : 4
    <d8d>   DW_AT_type        : <0x2b>
    <d91>   DW_AT_decl_file   : 19
    <d92>   DW_AT_decl_line   : 508
    <d94>   DW_AT_decl_column : 14
    <d95>   DW_AT_sibling     : <0xdac>
 <2><d99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x9ee): CFLAG_NONE
    <d9e>   DW_AT_const_value : 0
 <2><d9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x931): CFLAG_ONLY_STATS
    <da4>   DW_AT_const_value : 1
 <2><da5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0xbf5): CFLAG_BOTH
    <daa>   DW_AT_const_value : 2
 <2><dab>: Abbrev Number: 0
 <1><dac>: Abbrev Number: 28 (DW_TAG_typedef)
    <dad>   DW_AT_name        : (indirect string, offset: 0x1156): cflag_t
    <db1>   DW_AT_decl_file   : 19
    <db2>   DW_AT_decl_line   : 512
    <db4>   DW_AT_decl_column : 3
    <db5>   DW_AT_type        : <0xd8a>
 <1><db9>: Abbrev Number: 10 (DW_TAG_variable)
    <dba>   DW_AT_name        : (indirect string, offset: 0xd0d): cflag
    <dbe>   DW_AT_decl_file   : 19
    <dbf>   DW_AT_decl_line   : 513
    <dc1>   DW_AT_decl_column : 16
    <dc2>   DW_AT_type        : <0xdac>
    <dc6>   DW_AT_external    : 1
    <dc7>   DW_AT_declaration : 1
 <1><dc8>: Abbrev Number: 10 (DW_TAG_variable)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x180): Tflag
    <dcd>   DW_AT_decl_file   : 19
    <dce>   DW_AT_decl_line   : 514
    <dd0>   DW_AT_decl_column : 13
    <dd1>   DW_AT_type        : <0x515>
    <dd5>   DW_AT_external    : 1
    <dd6>   DW_AT_declaration : 1
 <1><dd7>: Abbrev Number: 10 (DW_TAG_variable)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x7ef): Tflag_scale
    <ddc>   DW_AT_decl_file   : 19
    <ddd>   DW_AT_decl_line   : 515
    <ddf>   DW_AT_decl_column : 12
    <de0>   DW_AT_type        : <0x64>
    <de4>   DW_AT_external    : 1
    <de5>   DW_AT_declaration : 1
 <1><de6>: Abbrev Number: 10 (DW_TAG_variable)
    <de7>   DW_AT_name        : (indirect string, offset: 0x8ad): Tflag_width
    <deb>   DW_AT_decl_file   : 19
    <dec>   DW_AT_decl_line   : 516
    <dee>   DW_AT_decl_column : 12
    <def>   DW_AT_type        : <0x64>
    <df3>   DW_AT_external    : 1
    <df4>   DW_AT_declaration : 1
 <1><df5>: Abbrev Number: 10 (DW_TAG_variable)
    <df6>   DW_AT_name        : (indirect string, offset: 0xe63): iflag
    <dfa>   DW_AT_decl_file   : 19
    <dfb>   DW_AT_decl_line   : 517
    <dfd>   DW_AT_decl_column : 13
    <dfe>   DW_AT_type        : <0x515>
    <e02>   DW_AT_external    : 1
    <e03>   DW_AT_declaration : 1
 <1><e04>: Abbrev Number: 10 (DW_TAG_variable)
    <e05>   DW_AT_name        : (indirect string, offset: 0x5b4): count_wallclock
    <e09>   DW_AT_decl_file   : 19
    <e0a>   DW_AT_decl_line   : 518
    <e0c>   DW_AT_decl_column : 13
    <e0d>   DW_AT_type        : <0x515>
    <e11>   DW_AT_external    : 1
    <e12>   DW_AT_declaration : 1
 <1><e13>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e14>   DW_AT_name        : (indirect string, offset: 0x4a): path_set_item
    <e18>   DW_AT_byte_size   : 4
    <e19>   DW_AT_decl_file   : 19
    <e1a>   DW_AT_decl_line   : 520
    <e1c>   DW_AT_decl_column : 8
    <e1d>   DW_AT_sibling     : <0xe32>
 <2><e21>: Abbrev Number: 22 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0xc3): path
    <e26>   DW_AT_decl_file   : 19
    <e27>   DW_AT_decl_line   : 521
    <e29>   DW_AT_decl_column : 14
    <e2a>   DW_AT_type        : <0x1c9>
    <e2e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e31>: Abbrev Number: 0
 <1><e32>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e33>   DW_AT_name        : (indirect string, offset: 0x79f): path_set
    <e37>   DW_AT_byte_size   : 12
    <e38>   DW_AT_decl_file   : 19
    <e39>   DW_AT_decl_line   : 525
    <e3b>   DW_AT_decl_column : 15
    <e3c>   DW_AT_sibling     : <0xe71>
 <2><e40>: Abbrev Number: 22 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x72d): paths_selected
    <e45>   DW_AT_decl_file   : 19
    <e46>   DW_AT_decl_line   : 526
    <e48>   DW_AT_decl_column : 24
    <e49>   DW_AT_type        : <0xe71>
    <e4d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e50>: Abbrev Number: 22 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x1091): num_selected
    <e55>   DW_AT_decl_file   : 19
    <e56>   DW_AT_decl_line   : 527
    <e58>   DW_AT_decl_column : 9
    <e59>   DW_AT_type        : <0x122>
    <e5d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e60>: Abbrev Number: 22 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0xba5): size
    <e65>   DW_AT_decl_file   : 19
    <e66>   DW_AT_decl_line   : 528
    <e68>   DW_AT_decl_column : 9
    <e69>   DW_AT_type        : <0x122>
    <e6d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e70>: Abbrev Number: 0
 <1><e71>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e72>   DW_AT_byte_size   : 4
    <e73>   DW_AT_type        : <0xe13>
 <1><e77>: Abbrev Number: 10 (DW_TAG_variable)
    <e78>   DW_AT_name        : (indirect string, offset: 0x10ef): global_path_set
    <e7c>   DW_AT_decl_file   : 19
    <e7d>   DW_AT_decl_line   : 529
    <e7f>   DW_AT_decl_column : 3
    <e80>   DW_AT_type        : <0xe32>
    <e84>   DW_AT_external    : 1
    <e85>   DW_AT_declaration : 1
 <1><e86>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e87>   DW_AT_name        : (indirect string, offset: 0xfdc): xflag_opts
    <e8b>   DW_AT_encoding    : 7	(unsigned)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0x2b>
    <e91>   DW_AT_decl_file   : 19
    <e92>   DW_AT_decl_line   : 531
    <e94>   DW_AT_decl_column : 6
    <e95>   DW_AT_sibling     : <0xeb8>
 <2><e99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xa6f): HEXSTR_NONE
    <e9e>   DW_AT_const_value : 0
 <2><e9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x1023): HEXSTR_NON_ASCII
    <ea4>   DW_AT_const_value : 1
 <2><ea5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x96f): HEXSTR_ALL
    <eaa>   DW_AT_const_value : 2
 <2><eab>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0x69c): HEXSTR_NON_ASCII_CHARS
    <eb0>   DW_AT_const_value : 3
 <2><eb1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x10ab): NUM_HEXSTR_OPTS
    <eb6>   DW_AT_const_value : 4
 <2><eb7>: Abbrev Number: 0
 <1><eb8>: Abbrev Number: 10 (DW_TAG_variable)
    <eb9>   DW_AT_name        : (indirect string, offset: 0xe38): xflag
    <ebd>   DW_AT_decl_file   : 19
    <ebe>   DW_AT_decl_line   : 544
    <ec0>   DW_AT_decl_column : 17
    <ec1>   DW_AT_type        : <0x2b>
    <ec5>   DW_AT_external    : 1
    <ec6>   DW_AT_declaration : 1
 <1><ec7>: Abbrev Number: 10 (DW_TAG_variable)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xcc8): followfork
    <ecc>   DW_AT_decl_file   : 19
    <ecd>   DW_AT_decl_line   : 545
    <ecf>   DW_AT_decl_column : 13
    <ed0>   DW_AT_type        : <0x515>
    <ed4>   DW_AT_external    : 1
    <ed5>   DW_AT_declaration : 1
 <1><ed6>: Abbrev Number: 10 (DW_TAG_variable)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x336): output_separately
    <edb>   DW_AT_decl_file   : 19
    <edc>   DW_AT_decl_line   : 546
    <ede>   DW_AT_decl_column : 13
    <edf>   DW_AT_type        : <0x515>
    <ee3>   DW_AT_external    : 1
    <ee4>   DW_AT_declaration : 1
 <1><ee5>: Abbrev Number: 10 (DW_TAG_variable)
    <ee6>   DW_AT_name        : (indirect string, offset: 0x22b): stack_trace_enabled
    <eea>   DW_AT_decl_file   : 19
    <eeb>   DW_AT_decl_line   : 549
    <eed>   DW_AT_decl_column : 13
    <eee>   DW_AT_type        : <0x515>
    <ef2>   DW_AT_external    : 1
    <ef3>   DW_AT_declaration : 1
 <1><ef4>: Abbrev Number: 10 (DW_TAG_variable)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x68a): ptrace_setoptions
    <ef9>   DW_AT_decl_file   : 19
    <efa>   DW_AT_decl_line   : 553
    <efc>   DW_AT_decl_column : 17
    <efd>   DW_AT_type        : <0x2b>
    <f01>   DW_AT_external    : 1
    <f02>   DW_AT_declaration : 1
 <1><f03>: Abbrev Number: 10 (DW_TAG_variable)
    <f04>   DW_AT_name        : (indirect string, offset: 0xa64): max_strlen
    <f08>   DW_AT_decl_file   : 19
    <f09>   DW_AT_decl_line   : 554
    <f0b>   DW_AT_decl_column : 17
    <f0c>   DW_AT_type        : <0x2b>
    <f10>   DW_AT_external    : 1
    <f11>   DW_AT_declaration : 1
 <1><f12>: Abbrev Number: 10 (DW_TAG_variable)
    <f13>   DW_AT_name        : (indirect string, offset: 0xa9c): os_release
    <f17>   DW_AT_decl_file   : 19
    <f18>   DW_AT_decl_line   : 555
    <f1a>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0x2b>
    <f1f>   DW_AT_external    : 1
    <f20>   DW_AT_declaration : 1
 <1><f21>: Abbrev Number: 10 (DW_TAG_variable)
    <f22>   DW_AT_name        : (indirect string, offset: 0x73c): xlat_verbosity
    <f26>   DW_AT_decl_file   : 19
    <f27>   DW_AT_decl_line   : 917
    <f29>   DW_AT_decl_column : 24
    <f2a>   DW_AT_type        : <0xa5f>
    <f2e>   DW_AT_external    : 1
    <f2f>   DW_AT_declaration : 1
 <1><f30>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f31>   DW_AT_name        : (indirect string, offset: 0x597): xlat_style_private_flag_bits
    <f35>   DW_AT_encoding    : 7	(unsigned)
    <f36>   DW_AT_byte_size   : 4
    <f37>   DW_AT_type        : <0x2b>
    <f3b>   DW_AT_decl_file   : 19
    <f3c>   DW_AT_decl_line   : 937
    <f3e>   DW_AT_decl_column : 6
    <f3f>   DW_AT_sibling     : <0xf5c>
 <2><f43>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x2b5): PAF_PRINT_INDICES_BIT
    <f48>   DW_AT_const_value : 5
 <2><f49>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xb5c): PAF_ARRAY_TRUNCATED_BIT
    <f4e>   DW_AT_const_value : 6
 <2><f4f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x40f): PXF_DEFAULT_STR_BIT
    <f54>   DW_AT_const_value : 7
 <2><f55>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0xcaa): SPFF_AUXSTR_MODE_BIT
    <f5a>   DW_AT_const_value : 8
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xd63): find_xlat_flag_bits
    <f61>   DW_AT_encoding    : 7	(unsigned)
    <f62>   DW_AT_byte_size   : 4
    <f63>   DW_AT_type        : <0x2b>
    <f67>   DW_AT_decl_file   : 19
    <f68>   DW_AT_decl_line   : 1441
    <f6a>   DW_AT_decl_column : 6
    <f6b>   DW_AT_sibling     : <0xf76>
 <2><f6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f70>   DW_AT_name        : (indirect string, offset: 0x9ac): FXL_CASE_SENSITIVE_BIT
    <f74>   DW_AT_const_value : 0
 <2><f75>: Abbrev Number: 0
 <1><f76>: Abbrev Number: 10 (DW_TAG_variable)
    <f77>   DW_AT_name        : (indirect string, offset: 0xa40): printing_tcp
    <f7b>   DW_AT_decl_file   : 19
    <f7c>   DW_AT_decl_line   : 1687
    <f7e>   DW_AT_decl_column : 20
    <f7f>   DW_AT_type        : <0x615>
    <f83>   DW_AT_external    : 1
    <f84>   DW_AT_declaration : 1
 <1><f85>: Abbrev Number: 10 (DW_TAG_variable)
    <f86>   DW_AT_name        : (indirect string, offset: 0x55f): errnoent
    <f8a>   DW_AT_decl_file   : 19
    <f8b>   DW_AT_decl_line   : 1885
    <f8d>   DW_AT_decl_column : 26
    <f8e>   DW_AT_type        : <0x449>
    <f92>   DW_AT_external    : 1
    <f93>   DW_AT_declaration : 1
 <1><f94>: Abbrev Number: 10 (DW_TAG_variable)
    <f95>   DW_AT_name        : (indirect string, offset: 0x8b9): signalent
    <f99>   DW_AT_decl_file   : 19
    <f9a>   DW_AT_decl_line   : 1886
    <f9c>   DW_AT_decl_column : 26
    <f9d>   DW_AT_type        : <0x449>
    <fa1>   DW_AT_external    : 1
    <fa2>   DW_AT_declaration : 1
 <1><fa3>: Abbrev Number: 10 (DW_TAG_variable)
    <fa4>   DW_AT_name        : (indirect string, offset: 0xeab): nerrnos
    <fa8>   DW_AT_decl_file   : 19
    <fa9>   DW_AT_decl_line   : 1887
    <fab>   DW_AT_decl_column : 27
    <fac>   DW_AT_type        : <0x32>
    <fb0>   DW_AT_external    : 1
    <fb1>   DW_AT_declaration : 1
 <1><fb2>: Abbrev Number: 10 (DW_TAG_variable)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x107a): nsignals
    <fb7>   DW_AT_decl_file   : 19
    <fb8>   DW_AT_decl_line   : 1888
    <fba>   DW_AT_decl_column : 27
    <fbb>   DW_AT_type        : <0x32>
    <fbf>   DW_AT_external    : 1
    <fc0>   DW_AT_declaration : 1
 <1><fc1>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc2>   DW_AT_type        : <0x87e>
    <fc6>   DW_AT_sibling     : <0xfcc>
 <2><fca>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fcb>: Abbrev Number: 0
 <1><fcc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fcd>   DW_AT_type        : <0xfc1>
 <1><fd1>: Abbrev Number: 10 (DW_TAG_variable)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xd2e): sysent0
    <fd6>   DW_AT_decl_file   : 19
    <fd7>   DW_AT_decl_line   : 1890
    <fd9>   DW_AT_decl_column : 28
    <fda>   DW_AT_type        : <0xfcc>
    <fde>   DW_AT_external    : 1
    <fdf>   DW_AT_declaration : 1
 <1><fe0>: Abbrev Number: 15 (DW_TAG_array_type)
    <fe1>   DW_AT_type        : <0x8e5>
    <fe5>   DW_AT_sibling     : <0xfeb>
 <2><fe9>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fea>: Abbrev Number: 0
 <1><feb>: Abbrev Number: 3 (DW_TAG_const_type)
    <fec>   DW_AT_type        : <0xfe0>
 <1><ff0>: Abbrev Number: 10 (DW_TAG_variable)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x10e5): ioctlent0
    <ff5>   DW_AT_decl_file   : 19
    <ff6>   DW_AT_decl_line   : 1891
    <ff8>   DW_AT_decl_column : 30
    <ff9>   DW_AT_type        : <0xfeb>
    <ffd>   DW_AT_external    : 1
    <ffe>   DW_AT_declaration : 1
 <1><fff>: Abbrev Number: 10 (DW_TAG_variable)
    <1000>   DW_AT_name        : (indirect string, offset: 0xfe7): personality_names
    <1004>   DW_AT_decl_file   : 19
    <1005>   DW_AT_decl_line   : 1893
    <1007>   DW_AT_decl_column : 26
    <1008>   DW_AT_type        : <0x449>
    <100c>   DW_AT_external    : 1
    <100d>   DW_AT_declaration : 1
 <1><100e>: Abbrev Number: 10 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0x8d9): sysent
    <1013>   DW_AT_decl_file   : 19
    <1014>   DW_AT_decl_line   : 1896
    <1016>   DW_AT_decl_column : 29
    <1017>   DW_AT_type        : <0x9ca>
    <101b>   DW_AT_external    : 1
    <101c>   DW_AT_declaration : 1
 <1><101d>: Abbrev Number: 10 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0xcbf): ioctlent
    <1022>   DW_AT_decl_file   : 19
    <1023>   DW_AT_decl_line   : 1897
    <1025>   DW_AT_decl_column : 31
    <1026>   DW_AT_type        : <0x102c>
    <102a>   DW_AT_external    : 1
    <102b>   DW_AT_declaration : 1
 <1><102c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <102d>   DW_AT_byte_size   : 4
    <102e>   DW_AT_type        : <0x8e5>
 <1><1032>: Abbrev Number: 10 (DW_TAG_variable)
    <1033>   DW_AT_name        : (indirect string, offset: 0x8c3): nsyscalls
    <1037>   DW_AT_decl_file   : 19
    <1038>   DW_AT_decl_line   : 1903
    <103a>   DW_AT_decl_column : 17
    <103b>   DW_AT_type        : <0x2b>
    <103f>   DW_AT_external    : 1
    <1040>   DW_AT_declaration : 1
 <1><1041>: Abbrev Number: 10 (DW_TAG_variable)
    <1042>   DW_AT_name        : (indirect string, offset: 0xec5): nioctlents
    <1046>   DW_AT_decl_file   : 19
    <1047>   DW_AT_decl_line   : 1904
    <1049>   DW_AT_decl_column : 17
    <104a>   DW_AT_type        : <0x2b>
    <104e>   DW_AT_external    : 1
    <104f>   DW_AT_declaration : 1
 <1><1050>: Abbrev Number: 15 (DW_TAG_array_type)
    <1051>   DW_AT_type        : <0x32>
    <1055>   DW_AT_sibling     : <0x1060>
 <2><1059>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <105a>   DW_AT_type        : <0x2b>
    <105e>   DW_AT_upper_bound : 2
 <2><105f>: Abbrev Number: 0
 <1><1060>: Abbrev Number: 3 (DW_TAG_const_type)
    <1061>   DW_AT_type        : <0x1050>
 <1><1065>: Abbrev Number: 10 (DW_TAG_variable)
    <1066>   DW_AT_name        : (indirect string, offset: 0xf44): nsyscall_vec
    <106a>   DW_AT_decl_file   : 19
    <106b>   DW_AT_decl_line   : 1906
    <106d>   DW_AT_decl_column : 27
    <106e>   DW_AT_type        : <0x1060>
    <1072>   DW_AT_external    : 1
    <1073>   DW_AT_declaration : 1
 <1><1074>: Abbrev Number: 15 (DW_TAG_array_type)
    <1075>   DW_AT_type        : <0x9d0>
    <1079>   DW_AT_sibling     : <0x1084>
 <2><107d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <107e>   DW_AT_type        : <0x2b>
    <1082>   DW_AT_upper_bound : 2
 <2><1083>: Abbrev Number: 0
 <1><1084>: Abbrev Number: 3 (DW_TAG_const_type)
    <1085>   DW_AT_type        : <0x1074>
 <1><1089>: Abbrev Number: 10 (DW_TAG_variable)
    <108a>   DW_AT_name        : (indirect string, offset: 0x7dc): sysent_vec
    <108e>   DW_AT_decl_file   : 19
    <108f>   DW_AT_decl_line   : 1907
    <1091>   DW_AT_decl_column : 35
    <1092>   DW_AT_type        : <0x1084>
    <1096>   DW_AT_external    : 1
    <1097>   DW_AT_declaration : 1
 <1><1098>: Abbrev Number: 10 (DW_TAG_variable)
    <1099>   DW_AT_name        : (indirect string, offset: 0x38f): inject_vec
    <109d>   DW_AT_decl_file   : 19
    <109e>   DW_AT_decl_line   : 1908
    <10a0>   DW_AT_decl_column : 28
    <10a1>   DW_AT_type        : <0x9d5>
    <10a5>   DW_AT_external    : 1
    <10a6>   DW_AT_declaration : 1
 <1><10a7>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a8>   DW_AT_name        : (indirect string, offset: 0xdb7): audit_arch_t
    <10ac>   DW_AT_byte_size   : 8
    <10ad>   DW_AT_decl_file   : 19
    <10ae>   DW_AT_decl_line   : 1910
    <10b0>   DW_AT_decl_column : 8
    <10b1>   DW_AT_sibling     : <0x10d6>
 <2><10b5>: Abbrev Number: 22 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x589): arch
    <10ba>   DW_AT_decl_file   : 19
    <10bb>   DW_AT_decl_line   : 1911
    <10bd>   DW_AT_decl_column : 15
    <10be>   DW_AT_type        : <0x2b>
    <10c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c5>: Abbrev Number: 22 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0xa26): flag
    <10ca>   DW_AT_decl_file   : 19
    <10cb>   DW_AT_decl_line   : 1912
    <10cd>   DW_AT_decl_column : 15
    <10ce>   DW_AT_type        : <0x2b>
    <10d2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d5>: Abbrev Number: 0
 <1><10d6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d7>   DW_AT_type        : <0x10a7>
 <1><10db>: Abbrev Number: 15 (DW_TAG_array_type)
    <10dc>   DW_AT_type        : <0x10d6>
    <10e0>   DW_AT_sibling     : <0x10eb>
 <2><10e4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10e5>   DW_AT_type        : <0x2b>
    <10e9>   DW_AT_upper_bound : 2
 <2><10ea>: Abbrev Number: 0
 <1><10eb>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ec>   DW_AT_type        : <0x10db>
 <1><10f0>: Abbrev Number: 10 (DW_TAG_variable)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x99d): audit_arch_vec
    <10f5>   DW_AT_decl_file   : 19
    <10f6>   DW_AT_decl_line   : 1915
    <10f8>   DW_AT_decl_column : 34
    <10f9>   DW_AT_type        : <0x10eb>
    <10fd>   DW_AT_external    : 1
    <10fe>   DW_AT_declaration : 1
 <1><10ff>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1100>   DW_AT_byte_size   : 180
    <1101>   DW_AT_decl_file   : 21
    <1102>   DW_AT_decl_line   : 2
    <1103>   DW_AT_decl_column : 9
    <1104>   DW_AT_sibling     : <0x13b9>
 <2><1108>: Abbrev Number: 9 (DW_TAG_member)
    <1109>   DW_AT_name        : (indirect string, offset: 0x1cd): block_ioctl
    <110d>   DW_AT_decl_file   : 21
    <110e>   DW_AT_decl_line   : 3
    <110f>   DW_AT_decl_column : 8
    <1110>   DW_AT_type        : <0x13d3>
    <1114>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1117>: Abbrev Number: 9 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0xafb): btrfs_ioctl
    <111c>   DW_AT_decl_file   : 21
    <111d>   DW_AT_decl_line   : 6
    <111e>   DW_AT_decl_column : 8
    <111f>   DW_AT_type        : <0x13d3>
    <1123>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1126>: Abbrev Number: 9 (DW_TAG_member)
    <1127>   DW_AT_name        : (indirect string, offset: 0x775): evdev_write_ioctl_mpers
    <112b>   DW_AT_decl_file   : 21
    <112c>   DW_AT_decl_line   : 9
    <112d>   DW_AT_decl_column : 8
    <112e>   DW_AT_type        : <0x13d3>
    <1132>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1135>: Abbrev Number: 9 (DW_TAG_member)
    <1136>   DW_AT_name        : (indirect string, offset: 0x74b): get_sock_fprog_size
    <113a>   DW_AT_decl_file   : 21
    <113b>   DW_AT_decl_line   : 12
    <113c>   DW_AT_decl_column : 17
    <113d>   DW_AT_type        : <0x13df>
    <1141>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1144>: Abbrev Number: 9 (DW_TAG_member)
    <1145>   DW_AT_name        : (indirect string, offset: 0x19c): fetch_bpf_fprog
    <1149>   DW_AT_decl_file   : 21
    <114a>   DW_AT_decl_line   : 15
    <114b>   DW_AT_decl_column : 10
