Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x192e (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5f4): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xcba): mpers-m32/siginfo_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xf35): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c0): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10cf): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9da): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ba): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf96): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8f3): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7a9): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbce): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xff6): __uid_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 146
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x2b>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xc04): __off_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 152
    <b5>   DW_AT_decl_column : 25
    <b6>   DW_AT_type        : <0xba>
 <1><ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <bb>   DW_AT_byte_size   : 4
    <bc>   DW_AT_encoding    : 5	(signed)
    <bd>   DW_AT_name        : (indirect string, offset: 0x2c4): long int
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xd7c): __off64_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 153
    <c8>   DW_AT_decl_column : 27
    <c9>   DW_AT_type        : <0x7c>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xb5f): __pid_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 154
    <d4>   DW_AT_decl_column : 25
    <d5>   DW_AT_type        : <0x64>
 <1><d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0xa8e): __clock_t
    <de>   DW_AT_decl_file   : 1
    <df>   DW_AT_decl_line   : 156
    <e0>   DW_AT_decl_column : 27
    <e1>   DW_AT_type        : <0xba>
 <1><e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0xcf1): __time_t
    <ea>   DW_AT_decl_file   : 1
    <eb>   DW_AT_decl_line   : 160
    <ec>   DW_AT_decl_column : 26
    <ed>   DW_AT_type        : <0xba>
 <1><f1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <f4>   DW_AT_type        : <0xf1>
 <1><f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indirect string, offset: 0x40c): __syscall_slong_t
    <fd>   DW_AT_decl_file   : 1
    <fe>   DW_AT_decl_line   : 196
    <ff>   DW_AT_decl_column : 33
    <100>   DW_AT_type        : <0xba>
 <1><104>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <105>   DW_AT_byte_size   : 4
    <106>   DW_AT_type        : <0x10a>
 <1><10a>: Abbrev Number: 2 (DW_TAG_base_type)
    <10b>   DW_AT_byte_size   : 1
    <10c>   DW_AT_encoding    : 6	(signed char)
    <10d>   DW_AT_name        : (indirect string, offset: 0x458): char
 <1><111>: Abbrev Number: 3 (DW_TAG_const_type)
    <112>   DW_AT_type        : <0x10a>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0x354): uint8_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 24
    <11d>   DW_AT_decl_column : 19
    <11e>   DW_AT_type        : <0x45>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xbef): uint16_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 25
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x58>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x1058): uint32_t
    <133>   DW_AT_decl_file   : 2
    <134>   DW_AT_decl_line   : 26
    <135>   DW_AT_decl_column : 20
    <136>   DW_AT_type        : <0x70>
 <1><13a>: Abbrev Number: 4 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0xe8e): uint64_t
    <13f>   DW_AT_decl_file   : 2
    <140>   DW_AT_decl_line   : 27
    <141>   DW_AT_decl_column : 20
    <142>   DW_AT_type        : <0x8f>
 <1><146>: Abbrev Number: 4 (DW_TAG_typedef)
    <147>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <14b>   DW_AT_decl_file   : 3
    <14c>   DW_AT_decl_line   : 209
    <14d>   DW_AT_decl_column : 23
    <14e>   DW_AT_type        : <0x2b>
 <1><152>: Abbrev Number: 3 (DW_TAG_const_type)
    <153>   DW_AT_type        : <0x146>
 <1><157>: Abbrev Number: 8 (DW_TAG_structure_type)
    <158>   DW_AT_name        : (indirect string, offset: 0xb77): timespec
    <15c>   DW_AT_byte_size   : 8
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 10
    <15f>   DW_AT_decl_column : 8
    <160>   DW_AT_sibling     : <0x183>
 <2><164>: Abbrev Number: 9 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x119c): tv_sec
    <169>   DW_AT_decl_file   : 4
    <16a>   DW_AT_decl_line   : 12
    <16b>   DW_AT_decl_column : 12
    <16c>   DW_AT_type        : <0xe5>
    <170>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><173>: Abbrev Number: 9 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0xebb): tv_nsec
    <178>   DW_AT_decl_file   : 4
    <179>   DW_AT_decl_line   : 16
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xf8>
    <17f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><182>: Abbrev Number: 0
 <1><183>: Abbrev Number: 2 (DW_TAG_base_type)
    <184>   DW_AT_byte_size   : 12
    <185>   DW_AT_encoding    : 4	(float)
    <186>   DW_AT_name        : (indirect string, offset: 0xb34): long double
 <1><18a>: Abbrev Number: 2 (DW_TAG_base_type)
    <18b>   DW_AT_byte_size   : 16
    <18c>   DW_AT_encoding    : 4	(float)
    <18d>   DW_AT_name        : (indirect string, offset: 0x1093): _Float128
 <1><191>: Abbrev Number: 10 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x27b): __environ
    <196>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 543
    <199>   DW_AT_decl_column : 15
    <19a>   DW_AT_type        : <0x1a0>
    <19e>   DW_AT_external    : 1
    <19f>   DW_AT_declaration : 1
 <1><1a0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1a1>   DW_AT_byte_size   : 4
    <1a2>   DW_AT_type        : <0x104>
 <1><1a6>: Abbrev Number: 10 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x3ae): environ
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 545
    <1ae>   DW_AT_decl_column : 15
    <1af>   DW_AT_type        : <0x1a0>
    <1b3>   DW_AT_external    : 1
    <1b4>   DW_AT_declaration : 1
 <1><1b5>: Abbrev Number: 11 (DW_TAG_variable)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x10b9): optarg
    <1ba>   DW_AT_decl_file   : 6
    <1bb>   DW_AT_decl_line   : 36
    <1bc>   DW_AT_decl_column : 14
    <1bd>   DW_AT_type        : <0x104>
    <1c1>   DW_AT_external    : 1
    <1c2>   DW_AT_declaration : 1
 <1><1c3>: Abbrev Number: 11 (DW_TAG_variable)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x77c): optind
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 50
    <1ca>   DW_AT_decl_column : 12
    <1cb>   DW_AT_type        : <0x64>
    <1cf>   DW_AT_external    : 1
    <1d0>   DW_AT_declaration : 1
 <1><1d1>: Abbrev Number: 11 (DW_TAG_variable)
    <1d2>   DW_AT_name        : (indirect string, offset: 0xce0): opterr
    <1d6>   DW_AT_decl_file   : 6
    <1d7>   DW_AT_decl_line   : 55
    <1d8>   DW_AT_decl_column : 12
    <1d9>   DW_AT_type        : <0x64>
    <1dd>   DW_AT_external    : 1
    <1de>   DW_AT_declaration : 1
 <1><1df>: Abbrev Number: 11 (DW_TAG_variable)
    <1e0>   DW_AT_name        : (indirect string, offset: 0xbb4): optopt
    <1e4>   DW_AT_decl_file   : 6
    <1e5>   DW_AT_decl_line   : 59
    <1e6>   DW_AT_decl_column : 12
    <1e7>   DW_AT_type        : <0x64>
    <1eb>   DW_AT_external    : 1
    <1ec>   DW_AT_declaration : 1
 <1><1ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ee>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x111>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <1f4>   DW_AT_type        : <0x1ed>
 <1><1f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1f9>   DW_AT_byte_size   : 4
    <1fa>   DW_AT_type        : <0x1fe>
 <1><1fe>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1ff>: Abbrev Number: 8 (DW_TAG_structure_type)
    <200>   DW_AT_name        : (indirect string, offset: 0x35c): _IO_FILE
    <204>   DW_AT_byte_size   : 148
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 49
    <207>   DW_AT_decl_column : 8
    <208>   DW_AT_sibling     : <0x3c0>
 <2><20c>: Abbrev Number: 9 (DW_TAG_member)
    <20d>   DW_AT_name        : (indirect string, offset: 0xa7c): _flags
    <211>   DW_AT_decl_file   : 7
    <212>   DW_AT_decl_line   : 51
    <213>   DW_AT_decl_column : 7
    <214>   DW_AT_type        : <0x64>
    <218>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><21b>: Abbrev Number: 9 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x4f8): _IO_read_ptr
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 54
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x104>
    <227>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><22a>: Abbrev Number: 9 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0xffe): _IO_read_end
    <22f>   DW_AT_decl_file   : 7
    <230>   DW_AT_decl_line   : 55
    <231>   DW_AT_decl_column : 9
    <232>   DW_AT_type        : <0x104>
    <236>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><239>: Abbrev Number: 9 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x7eb): _IO_read_base
    <23e>   DW_AT_decl_file   : 7
    <23f>   DW_AT_decl_line   : 56
    <240>   DW_AT_decl_column : 9
    <241>   DW_AT_type        : <0x104>
    <245>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><248>: Abbrev Number: 9 (DW_TAG_member)
    <249>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <24d>   DW_AT_decl_file   : 7
    <24e>   DW_AT_decl_line   : 57
    <24f>   DW_AT_decl_column : 9
    <250>   DW_AT_type        : <0x104>
    <254>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><257>: Abbrev Number: 9 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0x1108): _IO_write_ptr
    <25c>   DW_AT_decl_file   : 7
    <25d>   DW_AT_decl_line   : 58
    <25e>   DW_AT_decl_column : 9
    <25f>   DW_AT_type        : <0x104>
    <263>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><266>: Abbrev Number: 9 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x93f): _IO_write_end
    <26b>   DW_AT_decl_file   : 7
    <26c>   DW_AT_decl_line   : 59
    <26d>   DW_AT_decl_column : 9
    <26e>   DW_AT_type        : <0x104>
    <272>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><275>: Abbrev Number: 9 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x9bc): _IO_buf_base
    <27a>   DW_AT_decl_file   : 7
    <27b>   DW_AT_decl_line   : 60
    <27c>   DW_AT_decl_column : 9
    <27d>   DW_AT_type        : <0x104>
    <281>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><284>: Abbrev Number: 9 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe29): _IO_buf_end
    <289>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 61
    <28b>   DW_AT_decl_column : 9
    <28c>   DW_AT_type        : <0x104>
    <290>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><293>: Abbrev Number: 9 (DW_TAG_member)
    <294>   DW_AT_name        : (indirect string, offset: 0x1d8): _IO_save_base
    <298>   DW_AT_decl_file   : 7
    <299>   DW_AT_decl_line   : 64
    <29a>   DW_AT_decl_column : 9
    <29b>   DW_AT_type        : <0x104>
    <29f>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2a2>: Abbrev Number: 9 (DW_TAG_member)
    <2a3>   DW_AT_name        : (indirect string, offset: 0xd43): _IO_backup_base
    <2a7>   DW_AT_decl_file   : 7
    <2a8>   DW_AT_decl_line   : 65
    <2a9>   DW_AT_decl_column : 9
    <2aa>   DW_AT_type        : <0x104>
    <2ae>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2b1>: Abbrev Number: 9 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 66
    <2b8>   DW_AT_decl_column : 9
    <2b9>   DW_AT_type        : <0x104>
    <2bd>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2c0>: Abbrev Number: 9 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x5a0): _markers
    <2c5>   DW_AT_decl_file   : 7
    <2c6>   DW_AT_decl_line   : 68
    <2c7>   DW_AT_decl_column : 22
    <2c8>   DW_AT_type        : <0x3da>
    <2cc>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2cf>: Abbrev Number: 9 (DW_TAG_member)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x21b): _chain
    <2d4>   DW_AT_decl_file   : 7
    <2d5>   DW_AT_decl_line   : 70
    <2d6>   DW_AT_decl_column : 20
    <2d7>   DW_AT_type        : <0x3e0>
    <2db>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2de>: Abbrev Number: 9 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0x107e): _fileno
    <2e3>   DW_AT_decl_file   : 7
    <2e4>   DW_AT_decl_line   : 72
    <2e5>   DW_AT_decl_column : 7
    <2e6>   DW_AT_type        : <0x64>
    <2ea>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2ed>: Abbrev Number: 9 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x7d7): _flags2
    <2f2>   DW_AT_decl_file   : 7
    <2f3>   DW_AT_decl_line   : 73
    <2f4>   DW_AT_decl_column : 7
    <2f5>   DW_AT_type        : <0x64>
    <2f9>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2fc>: Abbrev Number: 9 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x866): _old_offset
    <301>   DW_AT_decl_file   : 7
    <302>   DW_AT_decl_line   : 74
    <303>   DW_AT_decl_column : 11
    <304>   DW_AT_type        : <0xae>
    <308>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><30b>: Abbrev Number: 9 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x249): _cur_column
    <310>   DW_AT_decl_file   : 7
    <311>   DW_AT_decl_line   : 77
    <312>   DW_AT_decl_column : 18
    <313>   DW_AT_type        : <0x24>
    <317>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><31a>: Abbrev Number: 9 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xee1): _vtable_offset
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 78
    <321>   DW_AT_decl_column : 15
    <322>   DW_AT_type        : <0x3e>
    <326>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><329>: Abbrev Number: 9 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0xd53): _shortbuf
    <32e>   DW_AT_decl_file   : 7
    <32f>   DW_AT_decl_line   : 79
    <330>   DW_AT_decl_column : 8
    <331>   DW_AT_type        : <0x3e6>
    <335>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><338>: Abbrev Number: 9 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <33d>   DW_AT_decl_file   : 7
    <33e>   DW_AT_decl_line   : 81
    <33f>   DW_AT_decl_column : 15
    <340>   DW_AT_type        : <0x3f6>
    <344>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><347>: Abbrev Number: 9 (DW_TAG_member)
    <348>   DW_AT_name        : (indirect string, offset: 0x70a): _offset
    <34c>   DW_AT_decl_file   : 7
    <34d>   DW_AT_decl_line   : 89
    <34e>   DW_AT_decl_column : 13
    <34f>   DW_AT_type        : <0xc1>
    <353>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><356>: Abbrev Number: 9 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0xac6): _codecvt
    <35b>   DW_AT_decl_file   : 7
    <35c>   DW_AT_decl_line   : 91
    <35d>   DW_AT_decl_column : 23
    <35e>   DW_AT_type        : <0x402>
    <362>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><365>: Abbrev Number: 9 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x109d): _wide_data
    <36a>   DW_AT_decl_file   : 7
    <36b>   DW_AT_decl_line   : 92
    <36c>   DW_AT_decl_column : 25
    <36d>   DW_AT_type        : <0x40e>
    <371>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x3dc): _freeres_list
    <379>   DW_AT_decl_file   : 7
    <37a>   DW_AT_decl_line   : 93
    <37b>   DW_AT_decl_column : 20
    <37c>   DW_AT_type        : <0x3e0>
    <380>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><383>: Abbrev Number: 9 (DW_TAG_member)
    <384>   DW_AT_name        : (indirect string, offset: 0xca0): _freeres_buf
    <388>   DW_AT_decl_file   : 7
    <389>   DW_AT_decl_line   : 94
    <38a>   DW_AT_decl_column : 9
    <38b>   DW_AT_type        : <0xf1>
    <38f>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><392>: Abbrev Number: 9 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0xa2b): __pad5
    <397>   DW_AT_decl_file   : 7
    <398>   DW_AT_decl_line   : 95
    <399>   DW_AT_decl_column : 10
    <39a>   DW_AT_type        : <0x146>
    <39e>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3a1>: Abbrev Number: 9 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xaaa): _mode
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 96
    <3a8>   DW_AT_decl_column : 7
    <3a9>   DW_AT_type        : <0x64>
    <3ad>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3b0>: Abbrev Number: 9 (DW_TAG_member)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x805): _unused2
    <3b5>   DW_AT_decl_file   : 7
    <3b6>   DW_AT_decl_line   : 98
    <3b7>   DW_AT_decl_column : 8
    <3b8>   DW_AT_type        : <0x414>
    <3bc>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3bf>: Abbrev Number: 0
 <1><3c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xb5a): FILE
    <3c5>   DW_AT_decl_file   : 8
    <3c6>   DW_AT_decl_line   : 7
    <3c7>   DW_AT_decl_column : 25
    <3c8>   DW_AT_type        : <0x1ff>
 <1><3cc>: Abbrev Number: 13 (DW_TAG_typedef)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x495): _IO_lock_t
    <3d1>   DW_AT_decl_file   : 7
    <3d2>   DW_AT_decl_line   : 43
    <3d3>   DW_AT_decl_column : 14
 <1><3d4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x306): _IO_marker
    <3d9>   DW_AT_declaration : 1
 <1><3da>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3db>   DW_AT_byte_size   : 4
    <3dc>   DW_AT_type        : <0x3d4>
 <1><3e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e1>   DW_AT_byte_size   : 4
    <3e2>   DW_AT_type        : <0x1ff>
 <1><3e6>: Abbrev Number: 15 (DW_TAG_array_type)
    <3e7>   DW_AT_type        : <0x10a>
    <3eb>   DW_AT_sibling     : <0x3f6>
 <2><3ef>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f0>   DW_AT_type        : <0x2b>
    <3f4>   DW_AT_upper_bound : 0
 <2><3f5>: Abbrev Number: 0
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x3cc>
 <1><3fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3fd>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <401>   DW_AT_declaration : 1
 <1><402>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <403>   DW_AT_byte_size   : 4
    <404>   DW_AT_type        : <0x3fc>
 <1><408>: Abbrev Number: 14 (DW_TAG_structure_type)
    <409>   DW_AT_name        : (indirect string, offset: 0x370): _IO_wide_data
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x408>
 <1><414>: Abbrev Number: 15 (DW_TAG_array_type)
    <415>   DW_AT_type        : <0x10a>
    <419>   DW_AT_sibling     : <0x424>
 <2><41d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <41e>   DW_AT_type        : <0x2b>
    <422>   DW_AT_upper_bound : 39
 <2><423>: Abbrev Number: 0
 <1><424>: Abbrev Number: 11 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x560): stdin
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 137
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x432>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <433>   DW_AT_byte_size   : 4
    <434>   DW_AT_type        : <0x3c0>
 <1><438>: Abbrev Number: 11 (DW_TAG_variable)
    <439>   DW_AT_name        : (indirect string, offset: 0x10e2): stdout
    <43d>   DW_AT_decl_file   : 9
    <43e>   DW_AT_decl_line   : 138
    <43f>   DW_AT_decl_column : 14
    <440>   DW_AT_type        : <0x432>
    <444>   DW_AT_external    : 1
    <445>   DW_AT_declaration : 1
 <1><446>: Abbrev Number: 11 (DW_TAG_variable)
    <447>   DW_AT_name        : (indirect string, offset: 0xe77): stderr
    <44b>   DW_AT_decl_file   : 9
    <44c>   DW_AT_decl_line   : 139
    <44d>   DW_AT_decl_column : 14
    <44e>   DW_AT_type        : <0x432>
    <452>   DW_AT_external    : 1
    <453>   DW_AT_declaration : 1
 <1><454>: Abbrev Number: 11 (DW_TAG_variable)
    <455>   DW_AT_name        : (indirect string, offset: 0x255): sys_nerr
    <459>   DW_AT_decl_file   : 10
    <45a>   DW_AT_decl_line   : 26
    <45b>   DW_AT_decl_column : 12
    <45c>   DW_AT_type        : <0x64>
    <460>   DW_AT_external    : 1
    <461>   DW_AT_declaration : 1
 <1><462>: Abbrev Number: 15 (DW_TAG_array_type)
    <463>   DW_AT_type        : <0x1f3>
    <467>   DW_AT_sibling     : <0x46d>
 <2><46b>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><46c>: Abbrev Number: 0
 <1><46d>: Abbrev Number: 3 (DW_TAG_const_type)
    <46e>   DW_AT_type        : <0x462>
 <1><472>: Abbrev Number: 11 (DW_TAG_variable)
    <473>   DW_AT_name        : (indirect string, offset: 0x56f): sys_errlist
    <477>   DW_AT_decl_file   : 10
    <478>   DW_AT_decl_line   : 27
    <479>   DW_AT_decl_column : 26
    <47a>   DW_AT_type        : <0x46d>
    <47e>   DW_AT_external    : 1
    <47f>   DW_AT_declaration : 1
 <1><480>: Abbrev Number: 11 (DW_TAG_variable)
    <481>   DW_AT_name        : (indirect string, offset: 0x268): _sys_nerr
    <485>   DW_AT_decl_file   : 10
    <486>   DW_AT_decl_line   : 30
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0x64>
    <48c>   DW_AT_external    : 1
    <48d>   DW_AT_declaration : 1
 <1><48e>: Abbrev Number: 11 (DW_TAG_variable)
    <48f>   DW_AT_name        : (indirect string, offset: 0xef0): _sys_errlist
    <493>   DW_AT_decl_file   : 10
    <494>   DW_AT_decl_line   : 31
    <495>   DW_AT_decl_column : 26
    <496>   DW_AT_type        : <0x46d>
    <49a>   DW_AT_external    : 1
    <49b>   DW_AT_declaration : 1
 <1><49c>: Abbrev Number: 11 (DW_TAG_variable)
    <49d>   DW_AT_name        : (indirect string, offset: 0x6e3): program_invocation_name
    <4a1>   DW_AT_decl_file   : 11
    <4a2>   DW_AT_decl_line   : 45
    <4a3>   DW_AT_decl_column : 14
    <4a4>   DW_AT_type        : <0x104>
    <4a8>   DW_AT_external    : 1
    <4a9>   DW_AT_declaration : 1
 <1><4aa>: Abbrev Number: 11 (DW_TAG_variable)
    <4ab>   DW_AT_name        : (indirect string, offset: 0xc3e): program_invocation_short_name
    <4af>   DW_AT_decl_file   : 11
    <4b0>   DW_AT_decl_line   : 46
    <4b1>   DW_AT_decl_column : 14
    <4b2>   DW_AT_type        : <0x104>
    <4b6>   DW_AT_external    : 1
    <4b7>   DW_AT_declaration : 1
 <1><4b8>: Abbrev Number: 15 (DW_TAG_array_type)
    <4b9>   DW_AT_type        : <0x104>
    <4bd>   DW_AT_sibling     : <0x4c8>
 <2><4c1>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4c2>   DW_AT_type        : <0x2b>
    <4c6>   DW_AT_upper_bound : 1
 <2><4c7>: Abbrev Number: 0
 <1><4c8>: Abbrev Number: 11 (DW_TAG_variable)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x1c5): __tzname
    <4cd>   DW_AT_decl_file   : 12
    <4ce>   DW_AT_decl_line   : 159
    <4cf>   DW_AT_decl_column : 14
    <4d0>   DW_AT_type        : <0x4b8>
    <4d4>   DW_AT_external    : 1
    <4d5>   DW_AT_declaration : 1
 <1><4d6>: Abbrev Number: 11 (DW_TAG_variable)
    <4d7>   DW_AT_name        : (indirect string, offset: 0xf7d): __daylight
    <4db>   DW_AT_decl_file   : 12
    <4dc>   DW_AT_decl_line   : 160
    <4dd>   DW_AT_decl_column : 12
    <4de>   DW_AT_type        : <0x64>
    <4e2>   DW_AT_external    : 1
    <4e3>   DW_AT_declaration : 1
 <1><4e4>: Abbrev Number: 11 (DW_TAG_variable)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x365): __timezone
    <4e9>   DW_AT_decl_file   : 12
    <4ea>   DW_AT_decl_line   : 161
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0xba>
    <4f0>   DW_AT_external    : 1
    <4f1>   DW_AT_declaration : 1
 <1><4f2>: Abbrev Number: 11 (DW_TAG_variable)
    <4f3>   DW_AT_name        : (indirect string, offset: 0xa1b): tzname
    <4f7>   DW_AT_decl_file   : 12
    <4f8>   DW_AT_decl_line   : 166
    <4f9>   DW_AT_decl_column : 14
    <4fa>   DW_AT_type        : <0x4b8>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0x1152): daylight
    <505>   DW_AT_decl_file   : 12
    <506>   DW_AT_decl_line   : 174
    <507>   DW_AT_decl_column : 12
    <508>   DW_AT_type        : <0x64>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 11 (DW_TAG_variable)
    <50f>   DW_AT_name        : (indirect string, offset: 0x4da): timezone
    <513>   DW_AT_decl_file   : 12
    <514>   DW_AT_decl_line   : 175
    <515>   DW_AT_decl_column : 17
    <516>   DW_AT_type        : <0xba>
    <51a>   DW_AT_external    : 1
    <51b>   DW_AT_declaration : 1
 <1><51c>: Abbrev Number: 10 (DW_TAG_variable)
    <51d>   DW_AT_name        : (indirect string, offset: 0x1025): getdate_err
    <521>   DW_AT_decl_file   : 12
    <522>   DW_AT_decl_line   : 274
    <524>   DW_AT_decl_column : 12
    <525>   DW_AT_type        : <0x64>
    <529>   DW_AT_external    : 1
    <52a>   DW_AT_declaration : 1
 <1><52b>: Abbrev Number: 11 (DW_TAG_variable)
    <52c>   DW_AT_name        : (indirect string, offset: 0xa37): debug_flag
    <530>   DW_AT_decl_file   : 13
    <531>   DW_AT_decl_line   : 20
    <532>   DW_AT_decl_column : 13
    <533>   DW_AT_type        : <0x539>
    <537>   DW_AT_external    : 1
    <538>   DW_AT_declaration : 1
 <1><539>: Abbrev Number: 2 (DW_TAG_base_type)
    <53a>   DW_AT_byte_size   : 1
    <53b>   DW_AT_encoding    : 2	(boolean)
    <53c>   DW_AT_name        : (indirect string, offset: 0x41e): _Bool
 <1><540>: Abbrev Number: 3 (DW_TAG_const_type)
    <541>   DW_AT_type        : <0x539>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0xb0a): __kernel_long_t
    <54a>   DW_AT_decl_file   : 14
    <54b>   DW_AT_decl_line   : 15
    <54c>   DW_AT_decl_column : 15
    <54d>   DW_AT_type        : <0xba>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x54f): __kernel_ulong_t
    <556>   DW_AT_decl_file   : 14
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 23
    <559>   DW_AT_type        : <0x37>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x3ea): kernel_long_t
    <562>   DW_AT_decl_file   : 15
    <563>   DW_AT_decl_line   : 16
    <564>   DW_AT_decl_column : 25
    <565>   DW_AT_type        : <0x545>
 <1><569>: Abbrev Number: 4 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x8e4): kernel_ulong_t
    <56e>   DW_AT_decl_file   : 15
    <56f>   DW_AT_decl_line   : 17
    <570>   DW_AT_decl_column : 26
    <571>   DW_AT_type        : <0x551>
 <1><575>: Abbrev Number: 3 (DW_TAG_const_type)
    <576>   DW_AT_type        : <0x569>
 <1><57a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <57b>   DW_AT_name        : (indirect string, offset: 0xc5c): list_item
    <57f>   DW_AT_byte_size   : 8
    <580>   DW_AT_decl_file   : 16
    <581>   DW_AT_decl_line   : 92
    <582>   DW_AT_decl_column : 8
    <583>   DW_AT_sibling     : <0x5a6>
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x1197): prev
    <58c>   DW_AT_decl_file   : 16
    <58d>   DW_AT_decl_line   : 93
    <58e>   DW_AT_decl_column : 20
    <58f>   DW_AT_type        : <0x5a6>
    <593>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><596>: Abbrev Number: 9 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0x118d): next
    <59b>   DW_AT_decl_file   : 16
    <59c>   DW_AT_decl_line   : 94
    <59d>   DW_AT_decl_column : 20
    <59e>   DW_AT_type        : <0x5a6>
    <5a2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5a5>: Abbrev Number: 0
 <1><5a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a7>   DW_AT_byte_size   : 4
    <5a8>   DW_AT_type        : <0x57a>
 <1><5ac>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8b3): sysent
    <5b1>   DW_AT_byte_size   : 20
    <5b2>   DW_AT_decl_file   : 17
    <5b3>   DW_AT_decl_line   : 13
    <5b4>   DW_AT_decl_column : 16
    <5b5>   DW_AT_sibling     : <0x605>
 <2><5b9>: Abbrev Number: 9 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x10f9): nargs
    <5be>   DW_AT_decl_file   : 17
    <5bf>   DW_AT_decl_line   : 14
    <5c0>   DW_AT_decl_column : 11
    <5c1>   DW_AT_type        : <0x2b>
    <5c5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x9d0): sys_flags
    <5cd>   DW_AT_decl_file   : 17
    <5ce>   DW_AT_decl_line   : 15
    <5cf>   DW_AT_decl_column : 6
    <5d0>   DW_AT_type        : <0x64>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5d7>: Abbrev Number: 18 (DW_TAG_member)
    <5d8>   DW_AT_name        : sen
    <5dc>   DW_AT_decl_file   : 17
    <5dd>   DW_AT_decl_line   : 16
    <5de>   DW_AT_decl_column : 6
    <5df>   DW_AT_type        : <0x64>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5e6>: Abbrev Number: 9 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x2fd): sys_func
    <5eb>   DW_AT_decl_file   : 17
    <5ec>   DW_AT_decl_line   : 17
    <5ed>   DW_AT_decl_column : 8
    <5ee>   DW_AT_type        : <0x86c>
    <5f2>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5f5>: Abbrev Number: 9 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x272): sys_name
    <5fa>   DW_AT_decl_file   : 17
    <5fb>   DW_AT_decl_line   : 18
    <5fc>   DW_AT_decl_column : 14
    <5fd>   DW_AT_type        : <0x1ed>
    <601>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <606>   DW_AT_prototyped  : 1
    <607>   DW_AT_type        : <0x64>
    <60b>   DW_AT_sibling     : <0x615>
 <2><60f>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <610>   DW_AT_type        : <0x615>
 <2><614>: Abbrev Number: 0
 <1><615>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <616>   DW_AT_byte_size   : 4
    <617>   DW_AT_type        : <0x620>
 <1><61b>: Abbrev Number: 3 (DW_TAG_const_type)
    <61c>   DW_AT_type        : <0x615>
 <1><620>: Abbrev Number: 21 (DW_TAG_structure_type)
    <621>   DW_AT_name        : tcb
    <625>   DW_AT_byte_size   : 204
    <626>   DW_AT_decl_file   : 18
    <627>   DW_AT_decl_line   : 262
    <629>   DW_AT_decl_column : 8
    <62a>   DW_AT_sibling     : <0x86c>
 <2><62e>: Abbrev Number: 22 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x4f2): flags
    <633>   DW_AT_decl_file   : 18
    <634>   DW_AT_decl_line   : 263
    <636>   DW_AT_decl_column : 6
    <637>   DW_AT_type        : <0x64>
    <63b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><63e>: Abbrev Number: 23 (DW_TAG_member)
    <63f>   DW_AT_name        : pid
    <643>   DW_AT_decl_file   : 18
    <644>   DW_AT_decl_line   : 264
    <646>   DW_AT_decl_column : 6
    <647>   DW_AT_type        : <0x64>
    <64b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><64e>: Abbrev Number: 22 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <653>   DW_AT_decl_file   : 18
    <654>   DW_AT_decl_line   : 265
    <656>   DW_AT_decl_column : 6
    <657>   DW_AT_type        : <0x64>
    <65b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><65e>: Abbrev Number: 22 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x392): currpers
    <663>   DW_AT_decl_file   : 18
    <664>   DW_AT_decl_line   : 267
    <666>   DW_AT_decl_column : 15
    <667>   DW_AT_type        : <0x2b>
    <66b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><66e>: Abbrev Number: 22 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0xbac): u_error
    <673>   DW_AT_decl_file   : 18
    <674>   DW_AT_decl_line   : 269
    <676>   DW_AT_decl_column : 16
    <677>   DW_AT_type        : <0x37>
    <67b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><67e>: Abbrev Number: 22 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <683>   DW_AT_decl_file   : 18
    <684>   DW_AT_decl_line   : 270
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0x569>
    <68b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><68e>: Abbrev Number: 22 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0xbe5): true_scno
    <693>   DW_AT_decl_file   : 18
    <694>   DW_AT_decl_line   : 271
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x569>
    <69b>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><69e>: Abbrev Number: 22 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x1af): u_arg
    <6a3>   DW_AT_decl_file   : 18
    <6a4>   DW_AT_decl_line   : 272
    <6a6>   DW_AT_decl_column : 17
    <6a7>   DW_AT_type        : <0x99c>
    <6ab>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6ae>: Abbrev Number: 22 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x9e7): u_rval
    <6b3>   DW_AT_decl_file   : 18
    <6b4>   DW_AT_decl_line   : 273
    <6b6>   DW_AT_decl_column : 16
    <6b7>   DW_AT_type        : <0x55d>
    <6bb>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6be>: Abbrev Number: 22 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xb26): sys_func_rval
    <6c3>   DW_AT_decl_file   : 18
    <6c4>   DW_AT_decl_line   : 274
    <6c6>   DW_AT_decl_column : 6
    <6c7>   DW_AT_type        : <0x64>
    <6cb>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6ce>: Abbrev Number: 22 (DW_TAG_member)
    <6cf>   DW_AT_name        : (indirect string, offset: 0xd6d): curcol
    <6d3>   DW_AT_decl_file   : 18
    <6d4>   DW_AT_decl_line   : 275
    <6d6>   DW_AT_decl_column : 6
    <6d7>   DW_AT_type        : <0x64>
    <6db>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6de>: Abbrev Number: 22 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0x9f9): outf
    <6e3>   DW_AT_decl_file   : 18
    <6e4>   DW_AT_decl_line   : 276
    <6e6>   DW_AT_decl_column : 8
    <6e7>   DW_AT_type        : <0x432>
    <6eb>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ee>: Abbrev Number: 22 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0xfbc): staged_output_data
    <6f3>   DW_AT_decl_file   : 18
    <6f4>   DW_AT_decl_line   : 277
    <6f6>   DW_AT_decl_column : 29
    <6f7>   DW_AT_type        : <0x9b2>
    <6fb>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6fe>: Abbrev Number: 22 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xaf1): auxstr
    <703>   DW_AT_decl_file   : 18
    <704>   DW_AT_decl_line   : 279
    <706>   DW_AT_decl_column : 14
    <707>   DW_AT_type        : <0x1ed>
    <70b>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><70e>: Abbrev Number: 22 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <713>   DW_AT_decl_file   : 18
    <714>   DW_AT_decl_line   : 280
    <716>   DW_AT_decl_column : 8
    <717>   DW_AT_type        : <0xf1>
    <71b>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><71e>: Abbrev Number: 22 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0xc89): _free_priv_data
    <723>   DW_AT_decl_file   : 18
    <724>   DW_AT_decl_line   : 281
    <726>   DW_AT_decl_column : 9
    <727>   DW_AT_type        : <0x9c4>
    <72b>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><72e>: Abbrev Number: 22 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <733>   DW_AT_decl_file   : 18
    <734>   DW_AT_decl_line   : 282
    <736>   DW_AT_decl_column : 23
    <737>   DW_AT_type        : <0x9ca>
    <73b>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><73e>: Abbrev Number: 22 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <743>   DW_AT_decl_file   : 18
    <744>   DW_AT_decl_line   : 285
    <746>   DW_AT_decl_column : 23
    <747>   DW_AT_type        : <0x9ca>
    <74b>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><74e>: Abbrev Number: 22 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x387): inject_vec
    <753>   DW_AT_decl_file   : 18
    <754>   DW_AT_decl_line   : 286
    <756>   DW_AT_decl_column : 22
    <757>   DW_AT_type        : <0x9d5>
    <75b>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><75e>: Abbrev Number: 22 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x81a): stime
    <763>   DW_AT_decl_file   : 18
    <764>   DW_AT_decl_line   : 287
    <766>   DW_AT_decl_column : 18
    <767>   DW_AT_type        : <0x157>
    <76b>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><76e>: Abbrev Number: 22 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x39b): ltime
    <773>   DW_AT_decl_file   : 18
    <774>   DW_AT_decl_line   : 288
    <776>   DW_AT_decl_column : 18
    <777>   DW_AT_type        : <0x157>
    <77b>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><77e>: Abbrev Number: 22 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x10c0): atime
    <783>   DW_AT_decl_file   : 18
    <784>   DW_AT_decl_line   : 289
    <786>   DW_AT_decl_column : 18
    <787>   DW_AT_type        : <0x157>
    <78b>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><78e>: Abbrev Number: 22 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0x4e3): etime
    <793>   DW_AT_decl_file   : 18
    <794>   DW_AT_decl_line   : 290
    <796>   DW_AT_decl_column : 18
    <797>   DW_AT_type        : <0x157>
    <79b>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><79f>: Abbrev Number: 22 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0xde6): delay_expiration_time
    <7a4>   DW_AT_decl_file   : 18
    <7a5>   DW_AT_decl_line   : 291
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x157>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7b0>: Abbrev Number: 22 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7b5>   DW_AT_decl_file   : 18
    <7b6>   DW_AT_decl_line   : 298
    <7b8>   DW_AT_decl_column : 15
    <7b9>   DW_AT_type        : <0x2b>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7c1>: Abbrev Number: 22 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x100b): last_dirfd
    <7c6>   DW_AT_decl_file   : 18
    <7c7>   DW_AT_decl_line   : 301
    <7c9>   DW_AT_decl_column : 6
    <7ca>   DW_AT_type        : <0x64>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7d2>: Abbrev Number: 22 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x1031): mmap_cache
    <7d7>   DW_AT_decl_file   : 18
    <7d8>   DW_AT_decl_line   : 304
    <7da>   DW_AT_decl_column : 23
    <7db>   DW_AT_type        : <0x9f1>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7e3>: Abbrev Number: 22 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xbbb): wait_data_idx
    <7e8>   DW_AT_decl_file   : 18
    <7e9>   DW_AT_decl_line   : 311
    <7eb>   DW_AT_decl_column : 9
    <7ec>   DW_AT_type        : <0x146>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7f4>: Abbrev Number: 22 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xaf8): delayed_wait_data
    <7f9>   DW_AT_decl_file   : 18
    <7fa>   DW_AT_decl_line   : 313
    <7fc>   DW_AT_decl_column : 24
    <7fd>   DW_AT_type        : <0x9fd>
    <801>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><805>: Abbrev Number: 22 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xb6d): wait_list
    <80a>   DW_AT_decl_file   : 18
    <80b>   DW_AT_decl_line   : 314
    <80d>   DW_AT_decl_column : 19
    <80e>   DW_AT_type        : <0x57a>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><816>: Abbrev Number: 22 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x6fb): vcpu_info_list
    <81b>   DW_AT_decl_file   : 18
    <81c>   DW_AT_decl_line   : 318
    <81e>   DW_AT_decl_column : 20
    <81f>   DW_AT_type        : <0xa09>
    <823>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><827>: Abbrev Number: 22 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0xd38): unwind_ctx
    <82c>   DW_AT_decl_file   : 18
    <82d>   DW_AT_decl_line   : 322
    <82f>   DW_AT_decl_column : 8
    <830>   DW_AT_type        : <0xf1>
    <834>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><838>: Abbrev Number: 22 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x4cd): unwind_queue
    <83d>   DW_AT_decl_file   : 18
    <83e>   DW_AT_decl_line   : 323
    <840>   DW_AT_decl_column : 25
    <841>   DW_AT_type        : <0xa15>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><849>: Abbrev Number: 22 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <84e>   DW_AT_decl_file   : 18
    <84f>   DW_AT_decl_line   : 327
    <851>   DW_AT_decl_column : 7
    <852>   DW_AT_type        : <0xa1b>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><85a>: Abbrev Number: 22 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x22b): start_prc
    <85f>   DW_AT_decl_file   : 18
    <860>   DW_AT_decl_line   : 329
    <862>   DW_AT_decl_column : 16
    <863>   DW_AT_type        : <0x37>
    <867>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><86b>: Abbrev Number: 0
 <1><86c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <86d>   DW_AT_byte_size   : 4
    <86e>   DW_AT_type        : <0x605>
 <1><872>: Abbrev Number: 4 (DW_TAG_typedef)
    <873>   DW_AT_name        : (indirect string, offset: 0x541): struct_sysent
    <877>   DW_AT_decl_file   : 17
    <878>   DW_AT_decl_line   : 19
    <879>   DW_AT_decl_column : 3
    <87a>   DW_AT_type        : <0x5ac>
 <1><87e>: Abbrev Number: 3 (DW_TAG_const_type)
    <87f>   DW_AT_type        : <0x872>
 <1><883>: Abbrev Number: 11 (DW_TAG_variable)
    <884>   DW_AT_name        : (indirect string, offset: 0xdd2): current_personality
    <888>   DW_AT_decl_file   : 18
    <889>   DW_AT_decl_line   : 158
    <88a>   DW_AT_decl_column : 17
    <88b>   DW_AT_type        : <0x2b>
    <88f>   DW_AT_external    : 1
    <890>   DW_AT_declaration : 1
 <1><891>: Abbrev Number: 11 (DW_TAG_variable)
    <892>   DW_AT_name        : (indirect string, offset: 0x84b): current_wordsize
    <896>   DW_AT_decl_file   : 18
    <897>   DW_AT_decl_line   : 171
    <898>   DW_AT_decl_column : 17
    <899>   DW_AT_type        : <0x2b>
    <89d>   DW_AT_external    : 1
    <89e>   DW_AT_declaration : 1
 <1><89f>: Abbrev Number: 11 (DW_TAG_variable)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xacf): current_klongsize
    <8a4>   DW_AT_decl_file   : 18
    <8a5>   DW_AT_decl_line   : 176
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0x2b>
    <8ab>   DW_AT_external    : 1
    <8ac>   DW_AT_declaration : 1
 <1><8ad>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xd0f): ioctlent
    <8b2>   DW_AT_byte_size   : 8
    <8b3>   DW_AT_decl_file   : 18
    <8b4>   DW_AT_decl_line   : 217
    <8b5>   DW_AT_decl_column : 16
    <8b6>   DW_AT_sibling     : <0x8d9>
 <2><8ba>: Abbrev Number: 9 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xfef): symbol
    <8bf>   DW_AT_decl_file   : 18
    <8c0>   DW_AT_decl_line   : 218
    <8c1>   DW_AT_decl_column : 14
    <8c2>   DW_AT_type        : <0x1ed>
    <8c6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c9>: Abbrev Number: 9 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xd91): code
    <8ce>   DW_AT_decl_file   : 18
    <8cf>   DW_AT_decl_line   : 219
    <8d0>   DW_AT_decl_column : 15
    <8d1>   DW_AT_type        : <0x2b>
    <8d5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d8>: Abbrev Number: 0
 <1><8d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <8da>   DW_AT_name        : (indirect string, offset: 0xcd0): struct_ioctlent
    <8de>   DW_AT_decl_file   : 18
    <8df>   DW_AT_decl_line   : 220
    <8e0>   DW_AT_decl_column : 3
    <8e1>   DW_AT_type        : <0x8ad>
 <1><8e5>: Abbrev Number: 3 (DW_TAG_const_type)
    <8e6>   DW_AT_type        : <0x8d9>
 <1><8ea>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x83f): inject_data
    <8ef>   DW_AT_byte_size   : 10
    <8f0>   DW_AT_decl_file   : 18
    <8f1>   DW_AT_decl_line   : 241
    <8f2>   DW_AT_decl_column : 8
    <8f3>   DW_AT_sibling     : <0x952>
 <2><8f7>: Abbrev Number: 9 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x4f2): flags
    <8fc>   DW_AT_decl_file   : 18
    <8fd>   DW_AT_decl_line   : 242
    <8fe>   DW_AT_decl_column : 10
    <8ff>   DW_AT_type        : <0x116>
    <903>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><906>: Abbrev Number: 9 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x971): signo
    <90b>   DW_AT_decl_file   : 18
    <90c>   DW_AT_decl_line   : 243
    <90d>   DW_AT_decl_column : 10
    <90e>   DW_AT_type        : <0x116>
    <912>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><915>: Abbrev Number: 9 (DW_TAG_member)
    <916>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <91a>   DW_AT_decl_file   : 18
    <91b>   DW_AT_decl_line   : 244
    <91c>   DW_AT_decl_column : 11
    <91d>   DW_AT_type        : <0x122>
    <921>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><924>: Abbrev Number: 9 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0xd63): delay_idx
    <929>   DW_AT_decl_file   : 18
    <92a>   DW_AT_decl_line   : 245
    <92b>   DW_AT_decl_column : 11
    <92c>   DW_AT_type        : <0x122>
    <930>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><933>: Abbrev Number: 9 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0x592): poke_idx
    <938>   DW_AT_decl_file   : 18
    <939>   DW_AT_decl_line   : 246
    <93a>   DW_AT_decl_column : 11
    <93b>   DW_AT_type        : <0x122>
    <93f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><942>: Abbrev Number: 9 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <947>   DW_AT_decl_file   : 18
    <948>   DW_AT_decl_line   : 247
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0x122>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 8 (DW_TAG_structure_type)
    <953>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <957>   DW_AT_byte_size   : 16
    <958>   DW_AT_decl_file   : 18
    <959>   DW_AT_decl_line   : 250
    <95a>   DW_AT_decl_column : 8
    <95b>   DW_AT_sibling     : <0x99c>
 <2><95f>: Abbrev Number: 9 (DW_TAG_member)
    <960>   DW_AT_name        : (indirect string, offset: 0xaa4): first
    <964>   DW_AT_decl_file   : 18
    <965>   DW_AT_decl_line   : 251
    <966>   DW_AT_decl_column : 11
    <967>   DW_AT_type        : <0x122>
    <96b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><96e>: Abbrev Number: 9 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0x11c9): last
    <973>   DW_AT_decl_file   : 18
    <974>   DW_AT_decl_line   : 252
    <975>   DW_AT_decl_column : 11
    <976>   DW_AT_type        : <0x122>
    <97a>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><97d>: Abbrev Number: 9 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x3a1): step
    <982>   DW_AT_decl_file   : 18
    <983>   DW_AT_decl_line   : 253
    <984>   DW_AT_decl_column : 11
    <985>   DW_AT_type        : <0x122>
    <989>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><98c>: Abbrev Number: 9 (DW_TAG_member)
    <98d>   DW_AT_name        : (indirect string, offset: 0x1192): data
    <991>   DW_AT_decl_file   : 18
    <992>   DW_AT_decl_line   : 254
    <993>   DW_AT_decl_column : 21
    <994>   DW_AT_type        : <0x8ea>
    <998>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><99b>: Abbrev Number: 0
 <1><99c>: Abbrev Number: 15 (DW_TAG_array_type)
    <99d>   DW_AT_type        : <0x569>
    <9a1>   DW_AT_sibling     : <0x9ac>
 <2><9a5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9a6>   DW_AT_type        : <0x2b>
    <9aa>   DW_AT_upper_bound : 5
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ad>   DW_AT_name        : (indirect string, offset: 0xfbc): staged_output_data
    <9b1>   DW_AT_declaration : 1
 <1><9b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_type        : <0x9ac>
 <1><9b8>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b9>   DW_AT_prototyped  : 1
    <9ba>   DW_AT_sibling     : <0x9c4>
 <2><9be>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9bf>   DW_AT_type        : <0xf1>
 <2><9c3>: Abbrev Number: 0
 <1><9c4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c5>   DW_AT_byte_size   : 4
    <9c6>   DW_AT_type        : <0x9b8>
 <1><9ca>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_type        : <0x87e>
 <1><9d0>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d1>   DW_AT_type        : <0x9ca>
 <1><9d5>: Abbrev Number: 15 (DW_TAG_array_type)
    <9d6>   DW_AT_type        : <0x9e5>
    <9da>   DW_AT_sibling     : <0x9e5>
 <2><9de>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9df>   DW_AT_type        : <0x2b>
    <9e3>   DW_AT_upper_bound : 2
 <2><9e4>: Abbrev Number: 0
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x952>
 <1><9eb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x3ce): tcb_wait_data
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a10>   DW_AT_name        : (indirect string, offset: 0xfa0): unwind_queue_t
    <a14>   DW_AT_declaration : 1
 <1><a15>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a16>   DW_AT_byte_size   : 4
    <a17>   DW_AT_type        : <0xa0f>
 <1><a1b>: Abbrev Number: 15 (DW_TAG_array_type)
    <a1c>   DW_AT_type        : <0x10a>
    <a20>   DW_AT_sibling     : <0xa2b>
 <2><a24>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a25>   DW_AT_type        : <0x2b>
    <a29>   DW_AT_upper_bound : 15
 <2><a2a>: Abbrev Number: 0
 <1><a2b>: Abbrev Number: 10 (DW_TAG_variable)
    <a2c>   DW_AT_name        : (indirect string, offset: 0xbf8): stub_sysent
    <a30>   DW_AT_decl_file   : 18
    <a31>   DW_AT_decl_line   : 403
    <a33>   DW_AT_decl_column : 28
    <a34>   DW_AT_type        : <0x87e>
    <a38>   DW_AT_external    : 1
    <a39>   DW_AT_declaration : 1
 <1><a3a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x1175): xlat_type
    <a3f>   DW_AT_encoding    : 7	(unsigned)
    <a40>   DW_AT_byte_size   : 4
    <a41>   DW_AT_type        : <0x2b>
    <a45>   DW_AT_decl_file   : 19
    <a46>   DW_AT_decl_line   : 13
    <a47>   DW_AT_decl_column : 6
    <a48>   DW_AT_sibling     : <0xa5f>
 <2><a4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x2cd): XT_NORMAL
    <a51>   DW_AT_const_value : 0
 <2><a52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0xce7): XT_SORTED
    <a57>   DW_AT_const_value : 1
 <2><a58>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0xe5e): XT_INDEXED
    <a5d>   DW_AT_const_value : 2
 <2><a5e>: Abbrev Number: 0
 <1><a5f>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a60>   DW_AT_name        : (indirect string, offset: 0xc33): xlat_style
    <a64>   DW_AT_encoding    : 7	(unsigned)
    <a65>   DW_AT_byte_size   : 4
    <a66>   DW_AT_type        : <0x2b>
    <a6a>   DW_AT_decl_file   : 19
    <a6b>   DW_AT_decl_line   : 19
    <a6c>   DW_AT_decl_column : 6
    <a6d>   DW_AT_sibling     : <0xa9c>
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a76>   DW_AT_const_value : 0
 <2><a77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0xc66): XLAT_STYLE_RAW
    <a7c>   DW_AT_const_value : 1
 <2><a7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x1140): XLAT_STYLE_ABBREV
    <a82>   DW_AT_const_value : 2
 <2><a83>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x2ea): XLAT_STYLE_VERBOSE
    <a88>   DW_AT_const_value : 3
 <2><a89>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a8e>   DW_AT_const_value : 0
 <2><a8f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a94>   DW_AT_const_value : 4
 <2><a95>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0x11af): XLAT_STYLE_FMT_D
    <a9a>   DW_AT_const_value : 8
 <2><a9b>: Abbrev Number: 0
 <1><a9c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x31b): xlat_data
    <aa1>   DW_AT_byte_size   : 12
    <aa2>   DW_AT_decl_file   : 19
    <aa3>   DW_AT_decl_line   : 51
    <aa4>   DW_AT_decl_column : 8
    <aa5>   DW_AT_sibling     : <0xac8>
 <2><aa9>: Abbrev Number: 18 (DW_TAG_member)
    <aaa>   DW_AT_name        : val
    <aae>   DW_AT_decl_file   : 19
    <aaf>   DW_AT_decl_line   : 52
    <ab0>   DW_AT_decl_column : 11
    <ab1>   DW_AT_type        : <0x13a>
    <ab5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab8>: Abbrev Number: 18 (DW_TAG_member)
    <ab9>   DW_AT_name        : str
    <abd>   DW_AT_decl_file   : 19
    <abe>   DW_AT_decl_line   : 53
    <abf>   DW_AT_decl_column : 14
    <ac0>   DW_AT_type        : <0x1ed>
    <ac4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac9>   DW_AT_type        : <0xa9c>
 <1><acd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ace>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ad2>   DW_AT_byte_size   : 24
    <ad3>   DW_AT_decl_file   : 19
    <ad4>   DW_AT_decl_line   : 56
    <ad5>   DW_AT_decl_column : 8
    <ad6>   DW_AT_sibling     : <0xb26>
 <2><ada>: Abbrev Number: 9 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x1192): data
    <adf>   DW_AT_decl_file   : 19
    <ae0>   DW_AT_decl_line   : 57
    <ae1>   DW_AT_decl_column : 26
    <ae2>   DW_AT_type        : <0xb2b>
    <ae6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae9>: Abbrev Number: 9 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x8a7): flags_strsz
    <aee>   DW_AT_decl_file   : 19
    <aef>   DW_AT_decl_line   : 58
    <af0>   DW_AT_decl_column : 9
    <af1>   DW_AT_type        : <0x146>
    <af5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af8>: Abbrev Number: 9 (DW_TAG_member)
    <af9>   DW_AT_name        : (indirect string, offset: 0xbc9): size
    <afd>   DW_AT_decl_file   : 19
    <afe>   DW_AT_decl_line   : 59
    <aff>   DW_AT_decl_column : 11
    <b00>   DW_AT_type        : <0x12e>
    <b04>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b07>: Abbrev Number: 9 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x1aa): type
    <b0c>   DW_AT_decl_file   : 19
    <b0d>   DW_AT_decl_line   : 60
    <b0e>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0xa3a>
    <b13>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b16>: Abbrev Number: 9 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x759): flags_mask
    <b1b>   DW_AT_decl_file   : 19
    <b1c>   DW_AT_decl_line   : 61
    <b1d>   DW_AT_decl_column : 11
    <b1e>   DW_AT_type        : <0x13a>
    <b22>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b25>: Abbrev Number: 0
 <1><b26>: Abbrev Number: 3 (DW_TAG_const_type)
    <b27>   DW_AT_type        : <0xacd>
 <1><b2b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b2c>   DW_AT_byte_size   : 4
    <b2d>   DW_AT_type        : <0xac8>
 <1><b31>: Abbrev Number: 15 (DW_TAG_array_type)
    <b32>   DW_AT_type        : <0xb26>
    <b36>   DW_AT_sibling     : <0xb3c>
 <2><b3a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b3b>: Abbrev Number: 0
 <1><b3c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b3d>   DW_AT_type        : <0xb31>
 <1><b41>: Abbrev Number: 10 (DW_TAG_variable)
    <b42>   DW_AT_name        : (indirect string, offset: 0xece): addrfams
    <b46>   DW_AT_decl_file   : 18
    <b47>   DW_AT_decl_line   : 409
    <b49>   DW_AT_decl_column : 26
    <b4a>   DW_AT_type        : <0xb3c>
    <b4e>   DW_AT_external    : 1
    <b4f>   DW_AT_declaration : 1
 <1><b50>: Abbrev Number: 10 (DW_TAG_variable)
    <b51>   DW_AT_name        : (indirect string, offset: 0xda1): arp_hardware_types
    <b55>   DW_AT_decl_file   : 18
    <b56>   DW_AT_decl_line   : 410
    <b58>   DW_AT_decl_column : 26
    <b59>   DW_AT_type        : <0xb3c>
    <b5d>   DW_AT_external    : 1
    <b5e>   DW_AT_declaration : 1
 <1><b5f>: Abbrev Number: 10 (DW_TAG_variable)
    <b60>   DW_AT_name        : (indirect string, offset: 0x10c6): at_flags
    <b64>   DW_AT_decl_file   : 18
    <b65>   DW_AT_decl_line   : 411
    <b67>   DW_AT_decl_column : 26
    <b68>   DW_AT_type        : <0xb3c>
    <b6c>   DW_AT_external    : 1
    <b6d>   DW_AT_declaration : 1
 <1><b6e>: Abbrev Number: 10 (DW_TAG_variable)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x4ab): clocknames
    <b73>   DW_AT_decl_file   : 18
    <b74>   DW_AT_decl_line   : 412
    <b76>   DW_AT_decl_column : 26
    <b77>   DW_AT_type        : <0xb3c>
    <b7b>   DW_AT_external    : 1
    <b7c>   DW_AT_declaration : 1
 <1><b7d>: Abbrev Number: 10 (DW_TAG_variable)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x1086): dirent_types
    <b82>   DW_AT_decl_file   : 18
    <b83>   DW_AT_decl_line   : 413
    <b85>   DW_AT_decl_column : 26
    <b86>   DW_AT_type        : <0xb3c>
    <b8a>   DW_AT_external    : 1
    <b8b>   DW_AT_declaration : 1
 <1><b8c>: Abbrev Number: 10 (DW_TAG_variable)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x901): ethernet_protocols
    <b91>   DW_AT_decl_file   : 18
    <b92>   DW_AT_decl_line   : 414
    <b94>   DW_AT_decl_column : 26
    <b95>   DW_AT_type        : <0xb3c>
    <b99>   DW_AT_external    : 1
    <b9a>   DW_AT_declaration : 1
 <1><b9b>: Abbrev Number: 10 (DW_TAG_variable)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x5e5): inet_protocols
    <ba0>   DW_AT_decl_file   : 18
    <ba1>   DW_AT_decl_line   : 415
    <ba3>   DW_AT_decl_column : 26
    <ba4>   DW_AT_type        : <0xb3c>
    <ba8>   DW_AT_external    : 1
    <ba9>   DW_AT_declaration : 1
 <1><baa>: Abbrev Number: 10 (DW_TAG_variable)
    <bab>   DW_AT_name        : (indirect string, offset: 0x2ba): evdev_abs
    <baf>   DW_AT_decl_file   : 18
    <bb0>   DW_AT_decl_line   : 416
    <bb2>   DW_AT_decl_column : 26
    <bb3>   DW_AT_type        : <0xb3c>
    <bb7>   DW_AT_external    : 1
    <bb8>   DW_AT_declaration : 1
 <1><bb9>: Abbrev Number: 10 (DW_TAG_variable)
    <bba>   DW_AT_name        : (indirect string, offset: 0x74e): audit_arch
    <bbe>   DW_AT_decl_file   : 18
    <bbf>   DW_AT_decl_line   : 417
    <bc1>   DW_AT_decl_column : 26
    <bc2>   DW_AT_type        : <0xb3c>
    <bc6>   DW_AT_external    : 1
    <bc7>   DW_AT_declaration : 1
 <1><bc8>: Abbrev Number: 10 (DW_TAG_variable)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bcd>   DW_AT_decl_file   : 18
    <bce>   DW_AT_decl_line   : 418
    <bd0>   DW_AT_decl_column : 26
    <bd1>   DW_AT_type        : <0xb3c>
    <bd5>   DW_AT_external    : 1
    <bd6>   DW_AT_declaration : 1
 <1><bd7>: Abbrev Number: 10 (DW_TAG_variable)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x48c): iffflags
    <bdc>   DW_AT_decl_file   : 18
    <bdd>   DW_AT_decl_line   : 419
    <bdf>   DW_AT_decl_column : 26
    <be0>   DW_AT_type        : <0xb3c>
    <be4>   DW_AT_external    : 1
    <be5>   DW_AT_declaration : 1
 <1><be6>: Abbrev Number: 10 (DW_TAG_variable)
    <be7>   DW_AT_name        : (indirect string, offset: 0xc75): ip_type_of_services
    <beb>   DW_AT_decl_file   : 18
    <bec>   DW_AT_decl_line   : 420
    <bee>   DW_AT_decl_column : 26
    <bef>   DW_AT_type        : <0xb3c>
    <bf3>   DW_AT_external    : 1
    <bf4>   DW_AT_declaration : 1
 <1><bf5>: Abbrev Number: 10 (DW_TAG_variable)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x6d7): ipc_private
    <bfa>   DW_AT_decl_file   : 18
    <bfb>   DW_AT_decl_line   : 421
    <bfd>   DW_AT_decl_column : 26
    <bfe>   DW_AT_type        : <0xb3c>
    <c02>   DW_AT_external    : 1
    <c03>   DW_AT_declaration : 1
 <1><c04>: Abbrev Number: 10 (DW_TAG_variable)
    <c05>   DW_AT_name        : (indirect string, offset: 0x311): msg_flags
    <c09>   DW_AT_decl_file   : 18
    <c0a>   DW_AT_decl_line   : 422
    <c0c>   DW_AT_decl_column : 26
    <c0d>   DW_AT_type        : <0xb3c>
    <c11>   DW_AT_external    : 1
    <c12>   DW_AT_declaration : 1
 <1><c13>: Abbrev Number: 10 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c18>   DW_AT_decl_file   : 18
    <c19>   DW_AT_decl_line   : 423
    <c1b>   DW_AT_decl_column : 26
    <c1c>   DW_AT_type        : <0xb3c>
    <c20>   DW_AT_external    : 1
    <c21>   DW_AT_declaration : 1
 <1><c22>: Abbrev Number: 10 (DW_TAG_variable)
    <c23>   DW_AT_name        : (indirect string, offset: 0xfcf): nl_bridge_vlan_flags
    <c27>   DW_AT_decl_file   : 18
    <c28>   DW_AT_decl_line   : 424
    <c2a>   DW_AT_decl_column : 26
    <c2b>   DW_AT_type        : <0xb3c>
    <c2f>   DW_AT_external    : 1
    <c30>   DW_AT_declaration : 1
 <1><c31>: Abbrev Number: 10 (DW_TAG_variable)
    <c32>   DW_AT_name        : (indirect string, offset: 0xe47): nl_netfilter_msg_types
    <c36>   DW_AT_decl_file   : 18
    <c37>   DW_AT_decl_line   : 425
    <c39>   DW_AT_decl_column : 26
    <c3a>   DW_AT_type        : <0xb3c>
    <c3e>   DW_AT_external    : 1
    <c3f>   DW_AT_declaration : 1
 <1><c40>: Abbrev Number: 10 (DW_TAG_variable)
    <c41>   DW_AT_name        : (indirect string, offset: 0x467): nl_route_types
    <c45>   DW_AT_decl_file   : 18
    <c46>   DW_AT_decl_line   : 426
    <c48>   DW_AT_decl_column : 26
    <c49>   DW_AT_type        : <0xb3c>
    <c4d>   DW_AT_external    : 1
    <c4e>   DW_AT_declaration : 1
 <1><c4f>: Abbrev Number: 10 (DW_TAG_variable)
    <c50>   DW_AT_name        : (indirect string, offset: 0xf0c): open_access_modes
    <c54>   DW_AT_decl_file   : 18
    <c55>   DW_AT_decl_line   : 427
    <c57>   DW_AT_decl_column : 26
    <c58>   DW_AT_type        : <0xb3c>
    <c5c>   DW_AT_external    : 1
    <c5d>   DW_AT_declaration : 1
 <1><c5e>: Abbrev Number: 10 (DW_TAG_variable)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c63>   DW_AT_decl_file   : 18
    <c64>   DW_AT_decl_line   : 428
    <c66>   DW_AT_decl_column : 26
    <c67>   DW_AT_type        : <0xb3c>
    <c6b>   DW_AT_external    : 1
    <c6c>   DW_AT_declaration : 1
 <1><c6d>: Abbrev Number: 10 (DW_TAG_variable)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xcad): perf_type_id
    <c72>   DW_AT_decl_file   : 18
    <c73>   DW_AT_decl_line   : 429
    <c75>   DW_AT_decl_column : 26
    <c76>   DW_AT_type        : <0xb3c>
    <c7a>   DW_AT_external    : 1
    <c7b>   DW_AT_declaration : 1
 <1><c7c>: Abbrev Number: 10 (DW_TAG_variable)
    <c7d>   DW_AT_name        : (indirect string, offset: 0xed7): pollflags
    <c81>   DW_AT_decl_file   : 18
    <c82>   DW_AT_decl_line   : 430
    <c84>   DW_AT_decl_column : 26
    <c85>   DW_AT_type        : <0xb3c>
    <c89>   DW_AT_external    : 1
    <c8a>   DW_AT_declaration : 1
 <1><c8b>: Abbrev Number: 10 (DW_TAG_variable)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x586): ptrace_cmds
    <c90>   DW_AT_decl_file   : 18
    <c91>   DW_AT_decl_line   : 431
    <c93>   DW_AT_decl_column : 26
    <c94>   DW_AT_type        : <0xb3c>
    <c98>   DW_AT_external    : 1
    <c99>   DW_AT_declaration : 1
 <1><c9a>: Abbrev Number: 10 (DW_TAG_variable)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x830): resource_flags
    <c9f>   DW_AT_decl_file   : 18
    <ca0>   DW_AT_decl_line   : 432
    <ca2>   DW_AT_decl_column : 26
    <ca3>   DW_AT_type        : <0xb3c>
    <ca7>   DW_AT_external    : 1
    <ca8>   DW_AT_declaration : 1
 <1><ca9>: Abbrev Number: 10 (DW_TAG_variable)
    <caa>   DW_AT_name        : (indirect string, offset: 0x290): route_nexthop_flags
    <cae>   DW_AT_decl_file   : 18
    <caf>   DW_AT_decl_line   : 433
    <cb1>   DW_AT_decl_column : 26
    <cb2>   DW_AT_type        : <0xb3c>
    <cb6>   DW_AT_external    : 1
    <cb7>   DW_AT_declaration : 1
 <1><cb8>: Abbrev Number: 10 (DW_TAG_variable)
    <cb9>   DW_AT_name        : (indirect string, offset: 0xf4a): routing_protocols
    <cbd>   DW_AT_decl_file   : 18
    <cbe>   DW_AT_decl_line   : 434
    <cc0>   DW_AT_decl_column : 26
    <cc1>   DW_AT_type        : <0xb3c>
    <cc5>   DW_AT_external    : 1
    <cc6>   DW_AT_declaration : 1
 <1><cc7>: Abbrev Number: 10 (DW_TAG_variable)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x47d): routing_scopes
    <ccc>   DW_AT_decl_file   : 18
    <ccd>   DW_AT_decl_line   : 435
    <ccf>   DW_AT_decl_column : 26
    <cd0>   DW_AT_type        : <0xb3c>
    <cd4>   DW_AT_external    : 1
    <cd5>   DW_AT_declaration : 1
 <1><cd6>: Abbrev Number: 10 (DW_TAG_variable)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xe35): routing_table_ids
    <cdb>   DW_AT_decl_file   : 18
    <cdc>   DW_AT_decl_line   : 436
    <cde>   DW_AT_decl_column : 26
    <cdf>   DW_AT_type        : <0xb3c>
    <ce3>   DW_AT_external    : 1
    <ce4>   DW_AT_declaration : 1
 <1><ce5>: Abbrev Number: 10 (DW_TAG_variable)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x6b4): routing_types
    <cea>   DW_AT_decl_file   : 18
    <ceb>   DW_AT_decl_line   : 437
    <ced>   DW_AT_decl_column : 26
    <cee>   DW_AT_type        : <0xb3c>
    <cf2>   DW_AT_external    : 1
    <cf3>   DW_AT_declaration : 1
 <1><cf4>: Abbrev Number: 10 (DW_TAG_variable)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x1ce): rwf_flags
    <cf9>   DW_AT_decl_file   : 18
    <cfa>   DW_AT_decl_line   : 438
    <cfc>   DW_AT_decl_column : 26
    <cfd>   DW_AT_type        : <0xb3c>
    <d01>   DW_AT_external    : 1
    <d02>   DW_AT_declaration : 1
 <1><d03>: Abbrev Number: 10 (DW_TAG_variable)
    <d04>   DW_AT_name        : (indirect string, offset: 0x872): seccomp_filter_flags
    <d08>   DW_AT_decl_file   : 18
    <d09>   DW_AT_decl_line   : 439
    <d0b>   DW_AT_decl_column : 26
    <d0c>   DW_AT_type        : <0xb3c>
    <d10>   DW_AT_external    : 1
    <d11>   DW_AT_declaration : 1
 <1><d12>: Abbrev Number: 10 (DW_TAG_variable)
    <d13>   DW_AT_name        : (indirect string, offset: 0x2d7): seccomp_ret_action
    <d17>   DW_AT_decl_file   : 18
    <d18>   DW_AT_decl_line   : 440
    <d1a>   DW_AT_decl_column : 26
    <d1b>   DW_AT_type        : <0xb3c>
    <d1f>   DW_AT_external    : 1
    <d20>   DW_AT_declaration : 1
 <1><d21>: Abbrev Number: 10 (DW_TAG_variable)
    <d22>   DW_AT_name        : (indirect string, offset: 0x438): setns_types
    <d26>   DW_AT_decl_file   : 18
    <d27>   DW_AT_decl_line   : 441
    <d29>   DW_AT_decl_column : 26
    <d2a>   DW_AT_type        : <0xb3c>
    <d2e>   DW_AT_external    : 1
    <d2f>   DW_AT_declaration : 1
 <1><d30>: Abbrev Number: 10 (DW_TAG_variable)
    <d31>   DW_AT_name        : (indirect string, offset: 0xec3): sg_io_info
    <d35>   DW_AT_decl_file   : 18
    <d36>   DW_AT_decl_line   : 442
    <d38>   DW_AT_decl_column : 26
    <d39>   DW_AT_type        : <0xb3c>
    <d3d>   DW_AT_external    : 1
    <d3e>   DW_AT_declaration : 1
 <1><d3f>: Abbrev Number: 10 (DW_TAG_variable)
    <d40>   DW_AT_name        : (indirect string, offset: 0xc0c): socketlayers
    <d44>   DW_AT_decl_file   : 18
    <d45>   DW_AT_decl_line   : 443
    <d47>   DW_AT_decl_column : 26
    <d48>   DW_AT_type        : <0xb3c>
    <d4c>   DW_AT_external    : 1
    <d4d>   DW_AT_declaration : 1
 <1><d4e>: Abbrev Number: 10 (DW_TAG_variable)
    <d4f>   DW_AT_name        : (indirect string, offset: 0xe1f): socktypes
    <d53>   DW_AT_decl_file   : 18
    <d54>   DW_AT_decl_line   : 444
    <d56>   DW_AT_decl_column : 26
    <d57>   DW_AT_type        : <0xb3c>
    <d5b>   DW_AT_external    : 1
    <d5c>   DW_AT_declaration : 1
 <1><d5d>: Abbrev Number: 10 (DW_TAG_variable)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xae1): tcp_state_flags
    <d62>   DW_AT_decl_file   : 18
    <d63>   DW_AT_decl_line   : 445
    <d65>   DW_AT_decl_column : 26
    <d66>   DW_AT_type        : <0xb3c>
    <d6a>   DW_AT_external    : 1
    <d6b>   DW_AT_declaration : 1
 <1><d6c>: Abbrev Number: 10 (DW_TAG_variable)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x783): tcp_states
    <d71>   DW_AT_decl_file   : 18
    <d72>   DW_AT_decl_line   : 446
    <d74>   DW_AT_decl_column : 26
    <d75>   DW_AT_type        : <0xb3c>
    <d79>   DW_AT_external    : 1
    <d7a>   DW_AT_declaration : 1
 <1><d7b>: Abbrev Number: 10 (DW_TAG_variable)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x1123): whence_codes
    <d80>   DW_AT_decl_file   : 18
    <d81>   DW_AT_decl_line   : 447
    <d83>   DW_AT_decl_column : 26
    <d84>   DW_AT_type        : <0xb3c>
    <d88>   DW_AT_external    : 1
    <d89>   DW_AT_declaration : 1
 <1><d8a>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d8b>   DW_AT_encoding    : 7	(unsigned)
    <d8c>   DW_AT_byte_size   : 4
    <d8d>   DW_AT_type        : <0x2b>
    <d91>   DW_AT_decl_file   : 18
    <d92>   DW_AT_decl_line   : 508
    <d94>   DW_AT_decl_column : 14
    <d95>   DW_AT_sibling     : <0xdac>
 <2><d99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x9ee): CFLAG_NONE
    <d9e>   DW_AT_const_value : 0
 <2><d9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x914): CFLAG_ONLY_STATS
    <da4>   DW_AT_const_value : 1
 <2><da5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0xc19): CFLAG_BOTH
    <daa>   DW_AT_const_value : 2
 <2><dab>: Abbrev Number: 0
 <1><dac>: Abbrev Number: 28 (DW_TAG_typedef)
    <dad>   DW_AT_name        : (indirect string, offset: 0x11ce): cflag_t
    <db1>   DW_AT_decl_file   : 18
    <db2>   DW_AT_decl_line   : 512
    <db4>   DW_AT_decl_column : 3
    <db5>   DW_AT_type        : <0xd8a>
 <1><db9>: Abbrev Number: 10 (DW_TAG_variable)
    <dba>   DW_AT_name        : (indirect string, offset: 0xd5d): cflag
    <dbe>   DW_AT_decl_file   : 18
    <dbf>   DW_AT_decl_line   : 513
    <dc1>   DW_AT_decl_column : 16
    <dc2>   DW_AT_type        : <0xdac>
    <dc6>   DW_AT_external    : 1
    <dc7>   DW_AT_declaration : 1
 <1><dc8>: Abbrev Number: 10 (DW_TAG_variable)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dcd>   DW_AT_decl_file   : 18
    <dce>   DW_AT_decl_line   : 514
    <dd0>   DW_AT_decl_column : 13
    <dd1>   DW_AT_type        : <0x539>
    <dd5>   DW_AT_external    : 1
    <dd6>   DW_AT_declaration : 1
 <1><dd7>: Abbrev Number: 10 (DW_TAG_variable)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x7df): Tflag_scale
    <ddc>   DW_AT_decl_file   : 18
    <ddd>   DW_AT_decl_line   : 515
    <ddf>   DW_AT_decl_column : 12
    <de0>   DW_AT_type        : <0x64>
    <de4>   DW_AT_external    : 1
    <de5>   DW_AT_declaration : 1
 <1><de6>: Abbrev Number: 10 (DW_TAG_variable)
    <de7>   DW_AT_name        : (indirect string, offset: 0x887): Tflag_width
    <deb>   DW_AT_decl_file   : 18
    <dec>   DW_AT_decl_line   : 516
    <dee>   DW_AT_decl_column : 12
    <def>   DW_AT_type        : <0x64>
    <df3>   DW_AT_external    : 1
    <df4>   DW_AT_declaration : 1
 <1><df5>: Abbrev Number: 10 (DW_TAG_variable)
    <df6>   DW_AT_name        : (indirect string, offset: 0xeae): iflag
    <dfa>   DW_AT_decl_file   : 18
    <dfb>   DW_AT_decl_line   : 517
    <dfd>   DW_AT_decl_column : 13
    <dfe>   DW_AT_type        : <0x539>
    <e02>   DW_AT_external    : 1
    <e03>   DW_AT_declaration : 1
 <1><e04>: Abbrev Number: 10 (DW_TAG_variable)
    <e05>   DW_AT_name        : (indirect string, offset: 0x5c6): count_wallclock
    <e09>   DW_AT_decl_file   : 18
    <e0a>   DW_AT_decl_line   : 518
    <e0c>   DW_AT_decl_column : 13
    <e0d>   DW_AT_type        : <0x539>
    <e11>   DW_AT_external    : 1
    <e12>   DW_AT_declaration : 1
 <1><e13>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e14>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e18>   DW_AT_byte_size   : 4
    <e19>   DW_AT_decl_file   : 18
    <e1a>   DW_AT_decl_line   : 520
    <e1c>   DW_AT_decl_column : 8
    <e1d>   DW_AT_sibling     : <0xe32>
 <2><e21>: Abbrev Number: 22 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e26>   DW_AT_decl_file   : 18
    <e27>   DW_AT_decl_line   : 521
    <e29>   DW_AT_decl_column : 14
    <e2a>   DW_AT_type        : <0x1ed>
    <e2e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e31>: Abbrev Number: 0
 <1><e32>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e33>   DW_AT_name        : (indirect string, offset: 0x78e): path_set
    <e37>   DW_AT_byte_size   : 12
    <e38>   DW_AT_decl_file   : 18
    <e39>   DW_AT_decl_line   : 525
    <e3b>   DW_AT_decl_column : 15
    <e3c>   DW_AT_sibling     : <0xe71>
 <2><e40>: Abbrev Number: 22 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x712): paths_selected
    <e45>   DW_AT_decl_file   : 18
    <e46>   DW_AT_decl_line   : 526
    <e48>   DW_AT_decl_column : 24
    <e49>   DW_AT_type        : <0xe71>
    <e4d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e50>: Abbrev Number: 22 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x1116): num_selected
    <e55>   DW_AT_decl_file   : 18
    <e56>   DW_AT_decl_line   : 527
    <e58>   DW_AT_decl_column : 9
    <e59>   DW_AT_type        : <0x146>
    <e5d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e60>: Abbrev Number: 22 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0xbc9): size
    <e65>   DW_AT_decl_file   : 18
    <e66>   DW_AT_decl_line   : 528
    <e68>   DW_AT_decl_column : 9
    <e69>   DW_AT_type        : <0x146>
    <e6d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e70>: Abbrev Number: 0
 <1><e71>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e72>   DW_AT_byte_size   : 4
    <e73>   DW_AT_type        : <0xe13>
 <1><e77>: Abbrev Number: 10 (DW_TAG_variable)
    <e78>   DW_AT_name        : (indirect string, offset: 0x1165): global_path_set
    <e7c>   DW_AT_decl_file   : 18
    <e7d>   DW_AT_decl_line   : 529
    <e7f>   DW_AT_decl_column : 3
    <e80>   DW_AT_type        : <0xe32>
    <e84>   DW_AT_external    : 1
    <e85>   DW_AT_declaration : 1
 <1><e86>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e87>   DW_AT_name        : (indirect string, offset: 0x1061): xflag_opts
    <e8b>   DW_AT_encoding    : 7	(unsigned)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0x2b>
    <e91>   DW_AT_decl_file   : 18
    <e92>   DW_AT_decl_line   : 531
    <e94>   DW_AT_decl_column : 6
    <e95>   DW_AT_sibling     : <0xeb8>
 <2><e99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xa98): HEXSTR_NONE
    <e9e>   DW_AT_const_value : 0
 <2><e9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x10a8): HEXSTR_NON_ASCII
    <ea4>   DW_AT_const_value : 1
 <2><ea5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x95c): HEXSTR_ALL
    <eaa>   DW_AT_const_value : 2
 <2><eab>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0x69d): HEXSTR_NON_ASCII_CHARS
    <eb0>   DW_AT_const_value : 3
 <2><eb1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x1130): NUM_HEXSTR_OPTS
    <eb6>   DW_AT_const_value : 4
 <2><eb7>: Abbrev Number: 0
 <1><eb8>: Abbrev Number: 10 (DW_TAG_variable)
    <eb9>   DW_AT_name        : (indirect string, offset: 0xe88): xflag
    <ebd>   DW_AT_decl_file   : 18
    <ebe>   DW_AT_decl_line   : 544
    <ec0>   DW_AT_decl_column : 17
    <ec1>   DW_AT_type        : <0x2b>
    <ec5>   DW_AT_external    : 1
    <ec6>   DW_AT_declaration : 1
 <1><ec7>: Abbrev Number: 10 (DW_TAG_variable)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xd18): followfork
    <ecc>   DW_AT_decl_file   : 18
    <ecd>   DW_AT_decl_line   : 545
    <ecf>   DW_AT_decl_column : 13
    <ed0>   DW_AT_type        : <0x539>
    <ed4>   DW_AT_external    : 1
    <ed5>   DW_AT_declaration : 1
 <1><ed6>: Abbrev Number: 10 (DW_TAG_variable)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x325): output_separately
    <edb>   DW_AT_decl_file   : 18
    <edc>   DW_AT_decl_line   : 546
    <ede>   DW_AT_decl_column : 13
    <edf>   DW_AT_type        : <0x539>
    <ee3>   DW_AT_external    : 1
    <ee4>   DW_AT_declaration : 1
 <1><ee5>: Abbrev Number: 10 (DW_TAG_variable)
    <ee6>   DW_AT_name        : (indirect string, offset: 0x235): stack_trace_enabled
    <eea>   DW_AT_decl_file   : 18
    <eeb>   DW_AT_decl_line   : 549
    <eed>   DW_AT_decl_column : 13
    <eee>   DW_AT_type        : <0x539>
    <ef2>   DW_AT_external    : 1
    <ef3>   DW_AT_declaration : 1
 <1><ef4>: Abbrev Number: 10 (DW_TAG_variable)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x68b): ptrace_setoptions
    <ef9>   DW_AT_decl_file   : 18
    <efa>   DW_AT_decl_line   : 553
    <efc>   DW_AT_decl_column : 17
    <efd>   DW_AT_type        : <0x2b>
    <f01>   DW_AT_external    : 1
    <f02>   DW_AT_declaration : 1
 <1><f03>: Abbrev Number: 10 (DW_TAG_variable)
    <f04>   DW_AT_name        : (indirect string, offset: 0xa83): max_strlen
    <f08>   DW_AT_decl_file   : 18
    <f09>   DW_AT_decl_line   : 554
    <f0b>   DW_AT_decl_column : 17
    <f0c>   DW_AT_type        : <0x2b>
    <f10>   DW_AT_external    : 1
    <f11>   DW_AT_declaration : 1
 <1><f12>: Abbrev Number: 10 (DW_TAG_variable)
    <f13>   DW_AT_name        : (indirect string, offset: 0xabb): os_release
    <f17>   DW_AT_decl_file   : 18
    <f18>   DW_AT_decl_line   : 555
    <f1a>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0x2b>
    <f1f>   DW_AT_external    : 1
    <f20>   DW_AT_declaration : 1
 <1><f21>: Abbrev Number: 10 (DW_TAG_variable)
    <f22>   DW_AT_name        : (indirect string, offset: 0x721): xlat_verbosity
    <f26>   DW_AT_decl_file   : 18
    <f27>   DW_AT_decl_line   : 917
    <f29>   DW_AT_decl_column : 24
    <f2a>   DW_AT_type        : <0xa5f>
    <f2e>   DW_AT_external    : 1
    <f2f>   DW_AT_declaration : 1
 <1><f30>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f31>   DW_AT_name        : (indirect string, offset: 0x5a9): xlat_style_private_flag_bits
    <f35>   DW_AT_encoding    : 7	(unsigned)
    <f36>   DW_AT_byte_size   : 4
    <f37>   DW_AT_type        : <0x2b>
    <f3b>   DW_AT_decl_file   : 18
    <f3c>   DW_AT_decl_line   : 937
    <f3e>   DW_AT_decl_column : 6
    <f3f>   DW_AT_sibling     : <0xf5c>
 <2><f43>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x2a4): PAF_PRINT_INDICES_BIT
    <f48>   DW_AT_const_value : 5
 <2><f49>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xb80): PAF_ARRAY_TRUNCATED_BIT
    <f4e>   DW_AT_const_value : 6
 <2><f4f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x3f8): PXF_DEFAULT_STR_BIT
    <f54>   DW_AT_const_value : 7
 <2><f55>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0xcfa): SPFF_AUXSTR_MODE_BIT
    <f5a>   DW_AT_const_value : 8
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xdb4): find_xlat_flag_bits
    <f61>   DW_AT_encoding    : 7	(unsigned)
    <f62>   DW_AT_byte_size   : 4
    <f63>   DW_AT_type        : <0x2b>
    <f67>   DW_AT_decl_file   : 18
    <f68>   DW_AT_decl_line   : 1441
    <f6a>   DW_AT_decl_column : 6
    <f6b>   DW_AT_sibling     : <0xf76>
 <2><f6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f70>   DW_AT_name        : (indirect string, offset: 0x9a5): FXL_CASE_SENSITIVE_BIT
    <f74>   DW_AT_const_value : 0
 <2><f75>: Abbrev Number: 0
 <1><f76>: Abbrev Number: 10 (DW_TAG_variable)
    <f77>   DW_AT_name        : (indirect string, offset: 0xa4c): printing_tcp
    <f7b>   DW_AT_decl_file   : 18
    <f7c>   DW_AT_decl_line   : 1687
    <f7e>   DW_AT_decl_column : 20
    <f7f>   DW_AT_type        : <0x615>
    <f83>   DW_AT_external    : 1
    <f84>   DW_AT_declaration : 1
 <1><f85>: Abbrev Number: 10 (DW_TAG_variable)
    <f86>   DW_AT_name        : (indirect string, offset: 0x566): errnoent
    <f8a>   DW_AT_decl_file   : 18
    <f8b>   DW_AT_decl_line   : 1885
    <f8d>   DW_AT_decl_column : 26
    <f8e>   DW_AT_type        : <0x46d>
    <f92>   DW_AT_external    : 1
    <f93>   DW_AT_declaration : 1
 <1><f94>: Abbrev Number: 10 (DW_TAG_variable)
    <f95>   DW_AT_name        : (indirect string, offset: 0x893): signalent
    <f99>   DW_AT_decl_file   : 18
    <f9a>   DW_AT_decl_line   : 1886
    <f9c>   DW_AT_decl_column : 26
    <f9d>   DW_AT_type        : <0x46d>
    <fa1>   DW_AT_external    : 1
    <fa2>   DW_AT_declaration : 1
 <1><fa3>: Abbrev Number: 10 (DW_TAG_variable)
    <fa4>   DW_AT_name        : (indirect string, offset: 0xf04): nerrnos
    <fa8>   DW_AT_decl_file   : 18
    <fa9>   DW_AT_decl_line   : 1887
    <fab>   DW_AT_decl_column : 27
    <fac>   DW_AT_type        : <0x32>
    <fb0>   DW_AT_external    : 1
    <fb1>   DW_AT_declaration : 1
 <1><fb2>: Abbrev Number: 10 (DW_TAG_variable)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x10ff): nsignals
    <fb7>   DW_AT_decl_file   : 18
    <fb8>   DW_AT_decl_line   : 1888
    <fba>   DW_AT_decl_column : 27
    <fbb>   DW_AT_type        : <0x32>
    <fbf>   DW_AT_external    : 1
    <fc0>   DW_AT_declaration : 1
 <1><fc1>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc2>   DW_AT_type        : <0x87e>
    <fc6>   DW_AT_sibling     : <0xfcc>
 <2><fca>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fcb>: Abbrev Number: 0
 <1><fcc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fcd>   DW_AT_type        : <0xfc1>
 <1><fd1>: Abbrev Number: 10 (DW_TAG_variable)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xd74): sysent0
    <fd6>   DW_AT_decl_file   : 18
    <fd7>   DW_AT_decl_line   : 1890
    <fd9>   DW_AT_decl_column : 28
    <fda>   DW_AT_type        : <0xfcc>
    <fde>   DW_AT_external    : 1
    <fdf>   DW_AT_declaration : 1
 <1><fe0>: Abbrev Number: 15 (DW_TAG_array_type)
    <fe1>   DW_AT_type        : <0x8e5>
    <fe5>   DW_AT_sibling     : <0xfeb>
 <2><fe9>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fea>: Abbrev Number: 0
 <1><feb>: Abbrev Number: 3 (DW_TAG_const_type)
    <fec>   DW_AT_type        : <0xfe0>
 <1><ff0>: Abbrev Number: 10 (DW_TAG_variable)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x115b): ioctlent0
    <ff5>   DW_AT_decl_file   : 18
    <ff6>   DW_AT_decl_line   : 1891
    <ff8>   DW_AT_decl_column : 30
    <ff9>   DW_AT_type        : <0xfeb>
    <ffd>   DW_AT_external    : 1
    <ffe>   DW_AT_declaration : 1
 <1><fff>: Abbrev Number: 10 (DW_TAG_variable)
    <1000>   DW_AT_name        : (indirect string, offset: 0x106c): personality_names
    <1004>   DW_AT_decl_file   : 18
    <1005>   DW_AT_decl_line   : 1893
    <1007>   DW_AT_decl_column : 26
    <1008>   DW_AT_type        : <0x46d>
    <100c>   DW_AT_external    : 1
    <100d>   DW_AT_declaration : 1
 <1><100e>: Abbrev Number: 10 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0x8b3): sysent
    <1013>   DW_AT_decl_file   : 18
    <1014>   DW_AT_decl_line   : 1896
    <1016>   DW_AT_decl_column : 29
    <1017>   DW_AT_type        : <0x9ca>
    <101b>   DW_AT_external    : 1
    <101c>   DW_AT_declaration : 1
 <1><101d>: Abbrev Number: 10 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0xd0f): ioctlent
    <1022>   DW_AT_decl_file   : 18
    <1023>   DW_AT_decl_line   : 1897
    <1025>   DW_AT_decl_column : 31
    <1026>   DW_AT_type        : <0x102c>
    <102a>   DW_AT_external    : 1
    <102b>   DW_AT_declaration : 1
 <1><102c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <102d>   DW_AT_byte_size   : 4
    <102e>   DW_AT_type        : <0x8e5>
 <1><1032>: Abbrev Number: 10 (DW_TAG_variable)
    <1033>   DW_AT_name        : (indirect string, offset: 0x89d): nsyscalls
    <1037>   DW_AT_decl_file   : 18
    <1038>   DW_AT_decl_line   : 1903
    <103a>   DW_AT_decl_column : 17
    <103b>   DW_AT_type        : <0x2b>
    <103f>   DW_AT_external    : 1
    <1040>   DW_AT_declaration : 1
 <1><1041>: Abbrev Number: 10 (DW_TAG_variable)
    <1042>   DW_AT_name        : (indirect string, offset: 0xf2a): nioctlents
    <1046>   DW_AT_decl_file   : 18
    <1047>   DW_AT_decl_line   : 1904
    <1049>   DW_AT_decl_column : 17
    <104a>   DW_AT_type        : <0x2b>
    <104e>   DW_AT_external    : 1
    <104f>   DW_AT_declaration : 1
 <1><1050>: Abbrev Number: 15 (DW_TAG_array_type)
    <1051>   DW_AT_type        : <0x32>
    <1055>   DW_AT_sibling     : <0x1060>
 <2><1059>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <105a>   DW_AT_type        : <0x2b>
    <105e>   DW_AT_upper_bound : 2
 <2><105f>: Abbrev Number: 0
 <1><1060>: Abbrev Number: 3 (DW_TAG_const_type)
    <1061>   DW_AT_type        : <0x1050>
 <1><1065>: Abbrev Number: 10 (DW_TAG_variable)
    <1066>   DW_AT_name        : (indirect string, offset: 0xfaf): nsyscall_vec
    <106a>   DW_AT_decl_file   : 18
    <106b>   DW_AT_decl_line   : 1906
    <106d>   DW_AT_decl_column : 27
    <106e>   DW_AT_type        : <0x1060>
    <1072>   DW_AT_external    : 1
    <1073>   DW_AT_declaration : 1
 <1><1074>: Abbrev Number: 15 (DW_TAG_array_type)
    <1075>   DW_AT_type        : <0x9d0>
    <1079>   DW_AT_sibling     : <0x1084>
 <2><107d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <107e>   DW_AT_type        : <0x2b>
    <1082>   DW_AT_upper_bound : 2
 <2><1083>: Abbrev Number: 0
 <1><1084>: Abbrev Number: 3 (DW_TAG_const_type)
    <1085>   DW_AT_type        : <0x1074>
 <1><1089>: Abbrev Number: 10 (DW_TAG_variable)
    <108a>   DW_AT_name        : (indirect string, offset: 0x7cc): sysent_vec
    <108e>   DW_AT_decl_file   : 18
    <108f>   DW_AT_decl_line   : 1907
    <1091>   DW_AT_decl_column : 35
    <1092>   DW_AT_type        : <0x1084>
    <1096>   DW_AT_external    : 1
    <1097>   DW_AT_declaration : 1
 <1><1098>: Abbrev Number: 10 (DW_TAG_variable)
    <1099>   DW_AT_name        : (indirect string, offset: 0x387): inject_vec
    <109d>   DW_AT_decl_file   : 18
    <109e>   DW_AT_decl_line   : 1908
    <10a0>   DW_AT_decl_column : 28
    <10a1>   DW_AT_type        : <0x9d5>
    <10a5>   DW_AT_external    : 1
    <10a6>   DW_AT_declaration : 1
 <1><10a7>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a8>   DW_AT_name        : (indirect string, offset: 0xe12): audit_arch_t
    <10ac>   DW_AT_byte_size   : 8
    <10ad>   DW_AT_decl_file   : 18
    <10ae>   DW_AT_decl_line   : 1910
    <10b0>   DW_AT_decl_column : 8
    <10b1>   DW_AT_sibling     : <0x10d6>
 <2><10b5>: Abbrev Number: 22 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x59b): arch
    <10ba>   DW_AT_decl_file   : 18
    <10bb>   DW_AT_decl_line   : 1911
    <10bd>   DW_AT_decl_column : 15
    <10be>   DW_AT_type        : <0x2b>
    <10c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c5>: Abbrev Number: 22 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0xa32): flag
    <10ca>   DW_AT_decl_file   : 18
    <10cb>   DW_AT_decl_line   : 1912
    <10cd>   DW_AT_decl_column : 15
    <10ce>   DW_AT_type        : <0x2b>
    <10d2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d5>: Abbrev Number: 0
 <1><10d6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d7>   DW_AT_type        : <0x10a7>
 <1><10db>: Abbrev Number: 15 (DW_TAG_array_type)
    <10dc>   DW_AT_type        : <0x10d6>
    <10e0>   DW_AT_sibling     : <0x10eb>
 <2><10e4>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10e5>   DW_AT_type        : <0x2b>
    <10e9>   DW_AT_upper_bound : 2
 <2><10ea>: Abbrev Number: 0
 <1><10eb>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ec>   DW_AT_type        : <0x10db>
 <1><10f0>: Abbrev Number: 10 (DW_TAG_variable)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x996): audit_arch_vec
    <10f5>   DW_AT_decl_file   : 18
    <10f6>   DW_AT_decl_line   : 1915
    <10f8>   DW_AT_decl_column : 34
    <10f9>   DW_AT_type        : <0x10eb>
    <10fd>   DW_AT_external    : 1
    <10fe>   DW_AT_declaration : 1
 <1><10ff>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1100>   DW_AT_byte_size   : 180
    <1101>   DW_AT_decl_file   : 20
    <1102>   DW_AT_decl_line   : 2
    <1103>   DW_AT_decl_column : 9
    <1104>   DW_AT_sibling     : <0x13b9>
 <2><1108>: Abbrev Number: 9 (DW_TAG_member)
    <1109>   DW_AT_name        : (indirect string, offset: 0x1e6): block_ioctl
    <110d>   DW_AT_decl_file   : 20
    <110e>   DW_AT_decl_line   : 3
    <110f>   DW_AT_decl_column : 8
    <1110>   DW_AT_type        : <0x13d3>
    <1114>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1117>: Abbrev Number: 9 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0xb1a): btrfs_ioctl
    <111c>   DW_AT_decl_file   : 20
    <111d>   DW_AT_decl_line   : 6
    <111e>   DW_AT_decl_column : 8
    <111f>   DW_AT_type        : <0x13d3>
    <1123>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1126>: Abbrev Number: 9 (DW_TAG_member)
    <1127>   DW_AT_name        : (indirect string, offset: 0x764): evdev_write_ioctl_mpers
    <112b>   DW_AT_decl_file   : 20
    <112c>   DW_AT_decl_line   : 9
    <112d>   DW_AT_decl_column : 8
    <112e>   DW_AT_type        : <0x13d3>
    <1132>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1135>: Abbrev Number: 9 (DW_TAG_member)
    <1136>   DW_AT_name        : (indirect string, offset: 0x730): get_sock_fprog_size
    <113a>   DW_AT_decl_file   : 20
    <113b>   DW_AT_decl_line   : 12
    <113c>   DW_AT_decl_column : 17
    <113d>   DW_AT_type        : <0x13df>
    <1141>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1144>: Abbrev Number: 9 (DW_TAG_member)
    <1145>   DW_AT_name        : (indirect string, offset: 0x1b5): fetch_bpf_fprog
    <1149>   DW_AT_decl_file   : 20
    <114a>   DW_AT_decl_line   : 15
    <114b>   DW_AT_decl_column : 10
    <114c>   DW_AT_type        : <0x13ff>
    <1150>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1153>: Abbrev Number: 9 (DW_TAG_member)
    <1154>   DW_AT_name        : (indirect string, offset: 0x983): fetch_struct_flock
    <1158>   DW_AT_decl_file   : 20
    <1159>   DW_AT_decl_line   : 18
    <115a>   DW_AT_decl_column : 10
    <115b>   DW_AT_type        : <0x13ff>
    <115f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1162>: Abbrev Number: 9 (DW_TAG_member)
    <1163>   DW_AT_name        : (indirect string, offset: 0xd23): fetch_struct_flock64
    <1167>   DW_AT_decl_file   : 20
    <1168>   DW_AT_decl_line   : 21
    <1169>   DW_AT_decl_column : 10
    <116a>   DW_AT_type        : <0x13ff>
