Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x193f (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5fa): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xcd6): mpers-m32/siginfo_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xab0): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10df): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9e0): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8c0): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf9d): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8f9): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7af): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbea): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xffd): __uid_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 146
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x2b>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xc20): __off_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 152
    <b5>   DW_AT_decl_column : 25
    <b6>   DW_AT_type        : <0xba>
 <1><ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <bb>   DW_AT_byte_size   : 4
    <bc>   DW_AT_encoding    : 5	(signed)
    <bd>   DW_AT_name        : (indirect string, offset: 0x2ca): long int
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xd98): __off64_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 153
    <c8>   DW_AT_decl_column : 27
    <c9>   DW_AT_type        : <0x7c>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xb7b): __pid_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 154
    <d4>   DW_AT_decl_column : 25
    <d5>   DW_AT_type        : <0x64>
 <1><d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0xa94): __clock_t
    <de>   DW_AT_decl_file   : 1
    <df>   DW_AT_decl_line   : 156
    <e0>   DW_AT_decl_column : 27
    <e1>   DW_AT_type        : <0xba>
 <1><e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0xd0d): __time_t
    <ea>   DW_AT_decl_file   : 1
    <eb>   DW_AT_decl_line   : 160
    <ec>   DW_AT_decl_column : 26
    <ed>   DW_AT_type        : <0xba>
 <1><f1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <f4>   DW_AT_type        : <0xf1>
 <1><f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indirect string, offset: 0x412): __syscall_slong_t
    <fd>   DW_AT_decl_file   : 1
    <fe>   DW_AT_decl_line   : 196
    <ff>   DW_AT_decl_column : 33
    <100>   DW_AT_type        : <0xba>
 <1><104>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <105>   DW_AT_byte_size   : 4
    <106>   DW_AT_type        : <0x10a>
 <1><10a>: Abbrev Number: 2 (DW_TAG_base_type)
    <10b>   DW_AT_byte_size   : 1
    <10c>   DW_AT_encoding    : 6	(signed char)
    <10d>   DW_AT_name        : (indirect string, offset: 0x45e): char
 <1><111>: Abbrev Number: 3 (DW_TAG_const_type)
    <112>   DW_AT_type        : <0x10a>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0x35a): uint8_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 24
    <11d>   DW_AT_decl_column : 19
    <11e>   DW_AT_type        : <0x45>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xc0b): uint16_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 25
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x58>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x105f): uint32_t
    <133>   DW_AT_decl_file   : 2
    <134>   DW_AT_decl_line   : 26
    <135>   DW_AT_decl_column : 20
    <136>   DW_AT_type        : <0x70>
 <1><13a>: Abbrev Number: 4 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0xeaa): uint64_t
    <13f>   DW_AT_decl_file   : 2
    <140>   DW_AT_decl_line   : 27
    <141>   DW_AT_decl_column : 20
    <142>   DW_AT_type        : <0x8f>
 <1><146>: Abbrev Number: 4 (DW_TAG_typedef)
    <147>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <14b>   DW_AT_decl_file   : 3
    <14c>   DW_AT_decl_line   : 209
    <14d>   DW_AT_decl_column : 23
    <14e>   DW_AT_type        : <0x2b>
 <1><152>: Abbrev Number: 3 (DW_TAG_const_type)
    <153>   DW_AT_type        : <0x146>
 <1><157>: Abbrev Number: 8 (DW_TAG_structure_type)
    <158>   DW_AT_name        : (indirect string, offset: 0xb93): timespec
    <15c>   DW_AT_byte_size   : 8
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 10
    <15f>   DW_AT_decl_column : 8
    <160>   DW_AT_sibling     : <0x183>
 <2><164>: Abbrev Number: 9 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x11ac): tv_sec
    <169>   DW_AT_decl_file   : 4
    <16a>   DW_AT_decl_line   : 12
    <16b>   DW_AT_decl_column : 12
    <16c>   DW_AT_type        : <0xe5>
    <170>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><173>: Abbrev Number: 9 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0xed7): tv_nsec
    <178>   DW_AT_decl_file   : 4
    <179>   DW_AT_decl_line   : 16
    <17a>   DW_AT_decl_column : 21
    <17b>   DW_AT_type        : <0xf8>
    <17f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><182>: Abbrev Number: 0
 <1><183>: Abbrev Number: 2 (DW_TAG_base_type)
    <184>   DW_AT_byte_size   : 12
    <185>   DW_AT_encoding    : 4	(float)
    <186>   DW_AT_name        : (indirect string, offset: 0xb50): long double
 <1><18a>: Abbrev Number: 2 (DW_TAG_base_type)
    <18b>   DW_AT_byte_size   : 16
    <18c>   DW_AT_encoding    : 4	(float)
    <18d>   DW_AT_name        : (indirect string, offset: 0x109a): _Float128
 <1><191>: Abbrev Number: 10 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x281): __environ
    <196>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 543
    <199>   DW_AT_decl_column : 15
    <19a>   DW_AT_type        : <0x1a0>
    <19e>   DW_AT_external    : 1
    <19f>   DW_AT_declaration : 1
 <1><1a0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1a1>   DW_AT_byte_size   : 4
    <1a2>   DW_AT_type        : <0x104>
 <1><1a6>: Abbrev Number: 10 (DW_TAG_variable)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x3b4): environ
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 545
    <1ae>   DW_AT_decl_column : 15
    <1af>   DW_AT_type        : <0x1a0>
    <1b3>   DW_AT_external    : 1
    <1b4>   DW_AT_declaration : 1
 <1><1b5>: Abbrev Number: 11 (DW_TAG_variable)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x10c9): optarg
    <1ba>   DW_AT_decl_file   : 6
    <1bb>   DW_AT_decl_line   : 36
    <1bc>   DW_AT_decl_column : 14
    <1bd>   DW_AT_type        : <0x104>
    <1c1>   DW_AT_external    : 1
    <1c2>   DW_AT_declaration : 1
 <1><1c3>: Abbrev Number: 11 (DW_TAG_variable)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x782): optind
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 50
    <1ca>   DW_AT_decl_column : 12
    <1cb>   DW_AT_type        : <0x64>
    <1cf>   DW_AT_external    : 1
    <1d0>   DW_AT_declaration : 1
 <1><1d1>: Abbrev Number: 11 (DW_TAG_variable)
    <1d2>   DW_AT_name        : (indirect string, offset: 0xcfc): opterr
    <1d6>   DW_AT_decl_file   : 6
    <1d7>   DW_AT_decl_line   : 55
    <1d8>   DW_AT_decl_column : 12
    <1d9>   DW_AT_type        : <0x64>
    <1dd>   DW_AT_external    : 1
    <1de>   DW_AT_declaration : 1
 <1><1df>: Abbrev Number: 11 (DW_TAG_variable)
    <1e0>   DW_AT_name        : (indirect string, offset: 0xbd0): optopt
    <1e4>   DW_AT_decl_file   : 6
    <1e5>   DW_AT_decl_line   : 59
    <1e6>   DW_AT_decl_column : 12
    <1e7>   DW_AT_type        : <0x64>
    <1eb>   DW_AT_external    : 1
    <1ec>   DW_AT_declaration : 1
 <1><1ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ee>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x111>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <1f4>   DW_AT_type        : <0x1ed>
 <1><1f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1f9>   DW_AT_byte_size   : 4
    <1fa>   DW_AT_type        : <0x1fe>
 <1><1fe>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1ff>: Abbrev Number: 8 (DW_TAG_structure_type)
    <200>   DW_AT_name        : (indirect string, offset: 0x362): _IO_FILE
    <204>   DW_AT_byte_size   : 148
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 49
    <207>   DW_AT_decl_column : 8
    <208>   DW_AT_sibling     : <0x3c0>
 <2><20c>: Abbrev Number: 9 (DW_TAG_member)
    <20d>   DW_AT_name        : (indirect string, offset: 0xa82): _flags
    <211>   DW_AT_decl_file   : 7
    <212>   DW_AT_decl_line   : 51
    <213>   DW_AT_decl_column : 7
    <214>   DW_AT_type        : <0x64>
    <218>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><21b>: Abbrev Number: 9 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x4fe): _IO_read_ptr
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 54
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x104>
    <227>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><22a>: Abbrev Number: 9 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0x1005): _IO_read_end
    <22f>   DW_AT_decl_file   : 7
    <230>   DW_AT_decl_line   : 55
    <231>   DW_AT_decl_column : 9
    <232>   DW_AT_type        : <0x104>
    <236>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><239>: Abbrev Number: 9 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x7f1): _IO_read_base
    <23e>   DW_AT_decl_file   : 7
    <23f>   DW_AT_decl_line   : 56
    <240>   DW_AT_decl_column : 9
    <241>   DW_AT_type        : <0x104>
    <245>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><248>: Abbrev Number: 9 (DW_TAG_member)
    <249>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <24d>   DW_AT_decl_file   : 7
    <24e>   DW_AT_decl_line   : 57
    <24f>   DW_AT_decl_column : 9
    <250>   DW_AT_type        : <0x104>
    <254>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><257>: Abbrev Number: 9 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0x1118): _IO_write_ptr
    <25c>   DW_AT_decl_file   : 7
    <25d>   DW_AT_decl_line   : 58
    <25e>   DW_AT_decl_column : 9
    <25f>   DW_AT_type        : <0x104>
    <263>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><266>: Abbrev Number: 9 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x945): _IO_write_end
    <26b>   DW_AT_decl_file   : 7
    <26c>   DW_AT_decl_line   : 59
    <26d>   DW_AT_decl_column : 9
    <26e>   DW_AT_type        : <0x104>
    <272>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><275>: Abbrev Number: 9 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x9c2): _IO_buf_base
    <27a>   DW_AT_decl_file   : 7
    <27b>   DW_AT_decl_line   : 60
    <27c>   DW_AT_decl_column : 9
    <27d>   DW_AT_type        : <0x104>
    <281>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><284>: Abbrev Number: 9 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe45): _IO_buf_end
    <289>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 61
    <28b>   DW_AT_decl_column : 9
    <28c>   DW_AT_type        : <0x104>
    <290>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><293>: Abbrev Number: 9 (DW_TAG_member)
    <294>   DW_AT_name        : (indirect string, offset: 0x1d8): _IO_save_base
    <298>   DW_AT_decl_file   : 7
    <299>   DW_AT_decl_line   : 64
    <29a>   DW_AT_decl_column : 9
    <29b>   DW_AT_type        : <0x104>
    <29f>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2a2>: Abbrev Number: 9 (DW_TAG_member)
    <2a3>   DW_AT_name        : (indirect string, offset: 0xd5f): _IO_backup_base
    <2a7>   DW_AT_decl_file   : 7
    <2a8>   DW_AT_decl_line   : 65
    <2a9>   DW_AT_decl_column : 9
    <2aa>   DW_AT_type        : <0x104>
    <2ae>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2b1>: Abbrev Number: 9 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 66
    <2b8>   DW_AT_decl_column : 9
    <2b9>   DW_AT_type        : <0x104>
    <2bd>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2c0>: Abbrev Number: 9 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x5a6): _markers
    <2c5>   DW_AT_decl_file   : 7
    <2c6>   DW_AT_decl_line   : 68
    <2c7>   DW_AT_decl_column : 22
    <2c8>   DW_AT_type        : <0x3da>
    <2cc>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2cf>: Abbrev Number: 9 (DW_TAG_member)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x21b): _chain
    <2d4>   DW_AT_decl_file   : 7
    <2d5>   DW_AT_decl_line   : 70
    <2d6>   DW_AT_decl_column : 20
    <2d7>   DW_AT_type        : <0x3e0>
    <2db>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2de>: Abbrev Number: 9 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0x1085): _fileno
    <2e3>   DW_AT_decl_file   : 7
    <2e4>   DW_AT_decl_line   : 72
    <2e5>   DW_AT_decl_column : 7
    <2e6>   DW_AT_type        : <0x64>
    <2ea>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2ed>: Abbrev Number: 9 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x7dd): _flags2
    <2f2>   DW_AT_decl_file   : 7
    <2f3>   DW_AT_decl_line   : 73
    <2f4>   DW_AT_decl_column : 7
    <2f5>   DW_AT_type        : <0x64>
    <2f9>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2fc>: Abbrev Number: 9 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x86c): _old_offset
    <301>   DW_AT_decl_file   : 7
    <302>   DW_AT_decl_line   : 74
    <303>   DW_AT_decl_column : 11
    <304>   DW_AT_type        : <0xae>
    <308>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><30b>: Abbrev Number: 9 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x249): _cur_column
    <310>   DW_AT_decl_file   : 7
    <311>   DW_AT_decl_line   : 77
    <312>   DW_AT_decl_column : 18
    <313>   DW_AT_type        : <0x24>
    <317>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><31a>: Abbrev Number: 9 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xefd): _vtable_offset
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 78
    <321>   DW_AT_decl_column : 15
    <322>   DW_AT_type        : <0x3e>
    <326>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><329>: Abbrev Number: 9 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0xd6f): _shortbuf
    <32e>   DW_AT_decl_file   : 7
    <32f>   DW_AT_decl_line   : 79
    <330>   DW_AT_decl_column : 8
    <331>   DW_AT_type        : <0x3e6>
    <335>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><338>: Abbrev Number: 9 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <33d>   DW_AT_decl_file   : 7
    <33e>   DW_AT_decl_line   : 81
    <33f>   DW_AT_decl_column : 15
    <340>   DW_AT_type        : <0x3f6>
    <344>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><347>: Abbrev Number: 9 (DW_TAG_member)
    <348>   DW_AT_name        : (indirect string, offset: 0x710): _offset
    <34c>   DW_AT_decl_file   : 7
    <34d>   DW_AT_decl_line   : 89
    <34e>   DW_AT_decl_column : 13
    <34f>   DW_AT_type        : <0xc1>
    <353>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><356>: Abbrev Number: 9 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0xae2): _codecvt
    <35b>   DW_AT_decl_file   : 7
    <35c>   DW_AT_decl_line   : 91
    <35d>   DW_AT_decl_column : 23
    <35e>   DW_AT_type        : <0x402>
    <362>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><365>: Abbrev Number: 9 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x10ad): _wide_data
    <36a>   DW_AT_decl_file   : 7
    <36b>   DW_AT_decl_line   : 92
    <36c>   DW_AT_decl_column : 25
    <36d>   DW_AT_type        : <0x40e>
    <371>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x3e2): _freeres_list
    <379>   DW_AT_decl_file   : 7
    <37a>   DW_AT_decl_line   : 93
    <37b>   DW_AT_decl_column : 20
    <37c>   DW_AT_type        : <0x3e0>
    <380>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><383>: Abbrev Number: 9 (DW_TAG_member)
    <384>   DW_AT_name        : (indirect string, offset: 0xcbc): _freeres_buf
    <388>   DW_AT_decl_file   : 7
    <389>   DW_AT_decl_line   : 94
    <38a>   DW_AT_decl_column : 9
    <38b>   DW_AT_type        : <0xf1>
    <38f>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><392>: Abbrev Number: 9 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0xa31): __pad5
    <397>   DW_AT_decl_file   : 7
    <398>   DW_AT_decl_line   : 95
    <399>   DW_AT_decl_column : 10
    <39a>   DW_AT_type        : <0x146>
    <39e>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3a1>: Abbrev Number: 9 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x268): _mode
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 96
    <3a8>   DW_AT_decl_column : 7
    <3a9>   DW_AT_type        : <0x64>
    <3ad>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3b0>: Abbrev Number: 9 (DW_TAG_member)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x80b): _unused2
    <3b5>   DW_AT_decl_file   : 7
    <3b6>   DW_AT_decl_line   : 98
    <3b7>   DW_AT_decl_column : 8
    <3b8>   DW_AT_type        : <0x414>
    <3bc>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3bf>: Abbrev Number: 0
 <1><3c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xb76): FILE
    <3c5>   DW_AT_decl_file   : 8
    <3c6>   DW_AT_decl_line   : 7
    <3c7>   DW_AT_decl_column : 25
    <3c8>   DW_AT_type        : <0x1ff>
 <1><3cc>: Abbrev Number: 13 (DW_TAG_typedef)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x49b): _IO_lock_t
    <3d1>   DW_AT_decl_file   : 7
    <3d2>   DW_AT_decl_line   : 43
    <3d3>   DW_AT_decl_column : 14
 <1><3d4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x30c): _IO_marker
    <3d9>   DW_AT_declaration : 1
 <1><3da>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3db>   DW_AT_byte_size   : 4
    <3dc>   DW_AT_type        : <0x3d4>
 <1><3e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e1>   DW_AT_byte_size   : 4
    <3e2>   DW_AT_type        : <0x1ff>
 <1><3e6>: Abbrev Number: 15 (DW_TAG_array_type)
    <3e7>   DW_AT_type        : <0x10a>
    <3eb>   DW_AT_sibling     : <0x3f6>
 <2><3ef>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3f0>   DW_AT_type        : <0x2b>
    <3f4>   DW_AT_upper_bound : 0
 <2><3f5>: Abbrev Number: 0
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x3cc>
 <1><3fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3fd>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <401>   DW_AT_declaration : 1
 <1><402>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <403>   DW_AT_byte_size   : 4
    <404>   DW_AT_type        : <0x3fc>
 <1><408>: Abbrev Number: 14 (DW_TAG_structure_type)
    <409>   DW_AT_name        : (indirect string, offset: 0x376): _IO_wide_data
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x408>
 <1><414>: Abbrev Number: 15 (DW_TAG_array_type)
    <415>   DW_AT_type        : <0x10a>
    <419>   DW_AT_sibling     : <0x424>
 <2><41d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <41e>   DW_AT_type        : <0x2b>
    <422>   DW_AT_upper_bound : 39
 <2><423>: Abbrev Number: 0
 <1><424>: Abbrev Number: 11 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x566): stdin
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 137
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x432>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <433>   DW_AT_byte_size   : 4
    <434>   DW_AT_type        : <0x3c0>
 <1><438>: Abbrev Number: 11 (DW_TAG_variable)
    <439>   DW_AT_name        : (indirect string, offset: 0x10f2): stdout
    <43d>   DW_AT_decl_file   : 9
    <43e>   DW_AT_decl_line   : 138
    <43f>   DW_AT_decl_column : 14
    <440>   DW_AT_type        : <0x432>
    <444>   DW_AT_external    : 1
    <445>   DW_AT_declaration : 1
 <1><446>: Abbrev Number: 11 (DW_TAG_variable)
    <447>   DW_AT_name        : (indirect string, offset: 0xe93): stderr
    <44b>   DW_AT_decl_file   : 9
    <44c>   DW_AT_decl_line   : 139
    <44d>   DW_AT_decl_column : 14
    <44e>   DW_AT_type        : <0x432>
    <452>   DW_AT_external    : 1
    <453>   DW_AT_declaration : 1
 <1><454>: Abbrev Number: 11 (DW_TAG_variable)
    <455>   DW_AT_name        : (indirect string, offset: 0x255): sys_nerr
    <459>   DW_AT_decl_file   : 10
    <45a>   DW_AT_decl_line   : 26
    <45b>   DW_AT_decl_column : 12
    <45c>   DW_AT_type        : <0x64>
    <460>   DW_AT_external    : 1
    <461>   DW_AT_declaration : 1
 <1><462>: Abbrev Number: 15 (DW_TAG_array_type)
    <463>   DW_AT_type        : <0x1f3>
    <467>   DW_AT_sibling     : <0x46d>
 <2><46b>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><46c>: Abbrev Number: 0
 <1><46d>: Abbrev Number: 3 (DW_TAG_const_type)
    <46e>   DW_AT_type        : <0x462>
 <1><472>: Abbrev Number: 11 (DW_TAG_variable)
    <473>   DW_AT_name        : (indirect string, offset: 0x575): sys_errlist
    <477>   DW_AT_decl_file   : 10
    <478>   DW_AT_decl_line   : 27
    <479>   DW_AT_decl_column : 26
    <47a>   DW_AT_type        : <0x46d>
    <47e>   DW_AT_external    : 1
    <47f>   DW_AT_declaration : 1
 <1><480>: Abbrev Number: 11 (DW_TAG_variable)
    <481>   DW_AT_name        : (indirect string, offset: 0x26e): _sys_nerr
    <485>   DW_AT_decl_file   : 10
    <486>   DW_AT_decl_line   : 30
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0x64>
    <48c>   DW_AT_external    : 1
    <48d>   DW_AT_declaration : 1
 <1><48e>: Abbrev Number: 11 (DW_TAG_variable)
    <48f>   DW_AT_name        : (indirect string, offset: 0xf0c): _sys_errlist
    <493>   DW_AT_decl_file   : 10
    <494>   DW_AT_decl_line   : 31
    <495>   DW_AT_decl_column : 26
    <496>   DW_AT_type        : <0x46d>
    <49a>   DW_AT_external    : 1
    <49b>   DW_AT_declaration : 1
 <1><49c>: Abbrev Number: 11 (DW_TAG_variable)
    <49d>   DW_AT_name        : (indirect string, offset: 0x6e9): program_invocation_name
    <4a1>   DW_AT_decl_file   : 11
    <4a2>   DW_AT_decl_line   : 45
    <4a3>   DW_AT_decl_column : 14
    <4a4>   DW_AT_type        : <0x104>
    <4a8>   DW_AT_external    : 1
    <4a9>   DW_AT_declaration : 1
 <1><4aa>: Abbrev Number: 11 (DW_TAG_variable)
    <4ab>   DW_AT_name        : (indirect string, offset: 0xc5a): program_invocation_short_name
    <4af>   DW_AT_decl_file   : 11
    <4b0>   DW_AT_decl_line   : 46
    <4b1>   DW_AT_decl_column : 14
    <4b2>   DW_AT_type        : <0x104>
    <4b6>   DW_AT_external    : 1
    <4b7>   DW_AT_declaration : 1
 <1><4b8>: Abbrev Number: 15 (DW_TAG_array_type)
    <4b9>   DW_AT_type        : <0x104>
    <4bd>   DW_AT_sibling     : <0x4c8>
 <2><4c1>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4c2>   DW_AT_type        : <0x2b>
    <4c6>   DW_AT_upper_bound : 1
 <2><4c7>: Abbrev Number: 0
 <1><4c8>: Abbrev Number: 11 (DW_TAG_variable)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x1c5): __tzname
    <4cd>   DW_AT_decl_file   : 12
    <4ce>   DW_AT_decl_line   : 159
    <4cf>   DW_AT_decl_column : 14
    <4d0>   DW_AT_type        : <0x4b8>
    <4d4>   DW_AT_external    : 1
    <4d5>   DW_AT_declaration : 1
 <1><4d6>: Abbrev Number: 11 (DW_TAG_variable)
    <4d7>   DW_AT_name        : (indirect string, offset: 0xf84): __daylight
    <4db>   DW_AT_decl_file   : 12
    <4dc>   DW_AT_decl_line   : 160
    <4dd>   DW_AT_decl_column : 12
    <4de>   DW_AT_type        : <0x64>
    <4e2>   DW_AT_external    : 1
    <4e3>   DW_AT_declaration : 1
 <1><4e4>: Abbrev Number: 11 (DW_TAG_variable)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x36b): __timezone
    <4e9>   DW_AT_decl_file   : 12
    <4ea>   DW_AT_decl_line   : 161
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0xba>
    <4f0>   DW_AT_external    : 1
    <4f1>   DW_AT_declaration : 1
 <1><4f2>: Abbrev Number: 11 (DW_TAG_variable)
    <4f3>   DW_AT_name        : (indirect string, offset: 0xa21): tzname
    <4f7>   DW_AT_decl_file   : 12
    <4f8>   DW_AT_decl_line   : 166
    <4f9>   DW_AT_decl_column : 14
    <4fa>   DW_AT_type        : <0x4b8>
    <4fe>   DW_AT_external    : 1
    <4ff>   DW_AT_declaration : 1
 <1><500>: Abbrev Number: 11 (DW_TAG_variable)
    <501>   DW_AT_name        : (indirect string, offset: 0x1162): daylight
    <505>   DW_AT_decl_file   : 12
    <506>   DW_AT_decl_line   : 174
    <507>   DW_AT_decl_column : 12
    <508>   DW_AT_type        : <0x64>
    <50c>   DW_AT_external    : 1
    <50d>   DW_AT_declaration : 1
 <1><50e>: Abbrev Number: 11 (DW_TAG_variable)
    <50f>   DW_AT_name        : (indirect string, offset: 0x4e0): timezone
    <513>   DW_AT_decl_file   : 12
    <514>   DW_AT_decl_line   : 175
    <515>   DW_AT_decl_column : 17
    <516>   DW_AT_type        : <0xba>
    <51a>   DW_AT_external    : 1
    <51b>   DW_AT_declaration : 1
 <1><51c>: Abbrev Number: 10 (DW_TAG_variable)
    <51d>   DW_AT_name        : (indirect string, offset: 0x102c): getdate_err
    <521>   DW_AT_decl_file   : 12
    <522>   DW_AT_decl_line   : 274
    <524>   DW_AT_decl_column : 12
    <525>   DW_AT_type        : <0x64>
    <529>   DW_AT_external    : 1
    <52a>   DW_AT_declaration : 1
 <1><52b>: Abbrev Number: 11 (DW_TAG_variable)
    <52c>   DW_AT_name        : (indirect string, offset: 0xa3d): debug_flag
    <530>   DW_AT_decl_file   : 13
    <531>   DW_AT_decl_line   : 20
    <532>   DW_AT_decl_column : 13
    <533>   DW_AT_type        : <0x539>
    <537>   DW_AT_external    : 1
    <538>   DW_AT_declaration : 1
 <1><539>: Abbrev Number: 2 (DW_TAG_base_type)
    <53a>   DW_AT_byte_size   : 1
    <53b>   DW_AT_encoding    : 2	(boolean)
    <53c>   DW_AT_name        : (indirect string, offset: 0x424): _Bool
 <1><540>: Abbrev Number: 3 (DW_TAG_const_type)
    <541>   DW_AT_type        : <0x539>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0xb26): __kernel_long_t
    <54a>   DW_AT_decl_file   : 14
    <54b>   DW_AT_decl_line   : 15
    <54c>   DW_AT_decl_column : 15
    <54d>   DW_AT_type        : <0xba>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x555): __kernel_ulong_t
    <556>   DW_AT_decl_file   : 14
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 23
    <559>   DW_AT_type        : <0x37>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x3f0): kernel_long_t
    <562>   DW_AT_decl_file   : 15
    <563>   DW_AT_decl_line   : 16
    <564>   DW_AT_decl_column : 25
    <565>   DW_AT_type        : <0x545>
 <1><569>: Abbrev Number: 4 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x8ea): kernel_ulong_t
    <56e>   DW_AT_decl_file   : 15
    <56f>   DW_AT_decl_line   : 17
    <570>   DW_AT_decl_column : 26
    <571>   DW_AT_type        : <0x551>
 <1><575>: Abbrev Number: 3 (DW_TAG_const_type)
    <576>   DW_AT_type        : <0x569>
 <1><57a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <57b>   DW_AT_name        : (indirect string, offset: 0xc78): list_item
    <57f>   DW_AT_byte_size   : 8
    <580>   DW_AT_decl_file   : 16
    <581>   DW_AT_decl_line   : 92
    <582>   DW_AT_decl_column : 8
    <583>   DW_AT_sibling     : <0x5a6>
 <2><587>: Abbrev Number: 9 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x11a7): prev
    <58c>   DW_AT_decl_file   : 16
    <58d>   DW_AT_decl_line   : 93
    <58e>   DW_AT_decl_column : 20
    <58f>   DW_AT_type        : <0x5a6>
    <593>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><596>: Abbrev Number: 9 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0x119d): next
    <59b>   DW_AT_decl_file   : 16
    <59c>   DW_AT_decl_line   : 94
    <59d>   DW_AT_decl_column : 20
    <59e>   DW_AT_type        : <0x5a6>
    <5a2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5a5>: Abbrev Number: 0
 <1><5a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a7>   DW_AT_byte_size   : 4
    <5a8>   DW_AT_type        : <0x57a>
 <1><5ac>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8b9): sysent
    <5b1>   DW_AT_byte_size   : 20
    <5b2>   DW_AT_decl_file   : 17
    <5b3>   DW_AT_decl_line   : 13
    <5b4>   DW_AT_decl_column : 16
    <5b5>   DW_AT_sibling     : <0x605>
 <2><5b9>: Abbrev Number: 9 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x1109): nargs
    <5be>   DW_AT_decl_file   : 17
    <5bf>   DW_AT_decl_line   : 14
    <5c0>   DW_AT_decl_column : 11
    <5c1>   DW_AT_type        : <0x2b>
    <5c5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x9d6): sys_flags
    <5cd>   DW_AT_decl_file   : 17
    <5ce>   DW_AT_decl_line   : 15
    <5cf>   DW_AT_decl_column : 6
    <5d0>   DW_AT_type        : <0x64>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5d7>: Abbrev Number: 18 (DW_TAG_member)
    <5d8>   DW_AT_name        : sen
    <5dc>   DW_AT_decl_file   : 17
    <5dd>   DW_AT_decl_line   : 16
    <5de>   DW_AT_decl_column : 6
    <5df>   DW_AT_type        : <0x64>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5e6>: Abbrev Number: 9 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x303): sys_func
    <5eb>   DW_AT_decl_file   : 17
    <5ec>   DW_AT_decl_line   : 17
    <5ed>   DW_AT_decl_column : 8
    <5ee>   DW_AT_type        : <0x87d>
    <5f2>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5f5>: Abbrev Number: 9 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x278): sys_name
    <5fa>   DW_AT_decl_file   : 17
    <5fb>   DW_AT_decl_line   : 18
    <5fc>   DW_AT_decl_column : 14
    <5fd>   DW_AT_type        : <0x1ed>
    <601>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <606>   DW_AT_prototyped  : 1
    <607>   DW_AT_type        : <0x64>
    <60b>   DW_AT_sibling     : <0x615>
 <2><60f>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <610>   DW_AT_type        : <0x615>
 <2><614>: Abbrev Number: 0
 <1><615>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <616>   DW_AT_byte_size   : 4
    <617>   DW_AT_type        : <0x620>
 <1><61b>: Abbrev Number: 3 (DW_TAG_const_type)
    <61c>   DW_AT_type        : <0x615>
 <1><620>: Abbrev Number: 21 (DW_TAG_structure_type)
    <621>   DW_AT_name        : tcb
    <625>   DW_AT_byte_size   : 220
    <626>   DW_AT_decl_file   : 18
    <627>   DW_AT_decl_line   : 262
    <629>   DW_AT_decl_column : 8
    <62a>   DW_AT_sibling     : <0x87d>
 <2><62e>: Abbrev Number: 22 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x4f8): flags
    <633>   DW_AT_decl_file   : 18
    <634>   DW_AT_decl_line   : 263
    <636>   DW_AT_decl_column : 6
    <637>   DW_AT_type        : <0x64>
    <63b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><63e>: Abbrev Number: 23 (DW_TAG_member)
    <63f>   DW_AT_name        : pid
    <643>   DW_AT_decl_file   : 18
    <644>   DW_AT_decl_line   : 264
    <646>   DW_AT_decl_column : 6
    <647>   DW_AT_type        : <0x64>
    <64b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><64e>: Abbrev Number: 22 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <653>   DW_AT_decl_file   : 18
    <654>   DW_AT_decl_line   : 265
    <656>   DW_AT_decl_column : 6
    <657>   DW_AT_type        : <0x64>
    <65b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><65e>: Abbrev Number: 22 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x398): currpers
    <663>   DW_AT_decl_file   : 18
    <664>   DW_AT_decl_line   : 267
    <666>   DW_AT_decl_column : 15
    <667>   DW_AT_type        : <0x2b>
    <66b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><66e>: Abbrev Number: 22 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0xbc8): u_error
    <673>   DW_AT_decl_file   : 18
    <674>   DW_AT_decl_line   : 269
    <676>   DW_AT_decl_column : 16
    <677>   DW_AT_type        : <0x37>
    <67b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><67e>: Abbrev Number: 22 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <683>   DW_AT_decl_file   : 18
    <684>   DW_AT_decl_line   : 270
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0x569>
    <68b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><68e>: Abbrev Number: 22 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0xc01): true_scno
    <693>   DW_AT_decl_file   : 18
    <694>   DW_AT_decl_line   : 271
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x569>
    <69b>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><69e>: Abbrev Number: 22 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x1af): u_arg
    <6a3>   DW_AT_decl_file   : 18
    <6a4>   DW_AT_decl_line   : 272
    <6a6>   DW_AT_decl_column : 17
    <6a7>   DW_AT_type        : <0x9ad>
    <6ab>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6ae>: Abbrev Number: 22 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x9ed): u_rval
    <6b3>   DW_AT_decl_file   : 18
    <6b4>   DW_AT_decl_line   : 273
    <6b6>   DW_AT_decl_column : 16
    <6b7>   DW_AT_type        : <0x55d>
    <6bb>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6be>: Abbrev Number: 22 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xb42): sys_func_rval
    <6c3>   DW_AT_decl_file   : 18
    <6c4>   DW_AT_decl_line   : 274
    <6c6>   DW_AT_decl_column : 6
    <6c7>   DW_AT_type        : <0x64>
    <6cb>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6ce>: Abbrev Number: 22 (DW_TAG_member)
    <6cf>   DW_AT_name        : (indirect string, offset: 0xd89): curcol
    <6d3>   DW_AT_decl_file   : 18
    <6d4>   DW_AT_decl_line   : 275
    <6d6>   DW_AT_decl_column : 6
    <6d7>   DW_AT_type        : <0x64>
    <6db>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6de>: Abbrev Number: 22 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0x9ff): outf
    <6e3>   DW_AT_decl_file   : 18
    <6e4>   DW_AT_decl_line   : 276
    <6e6>   DW_AT_decl_column : 8
    <6e7>   DW_AT_type        : <0x432>
    <6eb>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ee>: Abbrev Number: 22 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0xfc3): staged_output_data
    <6f3>   DW_AT_decl_file   : 18
    <6f4>   DW_AT_decl_line   : 277
    <6f6>   DW_AT_decl_column : 29
    <6f7>   DW_AT_type        : <0x9c3>
    <6fb>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6fe>: Abbrev Number: 22 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xb0d): auxstr
    <703>   DW_AT_decl_file   : 18
    <704>   DW_AT_decl_line   : 279
    <706>   DW_AT_decl_column : 14
    <707>   DW_AT_type        : <0x1ed>
    <70b>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><70e>: Abbrev Number: 22 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <713>   DW_AT_decl_file   : 18
    <714>   DW_AT_decl_line   : 280
    <716>   DW_AT_decl_column : 8
    <717>   DW_AT_type        : <0xf1>
    <71b>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><71e>: Abbrev Number: 22 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0xca5): _free_priv_data
    <723>   DW_AT_decl_file   : 18
    <724>   DW_AT_decl_line   : 281
    <726>   DW_AT_decl_column : 9
    <727>   DW_AT_type        : <0x9d5>
    <72b>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><72e>: Abbrev Number: 22 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <733>   DW_AT_decl_file   : 18
    <734>   DW_AT_decl_line   : 282
    <736>   DW_AT_decl_column : 23
    <737>   DW_AT_type        : <0x9db>
    <73b>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><73e>: Abbrev Number: 22 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <743>   DW_AT_decl_file   : 18
    <744>   DW_AT_decl_line   : 285
    <746>   DW_AT_decl_column : 23
    <747>   DW_AT_type        : <0x9db>
    <74b>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><74e>: Abbrev Number: 22 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x38d): inject_vec
    <753>   DW_AT_decl_file   : 18
    <754>   DW_AT_decl_line   : 286
    <756>   DW_AT_decl_column : 22
    <757>   DW_AT_type        : <0x9e6>
    <75b>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><75e>: Abbrev Number: 22 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x820): stime
    <763>   DW_AT_decl_file   : 18
    <764>   DW_AT_decl_line   : 287
    <766>   DW_AT_decl_column : 18
    <767>   DW_AT_type        : <0x157>
    <76b>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><76e>: Abbrev Number: 22 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x3a1): ltime
    <773>   DW_AT_decl_file   : 18
    <774>   DW_AT_decl_line   : 288
    <776>   DW_AT_decl_column : 18
    <777>   DW_AT_type        : <0x157>
    <77b>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><77e>: Abbrev Number: 22 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x10d0): atime
    <783>   DW_AT_decl_file   : 18
    <784>   DW_AT_decl_line   : 289
    <786>   DW_AT_decl_column : 18
    <787>   DW_AT_type        : <0x157>
    <78b>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><78e>: Abbrev Number: 22 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0x4e9): etime
    <793>   DW_AT_decl_file   : 18
    <794>   DW_AT_decl_line   : 290
    <796>   DW_AT_decl_column : 18
    <797>   DW_AT_type        : <0x157>
    <79b>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><79f>: Abbrev Number: 22 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0xe02): delay_expiration_time
    <7a4>   DW_AT_decl_file   : 18
    <7a5>   DW_AT_decl_line   : 291
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x157>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7b0>: Abbrev Number: 22 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7b5>   DW_AT_decl_file   : 18
    <7b6>   DW_AT_decl_line   : 298
    <7b8>   DW_AT_decl_column : 15
    <7b9>   DW_AT_type        : <0x2b>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7c1>: Abbrev Number: 22 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x1012): last_dirfd
    <7c6>   DW_AT_decl_file   : 18
    <7c7>   DW_AT_decl_line   : 301
    <7c9>   DW_AT_decl_column : 6
    <7ca>   DW_AT_type        : <0x64>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7d2>: Abbrev Number: 22 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x1038): mmap_cache
    <7d7>   DW_AT_decl_file   : 18
    <7d8>   DW_AT_decl_line   : 304
    <7da>   DW_AT_decl_column : 23
    <7db>   DW_AT_type        : <0xa02>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7e3>: Abbrev Number: 22 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xbd7): wait_data_idx
    <7e8>   DW_AT_decl_file   : 18
    <7e9>   DW_AT_decl_line   : 311
    <7eb>   DW_AT_decl_column : 9
    <7ec>   DW_AT_type        : <0x146>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7f4>: Abbrev Number: 22 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xb14): delayed_wait_data
    <7f9>   DW_AT_decl_file   : 18
    <7fa>   DW_AT_decl_line   : 313
    <7fc>   DW_AT_decl_column : 24
    <7fd>   DW_AT_type        : <0xa0e>
    <801>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><805>: Abbrev Number: 22 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xb89): wait_list
    <80a>   DW_AT_decl_file   : 18
    <80b>   DW_AT_decl_line   : 314
    <80d>   DW_AT_decl_column : 19
    <80e>   DW_AT_type        : <0x57a>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><816>: Abbrev Number: 22 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x701): vcpu_info_list
    <81b>   DW_AT_decl_file   : 18
    <81c>   DW_AT_decl_line   : 318
    <81e>   DW_AT_decl_column : 20
    <81f>   DW_AT_type        : <0xa1a>
    <823>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><827>: Abbrev Number: 22 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0xd54): unwind_ctx
    <82c>   DW_AT_decl_file   : 18
    <82d>   DW_AT_decl_line   : 322
    <82f>   DW_AT_decl_column : 8
    <830>   DW_AT_type        : <0xf1>
    <834>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><838>: Abbrev Number: 22 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x4d3): unwind_queue
    <83d>   DW_AT_decl_file   : 18
    <83e>   DW_AT_decl_line   : 323
    <840>   DW_AT_decl_column : 25
    <841>   DW_AT_type        : <0xa26>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><849>: Abbrev Number: 22 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <84e>   DW_AT_decl_file   : 18
    <84f>   DW_AT_decl_line   : 327
    <851>   DW_AT_decl_column : 7
    <852>   DW_AT_type        : <0xa2c>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><85a>: Abbrev Number: 22 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x22b): start_prc
    <85f>   DW_AT_decl_file   : 18
    <860>   DW_AT_decl_line   : 329
    <862>   DW_AT_decl_column : 16
    <863>   DW_AT_type        : <0x37>
    <867>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><86b>: Abbrev Number: 22 (DW_TAG_member)
    <86c>   DW_AT_name        : (indirect string, offset: 0x10a4): pre_comm
    <870>   DW_AT_decl_file   : 18
    <871>   DW_AT_decl_line   : 330
    <873>   DW_AT_decl_column : 7
    <874>   DW_AT_type        : <0xa2c>
    <878>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><87c>: Abbrev Number: 0
 <1><87d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <87e>   DW_AT_byte_size   : 4
    <87f>   DW_AT_type        : <0x605>
 <1><883>: Abbrev Number: 4 (DW_TAG_typedef)
    <884>   DW_AT_name        : (indirect string, offset: 0x547): struct_sysent
    <888>   DW_AT_decl_file   : 17
    <889>   DW_AT_decl_line   : 19
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x5ac>
 <1><88f>: Abbrev Number: 3 (DW_TAG_const_type)
    <890>   DW_AT_type        : <0x883>
 <1><894>: Abbrev Number: 11 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0xdee): current_personality
    <899>   DW_AT_decl_file   : 18
    <89a>   DW_AT_decl_line   : 158
    <89b>   DW_AT_decl_column : 17
    <89c>   DW_AT_type        : <0x2b>
    <8a0>   DW_AT_external    : 1
    <8a1>   DW_AT_declaration : 1
 <1><8a2>: Abbrev Number: 11 (DW_TAG_variable)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x851): current_wordsize
    <8a7>   DW_AT_decl_file   : 18
    <8a8>   DW_AT_decl_line   : 171
    <8a9>   DW_AT_decl_column : 17
    <8aa>   DW_AT_type        : <0x2b>
    <8ae>   DW_AT_external    : 1
    <8af>   DW_AT_declaration : 1
 <1><8b0>: Abbrev Number: 11 (DW_TAG_variable)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xaeb): current_klongsize
    <8b5>   DW_AT_decl_file   : 18
    <8b6>   DW_AT_decl_line   : 176
    <8b7>   DW_AT_decl_column : 17
    <8b8>   DW_AT_type        : <0x2b>
    <8bc>   DW_AT_external    : 1
    <8bd>   DW_AT_declaration : 1
 <1><8be>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xd2b): ioctlent
    <8c3>   DW_AT_byte_size   : 8
    <8c4>   DW_AT_decl_file   : 18
    <8c5>   DW_AT_decl_line   : 217
    <8c6>   DW_AT_decl_column : 16
    <8c7>   DW_AT_sibling     : <0x8ea>
 <2><8cb>: Abbrev Number: 9 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0xff6): symbol
    <8d0>   DW_AT_decl_file   : 18
    <8d1>   DW_AT_decl_line   : 218
    <8d2>   DW_AT_decl_column : 14
    <8d3>   DW_AT_type        : <0x1ed>
    <8d7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8da>: Abbrev Number: 9 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0xdad): code
    <8df>   DW_AT_decl_file   : 18
    <8e0>   DW_AT_decl_line   : 219
    <8e1>   DW_AT_decl_column : 15
    <8e2>   DW_AT_type        : <0x2b>
    <8e6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e9>: Abbrev Number: 0
 <1><8ea>: Abbrev Number: 4 (DW_TAG_typedef)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xcec): struct_ioctlent
    <8ef>   DW_AT_decl_file   : 18
    <8f0>   DW_AT_decl_line   : 220
    <8f1>   DW_AT_decl_column : 3
    <8f2>   DW_AT_type        : <0x8be>
 <1><8f6>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f7>   DW_AT_type        : <0x8ea>
 <1><8fb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x845): inject_data
    <900>   DW_AT_byte_size   : 10
    <901>   DW_AT_decl_file   : 18
    <902>   DW_AT_decl_line   : 241
    <903>   DW_AT_decl_column : 8
    <904>   DW_AT_sibling     : <0x963>
 <2><908>: Abbrev Number: 9 (DW_TAG_member)
    <909>   DW_AT_name        : (indirect string, offset: 0x4f8): flags
    <90d>   DW_AT_decl_file   : 18
    <90e>   DW_AT_decl_line   : 242
    <90f>   DW_AT_decl_column : 10
    <910>   DW_AT_type        : <0x116>
    <914>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><917>: Abbrev Number: 9 (DW_TAG_member)
    <918>   DW_AT_name        : (indirect string, offset: 0x977): signo
    <91c>   DW_AT_decl_file   : 18
    <91d>   DW_AT_decl_line   : 243
    <91e>   DW_AT_decl_column : 10
    <91f>   DW_AT_type        : <0x116>
    <923>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><926>: Abbrev Number: 9 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <92b>   DW_AT_decl_file   : 18
    <92c>   DW_AT_decl_line   : 244
    <92d>   DW_AT_decl_column : 11
    <92e>   DW_AT_type        : <0x122>
    <932>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><935>: Abbrev Number: 9 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0xd7f): delay_idx
    <93a>   DW_AT_decl_file   : 18
    <93b>   DW_AT_decl_line   : 245
    <93c>   DW_AT_decl_column : 11
    <93d>   DW_AT_type        : <0x122>
    <941>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><944>: Abbrev Number: 9 (DW_TAG_member)
    <945>   DW_AT_name        : (indirect string, offset: 0x598): poke_idx
    <949>   DW_AT_decl_file   : 18
    <94a>   DW_AT_decl_line   : 246
    <94b>   DW_AT_decl_column : 11
    <94c>   DW_AT_type        : <0x122>
    <950>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><953>: Abbrev Number: 9 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0x1a5): scno
    <958>   DW_AT_decl_file   : 18
    <959>   DW_AT_decl_line   : 247
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0x122>
    <95f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><962>: Abbrev Number: 0
 <1><963>: Abbrev Number: 8 (DW_TAG_structure_type)
    <964>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <968>   DW_AT_byte_size   : 16
    <969>   DW_AT_decl_file   : 18
    <96a>   DW_AT_decl_line   : 250
    <96b>   DW_AT_decl_column : 8
    <96c>   DW_AT_sibling     : <0x9ad>
 <2><970>: Abbrev Number: 9 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0xaaa): first
    <975>   DW_AT_decl_file   : 18
    <976>   DW_AT_decl_line   : 251
    <977>   DW_AT_decl_column : 11
    <978>   DW_AT_type        : <0x122>
    <97c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><97f>: Abbrev Number: 9 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0x11d9): last
    <984>   DW_AT_decl_file   : 18
    <985>   DW_AT_decl_line   : 252
    <986>   DW_AT_decl_column : 11
    <987>   DW_AT_type        : <0x122>
    <98b>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><98e>: Abbrev Number: 9 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x3a7): step
    <993>   DW_AT_decl_file   : 18
    <994>   DW_AT_decl_line   : 253
    <995>   DW_AT_decl_column : 11
    <996>   DW_AT_type        : <0x122>
    <99a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><99d>: Abbrev Number: 9 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x11a2): data
    <9a2>   DW_AT_decl_file   : 18
    <9a3>   DW_AT_decl_line   : 254
    <9a4>   DW_AT_decl_column : 21
    <9a5>   DW_AT_type        : <0x8fb>
    <9a9>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9ac>: Abbrev Number: 0
 <1><9ad>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ae>   DW_AT_type        : <0x569>
    <9b2>   DW_AT_sibling     : <0x9bd>
 <2><9b6>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9b7>   DW_AT_type        : <0x2b>
    <9bb>   DW_AT_upper_bound : 5
 <2><9bc>: Abbrev Number: 0
 <1><9bd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9be>   DW_AT_name        : (indirect string, offset: 0xfc3): staged_output_data
    <9c2>   DW_AT_declaration : 1
 <1><9c3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c4>   DW_AT_byte_size   : 4
    <9c5>   DW_AT_type        : <0x9bd>
 <1><9c9>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9ca>   DW_AT_prototyped  : 1
    <9cb>   DW_AT_sibling     : <0x9d5>
 <2><9cf>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9d0>   DW_AT_type        : <0xf1>
 <2><9d4>: Abbrev Number: 0
 <1><9d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d6>   DW_AT_byte_size   : 4
    <9d7>   DW_AT_type        : <0x9c9>
 <1><9db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9dc>   DW_AT_byte_size   : 4
    <9dd>   DW_AT_type        : <0x88f>
 <1><9e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <9e2>   DW_AT_type        : <0x9db>
 <1><9e6>: Abbrev Number: 15 (DW_TAG_array_type)
    <9e7>   DW_AT_type        : <0x9f6>
    <9eb>   DW_AT_sibling     : <0x9f6>
 <2><9ef>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9f0>   DW_AT_type        : <0x2b>
    <9f4>   DW_AT_upper_bound : 2
 <2><9f5>: Abbrev Number: 0
 <1><9f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f7>   DW_AT_byte_size   : 4
    <9f8>   DW_AT_type        : <0x963>
 <1><9fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <a01>   DW_AT_declaration : 1
 <1><a02>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a03>   DW_AT_byte_size   : 4
    <a04>   DW_AT_type        : <0x9fc>
 <1><a08>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a09>   DW_AT_name        : (indirect string, offset: 0x3d4): tcb_wait_data
    <a0d>   DW_AT_declaration : 1
 <1><a0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0f>   DW_AT_byte_size   : 4
    <a10>   DW_AT_type        : <0xa08>
 <1><a14>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a15>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <a19>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0xa14>
 <1><a20>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a21>   DW_AT_name        : (indirect string, offset: 0xfa7): unwind_queue_t
    <a25>   DW_AT_declaration : 1
 <1><a26>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_type        : <0xa20>
 <1><a2c>: Abbrev Number: 15 (DW_TAG_array_type)
    <a2d>   DW_AT_type        : <0x10a>
    <a31>   DW_AT_sibling     : <0xa3c>
 <2><a35>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a36>   DW_AT_type        : <0x2b>
    <a3a>   DW_AT_upper_bound : 15
 <2><a3b>: Abbrev Number: 0
 <1><a3c>: Abbrev Number: 10 (DW_TAG_variable)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xc14): stub_sysent
    <a41>   DW_AT_decl_file   : 18
    <a42>   DW_AT_decl_line   : 405
    <a44>   DW_AT_decl_column : 28
    <a45>   DW_AT_type        : <0x88f>
    <a49>   DW_AT_external    : 1
    <a4a>   DW_AT_declaration : 1
 <1><a4b>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x1185): xlat_type
    <a50>   DW_AT_encoding    : 7	(unsigned)
    <a51>   DW_AT_byte_size   : 4
    <a52>   DW_AT_type        : <0x2b>
    <a56>   DW_AT_decl_file   : 19
    <a57>   DW_AT_decl_line   : 13
    <a58>   DW_AT_decl_column : 6
    <a59>   DW_AT_sibling     : <0xa70>
 <2><a5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x2d3): XT_NORMAL
    <a62>   DW_AT_const_value : 0
 <2><a63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0xd03): XT_SORTED
    <a68>   DW_AT_const_value : 1
 <2><a69>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0xe7a): XT_INDEXED
    <a6e>   DW_AT_const_value : 2
 <2><a6f>: Abbrev Number: 0
 <1><a70>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a71>   DW_AT_name        : (indirect string, offset: 0xc4f): xlat_style
    <a75>   DW_AT_encoding    : 7	(unsigned)
    <a76>   DW_AT_byte_size   : 4
    <a77>   DW_AT_type        : <0x2b>
    <a7b>   DW_AT_decl_file   : 19
    <a7c>   DW_AT_decl_line   : 19
    <a7d>   DW_AT_decl_column : 6
    <a7e>   DW_AT_sibling     : <0xaad>
 <2><a82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a87>   DW_AT_const_value : 0
 <2><a88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0xc82): XLAT_STYLE_RAW
    <a8d>   DW_AT_const_value : 1
 <2><a8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x1150): XLAT_STYLE_ABBREV
    <a93>   DW_AT_const_value : 2
 <2><a94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x2f0): XLAT_STYLE_VERBOSE
    <a99>   DW_AT_const_value : 3
 <2><a9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a9f>   DW_AT_const_value : 0
 <2><aa0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <aa5>   DW_AT_const_value : 4
 <2><aa6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x11bf): XLAT_STYLE_FMT_D
    <aab>   DW_AT_const_value : 8
 <2><aac>: Abbrev Number: 0
 <1><aad>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aae>   DW_AT_name        : (indirect string, offset: 0x321): xlat_data
    <ab2>   DW_AT_byte_size   : 12
    <ab3>   DW_AT_decl_file   : 19
    <ab4>   DW_AT_decl_line   : 51
    <ab5>   DW_AT_decl_column : 8
    <ab6>   DW_AT_sibling     : <0xad9>
 <2><aba>: Abbrev Number: 18 (DW_TAG_member)
    <abb>   DW_AT_name        : val
    <abf>   DW_AT_decl_file   : 19
    <ac0>   DW_AT_decl_line   : 52
    <ac1>   DW_AT_decl_column : 11
    <ac2>   DW_AT_type        : <0x13a>
    <ac6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac9>: Abbrev Number: 18 (DW_TAG_member)
    <aca>   DW_AT_name        : str
    <ace>   DW_AT_decl_file   : 19
    <acf>   DW_AT_decl_line   : 53
    <ad0>   DW_AT_decl_column : 14
    <ad1>   DW_AT_type        : <0x1ed>
    <ad5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad8>: Abbrev Number: 0
 <1><ad9>: Abbrev Number: 3 (DW_TAG_const_type)
    <ada>   DW_AT_type        : <0xaad>
 <1><ade>: Abbrev Number: 8 (DW_TAG_structure_type)
    <adf>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ae3>   DW_AT_byte_size   : 24
    <ae4>   DW_AT_decl_file   : 19
    <ae5>   DW_AT_decl_line   : 56
    <ae6>   DW_AT_decl_column : 8
    <ae7>   DW_AT_sibling     : <0xb37>
 <2><aeb>: Abbrev Number: 9 (DW_TAG_member)
    <aec>   DW_AT_name        : (indirect string, offset: 0x11a2): data
    <af0>   DW_AT_decl_file   : 19
    <af1>   DW_AT_decl_line   : 57
    <af2>   DW_AT_decl_column : 26
    <af3>   DW_AT_type        : <0xb3c>
    <af7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><afa>: Abbrev Number: 9 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x8ad): flags_strsz
    <aff>   DW_AT_decl_file   : 19
    <b00>   DW_AT_decl_line   : 58
    <b01>   DW_AT_decl_column : 9
    <b02>   DW_AT_type        : <0x146>
    <b06>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b09>: Abbrev Number: 9 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0xbe5): size
    <b0e>   DW_AT_decl_file   : 19
    <b0f>   DW_AT_decl_line   : 59
    <b10>   DW_AT_decl_column : 11
    <b11>   DW_AT_type        : <0x12e>
    <b15>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b18>: Abbrev Number: 9 (DW_TAG_member)
    <b19>   DW_AT_name        : (indirect string, offset: 0x1aa): type
    <b1d>   DW_AT_decl_file   : 19
    <b1e>   DW_AT_decl_line   : 60
    <b1f>   DW_AT_decl_column : 17
    <b20>   DW_AT_type        : <0xa4b>
    <b24>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b27>: Abbrev Number: 9 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0x75f): flags_mask
    <b2c>   DW_AT_decl_file   : 19
    <b2d>   DW_AT_decl_line   : 61
    <b2e>   DW_AT_decl_column : 11
    <b2f>   DW_AT_type        : <0x13a>
    <b33>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b36>: Abbrev Number: 0
 <1><b37>: Abbrev Number: 3 (DW_TAG_const_type)
    <b38>   DW_AT_type        : <0xade>
 <1><b3c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b3d>   DW_AT_byte_size   : 4
    <b3e>   DW_AT_type        : <0xad9>
 <1><b42>: Abbrev Number: 15 (DW_TAG_array_type)
    <b43>   DW_AT_type        : <0xb37>
    <b47>   DW_AT_sibling     : <0xb4d>
 <2><b4b>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b4c>: Abbrev Number: 0
 <1><b4d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b4e>   DW_AT_type        : <0xb42>
 <1><b52>: Abbrev Number: 10 (DW_TAG_variable)
    <b53>   DW_AT_name        : (indirect string, offset: 0xeea): addrfams
    <b57>   DW_AT_decl_file   : 18
    <b58>   DW_AT_decl_line   : 411
    <b5a>   DW_AT_decl_column : 26
    <b5b>   DW_AT_type        : <0xb4d>
    <b5f>   DW_AT_external    : 1
    <b60>   DW_AT_declaration : 1
 <1><b61>: Abbrev Number: 10 (DW_TAG_variable)
    <b62>   DW_AT_name        : (indirect string, offset: 0xdbd): arp_hardware_types
    <b66>   DW_AT_decl_file   : 18
    <b67>   DW_AT_decl_line   : 412
    <b69>   DW_AT_decl_column : 26
    <b6a>   DW_AT_type        : <0xb4d>
    <b6e>   DW_AT_external    : 1
    <b6f>   DW_AT_declaration : 1
 <1><b70>: Abbrev Number: 10 (DW_TAG_variable)
    <b71>   DW_AT_name        : (indirect string, offset: 0x10d6): at_flags
    <b75>   DW_AT_decl_file   : 18
    <b76>   DW_AT_decl_line   : 413
    <b78>   DW_AT_decl_column : 26
    <b79>   DW_AT_type        : <0xb4d>
    <b7d>   DW_AT_external    : 1
    <b7e>   DW_AT_declaration : 1
 <1><b7f>: Abbrev Number: 10 (DW_TAG_variable)
    <b80>   DW_AT_name        : (indirect string, offset: 0x4b1): clocknames
    <b84>   DW_AT_decl_file   : 18
    <b85>   DW_AT_decl_line   : 414
    <b87>   DW_AT_decl_column : 26
    <b88>   DW_AT_type        : <0xb4d>
    <b8c>   DW_AT_external    : 1
    <b8d>   DW_AT_declaration : 1
 <1><b8e>: Abbrev Number: 10 (DW_TAG_variable)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x108d): dirent_types
    <b93>   DW_AT_decl_file   : 18
    <b94>   DW_AT_decl_line   : 415
    <b96>   DW_AT_decl_column : 26
    <b97>   DW_AT_type        : <0xb4d>
    <b9b>   DW_AT_external    : 1
    <b9c>   DW_AT_declaration : 1
 <1><b9d>: Abbrev Number: 10 (DW_TAG_variable)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x907): ethernet_protocols
    <ba2>   DW_AT_decl_file   : 18
    <ba3>   DW_AT_decl_line   : 416
    <ba5>   DW_AT_decl_column : 26
    <ba6>   DW_AT_type        : <0xb4d>
    <baa>   DW_AT_external    : 1
    <bab>   DW_AT_declaration : 1
 <1><bac>: Abbrev Number: 10 (DW_TAG_variable)
    <bad>   DW_AT_name        : (indirect string, offset: 0x5eb): inet_protocols
    <bb1>   DW_AT_decl_file   : 18
    <bb2>   DW_AT_decl_line   : 417
    <bb4>   DW_AT_decl_column : 26
    <bb5>   DW_AT_type        : <0xb4d>
    <bb9>   DW_AT_external    : 1
    <bba>   DW_AT_declaration : 1
 <1><bbb>: Abbrev Number: 10 (DW_TAG_variable)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x2c0): evdev_abs
    <bc0>   DW_AT_decl_file   : 18
    <bc1>   DW_AT_decl_line   : 418
    <bc3>   DW_AT_decl_column : 26
    <bc4>   DW_AT_type        : <0xb4d>
    <bc8>   DW_AT_external    : 1
    <bc9>   DW_AT_declaration : 1
 <1><bca>: Abbrev Number: 10 (DW_TAG_variable)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x754): audit_arch
    <bcf>   DW_AT_decl_file   : 18
    <bd0>   DW_AT_decl_line   : 419
    <bd2>   DW_AT_decl_column : 26
    <bd3>   DW_AT_type        : <0xb4d>
    <bd7>   DW_AT_external    : 1
    <bd8>   DW_AT_declaration : 1
 <1><bd9>: Abbrev Number: 10 (DW_TAG_variable)
    <bda>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bde>   DW_AT_decl_file   : 18
    <bdf>   DW_AT_decl_line   : 420
    <be1>   DW_AT_decl_column : 26
    <be2>   DW_AT_type        : <0xb4d>
    <be6>   DW_AT_external    : 1
    <be7>   DW_AT_declaration : 1
 <1><be8>: Abbrev Number: 10 (DW_TAG_variable)
    <be9>   DW_AT_name        : (indirect string, offset: 0x492): iffflags
    <bed>   DW_AT_decl_file   : 18
    <bee>   DW_AT_decl_line   : 421
    <bf0>   DW_AT_decl_column : 26
    <bf1>   DW_AT_type        : <0xb4d>
    <bf5>   DW_AT_external    : 1
    <bf6>   DW_AT_declaration : 1
 <1><bf7>: Abbrev Number: 10 (DW_TAG_variable)
    <bf8>   DW_AT_name        : (indirect string, offset: 0xc91): ip_type_of_services
    <bfc>   DW_AT_decl_file   : 18
    <bfd>   DW_AT_decl_line   : 422
    <bff>   DW_AT_decl_column : 26
    <c00>   DW_AT_type        : <0xb4d>
    <c04>   DW_AT_external    : 1
    <c05>   DW_AT_declaration : 1
 <1><c06>: Abbrev Number: 10 (DW_TAG_variable)
    <c07>   DW_AT_name        : (indirect string, offset: 0x6dd): ipc_private
    <c0b>   DW_AT_decl_file   : 18
    <c0c>   DW_AT_decl_line   : 423
    <c0e>   DW_AT_decl_column : 26
    <c0f>   DW_AT_type        : <0xb4d>
    <c13>   DW_AT_external    : 1
    <c14>   DW_AT_declaration : 1
 <1><c15>: Abbrev Number: 10 (DW_TAG_variable)
    <c16>   DW_AT_name        : (indirect string, offset: 0x317): msg_flags
    <c1a>   DW_AT_decl_file   : 18
    <c1b>   DW_AT_decl_line   : 424
    <c1d>   DW_AT_decl_column : 26
    <c1e>   DW_AT_type        : <0xb4d>
    <c22>   DW_AT_external    : 1
    <c23>   DW_AT_declaration : 1
 <1><c24>: Abbrev Number: 10 (DW_TAG_variable)
    <c25>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c29>   DW_AT_decl_file   : 18
    <c2a>   DW_AT_decl_line   : 425
    <c2c>   DW_AT_decl_column : 26
    <c2d>   DW_AT_type        : <0xb4d>
    <c31>   DW_AT_external    : 1
    <c32>   DW_AT_declaration : 1
 <1><c33>: Abbrev Number: 10 (DW_TAG_variable)
    <c34>   DW_AT_name        : (indirect string, offset: 0xfd6): nl_bridge_vlan_flags
    <c38>   DW_AT_decl_file   : 18
    <c39>   DW_AT_decl_line   : 426
    <c3b>   DW_AT_decl_column : 26
    <c3c>   DW_AT_type        : <0xb4d>
    <c40>   DW_AT_external    : 1
    <c41>   DW_AT_declaration : 1
 <1><c42>: Abbrev Number: 10 (DW_TAG_variable)
    <c43>   DW_AT_name        : (indirect string, offset: 0xe63): nl_netfilter_msg_types
    <c47>   DW_AT_decl_file   : 18
    <c48>   DW_AT_decl_line   : 427
    <c4a>   DW_AT_decl_column : 26
    <c4b>   DW_AT_type        : <0xb4d>
    <c4f>   DW_AT_external    : 1
    <c50>   DW_AT_declaration : 1
 <1><c51>: Abbrev Number: 10 (DW_TAG_variable)
    <c52>   DW_AT_name        : (indirect string, offset: 0x46d): nl_route_types
    <c56>   DW_AT_decl_file   : 18
    <c57>   DW_AT_decl_line   : 428
    <c59>   DW_AT_decl_column : 26
    <c5a>   DW_AT_type        : <0xb4d>
    <c5e>   DW_AT_external    : 1
    <c5f>   DW_AT_declaration : 1
 <1><c60>: Abbrev Number: 10 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0xf28): open_access_modes
    <c65>   DW_AT_decl_file   : 18
    <c66>   DW_AT_decl_line   : 429
    <c68>   DW_AT_decl_column : 26
    <c69>   DW_AT_type        : <0xb4d>
    <c6d>   DW_AT_external    : 1
    <c6e>   DW_AT_declaration : 1
 <1><c6f>: Abbrev Number: 10 (DW_TAG_variable)
    <c70>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c74>   DW_AT_decl_file   : 18
    <c75>   DW_AT_decl_line   : 430
    <c77>   DW_AT_decl_column : 26
    <c78>   DW_AT_type        : <0xb4d>
    <c7c>   DW_AT_external    : 1
    <c7d>   DW_AT_declaration : 1
 <1><c7e>: Abbrev Number: 10 (DW_TAG_variable)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xcc9): perf_type_id
    <c83>   DW_AT_decl_file   : 18
    <c84>   DW_AT_decl_line   : 431
    <c86>   DW_AT_decl_column : 26
    <c87>   DW_AT_type        : <0xb4d>
    <c8b>   DW_AT_external    : 1
    <c8c>   DW_AT_declaration : 1
 <1><c8d>: Abbrev Number: 10 (DW_TAG_variable)
    <c8e>   DW_AT_name        : (indirect string, offset: 0xef3): pollflags
    <c92>   DW_AT_decl_file   : 18
    <c93>   DW_AT_decl_line   : 432
    <c95>   DW_AT_decl_column : 26
    <c96>   DW_AT_type        : <0xb4d>
    <c9a>   DW_AT_external    : 1
    <c9b>   DW_AT_declaration : 1
 <1><c9c>: Abbrev Number: 10 (DW_TAG_variable)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x58c): ptrace_cmds
    <ca1>   DW_AT_decl_file   : 18
    <ca2>   DW_AT_decl_line   : 433
    <ca4>   DW_AT_decl_column : 26
    <ca5>   DW_AT_type        : <0xb4d>
    <ca9>   DW_AT_external    : 1
    <caa>   DW_AT_declaration : 1
 <1><cab>: Abbrev Number: 10 (DW_TAG_variable)
    <cac>   DW_AT_name        : (indirect string, offset: 0x836): resource_flags
    <cb0>   DW_AT_decl_file   : 18
    <cb1>   DW_AT_decl_line   : 434
    <cb3>   DW_AT_decl_column : 26
    <cb4>   DW_AT_type        : <0xb4d>
    <cb8>   DW_AT_external    : 1
    <cb9>   DW_AT_declaration : 1
 <1><cba>: Abbrev Number: 10 (DW_TAG_variable)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x296): route_nexthop_flags
    <cbf>   DW_AT_decl_file   : 18
    <cc0>   DW_AT_decl_line   : 435
    <cc2>   DW_AT_decl_column : 26
    <cc3>   DW_AT_type        : <0xb4d>
    <cc7>   DW_AT_external    : 1
    <cc8>   DW_AT_declaration : 1
 <1><cc9>: Abbrev Number: 10 (DW_TAG_variable)
    <cca>   DW_AT_name        : (indirect string, offset: 0xf51): routing_protocols
    <cce>   DW_AT_decl_file   : 18
    <ccf>   DW_AT_decl_line   : 436
    <cd1>   DW_AT_decl_column : 26
    <cd2>   DW_AT_type        : <0xb4d>
    <cd6>   DW_AT_external    : 1
    <cd7>   DW_AT_declaration : 1
 <1><cd8>: Abbrev Number: 10 (DW_TAG_variable)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x483): routing_scopes
    <cdd>   DW_AT_decl_file   : 18
    <cde>   DW_AT_decl_line   : 437
    <ce0>   DW_AT_decl_column : 26
    <ce1>   DW_AT_type        : <0xb4d>
    <ce5>   DW_AT_external    : 1
    <ce6>   DW_AT_declaration : 1
 <1><ce7>: Abbrev Number: 10 (DW_TAG_variable)
    <ce8>   DW_AT_name        : (indirect string, offset: 0xe51): routing_table_ids
    <cec>   DW_AT_decl_file   : 18
    <ced>   DW_AT_decl_line   : 438
    <cef>   DW_AT_decl_column : 26
    <cf0>   DW_AT_type        : <0xb4d>
    <cf4>   DW_AT_external    : 1
    <cf5>   DW_AT_declaration : 1
 <1><cf6>: Abbrev Number: 10 (DW_TAG_variable)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x6ba): routing_types
    <cfb>   DW_AT_decl_file   : 18
    <cfc>   DW_AT_decl_line   : 439
    <cfe>   DW_AT_decl_column : 26
    <cff>   DW_AT_type        : <0xb4d>
    <d03>   DW_AT_external    : 1
    <d04>   DW_AT_declaration : 1
 <1><d05>: Abbrev Number: 10 (DW_TAG_variable)
    <d06>   DW_AT_name        : (indirect string, offset: 0x1ce): rwf_flags
    <d0a>   DW_AT_decl_file   : 18
    <d0b>   DW_AT_decl_line   : 440
    <d0d>   DW_AT_decl_column : 26
    <d0e>   DW_AT_type        : <0xb4d>
    <d12>   DW_AT_external    : 1
    <d13>   DW_AT_declaration : 1
 <1><d14>: Abbrev Number: 10 (DW_TAG_variable)
    <d15>   DW_AT_name        : (indirect string, offset: 0x878): seccomp_filter_flags
    <d19>   DW_AT_decl_file   : 18
    <d1a>   DW_AT_decl_line   : 441
    <d1c>   DW_AT_decl_column : 26
    <d1d>   DW_AT_type        : <0xb4d>
    <d21>   DW_AT_external    : 1
    <d22>   DW_AT_declaration : 1
 <1><d23>: Abbrev Number: 10 (DW_TAG_variable)
    <d24>   DW_AT_name        : (indirect string, offset: 0x2dd): seccomp_ret_action
    <d28>   DW_AT_decl_file   : 18
    <d29>   DW_AT_decl_line   : 442
    <d2b>   DW_AT_decl_column : 26
    <d2c>   DW_AT_type        : <0xb4d>
    <d30>   DW_AT_external    : 1
    <d31>   DW_AT_declaration : 1
 <1><d32>: Abbrev Number: 10 (DW_TAG_variable)
    <d33>   DW_AT_name        : (indirect string, offset: 0x43e): setns_types
    <d37>   DW_AT_decl_file   : 18
    <d38>   DW_AT_decl_line   : 443
    <d3a>   DW_AT_decl_column : 26
    <d3b>   DW_AT_type        : <0xb4d>
    <d3f>   DW_AT_external    : 1
    <d40>   DW_AT_declaration : 1
 <1><d41>: Abbrev Number: 10 (DW_TAG_variable)
    <d42>   DW_AT_name        : (indirect string, offset: 0xedf): sg_io_info
    <d46>   DW_AT_decl_file   : 18
    <d47>   DW_AT_decl_line   : 444
    <d49>   DW_AT_decl_column : 26
    <d4a>   DW_AT_type        : <0xb4d>
    <d4e>   DW_AT_external    : 1
    <d4f>   DW_AT_declaration : 1
 <1><d50>: Abbrev Number: 10 (DW_TAG_variable)
    <d51>   DW_AT_name        : (indirect string, offset: 0xc28): socketlayers
    <d55>   DW_AT_decl_file   : 18
    <d56>   DW_AT_decl_line   : 445
    <d58>   DW_AT_decl_column : 26
    <d59>   DW_AT_type        : <0xb4d>
    <d5d>   DW_AT_external    : 1
    <d5e>   DW_AT_declaration : 1
 <1><d5f>: Abbrev Number: 10 (DW_TAG_variable)
    <d60>   DW_AT_name        : (indirect string, offset: 0xe3b): socktypes
    <d64>   DW_AT_decl_file   : 18
    <d65>   DW_AT_decl_line   : 446
    <d67>   DW_AT_decl_column : 26
    <d68>   DW_AT_type        : <0xb4d>
    <d6c>   DW_AT_external    : 1
    <d6d>   DW_AT_declaration : 1
 <1><d6e>: Abbrev Number: 10 (DW_TAG_variable)
    <d6f>   DW_AT_name        : (indirect string, offset: 0xafd): tcp_state_flags
    <d73>   DW_AT_decl_file   : 18
    <d74>   DW_AT_decl_line   : 447
    <d76>   DW_AT_decl_column : 26
    <d77>   DW_AT_type        : <0xb4d>
    <d7b>   DW_AT_external    : 1
    <d7c>   DW_AT_declaration : 1
 <1><d7d>: Abbrev Number: 10 (DW_TAG_variable)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x789): tcp_states
    <d82>   DW_AT_decl_file   : 18
    <d83>   DW_AT_decl_line   : 448
    <d85>   DW_AT_decl_column : 26
    <d86>   DW_AT_type        : <0xb4d>
    <d8a>   DW_AT_external    : 1
    <d8b>   DW_AT_declaration : 1
 <1><d8c>: Abbrev Number: 10 (DW_TAG_variable)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x1133): whence_codes
    <d91>   DW_AT_decl_file   : 18
    <d92>   DW_AT_decl_line   : 449
    <d94>   DW_AT_decl_column : 26
    <d95>   DW_AT_type        : <0xb4d>
    <d99>   DW_AT_external    : 1
    <d9a>   DW_AT_declaration : 1
 <1><d9b>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d9c>   DW_AT_encoding    : 7	(unsigned)
    <d9d>   DW_AT_byte_size   : 4
    <d9e>   DW_AT_type        : <0x2b>
    <da2>   DW_AT_decl_file   : 18
    <da3>   DW_AT_decl_line   : 510
    <da5>   DW_AT_decl_column : 14
    <da6>   DW_AT_sibling     : <0xdbd>
 <2><daa>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0x9f4): CFLAG_NONE
    <daf>   DW_AT_const_value : 0
 <2><db0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0x91a): CFLAG_ONLY_STATS
    <db5>   DW_AT_const_value : 1
 <2><db6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <db7>   DW_AT_name        : (indirect string, offset: 0xc35): CFLAG_BOTH
    <dbb>   DW_AT_const_value : 2
 <2><dbc>: Abbrev Number: 0
 <1><dbd>: Abbrev Number: 28 (DW_TAG_typedef)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x11de): cflag_t
    <dc2>   DW_AT_decl_file   : 18
    <dc3>   DW_AT_decl_line   : 514
    <dc5>   DW_AT_decl_column : 3
    <dc6>   DW_AT_type        : <0xd9b>
 <1><dca>: Abbrev Number: 10 (DW_TAG_variable)
    <dcb>   DW_AT_name        : (indirect string, offset: 0xd79): cflag
    <dcf>   DW_AT_decl_file   : 18
    <dd0>   DW_AT_decl_line   : 515
    <dd2>   DW_AT_decl_column : 16
    <dd3>   DW_AT_type        : <0xdbd>
    <dd7>   DW_AT_external    : 1
    <dd8>   DW_AT_declaration : 1
 <1><dd9>: Abbrev Number: 10 (DW_TAG_variable)
    <dda>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dde>   DW_AT_decl_file   : 18
    <ddf>   DW_AT_decl_line   : 516
    <de1>   DW_AT_decl_column : 13
    <de2>   DW_AT_type        : <0x539>
    <de6>   DW_AT_external    : 1
    <de7>   DW_AT_declaration : 1
 <1><de8>: Abbrev Number: 10 (DW_TAG_variable)
    <de9>   DW_AT_name        : (indirect string, offset: 0x7e5): Tflag_scale
    <ded>   DW_AT_decl_file   : 18
    <dee>   DW_AT_decl_line   : 517
    <df0>   DW_AT_decl_column : 12
    <df1>   DW_AT_type        : <0x64>
    <df5>   DW_AT_external    : 1
    <df6>   DW_AT_declaration : 1
 <1><df7>: Abbrev Number: 10 (DW_TAG_variable)
    <df8>   DW_AT_name        : (indirect string, offset: 0x88d): Tflag_width
    <dfc>   DW_AT_decl_file   : 18
    <dfd>   DW_AT_decl_line   : 518
    <dff>   DW_AT_decl_column : 12
    <e00>   DW_AT_type        : <0x64>
    <e04>   DW_AT_external    : 1
    <e05>   DW_AT_declaration : 1
 <1><e06>: Abbrev Number: 10 (DW_TAG_variable)
    <e07>   DW_AT_name        : (indirect string, offset: 0xeca): iflag
    <e0b>   DW_AT_decl_file   : 18
    <e0c>   DW_AT_decl_line   : 519
    <e0e>   DW_AT_decl_column : 13
    <e0f>   DW_AT_type        : <0x539>
    <e13>   DW_AT_external    : 1
    <e14>   DW_AT_declaration : 1
 <1><e15>: Abbrev Number: 10 (DW_TAG_variable)
    <e16>   DW_AT_name        : (indirect string, offset: 0x5cc): count_wallclock
    <e1a>   DW_AT_decl_file   : 18
    <e1b>   DW_AT_decl_line   : 520
    <e1d>   DW_AT_decl_column : 13
    <e1e>   DW_AT_type        : <0x539>
    <e22>   DW_AT_external    : 1
    <e23>   DW_AT_declaration : 1
 <1><e24>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e25>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e29>   DW_AT_byte_size   : 4
    <e2a>   DW_AT_decl_file   : 18
    <e2b>   DW_AT_decl_line   : 522
    <e2d>   DW_AT_decl_column : 8
    <e2e>   DW_AT_sibling     : <0xe43>
 <2><e32>: Abbrev Number: 22 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e37>   DW_AT_decl_file   : 18
    <e38>   DW_AT_decl_line   : 523
    <e3a>   DW_AT_decl_column : 14
    <e3b>   DW_AT_type        : <0x1ed>
    <e3f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e42>: Abbrev Number: 0
 <1><e43>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e44>   DW_AT_name        : (indirect string, offset: 0x794): path_set
    <e48>   DW_AT_byte_size   : 12
    <e49>   DW_AT_decl_file   : 18
    <e4a>   DW_AT_decl_line   : 527
    <e4c>   DW_AT_decl_column : 15
    <e4d>   DW_AT_sibling     : <0xe82>
 <2><e51>: Abbrev Number: 22 (DW_TAG_member)
    <e52>   DW_AT_name        : (indirect string, offset: 0x718): paths_selected
    <e56>   DW_AT_decl_file   : 18
    <e57>   DW_AT_decl_line   : 528
    <e59>   DW_AT_decl_column : 24
    <e5a>   DW_AT_type        : <0xe82>
    <e5e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e61>: Abbrev Number: 22 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x1126): num_selected
    <e66>   DW_AT_decl_file   : 18
    <e67>   DW_AT_decl_line   : 529
    <e69>   DW_AT_decl_column : 9
    <e6a>   DW_AT_type        : <0x146>
    <e6e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e71>: Abbrev Number: 22 (DW_TAG_member)
    <e72>   DW_AT_name        : (indirect string, offset: 0xbe5): size
    <e76>   DW_AT_decl_file   : 18
    <e77>   DW_AT_decl_line   : 530
    <e79>   DW_AT_decl_column : 9
    <e7a>   DW_AT_type        : <0x146>
    <e7e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e81>: Abbrev Number: 0
 <1><e82>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e83>   DW_AT_byte_size   : 4
    <e84>   DW_AT_type        : <0xe24>
 <1><e88>: Abbrev Number: 10 (DW_TAG_variable)
    <e89>   DW_AT_name        : (indirect string, offset: 0x1175): global_path_set
    <e8d>   DW_AT_decl_file   : 18
    <e8e>   DW_AT_decl_line   : 531
    <e90>   DW_AT_decl_column : 3
    <e91>   DW_AT_type        : <0xe43>
    <e95>   DW_AT_external    : 1
    <e96>   DW_AT_declaration : 1
 <1><e97>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e98>   DW_AT_name        : (indirect string, offset: 0x1068): xflag_opts
    <e9c>   DW_AT_encoding    : 7	(unsigned)
    <e9d>   DW_AT_byte_size   : 4
    <e9e>   DW_AT_type        : <0x2b>
    <ea2>   DW_AT_decl_file   : 18
    <ea3>   DW_AT_decl_line   : 533
    <ea5>   DW_AT_decl_column : 6
    <ea6>   DW_AT_sibling     : <0xec9>
 <2><eaa>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eab>   DW_AT_name        : (indirect string, offset: 0xa9e): HEXSTR_NONE
    <eaf>   DW_AT_const_value : 0
 <2><eb0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x10b8): HEXSTR_NON_ASCII
    <eb5>   DW_AT_const_value : 1
 <2><eb6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x962): HEXSTR_ALL
    <ebb>   DW_AT_const_value : 2
 <2><ebc>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x6a3): HEXSTR_NON_ASCII_CHARS
    <ec1>   DW_AT_const_value : 3
 <2><ec2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x1140): NUM_HEXSTR_OPTS
    <ec7>   DW_AT_const_value : 4
 <2><ec8>: Abbrev Number: 0
 <1><ec9>: Abbrev Number: 10 (DW_TAG_variable)
    <eca>   DW_AT_name        : (indirect string, offset: 0xea4): xflag
    <ece>   DW_AT_decl_file   : 18
    <ecf>   DW_AT_decl_line   : 546
    <ed1>   DW_AT_decl_column : 17
    <ed2>   DW_AT_type        : <0x2b>
    <ed6>   DW_AT_external    : 1
    <ed7>   DW_AT_declaration : 1
 <1><ed8>: Abbrev Number: 10 (DW_TAG_variable)
    <ed9>   DW_AT_name        : (indirect string, offset: 0xd34): followfork
    <edd>   DW_AT_decl_file   : 18
    <ede>   DW_AT_decl_line   : 547
    <ee0>   DW_AT_decl_column : 13
    <ee1>   DW_AT_type        : <0x539>
    <ee5>   DW_AT_external    : 1
    <ee6>   DW_AT_declaration : 1
 <1><ee7>: Abbrev Number: 10 (DW_TAG_variable)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x32b): output_separately
    <eec>   DW_AT_decl_file   : 18
    <eed>   DW_AT_decl_line   : 548
    <eef>   DW_AT_decl_column : 13
    <ef0>   DW_AT_type        : <0x539>
    <ef4>   DW_AT_external    : 1
    <ef5>   DW_AT_declaration : 1
 <1><ef6>: Abbrev Number: 10 (DW_TAG_variable)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x235): stack_trace_enabled
    <efb>   DW_AT_decl_file   : 18
    <efc>   DW_AT_decl_line   : 551
    <efe>   DW_AT_decl_column : 13
    <eff>   DW_AT_type        : <0x539>
    <f03>   DW_AT_external    : 1
    <f04>   DW_AT_declaration : 1
 <1><f05>: Abbrev Number: 10 (DW_TAG_variable)
    <f06>   DW_AT_name        : (indirect string, offset: 0x691): ptrace_setoptions
    <f0a>   DW_AT_decl_file   : 18
    <f0b>   DW_AT_decl_line   : 555
    <f0d>   DW_AT_decl_column : 17
    <f0e>   DW_AT_type        : <0x2b>
    <f12>   DW_AT_external    : 1
    <f13>   DW_AT_declaration : 1
 <1><f14>: Abbrev Number: 10 (DW_TAG_variable)
    <f15>   DW_AT_name        : (indirect string, offset: 0xa89): max_strlen
    <f19>   DW_AT_decl_file   : 18
    <f1a>   DW_AT_decl_line   : 556
    <f1c>   DW_AT_decl_column : 17
    <f1d>   DW_AT_type        : <0x2b>
    <f21>   DW_AT_external    : 1
    <f22>   DW_AT_declaration : 1
 <1><f23>: Abbrev Number: 10 (DW_TAG_variable)
    <f24>   DW_AT_name        : (indirect string, offset: 0xad7): os_release
    <f28>   DW_AT_decl_file   : 18
    <f29>   DW_AT_decl_line   : 557
    <f2b>   DW_AT_decl_column : 17
    <f2c>   DW_AT_type        : <0x2b>
    <f30>   DW_AT_external    : 1
    <f31>   DW_AT_declaration : 1
 <1><f32>: Abbrev Number: 10 (DW_TAG_variable)
    <f33>   DW_AT_name        : (indirect string, offset: 0x727): xlat_verbosity
    <f37>   DW_AT_decl_file   : 18
    <f38>   DW_AT_decl_line   : 919
    <f3a>   DW_AT_decl_column : 24
    <f3b>   DW_AT_type        : <0xa70>
    <f3f>   DW_AT_external    : 1
    <f40>   DW_AT_declaration : 1
 <1><f41>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f42>   DW_AT_name        : (indirect string, offset: 0x5af): xlat_style_private_flag_bits
    <f46>   DW_AT_encoding    : 7	(unsigned)
    <f47>   DW_AT_byte_size   : 4
    <f48>   DW_AT_type        : <0x2b>
    <f4c>   DW_AT_decl_file   : 18
    <f4d>   DW_AT_decl_line   : 939
    <f4f>   DW_AT_decl_column : 6
    <f50>   DW_AT_sibling     : <0xf6d>
 <2><f54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0x2aa): PAF_PRINT_INDICES_BIT
    <f59>   DW_AT_const_value : 5
 <2><f5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0xb9c): PAF_ARRAY_TRUNCATED_BIT
    <f5f>   DW_AT_const_value : 6
 <2><f60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0x3fe): PXF_DEFAULT_STR_BIT
    <f65>   DW_AT_const_value : 7
 <2><f66>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f67>   DW_AT_name        : (indirect string, offset: 0xd16): SPFF_AUXSTR_MODE_BIT
    <f6b>   DW_AT_const_value : 8
 <2><f6c>: Abbrev Number: 0
 <1><f6d>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f6e>   DW_AT_name        : (indirect string, offset: 0xdd0): find_xlat_flag_bits
    <f72>   DW_AT_encoding    : 7	(unsigned)
    <f73>   DW_AT_byte_size   : 4
    <f74>   DW_AT_type        : <0x2b>
    <f78>   DW_AT_decl_file   : 18
    <f79>   DW_AT_decl_line   : 1443
    <f7b>   DW_AT_decl_column : 6
    <f7c>   DW_AT_sibling     : <0xf87>
 <2><f80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f81>   DW_AT_name        : (indirect string, offset: 0x9ab): FXL_CASE_SENSITIVE_BIT
    <f85>   DW_AT_const_value : 0
 <2><f86>: Abbrev Number: 0
 <1><f87>: Abbrev Number: 10 (DW_TAG_variable)
    <f88>   DW_AT_name        : (indirect string, offset: 0xa52): printing_tcp
    <f8c>   DW_AT_decl_file   : 18
    <f8d>   DW_AT_decl_line   : 1689
    <f8f>   DW_AT_decl_column : 20
    <f90>   DW_AT_type        : <0x615>
    <f94>   DW_AT_external    : 1
    <f95>   DW_AT_declaration : 1
 <1><f96>: Abbrev Number: 10 (DW_TAG_variable)
    <f97>   DW_AT_name        : (indirect string, offset: 0x56c): errnoent
    <f9b>   DW_AT_decl_file   : 18
    <f9c>   DW_AT_decl_line   : 1887
    <f9e>   DW_AT_decl_column : 26
    <f9f>   DW_AT_type        : <0x46d>
    <fa3>   DW_AT_external    : 1
    <fa4>   DW_AT_declaration : 1
 <1><fa5>: Abbrev Number: 10 (DW_TAG_variable)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x899): signalent
    <faa>   DW_AT_decl_file   : 18
    <fab>   DW_AT_decl_line   : 1888
    <fad>   DW_AT_decl_column : 26
    <fae>   DW_AT_type        : <0x46d>
    <fb2>   DW_AT_external    : 1
    <fb3>   DW_AT_declaration : 1
 <1><fb4>: Abbrev Number: 10 (DW_TAG_variable)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xf20): nerrnos
    <fb9>   DW_AT_decl_file   : 18
    <fba>   DW_AT_decl_line   : 1889
    <fbc>   DW_AT_decl_column : 27
    <fbd>   DW_AT_type        : <0x32>
    <fc1>   DW_AT_external    : 1
    <fc2>   DW_AT_declaration : 1
 <1><fc3>: Abbrev Number: 10 (DW_TAG_variable)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x110f): nsignals
    <fc8>   DW_AT_decl_file   : 18
    <fc9>   DW_AT_decl_line   : 1890
    <fcb>   DW_AT_decl_column : 27
    <fcc>   DW_AT_type        : <0x32>
    <fd0>   DW_AT_external    : 1
    <fd1>   DW_AT_declaration : 1
 <1><fd2>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd3>   DW_AT_type        : <0x88f>
    <fd7>   DW_AT_sibling     : <0xfdd>
 <2><fdb>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fdc>: Abbrev Number: 0
 <1><fdd>: Abbrev Number: 3 (DW_TAG_const_type)
    <fde>   DW_AT_type        : <0xfd2>
 <1><fe2>: Abbrev Number: 10 (DW_TAG_variable)
    <fe3>   DW_AT_name        : (indirect string, offset: 0xd90): sysent0
    <fe7>   DW_AT_decl_file   : 18
    <fe8>   DW_AT_decl_line   : 1892
    <fea>   DW_AT_decl_column : 28
    <feb>   DW_AT_type        : <0xfdd>
    <fef>   DW_AT_external    : 1
    <ff0>   DW_AT_declaration : 1
 <1><ff1>: Abbrev Number: 15 (DW_TAG_array_type)
    <ff2>   DW_AT_type        : <0x8f6>
    <ff6>   DW_AT_sibling     : <0xffc>
 <2><ffa>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ffb>: Abbrev Number: 0
 <1><ffc>: Abbrev Number: 3 (DW_TAG_const_type)
    <ffd>   DW_AT_type        : <0xff1>
 <1><1001>: Abbrev Number: 10 (DW_TAG_variable)
    <1002>   DW_AT_name        : (indirect string, offset: 0x116b): ioctlent0
    <1006>   DW_AT_decl_file   : 18
    <1007>   DW_AT_decl_line   : 1893
    <1009>   DW_AT_decl_column : 30
    <100a>   DW_AT_type        : <0xffc>
    <100e>   DW_AT_external    : 1
    <100f>   DW_AT_declaration : 1
 <1><1010>: Abbrev Number: 10 (DW_TAG_variable)
    <1011>   DW_AT_name        : (indirect string, offset: 0x1073): personality_names
    <1015>   DW_AT_decl_file   : 18
    <1016>   DW_AT_decl_line   : 1895
    <1018>   DW_AT_decl_column : 26
    <1019>   DW_AT_type        : <0x46d>
    <101d>   DW_AT_external    : 1
    <101e>   DW_AT_declaration : 1
 <1><101f>: Abbrev Number: 10 (DW_TAG_variable)
    <1020>   DW_AT_name        : (indirect string, offset: 0x8b9): sysent
    <1024>   DW_AT_decl_file   : 18
    <1025>   DW_AT_decl_line   : 1898
    <1027>   DW_AT_decl_column : 29
    <1028>   DW_AT_type        : <0x9db>
    <102c>   DW_AT_external    : 1
    <102d>   DW_AT_declaration : 1
 <1><102e>: Abbrev Number: 10 (DW_TAG_variable)
    <102f>   DW_AT_name        : (indirect string, offset: 0xd2b): ioctlent
    <1033>   DW_AT_decl_file   : 18
    <1034>   DW_AT_decl_line   : 1899
    <1036>   DW_AT_decl_column : 31
    <1037>   DW_AT_type        : <0x103d>
    <103b>   DW_AT_external    : 1
    <103c>   DW_AT_declaration : 1
 <1><103d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <103e>   DW_AT_byte_size   : 4
    <103f>   DW_AT_type        : <0x8f6>
 <1><1043>: Abbrev Number: 10 (DW_TAG_variable)
    <1044>   DW_AT_name        : (indirect string, offset: 0x8a3): nsyscalls
    <1048>   DW_AT_decl_file   : 18
    <1049>   DW_AT_decl_line   : 1905
    <104b>   DW_AT_decl_column : 17
    <104c>   DW_AT_type        : <0x2b>
    <1050>   DW_AT_external    : 1
    <1051>   DW_AT_declaration : 1
 <1><1052>: Abbrev Number: 10 (DW_TAG_variable)
    <1053>   DW_AT_name        : (indirect string, offset: 0xf46): nioctlents
    <1057>   DW_AT_decl_file   : 18
    <1058>   DW_AT_decl_line   : 1906
    <105a>   DW_AT_decl_column : 17
    <105b>   DW_AT_type        : <0x2b>
    <105f>   DW_AT_external    : 1
    <1060>   DW_AT_declaration : 1
 <1><1061>: Abbrev Number: 15 (DW_TAG_array_type)
    <1062>   DW_AT_type        : <0x32>
    <1066>   DW_AT_sibling     : <0x1071>
 <2><106a>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <106b>   DW_AT_type        : <0x2b>
    <106f>   DW_AT_upper_bound : 2
 <2><1070>: Abbrev Number: 0
 <1><1071>: Abbrev Number: 3 (DW_TAG_const_type)
    <1072>   DW_AT_type        : <0x1061>
 <1><1076>: Abbrev Number: 10 (DW_TAG_variable)
    <1077>   DW_AT_name        : (indirect string, offset: 0xfb6): nsyscall_vec
    <107b>   DW_AT_decl_file   : 18
    <107c>   DW_AT_decl_line   : 1908
    <107e>   DW_AT_decl_column : 27
    <107f>   DW_AT_type        : <0x1071>
    <1083>   DW_AT_external    : 1
    <1084>   DW_AT_declaration : 1
 <1><1085>: Abbrev Number: 15 (DW_TAG_array_type)
    <1086>   DW_AT_type        : <0x9e1>
    <108a>   DW_AT_sibling     : <0x1095>
 <2><108e>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <108f>   DW_AT_type        : <0x2b>
    <1093>   DW_AT_upper_bound : 2
 <2><1094>: Abbrev Number: 0
 <1><1095>: Abbrev Number: 3 (DW_TAG_const_type)
    <1096>   DW_AT_type        : <0x1085>
 <1><109a>: Abbrev Number: 10 (DW_TAG_variable)
    <109b>   DW_AT_name        : (indirect string, offset: 0x7d2): sysent_vec
    <109f>   DW_AT_decl_file   : 18
    <10a0>   DW_AT_decl_line   : 1909
    <10a2>   DW_AT_decl_column : 35
    <10a3>   DW_AT_type        : <0x1095>
    <10a7>   DW_AT_external    : 1
    <10a8>   DW_AT_declaration : 1
 <1><10a9>: Abbrev Number: 10 (DW_TAG_variable)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x38d): inject_vec
    <10ae>   DW_AT_decl_file   : 18
    <10af>   DW_AT_decl_line   : 1910
    <10b1>   DW_AT_decl_column : 28
    <10b2>   DW_AT_type        : <0x9e6>
    <10b6>   DW_AT_external    : 1
    <10b7>   DW_AT_declaration : 1
 <1><10b8>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10b9>   DW_AT_name        : (indirect string, offset: 0xe2e): audit_arch_t
    <10bd>   DW_AT_byte_size   : 8
    <10be>   DW_AT_decl_file   : 18
    <10bf>   DW_AT_decl_line   : 1912
    <10c1>   DW_AT_decl_column : 8
    <10c2>   DW_AT_sibling     : <0x10e7>
 <2><10c6>: Abbrev Number: 22 (DW_TAG_member)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x5a1): arch
    <10cb>   DW_AT_decl_file   : 18
    <10cc>   DW_AT_decl_line   : 1913
    <10ce>   DW_AT_decl_column : 15
    <10cf>   DW_AT_type        : <0x2b>
    <10d3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d6>: Abbrev Number: 22 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0xa38): flag
    <10db>   DW_AT_decl_file   : 18
    <10dc>   DW_AT_decl_line   : 1914
    <10de>   DW_AT_decl_column : 15
    <10df>   DW_AT_type        : <0x2b>
    <10e3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e6>: Abbrev Number: 0
 <1><10e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e8>   DW_AT_type        : <0x10b8>
 <1><10ec>: Abbrev Number: 15 (DW_TAG_array_type)
    <10ed>   DW_AT_type        : <0x10e7>
    <10f1>   DW_AT_sibling     : <0x10fc>
 <2><10f5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10f6>   DW_AT_type        : <0x2b>
    <10fa>   DW_AT_upper_bound : 2
 <2><10fb>: Abbrev Number: 0
 <1><10fc>: Abbrev Number: 3 (DW_TAG_const_type)
    <10fd>   DW_AT_type        : <0x10ec>
 <1><1101>: Abbrev Number: 10 (DW_TAG_variable)
    <1102>   DW_AT_name        : (indirect string, offset: 0x99c): audit_arch_vec
    <1106>   DW_AT_decl_file   : 18
    <1107>   DW_AT_decl_line   : 1917
    <1109>   DW_AT_decl_column : 34
    <110a>   DW_AT_type        : <0x10fc>
    <110e>   DW_AT_external    : 1
    <110f>   DW_AT_declaration : 1
 <1><1110>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1111>   DW_AT_byte_size   : 180
    <1112>   DW_AT_decl_file   : 20
    <1113>   DW_AT_decl_line   : 2
    <1114>   DW_AT_decl_column : 9
    <1115>   DW_AT_sibling     : <0x13ca>
 <2><1119>: Abbrev Number: 9 (DW_TAG_member)
    <111a>   DW_AT_name        : (indirect string, offset: 0x1e6): block_ioctl
    <111e>   DW_AT_decl_file   : 20
    <111f>   DW_AT_decl_line   : 3
    <1120>   DW_AT_decl_column : 8
    <1121>   DW_AT_type        : <0x13e4>
    <1125>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1128>: Abbrev Number: 9 (DW_TAG_member)
    <1129>   DW_AT_name        : (indirect string, offset: 0xb36): btrfs_ioctl
    <112d>   DW_AT_decl_file   : 20
    <112e>   DW_AT_decl_line   : 6
    <112f>   DW_AT_decl_column : 8
    <1130>   DW_AT_type        : <0x13e4>
    <1134>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1137>: Abbrev Number: 9 (DW_TAG_member)
    <1138>   DW_AT_name        : (indirect string, offset: 0x76a): evdev_write_ioctl_mpers
    <113c>   DW_AT_decl_file   : 20
    <113d>   DW_AT_decl_line   : 9
    <113e>   DW_AT_decl_column : 8
    <113f>   DW_AT_type        : <0x13e4>
    <1143>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1146>: Abbrev Number: 9 (DW_TAG_member)
    <1147>   DW_AT_name        : (indirect string, offset: 0x736): get_sock_fprog_size
    <114b>   DW_AT_decl_file   : 20
    <114c>   DW_AT_decl_line   : 12
    <114d>   DW_AT_decl_column : 17
    <114e>   DW_AT_type        : <0x13f0>
    <1152>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1155>: Abbrev Number: 9 (DW_TAG_member)
    <1156>   DW_AT_name        : (indirect string, offset: 0x1b5): fetch_bpf_fprog
    <115a>   DW_AT_decl_file   : 20
    <115b>   DW_AT_decl_line   : 15
    <115c>   DW_AT_decl_column : 10
    <115d>   DW_AT_type        : <0x1410>
    <1161>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1164>: Abbrev Number: 9 (DW_TAG_member)
    <1165>   DW_AT_name        : (indirect string, offset: 0x989): fetch_struct_flock
    <1169>   DW_AT_decl_file   : 20
    <116a>   DW_AT_decl_line   : 18
    <116b>   DW_AT_decl_column : 10
    <116c>   DW_AT_type        : <0x1410>
