Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x173e (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5c4): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xa64): mpers-m32/struct_statfs.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa07): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b7): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1015): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x95e): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdde): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x486): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x864): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xec7): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x894): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x76f): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb68): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb9e): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2d6): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcea): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 6 (DW_TAG_array_type)
    <c2>   DW_AT_type        : <0x64>
    <c6>   DW_AT_sibling     : <0xd1>
 <2><ca>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <cb>   DW_AT_type        : <0x2b>
    <cf>   DW_AT_upper_bound : 1
 <2><d0>: Abbrev Number: 0
 <1><d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0xc5f): __time_t
    <d6>   DW_AT_decl_file   : 1
    <d7>   DW_AT_decl_line   : 160
    <d8>   DW_AT_decl_column : 26
    <d9>   DW_AT_type        : <0xae>
 <1><dd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <de>   DW_AT_byte_size   : 4
 <1><df>: Abbrev Number: 3 (DW_TAG_const_type)
    <e0>   DW_AT_type        : <0xdd>
 <1><e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5>   DW_AT_name        : (indirect string, offset: 0x403): __syscall_slong_t
    <e9>   DW_AT_decl_file   : 1
    <ea>   DW_AT_decl_line   : 196
    <eb>   DW_AT_decl_column : 33
    <ec>   DW_AT_type        : <0xae>
 <1><f0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <f1>   DW_AT_byte_size   : 4
    <f2>   DW_AT_type        : <0xf6>
 <1><f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <f7>   DW_AT_byte_size   : 1
    <f8>   DW_AT_encoding    : 6	(signed char)
    <f9>   DW_AT_name        : (indirect string, offset: 0x44f): char
 <1><fd>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe>   DW_AT_type        : <0xf6>
 <1><102>: Abbrev Number: 4 (DW_TAG_typedef)
    <103>   DW_AT_name        : (indirect string, offset: 0x366): uint8_t
    <107>   DW_AT_decl_file   : 2
    <108>   DW_AT_decl_line   : 24
    <109>   DW_AT_decl_column : 19
    <10a>   DW_AT_type        : <0x45>
 <1><10e>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f>   DW_AT_name        : (indirect string, offset: 0xb89): uint16_t
    <113>   DW_AT_decl_file   : 2
    <114>   DW_AT_decl_line   : 25
    <115>   DW_AT_decl_column : 20
    <116>   DW_AT_type        : <0x58>
 <1><11a>: Abbrev Number: 4 (DW_TAG_typedef)
    <11b>   DW_AT_name        : (indirect string, offset: 0xf6f): uint32_t
    <11f>   DW_AT_decl_file   : 2
    <120>   DW_AT_decl_line   : 26
    <121>   DW_AT_decl_column : 20
    <122>   DW_AT_type        : <0x70>
 <1><126>: Abbrev Number: 4 (DW_TAG_typedef)
    <127>   DW_AT_name        : (indirect string, offset: 0xdee): uint64_t
    <12b>   DW_AT_decl_file   : 2
    <12c>   DW_AT_decl_line   : 27
    <12d>   DW_AT_decl_column : 20
    <12e>   DW_AT_type        : <0x8f>
 <1><132>: Abbrev Number: 4 (DW_TAG_typedef)
    <133>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <137>   DW_AT_decl_file   : 3
    <138>   DW_AT_decl_line   : 209
    <139>   DW_AT_decl_column : 23
    <13a>   DW_AT_type        : <0x2b>
 <1><13e>: Abbrev Number: 3 (DW_TAG_const_type)
    <13f>   DW_AT_type        : <0x132>
 <1><143>: Abbrev Number: 10 (DW_TAG_structure_type)
    <144>   DW_AT_name        : (indirect string, offset: 0xaff): timespec
    <148>   DW_AT_byte_size   : 8
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 10
    <14b>   DW_AT_decl_column : 8
    <14c>   DW_AT_sibling     : <0x16f>
 <2><150>: Abbrev Number: 11 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x10e2): tv_sec
    <155>   DW_AT_decl_file   : 4
    <156>   DW_AT_decl_line   : 12
    <157>   DW_AT_decl_column : 12
    <158>   DW_AT_type        : <0xd1>
    <15c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15f>: Abbrev Number: 11 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xe14): tv_nsec
    <164>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 16
    <166>   DW_AT_decl_column : 21
    <167>   DW_AT_type        : <0xe4>
    <16b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xac1): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfaa): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x28d): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xf0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3af): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xfe7): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xf0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x742): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc4e): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xb4e): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xfd>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x36e): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 11 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x9e3): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 11 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4dc): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xf0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 11 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf1c): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xf0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 11 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7ab): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xf0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 11 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x13d): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xf0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 11 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x104e): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xf0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 11 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x8d6): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xf0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 11 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x947): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xf0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 11 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xd82): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xf0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 11 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1d6): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xf0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 11 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xcb1): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xf0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 11 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xf0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 11 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x570): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 11 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x219): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 11 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xf95): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 11 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x797): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 11 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x810): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 11 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x247): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 11 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe3a): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 11 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xcc1): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 11 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x17e): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 11 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x6da): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 11 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa39): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 11 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfcb): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 11 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3d3): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 11 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc24): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xdd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 11 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x99c): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x132>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 11 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x274): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 11 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x7c5): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xae1): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x47b): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x318): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 6 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xf6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x382): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 6 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xf6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x53b): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x1028): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xdd7): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x259): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 6 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x54a): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x27a): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe59): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6b3): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xf0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbc9): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xf0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 6 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xf0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1c3): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xeae): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x377): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x995): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x1098): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4c0): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf43): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9a8): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x415): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0xa97): __kernel_long_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 15
    <538>   DW_AT_decl_column : 15
    <539>   DW_AT_type        : <0xae>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x52a): __kernel_ulong_t
    <542>   DW_AT_decl_file   : 14
    <543>   DW_AT_decl_line   : 16
    <544>   DW_AT_decl_column : 23
    <545>   DW_AT_type        : <0x37>
 <1><549>: Abbrev Number: 18 (DW_TAG_structure_type)
    <54a>   DW_AT_byte_size   : 8
    <54b>   DW_AT_decl_file   : 14
    <54c>   DW_AT_decl_line   : 79
    <54d>   DW_AT_decl_column : 9
    <54e>   DW_AT_sibling     : <0x562>
 <2><552>: Abbrev Number: 19 (DW_TAG_member)
    <553>   DW_AT_name        : val
    <557>   DW_AT_decl_file   : 14
    <558>   DW_AT_decl_line   : 80
    <559>   DW_AT_decl_column : 6
    <55a>   DW_AT_type        : <0xc1>
    <55e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><561>: Abbrev Number: 0
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0xe49): __kernel_fsid_t
    <567>   DW_AT_decl_file   : 14
    <568>   DW_AT_decl_line   : 81
    <569>   DW_AT_decl_column : 3
    <56a>   DW_AT_type        : <0x549>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x3e1): kernel_long_t
    <573>   DW_AT_decl_file   : 15
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 25
    <576>   DW_AT_type        : <0x531>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x885): kernel_ulong_t
    <57f>   DW_AT_decl_file   : 15
    <580>   DW_AT_decl_line   : 17
    <581>   DW_AT_decl_column : 26
    <582>   DW_AT_type        : <0x53d>
 <1><586>: Abbrev Number: 3 (DW_TAG_const_type)
    <587>   DW_AT_type        : <0x57a>
 <1><58b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <58c>   DW_AT_name        : (indirect string, offset: 0xbe7): list_item
    <590>   DW_AT_byte_size   : 8
    <591>   DW_AT_decl_file   : 16
    <592>   DW_AT_decl_line   : 92
    <593>   DW_AT_decl_column : 8
    <594>   DW_AT_sibling     : <0x5b7>
 <2><598>: Abbrev Number: 11 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x10dd): prev
    <59d>   DW_AT_decl_file   : 16
    <59e>   DW_AT_decl_line   : 93
    <59f>   DW_AT_decl_column : 20
    <5a0>   DW_AT_type        : <0x5b7>
    <5a4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a7>: Abbrev Number: 11 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x10d3): next
    <5ac>   DW_AT_decl_file   : 16
    <5ad>   DW_AT_decl_line   : 94
    <5ae>   DW_AT_decl_column : 20
    <5af>   DW_AT_type        : <0x5b7>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b6>: Abbrev Number: 0
 <1><5b7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5b8>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x58b>
 <1><5bd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x85d): sysent
    <5c2>   DW_AT_byte_size   : 20
    <5c3>   DW_AT_decl_file   : 17
    <5c4>   DW_AT_decl_line   : 13
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_sibling     : <0x616>
 <2><5ca>: Abbrev Number: 11 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x103f): nargs
    <5cf>   DW_AT_decl_file   : 17
    <5d0>   DW_AT_decl_line   : 14
    <5d1>   DW_AT_decl_column : 11
    <5d2>   DW_AT_type        : <0x2b>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d9>: Abbrev Number: 11 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x954): sys_flags
    <5de>   DW_AT_decl_file   : 17
    <5df>   DW_AT_decl_line   : 15
    <5e0>   DW_AT_decl_column : 6
    <5e1>   DW_AT_type        : <0x64>
    <5e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e8>: Abbrev Number: 19 (DW_TAG_member)
    <5e9>   DW_AT_name        : sen
    <5ed>   DW_AT_decl_file   : 17
    <5ee>   DW_AT_decl_line   : 16
    <5ef>   DW_AT_decl_column : 6
    <5f0>   DW_AT_type        : <0x64>
    <5f4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f7>: Abbrev Number: 11 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x30f): sys_func
    <5fc>   DW_AT_decl_file   : 17
    <5fd>   DW_AT_decl_line   : 17
    <5fe>   DW_AT_decl_column : 8
    <5ff>   DW_AT_type        : <0x88e>
    <603>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><606>: Abbrev Number: 11 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x284): sys_name
    <60b>   DW_AT_decl_file   : 17
    <60c>   DW_AT_decl_line   : 18
    <60d>   DW_AT_decl_column : 14
    <60e>   DW_AT_type        : <0x1d9>
    <612>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><615>: Abbrev Number: 0
 <1><616>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <617>   DW_AT_prototyped  : 1
    <618>   DW_AT_type        : <0x64>
    <61c>   DW_AT_sibling     : <0x626>
 <2><620>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <621>   DW_AT_type        : <0x626>
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x631>
 <1><62c>: Abbrev Number: 3 (DW_TAG_const_type)
    <62d>   DW_AT_type        : <0x626>
 <1><631>: Abbrev Number: 22 (DW_TAG_structure_type)
    <632>   DW_AT_name        : tcb
    <636>   DW_AT_byte_size   : 220
    <637>   DW_AT_decl_file   : 18
    <638>   DW_AT_decl_line   : 262
    <63a>   DW_AT_decl_column : 8
    <63b>   DW_AT_sibling     : <0x88e>
 <2><63f>: Abbrev Number: 23 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x4d6): flags
    <644>   DW_AT_decl_file   : 18
    <645>   DW_AT_decl_line   : 263
    <647>   DW_AT_decl_column : 6
    <648>   DW_AT_type        : <0x64>
    <64c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><64f>: Abbrev Number: 24 (DW_TAG_member)
    <650>   DW_AT_name        : pid
    <654>   DW_AT_decl_file   : 18
    <655>   DW_AT_decl_line   : 264
    <657>   DW_AT_decl_column : 6
    <658>   DW_AT_type        : <0x64>
    <65c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><65f>: Abbrev Number: 23 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <664>   DW_AT_decl_file   : 18
    <665>   DW_AT_decl_line   : 265
    <667>   DW_AT_decl_column : 6
    <668>   DW_AT_type        : <0x64>
    <66c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><66f>: Abbrev Number: 23 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0x39b): currpers
    <674>   DW_AT_decl_file   : 18
    <675>   DW_AT_decl_line   : 267
    <677>   DW_AT_decl_column : 15
    <678>   DW_AT_type        : <0x2b>
    <67c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><67f>: Abbrev Number: 23 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0xb3c): u_error
    <684>   DW_AT_decl_file   : 18
    <685>   DW_AT_decl_line   : 269
    <687>   DW_AT_decl_column : 16
    <688>   DW_AT_type        : <0x37>
    <68c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><68f>: Abbrev Number: 23 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <694>   DW_AT_decl_file   : 18
    <695>   DW_AT_decl_line   : 270
    <697>   DW_AT_decl_column : 17
    <698>   DW_AT_type        : <0x57a>
    <69c>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><69f>: Abbrev Number: 23 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0xb7f): true_scno
    <6a4>   DW_AT_decl_file   : 18
    <6a5>   DW_AT_decl_line   : 271
    <6a7>   DW_AT_decl_column : 17
    <6a8>   DW_AT_type        : <0x57a>
    <6ac>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6af>: Abbrev Number: 23 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x1a5): u_arg
    <6b4>   DW_AT_decl_file   : 18
    <6b5>   DW_AT_decl_line   : 272
    <6b7>   DW_AT_decl_column : 17
    <6b8>   DW_AT_type        : <0x9be>
    <6bc>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6bf>: Abbrev Number: 23 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x96b): u_rval
    <6c4>   DW_AT_decl_file   : 18
    <6c5>   DW_AT_decl_line   : 273
    <6c7>   DW_AT_decl_column : 16
    <6c8>   DW_AT_type        : <0x56e>
    <6cc>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6cf>: Abbrev Number: 23 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xab3): sys_func_rval
    <6d4>   DW_AT_decl_file   : 18
    <6d5>   DW_AT_decl_line   : 274
    <6d7>   DW_AT_decl_column : 6
    <6d8>   DW_AT_type        : <0x64>
    <6dc>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6df>: Abbrev Number: 23 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xcdb): curcol
    <6e4>   DW_AT_decl_file   : 18
    <6e5>   DW_AT_decl_line   : 275
    <6e7>   DW_AT_decl_column : 6
    <6e8>   DW_AT_type        : <0x64>
    <6ec>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ef>: Abbrev Number: 23 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x97d): outf
    <6f4>   DW_AT_decl_file   : 18
    <6f5>   DW_AT_decl_line   : 276
    <6f7>   DW_AT_decl_column : 8
    <6f8>   DW_AT_type        : <0x41e>
    <6fc>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ff>: Abbrev Number: 23 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0xeed): staged_output_data
    <704>   DW_AT_decl_file   : 18
    <705>   DW_AT_decl_line   : 277
    <707>   DW_AT_decl_column : 29
    <708>   DW_AT_type        : <0x9d4>
    <70c>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><70f>: Abbrev Number: 23 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0xa7e): auxstr
    <714>   DW_AT_decl_file   : 18
    <715>   DW_AT_decl_line   : 279
    <717>   DW_AT_decl_column : 14
    <718>   DW_AT_type        : <0x1d9>
    <71c>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><71f>: Abbrev Number: 23 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x184): _priv_data
    <724>   DW_AT_decl_file   : 18
    <725>   DW_AT_decl_line   : 280
    <727>   DW_AT_decl_column : 8
    <728>   DW_AT_type        : <0xdd>
    <72c>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><72f>: Abbrev Number: 23 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0xc14): _free_priv_data
    <734>   DW_AT_decl_file   : 18
    <735>   DW_AT_decl_line   : 281
    <737>   DW_AT_decl_column : 9
    <738>   DW_AT_type        : <0x9e6>
    <73c>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><73f>: Abbrev Number: 23 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x195): s_ent
    <744>   DW_AT_decl_file   : 18
    <745>   DW_AT_decl_line   : 282
    <747>   DW_AT_decl_column : 23
    <748>   DW_AT_type        : <0x9ec>
    <74c>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <754>   DW_AT_decl_file   : 18
    <755>   DW_AT_decl_line   : 285
    <757>   DW_AT_decl_column : 23
    <758>   DW_AT_type        : <0x9ec>
    <75c>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><75f>: Abbrev Number: 23 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x390): inject_vec
    <764>   DW_AT_decl_file   : 18
    <765>   DW_AT_decl_line   : 286
    <767>   DW_AT_decl_column : 22
    <768>   DW_AT_type        : <0x9f7>
    <76c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><76f>: Abbrev Number: 23 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x7ce): stime
    <774>   DW_AT_decl_file   : 18
    <775>   DW_AT_decl_line   : 287
    <777>   DW_AT_decl_column : 18
    <778>   DW_AT_type        : <0x143>
    <77c>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><77f>: Abbrev Number: 23 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0x3a4): ltime
    <784>   DW_AT_decl_file   : 18
    <785>   DW_AT_decl_line   : 288
    <787>   DW_AT_decl_column : 18
    <788>   DW_AT_type        : <0x143>
    <78c>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><78f>: Abbrev Number: 23 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0xfff): atime
    <794>   DW_AT_decl_file   : 18
    <795>   DW_AT_decl_line   : 289
    <797>   DW_AT_decl_column : 18
    <798>   DW_AT_type        : <0x143>
    <79c>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><79f>: Abbrev Number: 23 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x4d0): etime
    <7a4>   DW_AT_decl_file   : 18
    <7a5>   DW_AT_decl_line   : 290
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x143>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7b0>: Abbrev Number: 23 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0xd3f): delay_expiration_time
    <7b5>   DW_AT_decl_file   : 18
    <7b6>   DW_AT_decl_line   : 291
    <7b8>   DW_AT_decl_column : 18
    <7b9>   DW_AT_type        : <0x143>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7c1>: Abbrev Number: 23 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7c6>   DW_AT_decl_file   : 18
    <7c7>   DW_AT_decl_line   : 298
    <7c9>   DW_AT_decl_column : 15
    <7ca>   DW_AT_type        : <0x2b>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7d2>: Abbrev Number: 23 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0xf29): last_dirfd
    <7d7>   DW_AT_decl_file   : 18
    <7d8>   DW_AT_decl_line   : 301
    <7da>   DW_AT_decl_column : 6
    <7db>   DW_AT_type        : <0x64>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7e3>: Abbrev Number: 23 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xf4f): mmap_cache
    <7e8>   DW_AT_decl_file   : 18
    <7e9>   DW_AT_decl_line   : 304
    <7eb>   DW_AT_decl_column : 23
    <7ec>   DW_AT_type        : <0xa13>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7f4>: Abbrev Number: 23 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xb55): wait_data_idx
    <7f9>   DW_AT_decl_file   : 18
    <7fa>   DW_AT_decl_line   : 311
    <7fc>   DW_AT_decl_column : 9
    <7fd>   DW_AT_type        : <0x132>
    <801>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><805>: Abbrev Number: 23 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xa85): delayed_wait_data
    <80a>   DW_AT_decl_file   : 18
    <80b>   DW_AT_decl_line   : 313
    <80d>   DW_AT_decl_column : 24
    <80e>   DW_AT_type        : <0xa1f>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><816>: Abbrev Number: 23 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0xaf5): wait_list
    <81b>   DW_AT_decl_file   : 18
    <81c>   DW_AT_decl_line   : 314
    <81e>   DW_AT_decl_column : 19
    <81f>   DW_AT_type        : <0x58b>
    <823>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><827>: Abbrev Number: 23 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x6cb): vcpu_info_list
    <82c>   DW_AT_decl_file   : 18
    <82d>   DW_AT_decl_line   : 318
    <82f>   DW_AT_decl_column : 20
    <830>   DW_AT_type        : <0xa2b>
    <834>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><838>: Abbrev Number: 23 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0xca6): unwind_ctx
    <83d>   DW_AT_decl_file   : 18
    <83e>   DW_AT_decl_line   : 322
    <840>   DW_AT_decl_column : 8
    <841>   DW_AT_type        : <0xdd>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><849>: Abbrev Number: 23 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x4b3): unwind_queue
    <84e>   DW_AT_decl_file   : 18
    <84f>   DW_AT_decl_line   : 323
    <851>   DW_AT_decl_column : 25
    <852>   DW_AT_type        : <0xa37>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><85a>: Abbrev Number: 23 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x179): comm
    <85f>   DW_AT_decl_file   : 18
    <860>   DW_AT_decl_line   : 327
    <862>   DW_AT_decl_column : 7
    <863>   DW_AT_type        : <0xa3d>
    <867>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><86b>: Abbrev Number: 23 (DW_TAG_member)
    <86c>   DW_AT_name        : (indirect string, offset: 0x229): start_prc
    <870>   DW_AT_decl_file   : 18
    <871>   DW_AT_decl_line   : 329
    <873>   DW_AT_decl_column : 16
    <874>   DW_AT_type        : <0x37>
    <878>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><87c>: Abbrev Number: 23 (DW_TAG_member)
    <87d>   DW_AT_name        : (indirect string, offset: 0xfb4): pre_comm
    <881>   DW_AT_decl_file   : 18
    <882>   DW_AT_decl_line   : 330
    <884>   DW_AT_decl_column : 7
    <885>   DW_AT_type        : <0xa3d>
    <889>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><88d>: Abbrev Number: 0
 <1><88e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <88f>   DW_AT_byte_size   : 4
    <890>   DW_AT_type        : <0x616>
 <1><894>: Abbrev Number: 4 (DW_TAG_typedef)
    <895>   DW_AT_name        : (indirect string, offset: 0x51c): struct_sysent
    <899>   DW_AT_decl_file   : 17
    <89a>   DW_AT_decl_line   : 19
    <89b>   DW_AT_decl_column : 3
    <89c>   DW_AT_type        : <0x5bd>
 <1><8a0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8a1>   DW_AT_type        : <0x894>
 <1><8a5>: Abbrev Number: 13 (DW_TAG_variable)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xd2b): current_personality
    <8aa>   DW_AT_decl_file   : 18
    <8ab>   DW_AT_decl_line   : 158
    <8ac>   DW_AT_decl_column : 17
    <8ad>   DW_AT_type        : <0x2b>
    <8b1>   DW_AT_external    : 1
    <8b2>   DW_AT_declaration : 1
 <1><8b3>: Abbrev Number: 13 (DW_TAG_variable)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x7ff): current_wordsize
    <8b8>   DW_AT_decl_file   : 18
    <8b9>   DW_AT_decl_line   : 171
    <8ba>   DW_AT_decl_column : 17
    <8bb>   DW_AT_type        : <0x2b>
    <8bf>   DW_AT_external    : 1
    <8c0>   DW_AT_declaration : 1
 <1><8c1>: Abbrev Number: 13 (DW_TAG_variable)
    <8c2>   DW_AT_name        : (indirect string, offset: 0xa42): current_klongsize
    <8c6>   DW_AT_decl_file   : 18
    <8c7>   DW_AT_decl_line   : 176
    <8c8>   DW_AT_decl_column : 17
    <8c9>   DW_AT_type        : <0x2b>
    <8cd>   DW_AT_external    : 1
    <8ce>   DW_AT_declaration : 1
 <1><8cf>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8d0>   DW_AT_name        : (indirect string, offset: 0xc7d): ioctlent
    <8d4>   DW_AT_byte_size   : 8
    <8d5>   DW_AT_decl_file   : 18
    <8d6>   DW_AT_decl_line   : 217
    <8d7>   DW_AT_decl_column : 16
    <8d8>   DW_AT_sibling     : <0x8fb>
 <2><8dc>: Abbrev Number: 11 (DW_TAG_member)
    <8dd>   DW_AT_name        : (indirect string, offset: 0xf15): symbol
    <8e1>   DW_AT_decl_file   : 18
    <8e2>   DW_AT_decl_line   : 218
    <8e3>   DW_AT_decl_column : 14
    <8e4>   DW_AT_type        : <0x1d9>
    <8e8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8eb>: Abbrev Number: 11 (DW_TAG_member)
    <8ec>   DW_AT_name        : (indirect string, offset: 0xcf4): code
    <8f0>   DW_AT_decl_file   : 18
    <8f1>   DW_AT_decl_line   : 219
    <8f2>   DW_AT_decl_column : 15
    <8f3>   DW_AT_type        : <0x2b>
    <8f7>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8fa>: Abbrev Number: 0
 <1><8fb>: Abbrev Number: 4 (DW_TAG_typedef)
    <8fc>   DW_AT_name        : (indirect string, offset: 0xc3e): struct_ioctlent
    <900>   DW_AT_decl_file   : 18
    <901>   DW_AT_decl_line   : 220
    <902>   DW_AT_decl_column : 3
    <903>   DW_AT_type        : <0x8cf>
 <1><907>: Abbrev Number: 3 (DW_TAG_const_type)
    <908>   DW_AT_type        : <0x8fb>
 <1><90c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <90d>   DW_AT_name        : (indirect string, offset: 0x7f3): inject_data
    <911>   DW_AT_byte_size   : 10
    <912>   DW_AT_decl_file   : 18
    <913>   DW_AT_decl_line   : 241
    <914>   DW_AT_decl_column : 8
    <915>   DW_AT_sibling     : <0x974>
 <2><919>: Abbrev Number: 11 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x4d6): flags
    <91e>   DW_AT_decl_file   : 18
    <91f>   DW_AT_decl_line   : 242
    <920>   DW_AT_decl_column : 10
    <921>   DW_AT_type        : <0x102>
    <925>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><928>: Abbrev Number: 11 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x908): signo
    <92d>   DW_AT_decl_file   : 18
    <92e>   DW_AT_decl_line   : 243
    <92f>   DW_AT_decl_column : 10
    <930>   DW_AT_type        : <0x102>
    <934>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><937>: Abbrev Number: 11 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0x10b): rval_idx
    <93c>   DW_AT_decl_file   : 18
    <93d>   DW_AT_decl_line   : 244
    <93e>   DW_AT_decl_column : 11
    <93f>   DW_AT_type        : <0x10e>
    <943>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><946>: Abbrev Number: 11 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0xcd1): delay_idx
    <94b>   DW_AT_decl_file   : 18
    <94c>   DW_AT_decl_line   : 245
    <94d>   DW_AT_decl_column : 11
    <94e>   DW_AT_type        : <0x10e>
    <952>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><955>: Abbrev Number: 11 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x562): poke_idx
    <95a>   DW_AT_decl_file   : 18
    <95b>   DW_AT_decl_line   : 246
    <95c>   DW_AT_decl_column : 11
    <95d>   DW_AT_type        : <0x10e>
    <961>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><964>: Abbrev Number: 11 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <969>   DW_AT_decl_file   : 18
    <96a>   DW_AT_decl_line   : 247
    <96b>   DW_AT_decl_column : 11
    <96c>   DW_AT_type        : <0x10e>
    <970>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><973>: Abbrev Number: 0
 <1><974>: Abbrev Number: 10 (DW_TAG_structure_type)
    <975>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <979>   DW_AT_byte_size   : 16
    <97a>   DW_AT_decl_file   : 18
    <97b>   DW_AT_decl_line   : 250
    <97c>   DW_AT_decl_column : 8
    <97d>   DW_AT_sibling     : <0x9be>
 <2><981>: Abbrev Number: 11 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0xa01): first
    <986>   DW_AT_decl_file   : 18
    <987>   DW_AT_decl_line   : 251
    <988>   DW_AT_decl_column : 11
    <989>   DW_AT_type        : <0x10e>
    <98d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><990>: Abbrev Number: 11 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x1106): last
    <995>   DW_AT_decl_file   : 18
    <996>   DW_AT_decl_line   : 252
    <997>   DW_AT_decl_column : 11
    <998>   DW_AT_type        : <0x10e>
    <99c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><99f>: Abbrev Number: 11 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x3aa): step
    <9a4>   DW_AT_decl_file   : 18
    <9a5>   DW_AT_decl_line   : 253
    <9a6>   DW_AT_decl_column : 11
    <9a7>   DW_AT_type        : <0x10e>
    <9ab>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9ae>: Abbrev Number: 11 (DW_TAG_member)
    <9af>   DW_AT_name        : (indirect string, offset: 0x10d8): data
    <9b3>   DW_AT_decl_file   : 18
    <9b4>   DW_AT_decl_line   : 254
    <9b5>   DW_AT_decl_column : 21
    <9b6>   DW_AT_type        : <0x90c>
    <9ba>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9bd>: Abbrev Number: 0
 <1><9be>: Abbrev Number: 6 (DW_TAG_array_type)
    <9bf>   DW_AT_type        : <0x57a>
    <9c3>   DW_AT_sibling     : <0x9ce>
 <2><9c7>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9c8>   DW_AT_type        : <0x2b>
    <9cc>   DW_AT_upper_bound : 5
 <2><9cd>: Abbrev Number: 0
 <1><9ce>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9cf>   DW_AT_name        : (indirect string, offset: 0xeed): staged_output_data
    <9d3>   DW_AT_declaration : 1
 <1><9d4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9ce>
 <1><9da>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9db>   DW_AT_prototyped  : 1
    <9dc>   DW_AT_sibling     : <0x9e6>
 <2><9e0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9e1>   DW_AT_type        : <0xdd>
 <2><9e5>: Abbrev Number: 0
 <1><9e6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9e7>   DW_AT_byte_size   : 4
    <9e8>   DW_AT_type        : <0x9da>
 <1><9ec>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x8a0>
 <1><9f2>: Abbrev Number: 3 (DW_TAG_const_type)
    <9f3>   DW_AT_type        : <0x9ec>
 <1><9f7>: Abbrev Number: 6 (DW_TAG_array_type)
    <9f8>   DW_AT_type        : <0xa07>
    <9fc>   DW_AT_sibling     : <0xa07>
 <2><a00>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a01>   DW_AT_type        : <0x2b>
    <a05>   DW_AT_upper_bound : 2
 <2><a06>: Abbrev Number: 0
 <1><a07>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a08>   DW_AT_byte_size   : 4
    <a09>   DW_AT_type        : <0x974>
 <1><a0d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a0e>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <a12>   DW_AT_declaration : 1
 <1><a13>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a14>   DW_AT_byte_size   : 4
    <a15>   DW_AT_type        : <0xa0d>
 <1><a19>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x3c5): tcb_wait_data
    <a1e>   DW_AT_declaration : 1
 <1><a1f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a20>   DW_AT_byte_size   : 4
    <a21>   DW_AT_type        : <0xa19>
 <1><a25>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a26>   DW_AT_name        : (indirect string, offset: 0x16f): vcpu_info
    <a2a>   DW_AT_declaration : 1
 <1><a2b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a2c>   DW_AT_byte_size   : 4
    <a2d>   DW_AT_type        : <0xa25>
 <1><a31>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a32>   DW_AT_name        : (indirect string, offset: 0xed1): unwind_queue_t
    <a36>   DW_AT_declaration : 1
 <1><a37>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a38>   DW_AT_byte_size   : 4
    <a39>   DW_AT_type        : <0xa31>
 <1><a3d>: Abbrev Number: 6 (DW_TAG_array_type)
    <a3e>   DW_AT_type        : <0xf6>
    <a42>   DW_AT_sibling     : <0xa4d>
 <2><a46>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a47>   DW_AT_type        : <0x2b>
    <a4b>   DW_AT_upper_bound : 15
 <2><a4c>: Abbrev Number: 0
 <1><a4d>: Abbrev Number: 12 (DW_TAG_variable)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xb92): stub_sysent
    <a52>   DW_AT_decl_file   : 18
    <a53>   DW_AT_decl_line   : 405
    <a55>   DW_AT_decl_column : 28
    <a56>   DW_AT_type        : <0x8a0>
    <a5a>   DW_AT_external    : 1
    <a5b>   DW_AT_declaration : 1
 <1><a5c>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x10bb): xlat_type
    <a61>   DW_AT_encoding    : 7	(unsigned)
    <a62>   DW_AT_byte_size   : 4
    <a63>   DW_AT_type        : <0x2b>
    <a67>   DW_AT_decl_file   : 19
    <a68>   DW_AT_decl_line   : 13
    <a69>   DW_AT_decl_column : 6
    <a6a>   DW_AT_sibling     : <0xa81>
 <2><a6e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x2df): XT_NORMAL
    <a73>   DW_AT_const_value : 0
 <2><a74>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a75>   DW_AT_name        : (indirect string, offset: 0xc55): XT_SORTED
    <a79>   DW_AT_const_value : 1
 <2><a7a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0xdb7): XT_INDEXED
    <a7f>   DW_AT_const_value : 2
 <2><a80>: Abbrev Number: 0
 <1><a81>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a82>   DW_AT_name        : (indirect string, offset: 0xbbe): xlat_style
    <a86>   DW_AT_encoding    : 7	(unsigned)
    <a87>   DW_AT_byte_size   : 4
    <a88>   DW_AT_type        : <0x2b>
    <a8c>   DW_AT_decl_file   : 19
    <a8d>   DW_AT_decl_line   : 19
    <a8e>   DW_AT_decl_column : 6
    <a8f>   DW_AT_sibling     : <0xabe>
 <2><a93>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a98>   DW_AT_const_value : 0
 <2><a99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0xbf1): XLAT_STYLE_RAW
    <a9e>   DW_AT_const_value : 1
 <2><a9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x1086): XLAT_STYLE_ABBREV
    <aa4>   DW_AT_const_value : 2
 <2><aa5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x2fc): XLAT_STYLE_VERBOSE
    <aaa>   DW_AT_const_value : 3
 <2><aab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <ab0>   DW_AT_const_value : 0
 <2><ab1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ab6>   DW_AT_const_value : 4
 <2><ab7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x10f5): XLAT_STYLE_FMT_D
    <abc>   DW_AT_const_value : 8
 <2><abd>: Abbrev Number: 0
 <1><abe>: Abbrev Number: 10 (DW_TAG_structure_type)
    <abf>   DW_AT_name        : (indirect string, offset: 0x32d): xlat_data
    <ac3>   DW_AT_byte_size   : 12
    <ac4>   DW_AT_decl_file   : 19
    <ac5>   DW_AT_decl_line   : 51
    <ac6>   DW_AT_decl_column : 8
    <ac7>   DW_AT_sibling     : <0xaea>
 <2><acb>: Abbrev Number: 19 (DW_TAG_member)
    <acc>   DW_AT_name        : val
    <ad0>   DW_AT_decl_file   : 19
    <ad1>   DW_AT_decl_line   : 52
    <ad2>   DW_AT_decl_column : 11
    <ad3>   DW_AT_type        : <0x126>
    <ad7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ada>: Abbrev Number: 19 (DW_TAG_member)
    <adb>   DW_AT_name        : str
    <adf>   DW_AT_decl_file   : 19
    <ae0>   DW_AT_decl_line   : 53
    <ae1>   DW_AT_decl_column : 14
    <ae2>   DW_AT_type        : <0x1d9>
    <ae6>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ae9>: Abbrev Number: 0
 <1><aea>: Abbrev Number: 3 (DW_TAG_const_type)
    <aeb>   DW_AT_type        : <0xabe>
 <1><aef>: Abbrev Number: 10 (DW_TAG_structure_type)
    <af0>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <af4>   DW_AT_byte_size   : 24
    <af5>   DW_AT_decl_file   : 19
    <af6>   DW_AT_decl_line   : 56
    <af7>   DW_AT_decl_column : 8
    <af8>   DW_AT_sibling     : <0xb48>
 <2><afc>: Abbrev Number: 11 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0x10d8): data
    <b01>   DW_AT_decl_file   : 19
    <b02>   DW_AT_decl_line   : 57
    <b03>   DW_AT_decl_column : 26
    <b04>   DW_AT_type        : <0xb4d>
    <b08>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b0b>: Abbrev Number: 11 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x851): flags_strsz
    <b10>   DW_AT_decl_file   : 19
    <b11>   DW_AT_decl_line   : 58
    <b12>   DW_AT_decl_column : 9
    <b13>   DW_AT_type        : <0x132>
    <b17>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b1a>: Abbrev Number: 11 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0xb63): size
    <b1f>   DW_AT_decl_file   : 19
    <b20>   DW_AT_decl_line   : 59
    <b21>   DW_AT_decl_column : 11
    <b22>   DW_AT_type        : <0x11a>
    <b26>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b29>: Abbrev Number: 11 (DW_TAG_member)
    <b2a>   DW_AT_name        : (indirect string, offset: 0x1a0): type
    <b2e>   DW_AT_decl_file   : 19
    <b2f>   DW_AT_decl_line   : 60
    <b30>   DW_AT_decl_column : 17
    <b31>   DW_AT_type        : <0xa5c>
    <b35>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b38>: Abbrev Number: 11 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x71f): flags_mask
    <b3d>   DW_AT_decl_file   : 19
    <b3e>   DW_AT_decl_line   : 61
    <b3f>   DW_AT_decl_column : 11
    <b40>   DW_AT_type        : <0x126>
    <b44>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b47>: Abbrev Number: 0
 <1><b48>: Abbrev Number: 3 (DW_TAG_const_type)
    <b49>   DW_AT_type        : <0xaef>
 <1><b4d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b4e>   DW_AT_byte_size   : 4
    <b4f>   DW_AT_type        : <0xaea>
 <1><b53>: Abbrev Number: 6 (DW_TAG_array_type)
    <b54>   DW_AT_type        : <0xb48>
    <b58>   DW_AT_sibling     : <0xb5e>
 <2><b5c>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b5d>: Abbrev Number: 0
 <1><b5e>: Abbrev Number: 3 (DW_TAG_const_type)
    <b5f>   DW_AT_type        : <0xb53>
 <1><b63>: Abbrev Number: 12 (DW_TAG_variable)
    <b64>   DW_AT_name        : (indirect string, offset: 0xe27): addrfams
    <b68>   DW_AT_decl_file   : 18
    <b69>   DW_AT_decl_line   : 411
    <b6b>   DW_AT_decl_column : 26
    <b6c>   DW_AT_type        : <0xb5e>
    <b70>   DW_AT_external    : 1
    <b71>   DW_AT_declaration : 1
 <1><b72>: Abbrev Number: 12 (DW_TAG_variable)
    <b73>   DW_AT_name        : (indirect string, offset: 0xd04): arp_hardware_types
    <b77>   DW_AT_decl_file   : 18
    <b78>   DW_AT_decl_line   : 412
    <b7a>   DW_AT_decl_column : 26
    <b7b>   DW_AT_type        : <0xb5e>
    <b7f>   DW_AT_external    : 1
    <b80>   DW_AT_declaration : 1
 <1><b81>: Abbrev Number: 12 (DW_TAG_variable)
    <b82>   DW_AT_name        : (indirect string, offset: 0x1005): at_flags
    <b86>   DW_AT_decl_file   : 18
    <b87>   DW_AT_decl_line   : 413
    <b89>   DW_AT_decl_column : 26
    <b8a>   DW_AT_type        : <0xb5e>
    <b8e>   DW_AT_external    : 1
    <b8f>   DW_AT_declaration : 1
 <1><b90>: Abbrev Number: 12 (DW_TAG_variable)
    <b91>   DW_AT_name        : (indirect string, offset: 0x491): clocknames
    <b95>   DW_AT_decl_file   : 18
    <b96>   DW_AT_decl_line   : 414
    <b98>   DW_AT_decl_column : 26
    <b99>   DW_AT_type        : <0xb5e>
    <b9d>   DW_AT_external    : 1
    <b9e>   DW_AT_declaration : 1
 <1><b9f>: Abbrev Number: 12 (DW_TAG_variable)
    <ba0>   DW_AT_name        : (indirect string, offset: 0xf9d): dirent_types
    <ba4>   DW_AT_decl_file   : 18
    <ba5>   DW_AT_decl_line   : 415
    <ba7>   DW_AT_decl_column : 26
    <ba8>   DW_AT_type        : <0xb5e>
    <bac>   DW_AT_external    : 1
    <bad>   DW_AT_declaration : 1
 <1><bae>: Abbrev Number: 12 (DW_TAG_variable)
    <baf>   DW_AT_name        : (indirect string, offset: 0x8a2): ethernet_protocols
    <bb3>   DW_AT_decl_file   : 18
    <bb4>   DW_AT_decl_line   : 416
    <bb6>   DW_AT_decl_column : 26
    <bb7>   DW_AT_type        : <0xb5e>
    <bbb>   DW_AT_external    : 1
    <bbc>   DW_AT_declaration : 1
 <1><bbd>: Abbrev Number: 12 (DW_TAG_variable)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x5b5): inet_protocols
    <bc2>   DW_AT_decl_file   : 18
    <bc3>   DW_AT_decl_line   : 417
    <bc5>   DW_AT_decl_column : 26
    <bc6>   DW_AT_type        : <0xb5e>
    <bca>   DW_AT_external    : 1
    <bcb>   DW_AT_declaration : 1
 <1><bcc>: Abbrev Number: 12 (DW_TAG_variable)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x2cc): evdev_abs
    <bd1>   DW_AT_decl_file   : 18
    <bd2>   DW_AT_decl_line   : 418
    <bd4>   DW_AT_decl_column : 26
    <bd5>   DW_AT_type        : <0xb5e>
    <bd9>   DW_AT_external    : 1
    <bda>   DW_AT_declaration : 1
 <1><bdb>: Abbrev Number: 12 (DW_TAG_variable)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x714): audit_arch
    <be0>   DW_AT_decl_file   : 18
    <be1>   DW_AT_decl_line   : 419
    <be3>   DW_AT_decl_column : 26
    <be4>   DW_AT_type        : <0xb5e>
    <be8>   DW_AT_external    : 1
    <be9>   DW_AT_declaration : 1
 <1><bea>: Abbrev Number: 12 (DW_TAG_variable)
    <beb>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bef>   DW_AT_decl_file   : 18
    <bf0>   DW_AT_decl_line   : 420
    <bf2>   DW_AT_decl_column : 26
    <bf3>   DW_AT_type        : <0xb5e>
    <bf7>   DW_AT_external    : 1
    <bf8>   DW_AT_declaration : 1
 <1><bf9>: Abbrev Number: 12 (DW_TAG_variable)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x472): iffflags
    <bfe>   DW_AT_decl_file   : 18
    <bff>   DW_AT_decl_line   : 421
    <c01>   DW_AT_decl_column : 26
    <c02>   DW_AT_type        : <0xb5e>
    <c06>   DW_AT_external    : 1
    <c07>   DW_AT_declaration : 1
 <1><c08>: Abbrev Number: 12 (DW_TAG_variable)
    <c09>   DW_AT_name        : (indirect string, offset: 0xc00): ip_type_of_services
    <c0d>   DW_AT_decl_file   : 18
    <c0e>   DW_AT_decl_line   : 422
    <c10>   DW_AT_decl_column : 26
    <c11>   DW_AT_type        : <0xb5e>
    <c15>   DW_AT_external    : 1
    <c16>   DW_AT_declaration : 1
 <1><c17>: Abbrev Number: 12 (DW_TAG_variable)
    <c18>   DW_AT_name        : (indirect string, offset: 0x6a7): ipc_private
    <c1c>   DW_AT_decl_file   : 18
    <c1d>   DW_AT_decl_line   : 423
    <c1f>   DW_AT_decl_column : 26
    <c20>   DW_AT_type        : <0xb5e>
    <c24>   DW_AT_external    : 1
    <c25>   DW_AT_declaration : 1
 <1><c26>: Abbrev Number: 12 (DW_TAG_variable)
    <c27>   DW_AT_name        : (indirect string, offset: 0x323): msg_flags
    <c2b>   DW_AT_decl_file   : 18
    <c2c>   DW_AT_decl_line   : 424
    <c2e>   DW_AT_decl_column : 26
    <c2f>   DW_AT_type        : <0xb5e>
    <c33>   DW_AT_external    : 1
    <c34>   DW_AT_declaration : 1
 <1><c35>: Abbrev Number: 12 (DW_TAG_variable)
    <c36>   DW_AT_name        : (indirect string, offset: 0x114): netlink_protocols
    <c3a>   DW_AT_decl_file   : 18
    <c3b>   DW_AT_decl_line   : 425
    <c3d>   DW_AT_decl_column : 26
    <c3e>   DW_AT_type        : <0xb5e>
    <c42>   DW_AT_external    : 1
    <c43>   DW_AT_declaration : 1
 <1><c44>: Abbrev Number: 12 (DW_TAG_variable)
    <c45>   DW_AT_name        : (indirect string, offset: 0xf00): nl_bridge_vlan_flags
    <c49>   DW_AT_decl_file   : 18
    <c4a>   DW_AT_decl_line   : 426
    <c4c>   DW_AT_decl_column : 26
    <c4d>   DW_AT_type        : <0xb5e>
    <c51>   DW_AT_external    : 1
    <c52>   DW_AT_declaration : 1
 <1><c53>: Abbrev Number: 12 (DW_TAG_variable)
    <c54>   DW_AT_name        : (indirect string, offset: 0xda0): nl_netfilter_msg_types
    <c58>   DW_AT_decl_file   : 18
    <c59>   DW_AT_decl_line   : 427
    <c5b>   DW_AT_decl_column : 26
    <c5c>   DW_AT_type        : <0xb5e>
    <c60>   DW_AT_external    : 1
    <c61>   DW_AT_declaration : 1
 <1><c62>: Abbrev Number: 12 (DW_TAG_variable)
    <c63>   DW_AT_name        : (indirect string, offset: 0x454): nl_route_types
    <c67>   DW_AT_decl_file   : 18
    <c68>   DW_AT_decl_line   : 428
    <c6a>   DW_AT_decl_column : 26
    <c6b>   DW_AT_type        : <0xb5e>
    <c6f>   DW_AT_external    : 1
    <c70>   DW_AT_declaration : 1
 <1><c71>: Abbrev Number: 12 (DW_TAG_variable)
    <c72>   DW_AT_name        : (indirect string, offset: 0xe6e): open_access_modes
    <c76>   DW_AT_decl_file   : 18
    <c77>   DW_AT_decl_line   : 429
    <c79>   DW_AT_decl_column : 26
    <c7a>   DW_AT_type        : <0xb5e>
    <c7e>   DW_AT_external    : 1
    <c7f>   DW_AT_declaration : 1
 <1><c80>: Abbrev Number: 12 (DW_TAG_variable)
    <c81>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c85>   DW_AT_decl_file   : 18
    <c86>   DW_AT_decl_line   : 430
    <c88>   DW_AT_decl_column : 26
    <c89>   DW_AT_type        : <0xb5e>
    <c8d>   DW_AT_external    : 1
    <c8e>   DW_AT_declaration : 1
 <1><c8f>: Abbrev Number: 12 (DW_TAG_variable)
    <c90>   DW_AT_name        : (indirect string, offset: 0xc31): perf_type_id
    <c94>   DW_AT_decl_file   : 18
    <c95>   DW_AT_decl_line   : 431
    <c97>   DW_AT_decl_column : 26
    <c98>   DW_AT_type        : <0xb5e>
    <c9c>   DW_AT_external    : 1
    <c9d>   DW_AT_declaration : 1
 <1><c9e>: Abbrev Number: 12 (DW_TAG_variable)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xe30): pollflags
    <ca3>   DW_AT_decl_file   : 18
    <ca4>   DW_AT_decl_line   : 432
    <ca6>   DW_AT_decl_column : 26
    <ca7>   DW_AT_type        : <0xb5e>
    <cab>   DW_AT_external    : 1
    <cac>   DW_AT_declaration : 1
 <1><cad>: Abbrev Number: 12 (DW_TAG_variable)
    <cae>   DW_AT_name        : (indirect string, offset: 0x556): ptrace_cmds
    <cb2>   DW_AT_decl_file   : 18
    <cb3>   DW_AT_decl_line   : 433
    <cb5>   DW_AT_decl_column : 26
    <cb6>   DW_AT_type        : <0xb5e>
    <cba>   DW_AT_external    : 1
    <cbb>   DW_AT_declaration : 1
 <1><cbc>: Abbrev Number: 12 (DW_TAG_variable)
    <cbd>   DW_AT_name        : (indirect string, offset: 0x7e4): resource_flags
    <cc1>   DW_AT_decl_file   : 18
    <cc2>   DW_AT_decl_line   : 434
    <cc4>   DW_AT_decl_column : 26
    <cc5>   DW_AT_type        : <0xb5e>
    <cc9>   DW_AT_external    : 1
    <cca>   DW_AT_declaration : 1
 <1><ccb>: Abbrev Number: 12 (DW_TAG_variable)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x2a2): route_nexthop_flags
    <cd0>   DW_AT_decl_file   : 18
    <cd1>   DW_AT_decl_line   : 435
    <cd3>   DW_AT_decl_column : 26
    <cd4>   DW_AT_type        : <0xb5e>
    <cd8>   DW_AT_external    : 1
    <cd9>   DW_AT_declaration : 1
 <1><cda>: Abbrev Number: 12 (DW_TAG_variable)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xe8b): routing_protocols
    <cdf>   DW_AT_decl_file   : 18
    <ce0>   DW_AT_decl_line   : 436
    <ce2>   DW_AT_decl_column : 26
    <ce3>   DW_AT_type        : <0xb5e>
    <ce7>   DW_AT_external    : 1
    <ce8>   DW_AT_declaration : 1
 <1><ce9>: Abbrev Number: 12 (DW_TAG_variable)
    <cea>   DW_AT_name        : (indirect string, offset: 0x463): routing_scopes
    <cee>   DW_AT_decl_file   : 18
    <cef>   DW_AT_decl_line   : 437
    <cf1>   DW_AT_decl_column : 26
    <cf2>   DW_AT_type        : <0xb5e>
    <cf6>   DW_AT_external    : 1
    <cf7>   DW_AT_declaration : 1
 <1><cf8>: Abbrev Number: 12 (DW_TAG_variable)
    <cf9>   DW_AT_name        : (indirect string, offset: 0xd8e): routing_table_ids
    <cfd>   DW_AT_decl_file   : 18
    <cfe>   DW_AT_decl_line   : 438
    <d00>   DW_AT_decl_column : 26
    <d01>   DW_AT_type        : <0xb5e>
    <d05>   DW_AT_external    : 1
    <d06>   DW_AT_declaration : 1
 <1><d07>: Abbrev Number: 12 (DW_TAG_variable)
    <d08>   DW_AT_name        : (indirect string, offset: 0x684): routing_types
    <d0c>   DW_AT_decl_file   : 18
    <d0d>   DW_AT_decl_line   : 439
    <d0f>   DW_AT_decl_column : 26
    <d10>   DW_AT_type        : <0xb5e>
    <d14>   DW_AT_external    : 1
    <d15>   DW_AT_declaration : 1
 <1><d16>: Abbrev Number: 12 (DW_TAG_variable)
    <d17>   DW_AT_name        : (indirect string, offset: 0x1cc): rwf_flags
    <d1b>   DW_AT_decl_file   : 18
    <d1c>   DW_AT_decl_line   : 440
    <d1e>   DW_AT_decl_column : 26
    <d1f>   DW_AT_type        : <0xb5e>
    <d23>   DW_AT_external    : 1
    <d24>   DW_AT_declaration : 1
 <1><d25>: Abbrev Number: 12 (DW_TAG_variable)
    <d26>   DW_AT_name        : (indirect string, offset: 0x81c): seccomp_filter_flags
    <d2a>   DW_AT_decl_file   : 18
    <d2b>   DW_AT_decl_line   : 441
    <d2d>   DW_AT_decl_column : 26
    <d2e>   DW_AT_type        : <0xb5e>
    <d32>   DW_AT_external    : 1
    <d33>   DW_AT_declaration : 1
 <1><d34>: Abbrev Number: 12 (DW_TAG_variable)
    <d35>   DW_AT_name        : (indirect string, offset: 0x2e9): seccomp_ret_action
    <d39>   DW_AT_decl_file   : 18
    <d3a>   DW_AT_decl_line   : 442
    <d3c>   DW_AT_decl_column : 26
    <d3d>   DW_AT_type        : <0xb5e>
    <d41>   DW_AT_external    : 1
    <d42>   DW_AT_declaration : 1
 <1><d43>: Abbrev Number: 12 (DW_TAG_variable)
    <d44>   DW_AT_name        : (indirect string, offset: 0x42f): setns_types
    <d48>   DW_AT_decl_file   : 18
    <d49>   DW_AT_decl_line   : 443
    <d4b>   DW_AT_decl_column : 26
    <d4c>   DW_AT_type        : <0xb5e>
    <d50>   DW_AT_external    : 1
    <d51>   DW_AT_declaration : 1
 <1><d52>: Abbrev Number: 12 (DW_TAG_variable)
    <d53>   DW_AT_name        : (indirect string, offset: 0xe1c): sg_io_info
    <d57>   DW_AT_decl_file   : 18
    <d58>   DW_AT_decl_line   : 444
    <d5a>   DW_AT_decl_column : 26
    <d5b>   DW_AT_type        : <0xb5e>
    <d5f>   DW_AT_external    : 1
    <d60>   DW_AT_declaration : 1
 <1><d61>: Abbrev Number: 12 (DW_TAG_variable)
    <d62>   DW_AT_name        : (indirect string, offset: 0xba6): socketlayers
    <d66>   DW_AT_decl_file   : 18
    <d67>   DW_AT_decl_line   : 445
    <d69>   DW_AT_decl_column : 26
    <d6a>   DW_AT_type        : <0xb5e>
    <d6e>   DW_AT_external    : 1
    <d6f>   DW_AT_declaration : 1
 <1><d70>: Abbrev Number: 12 (DW_TAG_variable)
    <d71>   DW_AT_name        : (indirect string, offset: 0xd78): socktypes
    <d75>   DW_AT_decl_file   : 18
    <d76>   DW_AT_decl_line   : 446
    <d78>   DW_AT_decl_column : 26
    <d79>   DW_AT_type        : <0xb5e>
    <d7d>   DW_AT_external    : 1
    <d7e>   DW_AT_declaration : 1
 <1><d7f>: Abbrev Number: 12 (DW_TAG_variable)
    <d80>   DW_AT_name        : (indirect string, offset: 0xa54): tcp_state_flags
    <d84>   DW_AT_decl_file   : 18
    <d85>   DW_AT_decl_line   : 447
    <d87>   DW_AT_decl_column : 26
    <d88>   DW_AT_type        : <0xb5e>
    <d8c>   DW_AT_external    : 1
    <d8d>   DW_AT_declaration : 1
 <1><d8e>: Abbrev Number: 12 (DW_TAG_variable)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x749): tcp_states
    <d93>   DW_AT_decl_file   : 18
    <d94>   DW_AT_decl_line   : 448
    <d96>   DW_AT_decl_column : 26
    <d97>   DW_AT_type        : <0xb5e>
    <d9b>   DW_AT_external    : 1
    <d9c>   DW_AT_declaration : 1
 <1><d9d>: Abbrev Number: 12 (DW_TAG_variable)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x1069): whence_codes
    <da2>   DW_AT_decl_file   : 18
    <da3>   DW_AT_decl_line   : 449
    <da5>   DW_AT_decl_column : 26
    <da6>   DW_AT_type        : <0xb5e>
    <daa>   DW_AT_external    : 1
    <dab>   DW_AT_declaration : 1
 <1><dac>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <dad>   DW_AT_encoding    : 7	(unsigned)
    <dae>   DW_AT_byte_size   : 4
    <daf>   DW_AT_type        : <0x2b>
    <db3>   DW_AT_decl_file   : 18
    <db4>   DW_AT_decl_line   : 510
    <db6>   DW_AT_decl_column : 14
    <db7>   DW_AT_sibling     : <0xdce>
 <2><dbb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x972): CFLAG_NONE
    <dc0>   DW_AT_const_value : 0
 <2><dc1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x8b5): CFLAG_ONLY_STATS
    <dc6>   DW_AT_const_value : 1
 <2><dc7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xbb3): CFLAG_BOTH
    <dcc>   DW_AT_const_value : 2
 <2><dcd>: Abbrev Number: 0
 <1><dce>: Abbrev Number: 29 (DW_TAG_typedef)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x110b): cflag_t
    <dd3>   DW_AT_decl_file   : 18
    <dd4>   DW_AT_decl_line   : 514
    <dd6>   DW_AT_decl_column : 3
    <dd7>   DW_AT_type        : <0xdac>
 <1><ddb>: Abbrev Number: 12 (DW_TAG_variable)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xccb): cflag
    <de0>   DW_AT_decl_file   : 18
    <de1>   DW_AT_decl_line   : 515
    <de3>   DW_AT_decl_column : 16
    <de4>   DW_AT_type        : <0xdce>
    <de8>   DW_AT_external    : 1
    <de9>   DW_AT_declaration : 1
 <1><dea>: Abbrev Number: 12 (DW_TAG_variable)
    <deb>   DW_AT_name        : (indirect string, offset: 0x18f): Tflag
    <def>   DW_AT_decl_file   : 18
    <df0>   DW_AT_decl_line   : 516
    <df2>   DW_AT_decl_column : 13
    <df3>   DW_AT_type        : <0x525>
    <df7>   DW_AT_external    : 1
    <df8>   DW_AT_declaration : 1
 <1><df9>: Abbrev Number: 12 (DW_TAG_variable)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x79f): Tflag_scale
    <dfe>   DW_AT_decl_file   : 18
    <dff>   DW_AT_decl_line   : 517
    <e01>   DW_AT_decl_column : 12
    <e02>   DW_AT_type        : <0x64>
    <e06>   DW_AT_external    : 1
    <e07>   DW_AT_declaration : 1
 <1><e08>: Abbrev Number: 12 (DW_TAG_variable)
    <e09>   DW_AT_name        : (indirect string, offset: 0x831): Tflag_width
    <e0d>   DW_AT_decl_file   : 18
    <e0e>   DW_AT_decl_line   : 518
    <e10>   DW_AT_decl_column : 12
    <e11>   DW_AT_type        : <0x64>
    <e15>   DW_AT_external    : 1
    <e16>   DW_AT_declaration : 1
 <1><e17>: Abbrev Number: 12 (DW_TAG_variable)
    <e18>   DW_AT_name        : (indirect string, offset: 0xe0e): iflag
    <e1c>   DW_AT_decl_file   : 18
    <e1d>   DW_AT_decl_line   : 519
    <e1f>   DW_AT_decl_column : 13
    <e20>   DW_AT_type        : <0x525>
    <e24>   DW_AT_external    : 1
    <e25>   DW_AT_declaration : 1
 <1><e26>: Abbrev Number: 12 (DW_TAG_variable)
    <e27>   DW_AT_name        : (indirect string, offset: 0x596): count_wallclock
    <e2b>   DW_AT_decl_file   : 18
    <e2c>   DW_AT_decl_line   : 520
    <e2e>   DW_AT_decl_column : 13
    <e2f>   DW_AT_type        : <0x525>
    <e33>   DW_AT_external    : 1
    <e34>   DW_AT_declaration : 1
 <1><e35>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e36>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e3a>   DW_AT_byte_size   : 4
    <e3b>   DW_AT_decl_file   : 18
    <e3c>   DW_AT_decl_line   : 522
    <e3e>   DW_AT_decl_column : 8
    <e3f>   DW_AT_sibling     : <0xe54>
 <2><e43>: Abbrev Number: 23 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e48>   DW_AT_decl_file   : 18
    <e49>   DW_AT_decl_line   : 523
    <e4b>   DW_AT_decl_column : 14
    <e4c>   DW_AT_type        : <0x1d9>
    <e50>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e55>   DW_AT_name        : (indirect string, offset: 0x754): path_set
    <e59>   DW_AT_byte_size   : 12
    <e5a>   DW_AT_decl_file   : 18
    <e5b>   DW_AT_decl_line   : 527
    <e5d>   DW_AT_decl_column : 15
    <e5e>   DW_AT_sibling     : <0xe93>
 <2><e62>: Abbrev Number: 23 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0x6e2): paths_selected
    <e67>   DW_AT_decl_file   : 18
    <e68>   DW_AT_decl_line   : 528
    <e6a>   DW_AT_decl_column : 24
    <e6b>   DW_AT_type        : <0xe93>
    <e6f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e72>: Abbrev Number: 23 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x105c): num_selected
    <e77>   DW_AT_decl_file   : 18
    <e78>   DW_AT_decl_line   : 529
    <e7a>   DW_AT_decl_column : 9
    <e7b>   DW_AT_type        : <0x132>
    <e7f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e82>: Abbrev Number: 23 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0xb63): size
    <e87>   DW_AT_decl_file   : 18
    <e88>   DW_AT_decl_line   : 530
    <e8a>   DW_AT_decl_column : 9
    <e8b>   DW_AT_type        : <0x132>
    <e8f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e92>: Abbrev Number: 0
 <1><e93>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e94>   DW_AT_byte_size   : 4
    <e95>   DW_AT_type        : <0xe35>
 <1><e99>: Abbrev Number: 12 (DW_TAG_variable)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x10ab): global_path_set
    <e9e>   DW_AT_decl_file   : 18
    <e9f>   DW_AT_decl_line   : 531
    <ea1>   DW_AT_decl_column : 3
    <ea2>   DW_AT_type        : <0xe54>
    <ea6>   DW_AT_external    : 1
    <ea7>   DW_AT_declaration : 1
 <1><ea8>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ea9>   DW_AT_name        : (indirect string, offset: 0xf78): xflag_opts
    <ead>   DW_AT_encoding    : 7	(unsigned)
    <eae>   DW_AT_byte_size   : 4
    <eaf>   DW_AT_type        : <0x2b>
    <eb3>   DW_AT_decl_file   : 18
    <eb4>   DW_AT_decl_line   : 533
    <eb6>   DW_AT_decl_column : 6
    <eb7>   DW_AT_sibling     : <0xeda>
 <2><ebb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x9f5): HEXSTR_NONE
    <ec0>   DW_AT_const_value : 0
 <2><ec1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xfd6): HEXSTR_NON_ASCII
    <ec6>   DW_AT_const_value : 1
 <2><ec7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x8f3): HEXSTR_ALL
    <ecc>   DW_AT_const_value : 2
 <2><ecd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ece>   DW_AT_name        : (indirect string, offset: 0x66d): HEXSTR_NON_ASCII_CHARS
    <ed2>   DW_AT_const_value : 3
 <2><ed3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x1076): NUM_HEXSTR_OPTS
    <ed8>   DW_AT_const_value : 4
 <2><ed9>: Abbrev Number: 0
 <1><eda>: Abbrev Number: 12 (DW_TAG_variable)
    <edb>   DW_AT_name        : (indirect string, offset: 0xde8): xflag
    <edf>   DW_AT_decl_file   : 18
    <ee0>   DW_AT_decl_line   : 546
    <ee2>   DW_AT_decl_column : 17
    <ee3>   DW_AT_type        : <0x2b>
    <ee7>   DW_AT_external    : 1
    <ee8>   DW_AT_declaration : 1
 <1><ee9>: Abbrev Number: 12 (DW_TAG_variable)
    <eea>   DW_AT_name        : (indirect string, offset: 0xc86): followfork
    <eee>   DW_AT_decl_file   : 18
    <eef>   DW_AT_decl_line   : 547
    <ef1>   DW_AT_decl_column : 13
    <ef2>   DW_AT_type        : <0x525>
    <ef6>   DW_AT_external    : 1
    <ef7>   DW_AT_declaration : 1
 <1><ef8>: Abbrev Number: 12 (DW_TAG_variable)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x337): output_separately
    <efd>   DW_AT_decl_file   : 18
    <efe>   DW_AT_decl_line   : 548
    <f00>   DW_AT_decl_column : 13
    <f01>   DW_AT_type        : <0x525>
    <f05>   DW_AT_external    : 1
    <f06>   DW_AT_declaration : 1
 <1><f07>: Abbrev Number: 12 (DW_TAG_variable)
    <f08>   DW_AT_name        : (indirect string, offset: 0x233): stack_trace_enabled
    <f0c>   DW_AT_decl_file   : 18
    <f0d>   DW_AT_decl_line   : 551
    <f0f>   DW_AT_decl_column : 13
    <f10>   DW_AT_type        : <0x525>
    <f14>   DW_AT_external    : 1
    <f15>   DW_AT_declaration : 1
 <1><f16>: Abbrev Number: 12 (DW_TAG_variable)
    <f17>   DW_AT_name        : (indirect string, offset: 0x65b): ptrace_setoptions
    <f1b>   DW_AT_decl_file   : 18
    <f1c>   DW_AT_decl_line   : 555
    <f1e>   DW_AT_decl_column : 17
    <f1f>   DW_AT_type        : <0x2b>
    <f23>   DW_AT_external    : 1
    <f24>   DW_AT_declaration : 1
 <1><f25>: Abbrev Number: 12 (DW_TAG_variable)
    <f26>   DW_AT_name        : (indirect string, offset: 0x9ea): max_strlen
    <f2a>   DW_AT_decl_file   : 18
    <f2b>   DW_AT_decl_line   : 556
    <f2d>   DW_AT_decl_column : 17
    <f2e>   DW_AT_type        : <0x2b>
    <f32>   DW_AT_external    : 1
    <f33>   DW_AT_declaration : 1
 <1><f34>: Abbrev Number: 12 (DW_TAG_variable)
    <f35>   DW_AT_name        : (indirect string, offset: 0xa2e): os_release
    <f39>   DW_AT_decl_file   : 18
    <f3a>   DW_AT_decl_line   : 557
    <f3c>   DW_AT_decl_column : 17
    <f3d>   DW_AT_type        : <0x2b>
    <f41>   DW_AT_external    : 1
    <f42>   DW_AT_declaration : 1
 <1><f43>: Abbrev Number: 12 (DW_TAG_variable)
    <f44>   DW_AT_name        : (indirect string, offset: 0x6f1): xlat_verbosity
    <f48>   DW_AT_decl_file   : 18
    <f49>   DW_AT_decl_line   : 919
    <f4b>   DW_AT_decl_column : 24
    <f4c>   DW_AT_type        : <0xa81>
    <f50>   DW_AT_external    : 1
    <f51>   DW_AT_declaration : 1
 <1><f52>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f53>   DW_AT_name        : (indirect string, offset: 0x579): xlat_style_private_flag_bits
    <f57>   DW_AT_encoding    : 7	(unsigned)
    <f58>   DW_AT_byte_size   : 4
    <f59>   DW_AT_type        : <0x2b>
    <f5d>   DW_AT_decl_file   : 18
    <f5e>   DW_AT_decl_line   : 939
    <f60>   DW_AT_decl_column : 6
    <f61>   DW_AT_sibling     : <0xf7e>
 <2><f65>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0x2b6): PAF_PRINT_INDICES_BIT
    <f6a>   DW_AT_const_value : 5
 <2><f6b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f6c>   DW_AT_name        : (indirect string, offset: 0xb10): PAF_ARRAY_TRUNCATED_BIT
    <f70>   DW_AT_const_value : 6
 <2><f71>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f72>   DW_AT_name        : (indirect string, offset: 0x3ef): PXF_DEFAULT_STR_BIT
    <f76>   DW_AT_const_value : 7
 <2><f77>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0xc68): SPFF_AUXSTR_MODE_BIT
    <f7c>   DW_AT_const_value : 8
 <2><f7d>: Abbrev Number: 0
 <1><f7e>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xd17): find_xlat_flag_bits
    <f83>   DW_AT_encoding    : 7	(unsigned)
    <f84>   DW_AT_byte_size   : 4
    <f85>   DW_AT_type        : <0x2b>
    <f89>   DW_AT_decl_file   : 18
    <f8a>   DW_AT_decl_line   : 1443
    <f8c>   DW_AT_decl_column : 6
    <f8d>   DW_AT_sibling     : <0xf98>
 <2><f91>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f92>   DW_AT_name        : (indirect string, offset: 0x930): FXL_CASE_SENSITIVE_BIT
    <f96>   DW_AT_const_value : 0
 <2><f97>: Abbrev Number: 0
 <1><f98>: Abbrev Number: 12 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0x9bd): printing_tcp
    <f9d>   DW_AT_decl_file   : 18
    <f9e>   DW_AT_decl_line   : 1689
    <fa0>   DW_AT_decl_column : 20
    <fa1>   DW_AT_type        : <0x626>
    <fa5>   DW_AT_external    : 1
    <fa6>   DW_AT_declaration : 1
 <1><fa7>: Abbrev Number: 12 (DW_TAG_variable)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x541): errnoent
    <fac>   DW_AT_decl_file   : 18
    <fad>   DW_AT_decl_line   : 1887
    <faf>   DW_AT_decl_column : 26
    <fb0>   DW_AT_type        : <0x459>
    <fb4>   DW_AT_external    : 1
    <fb5>   DW_AT_declaration : 1
 <1><fb6>: Abbrev Number: 12 (DW_TAG_variable)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x83d): signalent
    <fbb>   DW_AT_decl_file   : 18
    <fbc>   DW_AT_decl_line   : 1888
    <fbe>   DW_AT_decl_column : 26
    <fbf>   DW_AT_type        : <0x459>
    <fc3>   DW_AT_external    : 1
    <fc4>   DW_AT_declaration : 1
 <1><fc5>: Abbrev Number: 12 (DW_TAG_variable)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xe66): nerrnos
    <fca>   DW_AT_decl_file   : 18
    <fcb>   DW_AT_decl_line   : 1889
    <fcd>   DW_AT_decl_column : 27
    <fce>   DW_AT_type        : <0x32>
    <fd2>   DW_AT_external    : 1
    <fd3>   DW_AT_declaration : 1
 <1><fd4>: Abbrev Number: 12 (DW_TAG_variable)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x1045): nsignals
    <fd9>   DW_AT_decl_file   : 18
    <fda>   DW_AT_decl_line   : 1890
    <fdc>   DW_AT_decl_column : 27
    <fdd>   DW_AT_type        : <0x32>
    <fe1>   DW_AT_external    : 1
    <fe2>   DW_AT_declaration : 1
 <1><fe3>: Abbrev Number: 6 (DW_TAG_array_type)
    <fe4>   DW_AT_type        : <0x8a0>
    <fe8>   DW_AT_sibling     : <0xfee>
 <2><fec>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fed>: Abbrev Number: 0
 <1><fee>: Abbrev Number: 3 (DW_TAG_const_type)
    <fef>   DW_AT_type        : <0xfe3>
 <1><ff3>: Abbrev Number: 12 (DW_TAG_variable)
    <ff4>   DW_AT_name        : (indirect string, offset: 0xce2): sysent0
    <ff8>   DW_AT_decl_file   : 18
    <ff9>   DW_AT_decl_line   : 1892
    <ffb>   DW_AT_decl_column : 28
    <ffc>   DW_AT_type        : <0xfee>
    <1000>   DW_AT_external    : 1
    <1001>   DW_AT_declaration : 1
 <1><1002>: Abbrev Number: 6 (DW_TAG_array_type)
    <1003>   DW_AT_type        : <0x907>
    <1007>   DW_AT_sibling     : <0x100d>
 <2><100b>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><100c>: Abbrev Number: 0
 <1><100d>: Abbrev Number: 3 (DW_TAG_const_type)
    <100e>   DW_AT_type        : <0x1002>
 <1><1012>: Abbrev Number: 12 (DW_TAG_variable)
    <1013>   DW_AT_name        : (indirect string, offset: 0x10a1): ioctlent0
    <1017>   DW_AT_decl_file   : 18
    <1018>   DW_AT_decl_line   : 1893
    <101a>   DW_AT_decl_column : 30
    <101b>   DW_AT_type        : <0x100d>
    <101f>   DW_AT_external    : 1
    <1020>   DW_AT_declaration : 1
 <1><1021>: Abbrev Number: 12 (DW_TAG_variable)
    <1022>   DW_AT_name        : (indirect string, offset: 0xf83): personality_names
    <1026>   DW_AT_decl_file   : 18
    <1027>   DW_AT_decl_line   : 1895
    <1029>   DW_AT_decl_column : 26
    <102a>   DW_AT_type        : <0x459>
    <102e>   DW_AT_external    : 1
    <102f>   DW_AT_declaration : 1
 <1><1030>: Abbrev Number: 12 (DW_TAG_variable)
    <1031>   DW_AT_name        : (indirect string, offset: 0x85d): sysent
    <1035>   DW_AT_decl_file   : 18
    <1036>   DW_AT_decl_line   : 1898
    <1038>   DW_AT_decl_column : 29
    <1039>   DW_AT_type        : <0x9ec>
    <103d>   DW_AT_external    : 1
    <103e>   DW_AT_declaration : 1
 <1><103f>: Abbrev Number: 12 (DW_TAG_variable)
    <1040>   DW_AT_name        : (indirect string, offset: 0xc7d): ioctlent
    <1044>   DW_AT_decl_file   : 18
    <1045>   DW_AT_decl_line   : 1899
    <1047>   DW_AT_decl_column : 31
    <1048>   DW_AT_type        : <0x104e>
    <104c>   DW_AT_external    : 1
    <104d>   DW_AT_declaration : 1
 <1><104e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <104f>   DW_AT_byte_size   : 4
    <1050>   DW_AT_type        : <0x907>
 <1><1054>: Abbrev Number: 12 (DW_TAG_variable)
    <1055>   DW_AT_name        : (indirect string, offset: 0x847): nsyscalls
    <1059>   DW_AT_decl_file   : 18
    <105a>   DW_AT_decl_line   : 1905
    <105c>   DW_AT_decl_column : 17
    <105d>   DW_AT_type        : <0x2b>
    <1061>   DW_AT_external    : 1
    <1062>   DW_AT_declaration : 1
 <1><1063>: Abbrev Number: 12 (DW_TAG_variable)
    <1064>   DW_AT_name        : (indirect string, offset: 0xe80): nioctlents
    <1068>   DW_AT_decl_file   : 18
    <1069>   DW_AT_decl_line   : 1906
    <106b>   DW_AT_decl_column : 17
    <106c>   DW_AT_type        : <0x2b>
    <1070>   DW_AT_external    : 1
    <1071>   DW_AT_declaration : 1
 <1><1072>: Abbrev Number: 6 (DW_TAG_array_type)
    <1073>   DW_AT_type        : <0x32>
    <1077>   DW_AT_sibling     : <0x1082>
 <2><107b>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <107c>   DW_AT_type        : <0x2b>
    <1080>   DW_AT_upper_bound : 2
 <2><1081>: Abbrev Number: 0
 <1><1082>: Abbrev Number: 3 (DW_TAG_const_type)
    <1083>   DW_AT_type        : <0x1072>
 <1><1087>: Abbrev Number: 12 (DW_TAG_variable)
    <1088>   DW_AT_name        : (indirect string, offset: 0xee0): nsyscall_vec
    <108c>   DW_AT_decl_file   : 18
    <108d>   DW_AT_decl_line   : 1908
    <108f>   DW_AT_decl_column : 27
    <1090>   DW_AT_type        : <0x1082>
    <1094>   DW_AT_external    : 1
    <1095>   DW_AT_declaration : 1
 <1><1096>: Abbrev Number: 6 (DW_TAG_array_type)
    <1097>   DW_AT_type        : <0x9f2>
    <109b>   DW_AT_sibling     : <0x10a6>
 <2><109f>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10a0>   DW_AT_type        : <0x2b>
    <10a4>   DW_AT_upper_bound : 2
 <2><10a5>: Abbrev Number: 0
 <1><10a6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10a7>   DW_AT_type        : <0x1096>
 <1><10ab>: Abbrev Number: 12 (DW_TAG_variable)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x78c): sysent_vec
    <10b0>   DW_AT_decl_file   : 18
    <10b1>   DW_AT_decl_line   : 1909
    <10b3>   DW_AT_decl_column : 35
    <10b4>   DW_AT_type        : <0x10a6>
    <10b8>   DW_AT_external    : 1
    <10b9>   DW_AT_declaration : 1
 <1><10ba>: Abbrev Number: 12 (DW_TAG_variable)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x390): inject_vec
    <10bf>   DW_AT_decl_file   : 18
    <10c0>   DW_AT_decl_line   : 1910
    <10c2>   DW_AT_decl_column : 28
    <10c3>   DW_AT_type        : <0x9f7>
    <10c7>   DW_AT_external    : 1
    <10c8>   DW_AT_declaration : 1
 <1><10c9>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10ca>   DW_AT_name        : (indirect string, offset: 0xd6b): audit_arch_t
    <10ce>   DW_AT_byte_size   : 8
    <10cf>   DW_AT_decl_file   : 18
    <10d0>   DW_AT_decl_line   : 1912
    <10d2>   DW_AT_decl_column : 8
    <10d3>   DW_AT_sibling     : <0x10f8>
 <2><10d7>: Abbrev Number: 23 (DW_TAG_member)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x56b): arch
    <10dc>   DW_AT_decl_file   : 18
    <10dd>   DW_AT_decl_line   : 1913
    <10df>   DW_AT_decl_column : 15
    <10e0>   DW_AT_type        : <0x2b>
    <10e4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10e7>: Abbrev Number: 23 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x9a3): flag
    <10ec>   DW_AT_decl_file   : 18
    <10ed>   DW_AT_decl_line   : 1914
    <10ef>   DW_AT_decl_column : 15
    <10f0>   DW_AT_type        : <0x2b>
    <10f4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10f7>: Abbrev Number: 0
 <1><10f8>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f9>   DW_AT_type        : <0x10c9>
 <1><10fd>: Abbrev Number: 6 (DW_TAG_array_type)
    <10fe>   DW_AT_type        : <0x10f8>
    <1102>   DW_AT_sibling     : <0x110d>
 <2><1106>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1107>   DW_AT_type        : <0x2b>
    <110b>   DW_AT_upper_bound : 2
 <2><110c>: Abbrev Number: 0
 <1><110d>: Abbrev Number: 3 (DW_TAG_const_type)
    <110e>   DW_AT_type        : <0x10fd>
 <1><1112>: Abbrev Number: 12 (DW_TAG_variable)
    <1113>   DW_AT_name        : (indirect string, offset: 0x921): audit_arch_vec
    <1117>   DW_AT_decl_file   : 18
    <1118>   DW_AT_decl_line   : 1917
    <111a>   DW_AT_decl_column : 34
    <111b>   DW_AT_type        : <0x110d>
    <111f>   DW_AT_external    : 1
    <1120>   DW_AT_declaration : 1
 <1><1121>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1122>   DW_AT_byte_size   : 180
    <1123>   DW_AT_decl_file   : 20
    <1124>   DW_AT_decl_line   : 2
    <1125>   DW_AT_decl_column : 9
    <1126>   DW_AT_sibling     : <0x13db>
 <2><112a>: Abbrev Number: 11 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0x1e4): block_ioctl
    <112f>   DW_AT_decl_file   : 20
    <1130>   DW_AT_decl_line   : 3
    <1131>   DW_AT_decl_column : 8
    <1132>   DW_AT_type        : <0x13f5>
    <1136>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1139>: Abbrev Number: 11 (DW_TAG_member)
    <113a>   DW_AT_name        : (indirect string, offset: 0xaa7): btrfs_ioctl
    <113e>   DW_AT_decl_file   : 20
    <113f>   DW_AT_decl_line   : 6
    <1140>   DW_AT_decl_column : 8
    <1141>   DW_AT_type        : <0x13f5>
    <1145>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1148>: Abbrev Number: 11 (DW_TAG_member)
    <1149>   DW_AT_name        : (indirect string, offset: 0x72a): evdev_write_ioctl_mpers
    <114d>   DW_AT_decl_file   : 20
    <114e>   DW_AT_decl_line   : 9
    <114f>   DW_AT_decl_column : 8
    <1150>   DW_AT_type        : <0x13f5>
    <1154>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1157>: Abbrev Number: 11 (DW_TAG_member)
    <1158>   DW_AT_name        : (indirect string, offset: 0x700): get_sock_fprog_size
    <115c>   DW_AT_decl_file   : 20
