Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x172b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5cf): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xdb9): mpers-m32/struct_group_req.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb48): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3ad): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1011): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x989): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x350): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x25a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe2b): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x48c): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x86f): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf04): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8b5): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x77a): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb75): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbb7): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2c0): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd03): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc78): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3f9): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x452): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x35c): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xba2): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xfac): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe3b): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb0b): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10f4): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe61): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xacd): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0xfd5): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x277): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x3a5): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0xffb): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x74d): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc67): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x1107): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x364): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0xa16): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4db): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xf59): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x7b6): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x135): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x104a): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x901): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x972): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xd9b): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1c6): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xcca): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x56f): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x209): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xfc0): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x7a2): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x81b): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x23c): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe87): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xcda): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x176): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x6e5): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xa56): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xfdf): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3c9): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xc3d): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x9d8): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xa3a): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x7d0): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xaed): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x481): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x302): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x378): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x53a): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0x1024): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xe24): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x248): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x549): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x264): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xe96): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x6be): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xbe2): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1b3): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xeeb): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x36d): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x9d1): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x1094): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4c6): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xf80): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x9e4): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x40b): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0xaa3): __kernel_long_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 15
    <528>   DW_AT_decl_column : 15
    <529>   DW_AT_type        : <0xae>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0x529): __kernel_ulong_t
    <532>   DW_AT_decl_file   : 14
    <533>   DW_AT_decl_line   : 16
    <534>   DW_AT_decl_column : 23
    <535>   DW_AT_type        : <0x37>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x3d7): kernel_long_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 25
    <541>   DW_AT_type        : <0x521>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x8a6): kernel_ulong_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 17
    <54c>   DW_AT_decl_column : 26
    <54d>   DW_AT_type        : <0x52d>
 <1><551>: Abbrev Number: 3 (DW_TAG_const_type)
    <552>   DW_AT_type        : <0x545>
 <1><556>: Abbrev Number: 8 (DW_TAG_structure_type)
    <557>   DW_AT_name        : (indirect string, offset: 0xc00): list_item
    <55b>   DW_AT_byte_size   : 8
    <55c>   DW_AT_decl_file   : 16
    <55d>   DW_AT_decl_line   : 92
    <55e>   DW_AT_decl_column : 8
    <55f>   DW_AT_sibling     : <0x582>
 <2><563>: Abbrev Number: 9 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x10ef): prev
    <568>   DW_AT_decl_file   : 16
    <569>   DW_AT_decl_line   : 93
    <56a>   DW_AT_decl_column : 20
    <56b>   DW_AT_type        : <0x582>
    <56f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><572>: Abbrev Number: 9 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x10db): next
    <577>   DW_AT_decl_file   : 16
    <578>   DW_AT_decl_line   : 94
    <579>   DW_AT_decl_column : 20
    <57a>   DW_AT_type        : <0x582>
    <57e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><581>: Abbrev Number: 0
 <1><582>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <583>   DW_AT_byte_size   : 4
    <584>   DW_AT_type        : <0x556>
 <1><588>: Abbrev Number: 8 (DW_TAG_structure_type)
    <589>   DW_AT_name        : (indirect string, offset: 0x868): sysent
    <58d>   DW_AT_byte_size   : 20
    <58e>   DW_AT_decl_file   : 17
    <58f>   DW_AT_decl_line   : 13
    <590>   DW_AT_decl_column : 16
    <591>   DW_AT_sibling     : <0x5e1>
 <2><595>: Abbrev Number: 9 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x103b): nargs
    <59a>   DW_AT_decl_file   : 17
    <59b>   DW_AT_decl_line   : 14
    <59c>   DW_AT_decl_column : 11
    <59d>   DW_AT_type        : <0x2b>
    <5a1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x97f): sys_flags
    <5a9>   DW_AT_decl_file   : 17
    <5aa>   DW_AT_decl_line   : 15
    <5ab>   DW_AT_decl_column : 6
    <5ac>   DW_AT_type        : <0x64>
    <5b0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b3>: Abbrev Number: 18 (DW_TAG_member)
    <5b4>   DW_AT_name        : sen
    <5b8>   DW_AT_decl_file   : 17
    <5b9>   DW_AT_decl_line   : 16
    <5ba>   DW_AT_decl_column : 6
    <5bb>   DW_AT_type        : <0x64>
    <5bf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5c2>: Abbrev Number: 9 (DW_TAG_member)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x2f9): sys_func
    <5c7>   DW_AT_decl_file   : 17
    <5c8>   DW_AT_decl_line   : 17
    <5c9>   DW_AT_decl_column : 8
    <5ca>   DW_AT_type        : <0x837>
    <5ce>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5d1>: Abbrev Number: 9 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x26e): sys_name
    <5d6>   DW_AT_decl_file   : 17
    <5d7>   DW_AT_decl_line   : 18
    <5d8>   DW_AT_decl_column : 14
    <5d9>   DW_AT_type        : <0x1c9>
    <5dd>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e0>: Abbrev Number: 0
 <1><5e1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5e2>   DW_AT_prototyped  : 1
    <5e3>   DW_AT_type        : <0x64>
    <5e7>   DW_AT_sibling     : <0x5f1>
 <2><5eb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5ec>   DW_AT_type        : <0x5f1>
 <2><5f0>: Abbrev Number: 0
 <1><5f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5f2>   DW_AT_byte_size   : 4
    <5f3>   DW_AT_type        : <0x5fc>
 <1><5f7>: Abbrev Number: 3 (DW_TAG_const_type)
    <5f8>   DW_AT_type        : <0x5f1>
 <1><5fc>: Abbrev Number: 21 (DW_TAG_structure_type)
    <5fd>   DW_AT_name        : tcb
    <601>   DW_AT_byte_size   : 200
    <602>   DW_AT_decl_file   : 18
    <603>   DW_AT_decl_line   : 262
    <605>   DW_AT_decl_column : 8
    <606>   DW_AT_sibling     : <0x837>
 <2><60a>: Abbrev Number: 22 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x4d5): flags
    <60f>   DW_AT_decl_file   : 18
    <610>   DW_AT_decl_line   : 263
    <612>   DW_AT_decl_column : 6
    <613>   DW_AT_type        : <0x64>
    <617>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><61a>: Abbrev Number: 23 (DW_TAG_member)
    <61b>   DW_AT_name        : pid
    <61f>   DW_AT_decl_file   : 18
    <620>   DW_AT_decl_line   : 264
    <622>   DW_AT_decl_column : 6
    <623>   DW_AT_type        : <0x64>
    <627>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><62a>: Abbrev Number: 22 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <62f>   DW_AT_decl_file   : 18
    <630>   DW_AT_decl_line   : 265
    <632>   DW_AT_decl_column : 6
    <633>   DW_AT_type        : <0x64>
    <637>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><63a>: Abbrev Number: 22 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x391): currpers
    <63f>   DW_AT_decl_file   : 18
    <640>   DW_AT_decl_line   : 267
    <642>   DW_AT_decl_column : 15
    <643>   DW_AT_type        : <0x2b>
    <647>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><64a>: Abbrev Number: 22 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0xb40): u_error
    <64f>   DW_AT_decl_file   : 18
    <650>   DW_AT_decl_line   : 269
    <652>   DW_AT_decl_column : 16
    <653>   DW_AT_type        : <0x37>
    <657>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><65a>: Abbrev Number: 22 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x193): scno
    <65f>   DW_AT_decl_file   : 18
    <660>   DW_AT_decl_line   : 270
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x545>
    <667>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><66a>: Abbrev Number: 22 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0xb98): true_scno
    <66f>   DW_AT_decl_file   : 18
    <670>   DW_AT_decl_line   : 271
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x545>
    <677>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67a>: Abbrev Number: 22 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x19d): u_arg
    <67f>   DW_AT_decl_file   : 18
    <680>   DW_AT_decl_line   : 272
    <682>   DW_AT_decl_column : 17
    <683>   DW_AT_type        : <0x967>
    <687>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><68a>: Abbrev Number: 22 (DW_TAG_member)
    <68b>   DW_AT_name        : (indirect string, offset: 0x996): u_rval
    <68f>   DW_AT_decl_file   : 18
    <690>   DW_AT_decl_line   : 273
    <692>   DW_AT_decl_column : 16
    <693>   DW_AT_type        : <0x539>
    <697>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><69a>: Abbrev Number: 22 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0xabf): sys_func_rval
    <69f>   DW_AT_decl_file   : 18
    <6a0>   DW_AT_decl_line   : 274
    <6a2>   DW_AT_decl_column : 6
    <6a3>   DW_AT_type        : <0x64>
    <6a7>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6aa>: Abbrev Number: 22 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0xcf4): curcol
    <6af>   DW_AT_decl_file   : 18
    <6b0>   DW_AT_decl_line   : 275
    <6b2>   DW_AT_decl_column : 6
    <6b3>   DW_AT_type        : <0x64>
    <6b7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ba>: Abbrev Number: 22 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x9b9): outf
    <6bf>   DW_AT_decl_file   : 18
    <6c0>   DW_AT_decl_line   : 276
    <6c2>   DW_AT_decl_column : 8
    <6c3>   DW_AT_type        : <0x40e>
    <6c7>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ca>: Abbrev Number: 22 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0xf2a): staged_output_data
    <6cf>   DW_AT_decl_file   : 18
    <6d0>   DW_AT_decl_line   : 277
    <6d2>   DW_AT_decl_column : 29
    <6d3>   DW_AT_type        : <0x97d>
    <6d7>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6da>: Abbrev Number: 22 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xa8a): auxstr
    <6df>   DW_AT_decl_file   : 18
    <6e0>   DW_AT_decl_line   : 279
    <6e2>   DW_AT_decl_column : 14
    <6e3>   DW_AT_type        : <0x1c9>
    <6e7>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><6ea>: Abbrev Number: 22 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x17c): _priv_data
    <6ef>   DW_AT_decl_file   : 18
    <6f0>   DW_AT_decl_line   : 280
    <6f2>   DW_AT_decl_column : 8
    <6f3>   DW_AT_type        : <0xcd>
    <6f7>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><6fa>: Abbrev Number: 22 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0xc2d): _free_priv_data
    <6ff>   DW_AT_decl_file   : 18
    <700>   DW_AT_decl_line   : 281
    <702>   DW_AT_decl_column : 9
    <703>   DW_AT_type        : <0x98f>
    <707>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><70a>: Abbrev Number: 22 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0x18d): s_ent
    <70f>   DW_AT_decl_file   : 18
    <710>   DW_AT_decl_line   : 282
    <712>   DW_AT_decl_column : 23
    <713>   DW_AT_type        : <0x995>
    <717>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><71a>: Abbrev Number: 22 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <71f>   DW_AT_decl_file   : 18
    <720>   DW_AT_decl_line   : 285
    <722>   DW_AT_decl_column : 23
    <723>   DW_AT_type        : <0x995>
    <727>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><72a>: Abbrev Number: 22 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x386): inject_vec
    <72f>   DW_AT_decl_file   : 18
    <730>   DW_AT_decl_line   : 286
    <732>   DW_AT_decl_column : 22
    <733>   DW_AT_type        : <0x9a0>
    <737>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><73a>: Abbrev Number: 22 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x7d9): stime
    <73f>   DW_AT_decl_file   : 18
    <740>   DW_AT_decl_line   : 287
    <742>   DW_AT_decl_column : 18
    <743>   DW_AT_type        : <0x133>
    <747>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><74a>: Abbrev Number: 22 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x39a): ltime
    <74f>   DW_AT_decl_file   : 18
    <750>   DW_AT_decl_line   : 288
    <752>   DW_AT_decl_column : 18
    <753>   DW_AT_type        : <0x133>
    <757>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x1002): atime
    <75f>   DW_AT_decl_file   : 18
    <760>   DW_AT_decl_line   : 289
    <762>   DW_AT_decl_column : 18
    <763>   DW_AT_type        : <0x133>
    <767>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><76a>: Abbrev Number: 22 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x4cf): etime
    <76f>   DW_AT_decl_file   : 18
    <770>   DW_AT_decl_line   : 290
    <772>   DW_AT_decl_column : 18
    <773>   DW_AT_type        : <0x133>
    <777>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><77b>: Abbrev Number: 22 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0xd58): delay_expiration_time
    <780>   DW_AT_decl_file   : 18
    <781>   DW_AT_decl_line   : 291
    <783>   DW_AT_decl_column : 18
    <784>   DW_AT_type        : <0x133>
    <788>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><78c>: Abbrev Number: 22 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <791>   DW_AT_decl_file   : 18
    <792>   DW_AT_decl_line   : 298
    <794>   DW_AT_decl_column : 15
    <795>   DW_AT_type        : <0x2b>
    <799>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><79d>: Abbrev Number: 22 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0xf66): last_dirfd
    <7a2>   DW_AT_decl_file   : 18
    <7a3>   DW_AT_decl_line   : 301
    <7a5>   DW_AT_decl_column : 6
    <7a6>   DW_AT_type        : <0x64>
    <7aa>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ae>: Abbrev Number: 22 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0xf8c): mmap_cache
    <7b3>   DW_AT_decl_file   : 18
    <7b4>   DW_AT_decl_line   : 304
    <7b6>   DW_AT_decl_column : 23
    <7b7>   DW_AT_type        : <0x9bc>
    <7bb>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7bf>: Abbrev Number: 22 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0xb62): wait_data_idx
    <7c4>   DW_AT_decl_file   : 18
    <7c5>   DW_AT_decl_line   : 311
    <7c7>   DW_AT_decl_column : 9
    <7c8>   DW_AT_type        : <0x122>
    <7cc>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7d0>: Abbrev Number: 22 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xa91): delayed_wait_data
    <7d5>   DW_AT_decl_file   : 18
    <7d6>   DW_AT_decl_line   : 313
    <7d8>   DW_AT_decl_column : 24
    <7d9>   DW_AT_type        : <0x9c8>
    <7dd>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7e1>: Abbrev Number: 22 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0xb01): wait_list
    <7e6>   DW_AT_decl_file   : 18
    <7e7>   DW_AT_decl_line   : 314
    <7e9>   DW_AT_decl_column : 19
    <7ea>   DW_AT_type        : <0x556>
    <7ee>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><7f2>: Abbrev Number: 22 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x6d6): vcpu_info_list
    <7f7>   DW_AT_decl_file   : 18
    <7f8>   DW_AT_decl_line   : 318
    <7fa>   DW_AT_decl_column : 20
    <7fb>   DW_AT_type        : <0x9d4>
    <7ff>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><803>: Abbrev Number: 22 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0xcbf): unwind_ctx
    <808>   DW_AT_decl_file   : 18
    <809>   DW_AT_decl_line   : 322
    <80b>   DW_AT_decl_column : 8
    <80c>   DW_AT_type        : <0xcd>
    <810>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><814>: Abbrev Number: 22 (DW_TAG_member)
    <815>   DW_AT_name        : (indirect string, offset: 0x4b9): unwind_queue
    <819>   DW_AT_decl_file   : 18
    <81a>   DW_AT_decl_line   : 323
    <81c>   DW_AT_decl_column : 25
    <81d>   DW_AT_type        : <0x9e0>
    <821>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><825>: Abbrev Number: 22 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0x171): comm
    <82a>   DW_AT_decl_file   : 18
    <82b>   DW_AT_decl_line   : 327
    <82d>   DW_AT_decl_column : 7
    <82e>   DW_AT_type        : <0x9e6>
    <832>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><836>: Abbrev Number: 0
 <1><837>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <838>   DW_AT_byte_size   : 4
    <839>   DW_AT_type        : <0x5e1>
 <1><83d>: Abbrev Number: 4 (DW_TAG_typedef)
    <83e>   DW_AT_name        : (indirect string, offset: 0x51b): struct_sysent
    <842>   DW_AT_decl_file   : 17
    <843>   DW_AT_decl_line   : 19
    <844>   DW_AT_decl_column : 3
    <845>   DW_AT_type        : <0x588>
 <1><849>: Abbrev Number: 3 (DW_TAG_const_type)
    <84a>   DW_AT_type        : <0x83d>
 <1><84e>: Abbrev Number: 11 (DW_TAG_variable)
    <84f>   DW_AT_name        : (indirect string, offset: 0xd44): current_personality
    <853>   DW_AT_decl_file   : 18
    <854>   DW_AT_decl_line   : 158
    <855>   DW_AT_decl_column : 17
    <856>   DW_AT_type        : <0x2b>
    <85a>   DW_AT_external    : 1
    <85b>   DW_AT_declaration : 1
 <1><85c>: Abbrev Number: 11 (DW_TAG_variable)
    <85d>   DW_AT_name        : (indirect string, offset: 0x80a): current_wordsize
    <861>   DW_AT_decl_file   : 18
    <862>   DW_AT_decl_line   : 171
    <863>   DW_AT_decl_column : 17
    <864>   DW_AT_type        : <0x2b>
    <868>   DW_AT_external    : 1
    <869>   DW_AT_declaration : 1
 <1><86a>: Abbrev Number: 11 (DW_TAG_variable)
    <86b>   DW_AT_name        : (indirect string, offset: 0xa68): current_klongsize
    <86f>   DW_AT_decl_file   : 18
    <870>   DW_AT_decl_line   : 176
    <871>   DW_AT_decl_column : 17
    <872>   DW_AT_type        : <0x2b>
    <876>   DW_AT_external    : 1
    <877>   DW_AT_declaration : 1
 <1><878>: Abbrev Number: 8 (DW_TAG_structure_type)
    <879>   DW_AT_name        : (indirect string, offset: 0xc96): ioctlent
    <87d>   DW_AT_byte_size   : 8
    <87e>   DW_AT_decl_file   : 18
    <87f>   DW_AT_decl_line   : 217
    <880>   DW_AT_decl_column : 16
    <881>   DW_AT_sibling     : <0x8a4>
 <2><885>: Abbrev Number: 9 (DW_TAG_member)
    <886>   DW_AT_name        : (indirect string, offset: 0xf52): symbol
    <88a>   DW_AT_decl_file   : 18
    <88b>   DW_AT_decl_line   : 218
    <88c>   DW_AT_decl_column : 14
    <88d>   DW_AT_type        : <0x1c9>
    <891>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><894>: Abbrev Number: 9 (DW_TAG_member)
    <895>   DW_AT_name        : (indirect string, offset: 0xd0d): code
    <899>   DW_AT_decl_file   : 18
    <89a>   DW_AT_decl_line   : 219
    <89b>   DW_AT_decl_column : 15
    <89c>   DW_AT_type        : <0x2b>
    <8a0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8a3>: Abbrev Number: 0
 <1><8a4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xc57): struct_ioctlent
    <8a9>   DW_AT_decl_file   : 18
    <8aa>   DW_AT_decl_line   : 220
    <8ab>   DW_AT_decl_column : 3
    <8ac>   DW_AT_type        : <0x878>
 <1><8b0>: Abbrev Number: 3 (DW_TAG_const_type)
    <8b1>   DW_AT_type        : <0x8a4>
 <1><8b5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x7fe): inject_data
    <8ba>   DW_AT_byte_size   : 10
    <8bb>   DW_AT_decl_file   : 18
    <8bc>   DW_AT_decl_line   : 241
    <8bd>   DW_AT_decl_column : 8
    <8be>   DW_AT_sibling     : <0x91d>
 <2><8c2>: Abbrev Number: 9 (DW_TAG_member)
    <8c3>   DW_AT_name        : (indirect string, offset: 0x4d5): flags
    <8c7>   DW_AT_decl_file   : 18
    <8c8>   DW_AT_decl_line   : 242
    <8c9>   DW_AT_decl_column : 10
    <8ca>   DW_AT_type        : <0xf2>
    <8ce>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d1>: Abbrev Number: 9 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x933): signo
    <8d6>   DW_AT_decl_file   : 18
    <8d7>   DW_AT_decl_line   : 243
    <8d8>   DW_AT_decl_column : 10
    <8d9>   DW_AT_type        : <0xf2>
    <8dd>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8e0>: Abbrev Number: 9 (DW_TAG_member)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x103): rval_idx
    <8e5>   DW_AT_decl_file   : 18
    <8e6>   DW_AT_decl_line   : 244
    <8e7>   DW_AT_decl_column : 11
    <8e8>   DW_AT_type        : <0xfe>
    <8ec>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><8ef>: Abbrev Number: 9 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xcea): delay_idx
    <8f4>   DW_AT_decl_file   : 18
    <8f5>   DW_AT_decl_line   : 245
    <8f6>   DW_AT_decl_column : 11
    <8f7>   DW_AT_type        : <0xfe>
    <8fb>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8fe>: Abbrev Number: 9 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x561): poke_idx
    <903>   DW_AT_decl_file   : 18
    <904>   DW_AT_decl_line   : 246
    <905>   DW_AT_decl_column : 11
    <906>   DW_AT_type        : <0xfe>
    <90a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><90d>: Abbrev Number: 9 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x193): scno
    <912>   DW_AT_decl_file   : 18
    <913>   DW_AT_decl_line   : 247
    <914>   DW_AT_decl_column : 11
    <915>   DW_AT_type        : <0xfe>
    <919>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><91c>: Abbrev Number: 0
 <1><91d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <91e>   DW_AT_name        : (indirect string, offset: 0xe4): inject_opts
    <922>   DW_AT_byte_size   : 16
    <923>   DW_AT_decl_file   : 18
    <924>   DW_AT_decl_line   : 250
    <925>   DW_AT_decl_column : 8
    <926>   DW_AT_sibling     : <0x967>
 <2><92a>: Abbrev Number: 9 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0xa34): first
    <92f>   DW_AT_decl_file   : 18
    <930>   DW_AT_decl_line   : 251
    <931>   DW_AT_decl_column : 11
    <932>   DW_AT_type        : <0xfe>
    <936>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><939>: Abbrev Number: 9 (DW_TAG_member)
    <93a>   DW_AT_name        : (indirect string, offset: 0x111f): last
    <93e>   DW_AT_decl_file   : 18
    <93f>   DW_AT_decl_line   : 252
    <940>   DW_AT_decl_column : 11
    <941>   DW_AT_type        : <0xfe>
    <945>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><948>: Abbrev Number: 9 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0x3a0): step
    <94d>   DW_AT_decl_file   : 18
    <94e>   DW_AT_decl_line   : 253
    <94f>   DW_AT_decl_column : 11
    <950>   DW_AT_type        : <0xfe>
    <954>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><957>: Abbrev Number: 9 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x10e0): data
    <95c>   DW_AT_decl_file   : 18
    <95d>   DW_AT_decl_line   : 254
    <95e>   DW_AT_decl_column : 21
    <95f>   DW_AT_type        : <0x8b5>
    <963>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><966>: Abbrev Number: 0
 <1><967>: Abbrev Number: 15 (DW_TAG_array_type)
    <968>   DW_AT_type        : <0x545>
    <96c>   DW_AT_sibling     : <0x977>
 <2><970>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <971>   DW_AT_type        : <0x2b>
    <975>   DW_AT_upper_bound : 5
 <2><976>: Abbrev Number: 0
 <1><977>: Abbrev Number: 14 (DW_TAG_structure_type)
    <978>   DW_AT_name        : (indirect string, offset: 0xf2a): staged_output_data
    <97c>   DW_AT_declaration : 1
 <1><97d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <97e>   DW_AT_byte_size   : 4
    <97f>   DW_AT_type        : <0x977>
 <1><983>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <984>   DW_AT_prototyped  : 1
    <985>   DW_AT_sibling     : <0x98f>
 <2><989>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <98a>   DW_AT_type        : <0xcd>
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <990>   DW_AT_byte_size   : 4
    <991>   DW_AT_type        : <0x983>
 <1><995>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <996>   DW_AT_byte_size   : 4
    <997>   DW_AT_type        : <0x849>
 <1><99b>: Abbrev Number: 3 (DW_TAG_const_type)
    <99c>   DW_AT_type        : <0x995>
 <1><9a0>: Abbrev Number: 15 (DW_TAG_array_type)
    <9a1>   DW_AT_type        : <0x9b0>
    <9a5>   DW_AT_sibling     : <0x9b0>
 <2><9a9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9aa>   DW_AT_type        : <0x2b>
    <9ae>   DW_AT_upper_bound : 2
 <2><9af>: Abbrev Number: 0
 <1><9b0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b1>   DW_AT_byte_size   : 4
    <9b2>   DW_AT_type        : <0x91d>
 <1><9b6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9bb>   DW_AT_declaration : 1
 <1><9bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bd>   DW_AT_byte_size   : 4
    <9be>   DW_AT_type        : <0x9b6>
 <1><9c2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x3bb): tcb_wait_data
    <9c7>   DW_AT_declaration : 1
 <1><9c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4
    <9ca>   DW_AT_type        : <0x9c2>
 <1><9ce>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x167): vcpu_info
    <9d3>   DW_AT_declaration : 1
 <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9ce>
 <1><9da>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0xf0e): unwind_queue_t
    <9df>   DW_AT_declaration : 1
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9da>
 <1><9e6>: Abbrev Number: 15 (DW_TAG_array_type)
    <9e7>   DW_AT_type        : <0xe6>
    <9eb>   DW_AT_sibling     : <0x9f6>
 <2><9ef>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9f0>   DW_AT_type        : <0x2b>
    <9f4>   DW_AT_upper_bound : 15
 <2><9f5>: Abbrev Number: 0
 <1><9f6>: Abbrev Number: 10 (DW_TAG_variable)
    <9f7>   DW_AT_name        : (indirect string, offset: 0xbab): stub_sysent
    <9fb>   DW_AT_decl_file   : 18
    <9fc>   DW_AT_decl_line   : 400
    <9fe>   DW_AT_decl_column : 28
    <9ff>   DW_AT_type        : <0x849>
    <a03>   DW_AT_external    : 1
    <a04>   DW_AT_declaration : 1
 <1><a05>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a06>   DW_AT_name        : (indirect string, offset: 0x10c3): xlat_type
    <a0a>   DW_AT_encoding    : 7	(unsigned)
    <a0b>   DW_AT_byte_size   : 4
    <a0c>   DW_AT_type        : <0x2b>
    <a10>   DW_AT_decl_file   : 19
    <a11>   DW_AT_decl_line   : 13
    <a12>   DW_AT_decl_column : 6
    <a13>   DW_AT_sibling     : <0xa2a>
 <2><a17>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a18>   DW_AT_name        : (indirect string, offset: 0x2c9): XT_NORMAL
    <a1c>   DW_AT_const_value : 0
 <2><a1d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a1e>   DW_AT_name        : (indirect string, offset: 0xc6e): XT_SORTED
    <a22>   DW_AT_const_value : 1
 <2><a23>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a24>   DW_AT_name        : (indirect string, offset: 0xded): XT_INDEXED
    <a28>   DW_AT_const_value : 2
 <2><a29>: Abbrev Number: 0
 <1><a2a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a2b>   DW_AT_name        : (indirect string, offset: 0xbd7): xlat_style
    <a2f>   DW_AT_encoding    : 7	(unsigned)
    <a30>   DW_AT_byte_size   : 4
    <a31>   DW_AT_type        : <0x2b>
    <a35>   DW_AT_decl_file   : 19
    <a36>   DW_AT_decl_line   : 19
    <a37>   DW_AT_decl_column : 6
    <a38>   DW_AT_sibling     : <0xa67>
 <2><a3c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xf0): XLAT_STYLE_DEFAULT
    <a41>   DW_AT_const_value : 0
 <2><a42>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0xc0a): XLAT_STYLE_RAW
    <a47>   DW_AT_const_value : 1
 <2><a48>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x1082): XLAT_STYLE_ABBREV
    <a4d>   DW_AT_const_value : 2
 <2><a4e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x2e6): XLAT_STYLE_VERBOSE
    <a53>   DW_AT_const_value : 3
 <2><a54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a59>   DW_AT_const_value : 0
 <2><a5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a5f>   DW_AT_const_value : 4
 <2><a60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x110e): XLAT_STYLE_FMT_D
    <a65>   DW_AT_const_value : 8
 <2><a66>: Abbrev Number: 0
 <1><a67>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a68>   DW_AT_name        : (indirect string, offset: 0x317): xlat_data
    <a6c>   DW_AT_byte_size   : 12
    <a6d>   DW_AT_decl_file   : 19
    <a6e>   DW_AT_decl_line   : 51
    <a6f>   DW_AT_decl_column : 8
    <a70>   DW_AT_sibling     : <0xa93>
 <2><a74>: Abbrev Number: 18 (DW_TAG_member)
    <a75>   DW_AT_name        : val
    <a79>   DW_AT_decl_file   : 19
    <a7a>   DW_AT_decl_line   : 52
    <a7b>   DW_AT_decl_column : 11
    <a7c>   DW_AT_type        : <0x116>
    <a80>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a83>: Abbrev Number: 18 (DW_TAG_member)
    <a84>   DW_AT_name        : str
    <a88>   DW_AT_decl_file   : 19
    <a89>   DW_AT_decl_line   : 53
    <a8a>   DW_AT_decl_column : 14
    <a8b>   DW_AT_type        : <0x1c9>
    <a8f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><a92>: Abbrev Number: 0
 <1><a93>: Abbrev Number: 3 (DW_TAG_const_type)
    <a94>   DW_AT_type        : <0xa67>
 <1><a98>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a99>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <a9d>   DW_AT_byte_size   : 24
    <a9e>   DW_AT_decl_file   : 19
    <a9f>   DW_AT_decl_line   : 56
    <aa0>   DW_AT_decl_column : 8
    <aa1>   DW_AT_sibling     : <0xaf1>
 <2><aa5>: Abbrev Number: 9 (DW_TAG_member)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x10e0): data
    <aaa>   DW_AT_decl_file   : 19
    <aab>   DW_AT_decl_line   : 57
    <aac>   DW_AT_decl_column : 26
    <aad>   DW_AT_type        : <0xaf6>
    <ab1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab4>: Abbrev Number: 9 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x85c): flags_strsz
    <ab9>   DW_AT_decl_file   : 19
    <aba>   DW_AT_decl_line   : 58
    <abb>   DW_AT_decl_column : 9
    <abc>   DW_AT_type        : <0x122>
    <ac0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ac3>: Abbrev Number: 9 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xb70): size
    <ac8>   DW_AT_decl_file   : 19
    <ac9>   DW_AT_decl_line   : 59
    <aca>   DW_AT_decl_column : 11
    <acb>   DW_AT_type        : <0x10a>
    <acf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad2>: Abbrev Number: 9 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x198): type
    <ad7>   DW_AT_decl_file   : 19
    <ad8>   DW_AT_decl_line   : 60
    <ad9>   DW_AT_decl_column : 17
    <ada>   DW_AT_type        : <0xa05>
    <ade>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><ae1>: Abbrev Number: 9 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x72a): flags_mask
    <ae6>   DW_AT_decl_file   : 19
    <ae7>   DW_AT_decl_line   : 61
    <ae8>   DW_AT_decl_column : 11
    <ae9>   DW_AT_type        : <0x116>
    <aed>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><af0>: Abbrev Number: 0
 <1><af1>: Abbrev Number: 3 (DW_TAG_const_type)
    <af2>   DW_AT_type        : <0xa98>
 <1><af6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <af7>   DW_AT_byte_size   : 4
    <af8>   DW_AT_type        : <0xa93>
 <1><afc>: Abbrev Number: 15 (DW_TAG_array_type)
    <afd>   DW_AT_type        : <0xaf1>
    <b01>   DW_AT_sibling     : <0xb07>
 <2><b05>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b06>: Abbrev Number: 0
 <1><b07>: Abbrev Number: 3 (DW_TAG_const_type)
    <b08>   DW_AT_type        : <0xafc>
 <1><b0c>: Abbrev Number: 10 (DW_TAG_variable)
    <b0d>   DW_AT_name        : (indirect string, offset: 0xe74): addrfams
    <b11>   DW_AT_decl_file   : 18
    <b12>   DW_AT_decl_line   : 406
    <b14>   DW_AT_decl_column : 26
    <b15>   DW_AT_type        : <0xb07>
    <b19>   DW_AT_external    : 1
    <b1a>   DW_AT_declaration : 1
 <1><b1b>: Abbrev Number: 10 (DW_TAG_variable)
    <b1c>   DW_AT_name        : (indirect string, offset: 0xd1d): arp_hardware_types
    <b20>   DW_AT_decl_file   : 18
    <b21>   DW_AT_decl_line   : 407
    <b23>   DW_AT_decl_column : 26
    <b24>   DW_AT_type        : <0xb07>
    <b28>   DW_AT_external    : 1
    <b29>   DW_AT_declaration : 1
 <1><b2a>: Abbrev Number: 10 (DW_TAG_variable)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x1008): at_flags
    <b2f>   DW_AT_decl_file   : 18
    <b30>   DW_AT_decl_line   : 408
    <b32>   DW_AT_decl_column : 26
    <b33>   DW_AT_type        : <0xb07>
    <b37>   DW_AT_external    : 1
    <b38>   DW_AT_declaration : 1
 <1><b39>: Abbrev Number: 10 (DW_TAG_variable)
    <b3a>   DW_AT_name        : (indirect string, offset: 0x497): clocknames
    <b3e>   DW_AT_decl_file   : 18
    <b3f>   DW_AT_decl_line   : 409
    <b41>   DW_AT_decl_column : 26
    <b42>   DW_AT_type        : <0xb07>
    <b46>   DW_AT_external    : 1
    <b47>   DW_AT_declaration : 1
 <1><b48>: Abbrev Number: 10 (DW_TAG_variable)
    <b49>   DW_AT_name        : (indirect string, offset: 0xfc8): dirent_types
    <b4d>   DW_AT_decl_file   : 18
    <b4e>   DW_AT_decl_line   : 410
    <b50>   DW_AT_decl_column : 26
    <b51>   DW_AT_type        : <0xb07>
    <b55>   DW_AT_external    : 1
    <b56>   DW_AT_declaration : 1
 <1><b57>: Abbrev Number: 10 (DW_TAG_variable)
    <b58>   DW_AT_name        : (indirect string, offset: 0x8c3): ethernet_protocols
    <b5c>   DW_AT_decl_file   : 18
    <b5d>   DW_AT_decl_line   : 411
    <b5f>   DW_AT_decl_column : 26
    <b60>   DW_AT_type        : <0xb07>
    <b64>   DW_AT_external    : 1
    <b65>   DW_AT_declaration : 1
 <1><b66>: Abbrev Number: 10 (DW_TAG_variable)
    <b67>   DW_AT_name        : (indirect string, offset: 0x5c0): inet_protocols
    <b6b>   DW_AT_decl_file   : 18
    <b6c>   DW_AT_decl_line   : 412
    <b6e>   DW_AT_decl_column : 26
    <b6f>   DW_AT_type        : <0xb07>
    <b73>   DW_AT_external    : 1
    <b74>   DW_AT_declaration : 1
 <1><b75>: Abbrev Number: 10 (DW_TAG_variable)
    <b76>   DW_AT_name        : (indirect string, offset: 0x2b6): evdev_abs
    <b7a>   DW_AT_decl_file   : 18
    <b7b>   DW_AT_decl_line   : 413
    <b7d>   DW_AT_decl_column : 26
    <b7e>   DW_AT_type        : <0xb07>
    <b82>   DW_AT_external    : 1
    <b83>   DW_AT_declaration : 1
 <1><b84>: Abbrev Number: 10 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x71f): audit_arch
    <b89>   DW_AT_decl_file   : 18
    <b8a>   DW_AT_decl_line   : 414
    <b8c>   DW_AT_decl_column : 26
    <b8d>   DW_AT_type        : <0xb07>
    <b91>   DW_AT_external    : 1
    <b92>   DW_AT_declaration : 1
 <1><b93>: Abbrev Number: 10 (DW_TAG_variable)
    <b94>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <b98>   DW_AT_decl_file   : 18
    <b99>   DW_AT_decl_line   : 415
    <b9b>   DW_AT_decl_column : 26
    <b9c>   DW_AT_type        : <0xb07>
    <ba0>   DW_AT_external    : 1
    <ba1>   DW_AT_declaration : 1
 <1><ba2>: Abbrev Number: 10 (DW_TAG_variable)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x478): iffflags
    <ba7>   DW_AT_decl_file   : 18
    <ba8>   DW_AT_decl_line   : 416
    <baa>   DW_AT_decl_column : 26
    <bab>   DW_AT_type        : <0xb07>
    <baf>   DW_AT_external    : 1
    <bb0>   DW_AT_declaration : 1
 <1><bb1>: Abbrev Number: 10 (DW_TAG_variable)
    <bb2>   DW_AT_name        : (indirect string, offset: 0xc19): ip_type_of_services
    <bb6>   DW_AT_decl_file   : 18
    <bb7>   DW_AT_decl_line   : 417
    <bb9>   DW_AT_decl_column : 26
    <bba>   DW_AT_type        : <0xb07>
    <bbe>   DW_AT_external    : 1
    <bbf>   DW_AT_declaration : 1
 <1><bc0>: Abbrev Number: 10 (DW_TAG_variable)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x6b2): ipc_private
    <bc5>   DW_AT_decl_file   : 18
    <bc6>   DW_AT_decl_line   : 418
    <bc8>   DW_AT_decl_column : 26
    <bc9>   DW_AT_type        : <0xb07>
    <bcd>   DW_AT_external    : 1
    <bce>   DW_AT_declaration : 1
 <1><bcf>: Abbrev Number: 10 (DW_TAG_variable)
    <bd0>   DW_AT_name        : (indirect string, offset: 0x30d): msg_flags
    <bd4>   DW_AT_decl_file   : 18
    <bd5>   DW_AT_decl_line   : 419
    <bd7>   DW_AT_decl_column : 26
    <bd8>   DW_AT_type        : <0xb07>
    <bdc>   DW_AT_external    : 1
    <bdd>   DW_AT_declaration : 1
 <1><bde>: Abbrev Number: 10 (DW_TAG_variable)
    <bdf>   DW_AT_name        : (indirect string, offset: 0x10c): netlink_protocols
    <be3>   DW_AT_decl_file   : 18
    <be4>   DW_AT_decl_line   : 420
    <be6>   DW_AT_decl_column : 26
    <be7>   DW_AT_type        : <0xb07>
    <beb>   DW_AT_external    : 1
    <bec>   DW_AT_declaration : 1
 <1><bed>: Abbrev Number: 10 (DW_TAG_variable)
    <bee>   DW_AT_name        : (indirect string, offset: 0xf3d): nl_bridge_vlan_flags
    <bf2>   DW_AT_decl_file   : 18
    <bf3>   DW_AT_decl_line   : 421
    <bf5>   DW_AT_decl_column : 26
    <bf6>   DW_AT_type        : <0xb07>
    <bfa>   DW_AT_external    : 1
    <bfb>   DW_AT_declaration : 1
 <1><bfc>: Abbrev Number: 10 (DW_TAG_variable)
    <bfd>   DW_AT_name        : (indirect string, offset: 0xdd6): nl_netfilter_msg_types
    <c01>   DW_AT_decl_file   : 18
    <c02>   DW_AT_decl_line   : 422
    <c04>   DW_AT_decl_column : 26
    <c05>   DW_AT_type        : <0xb07>
    <c09>   DW_AT_external    : 1
    <c0a>   DW_AT_declaration : 1
 <1><c0b>: Abbrev Number: 10 (DW_TAG_variable)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x219): nl_route_types
    <c10>   DW_AT_decl_file   : 18
    <c11>   DW_AT_decl_line   : 423
    <c13>   DW_AT_decl_column : 26
    <c14>   DW_AT_type        : <0xb07>
    <c18>   DW_AT_external    : 1
    <c19>   DW_AT_declaration : 1
 <1><c1a>: Abbrev Number: 10 (DW_TAG_variable)
    <c1b>   DW_AT_name        : (indirect string, offset: 0xeab): open_access_modes
    <c1f>   DW_AT_decl_file   : 18
    <c20>   DW_AT_decl_line   : 424
    <c22>   DW_AT_decl_column : 26
    <c23>   DW_AT_type        : <0xb07>
    <c27>   DW_AT_external    : 1
    <c28>   DW_AT_declaration : 1
 <1><c29>: Abbrev Number: 10 (DW_TAG_variable)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c2e>   DW_AT_decl_file   : 18
    <c2f>   DW_AT_decl_line   : 425
    <c31>   DW_AT_decl_column : 26
    <c32>   DW_AT_type        : <0xb07>
    <c36>   DW_AT_external    : 1
    <c37>   DW_AT_declaration : 1
 <1><c38>: Abbrev Number: 10 (DW_TAG_variable)
    <c39>   DW_AT_name        : (indirect string, offset: 0xc4a): perf_type_id
    <c3d>   DW_AT_decl_file   : 18
    <c3e>   DW_AT_decl_line   : 426
    <c40>   DW_AT_decl_column : 26
    <c41>   DW_AT_type        : <0xb07>
    <c45>   DW_AT_external    : 1
    <c46>   DW_AT_declaration : 1
 <1><c47>: Abbrev Number: 10 (DW_TAG_variable)
    <c48>   DW_AT_name        : (indirect string, offset: 0xe7d): pollflags
    <c4c>   DW_AT_decl_file   : 18
    <c4d>   DW_AT_decl_line   : 427
    <c4f>   DW_AT_decl_column : 26
    <c50>   DW_AT_type        : <0xb07>
    <c54>   DW_AT_external    : 1
    <c55>   DW_AT_declaration : 1
 <1><c56>: Abbrev Number: 10 (DW_TAG_variable)
    <c57>   DW_AT_name        : (indirect string, offset: 0x555): ptrace_cmds
    <c5b>   DW_AT_decl_file   : 18
    <c5c>   DW_AT_decl_line   : 428
    <c5e>   DW_AT_decl_column : 26
    <c5f>   DW_AT_type        : <0xb07>
    <c63>   DW_AT_external    : 1
    <c64>   DW_AT_declaration : 1
 <1><c65>: Abbrev Number: 10 (DW_TAG_variable)
    <c66>   DW_AT_name        : (indirect string, offset: 0x7ef): resource_flags
    <c6a>   DW_AT_decl_file   : 18
    <c6b>   DW_AT_decl_line   : 429
    <c6d>   DW_AT_decl_column : 26
    <c6e>   DW_AT_type        : <0xb07>
    <c72>   DW_AT_external    : 1
    <c73>   DW_AT_declaration : 1
 <1><c74>: Abbrev Number: 10 (DW_TAG_variable)
    <c75>   DW_AT_name        : (indirect string, offset: 0x28c): route_nexthop_flags
    <c79>   DW_AT_decl_file   : 18
    <c7a>   DW_AT_decl_line   : 430
    <c7c>   DW_AT_decl_column : 26
    <c7d>   DW_AT_type        : <0xb07>
    <c81>   DW_AT_external    : 1
    <c82>   DW_AT_declaration : 1
 <1><c83>: Abbrev Number: 10 (DW_TAG_variable)
    <c84>   DW_AT_name        : (indirect string, offset: 0xec8): routing_protocols
    <c88>   DW_AT_decl_file   : 18
    <c89>   DW_AT_decl_line   : 431
    <c8b>   DW_AT_decl_column : 26
    <c8c>   DW_AT_type        : <0xb07>
    <c90>   DW_AT_external    : 1
    <c91>   DW_AT_declaration : 1
 <1><c92>: Abbrev Number: 10 (DW_TAG_variable)
    <c93>   DW_AT_name        : (indirect string, offset: 0x469): routing_scopes
    <c97>   DW_AT_decl_file   : 18
    <c98>   DW_AT_decl_line   : 432
    <c9a>   DW_AT_decl_column : 26
    <c9b>   DW_AT_type        : <0xb07>
    <c9f>   DW_AT_external    : 1
    <ca0>   DW_AT_declaration : 1
 <1><ca1>: Abbrev Number: 10 (DW_TAG_variable)
    <ca2>   DW_AT_name        : (indirect string, offset: 0xda7): routing_table_ids
    <ca6>   DW_AT_decl_file   : 18
    <ca7>   DW_AT_decl_line   : 433
    <ca9>   DW_AT_decl_column : 26
    <caa>   DW_AT_type        : <0xb07>
    <cae>   DW_AT_external    : 1
    <caf>   DW_AT_declaration : 1
 <1><cb0>: Abbrev Number: 10 (DW_TAG_variable)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x68f): routing_types
    <cb5>   DW_AT_decl_file   : 18
    <cb6>   DW_AT_decl_line   : 434
    <cb8>   DW_AT_decl_column : 26
    <cb9>   DW_AT_type        : <0xb07>
    <cbd>   DW_AT_external    : 1
    <cbe>   DW_AT_declaration : 1
 <1><cbf>: Abbrev Number: 10 (DW_TAG_variable)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x1bc): rwf_flags
    <cc4>   DW_AT_decl_file   : 18
    <cc5>   DW_AT_decl_line   : 435
    <cc7>   DW_AT_decl_column : 26
    <cc8>   DW_AT_type        : <0xb07>
    <ccc>   DW_AT_external    : 1
    <ccd>   DW_AT_declaration : 1
 <1><cce>: Abbrev Number: 10 (DW_TAG_variable)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x827): seccomp_filter_flags
    <cd3>   DW_AT_decl_file   : 18
    <cd4>   DW_AT_decl_line   : 436
    <cd6>   DW_AT_decl_column : 26
    <cd7>   DW_AT_type        : <0xb07>
    <cdb>   DW_AT_external    : 1
    <cdc>   DW_AT_declaration : 1
 <1><cdd>: Abbrev Number: 10 (DW_TAG_variable)
    <cde>   DW_AT_name        : (indirect string, offset: 0x2d3): seccomp_ret_action
    <ce2>   DW_AT_decl_file   : 18
    <ce3>   DW_AT_decl_line   : 437
    <ce5>   DW_AT_decl_column : 26
    <ce6>   DW_AT_type        : <0xb07>
    <cea>   DW_AT_external    : 1
    <ceb>   DW_AT_declaration : 1
 <1><cec>: Abbrev Number: 10 (DW_TAG_variable)
    <ced>   DW_AT_name        : (indirect string, offset: 0x425): setns_types
    <cf1>   DW_AT_decl_file   : 18
    <cf2>   DW_AT_decl_line   : 438
    <cf4>   DW_AT_decl_column : 26
    <cf5>   DW_AT_type        : <0xb07>
    <cf9>   DW_AT_external    : 1
    <cfa>   DW_AT_declaration : 1
 <1><cfb>: Abbrev Number: 10 (DW_TAG_variable)
    <cfc>   DW_AT_name        : (indirect string, offset: 0xe69): sg_io_info
    <d00>   DW_AT_decl_file   : 18
    <d01>   DW_AT_decl_line   : 439
    <d03>   DW_AT_decl_column : 26
    <d04>   DW_AT_type        : <0xb07>
    <d08>   DW_AT_external    : 1
    <d09>   DW_AT_declaration : 1
 <1><d0a>: Abbrev Number: 10 (DW_TAG_variable)
    <d0b>   DW_AT_name        : (indirect string, offset: 0xbbf): socketlayers
    <d0f>   DW_AT_decl_file   : 18
    <d10>   DW_AT_decl_line   : 440
    <d12>   DW_AT_decl_column : 26
    <d13>   DW_AT_type        : <0xb07>
    <d17>   DW_AT_external    : 1
    <d18>   DW_AT_declaration : 1
 <1><d19>: Abbrev Number: 10 (DW_TAG_variable)
    <d1a>   DW_AT_name        : (indirect string, offset: 0xd91): socktypes
    <d1e>   DW_AT_decl_file   : 18
    <d1f>   DW_AT_decl_line   : 441
    <d21>   DW_AT_decl_column : 26
    <d22>   DW_AT_type        : <0xb07>
    <d26>   DW_AT_external    : 1
    <d27>   DW_AT_declaration : 1
 <1><d28>: Abbrev Number: 10 (DW_TAG_variable)
    <d29>   DW_AT_name        : (indirect string, offset: 0xa7a): tcp_state_flags
    <d2d>   DW_AT_decl_file   : 18
    <d2e>   DW_AT_decl_line   : 442
    <d30>   DW_AT_decl_column : 26
    <d31>   DW_AT_type        : <0xb07>
    <d35>   DW_AT_external    : 1
    <d36>   DW_AT_declaration : 1
 <1><d37>: Abbrev Number: 10 (DW_TAG_variable)
    <d38>   DW_AT_name        : (indirect string, offset: 0x754): tcp_states
    <d3c>   DW_AT_decl_file   : 18
    <d3d>   DW_AT_decl_line   : 443
    <d3f>   DW_AT_decl_column : 26
    <d40>   DW_AT_type        : <0xb07>
    <d44>   DW_AT_external    : 1
    <d45>   DW_AT_declaration : 1
 <1><d46>: Abbrev Number: 10 (DW_TAG_variable)
    <d47>   DW_AT_name        : (indirect string, offset: 0x1065): whence_codes
    <d4b>   DW_AT_decl_file   : 18
    <d4c>   DW_AT_decl_line   : 444
    <d4e>   DW_AT_decl_column : 26
    <d4f>   DW_AT_type        : <0xb07>
    <d53>   DW_AT_external    : 1
    <d54>   DW_AT_declaration : 1
 <1><d55>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d56>   DW_AT_encoding    : 7	(unsigned)
    <d57>   DW_AT_byte_size   : 4
    <d58>   DW_AT_type        : <0x2b>
    <d5c>   DW_AT_decl_file   : 18
    <d5d>   DW_AT_decl_line   : 505
    <d5f>   DW_AT_decl_column : 14
    <d60>   DW_AT_sibling     : <0xd77>
 <2><d64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d65>   DW_AT_name        : (indirect string, offset: 0x9ae): CFLAG_NONE
    <d69>   DW_AT_const_value : 0
 <2><d6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x8d6): CFLAG_ONLY_STATS
    <d6f>   DW_AT_const_value : 1
 <2><d70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d71>   DW_AT_name        : (indirect string, offset: 0xbcc): CFLAG_BOTH
    <d75>   DW_AT_const_value : 2
 <2><d76>: Abbrev Number: 0
 <1><d77>: Abbrev Number: 28 (DW_TAG_typedef)
    <d78>   DW_AT_name        : (indirect string, offset: 0x112c): cflag_t
    <d7c>   DW_AT_decl_file   : 18
    <d7d>   DW_AT_decl_line   : 509
    <d7f>   DW_AT_decl_column : 3
    <d80>   DW_AT_type        : <0xd55>
 <1><d84>: Abbrev Number: 10 (DW_TAG_variable)
    <d85>   DW_AT_name        : (indirect string, offset: 0xce4): cflag
    <d89>   DW_AT_decl_file   : 18
    <d8a>   DW_AT_decl_line   : 510
    <d8c>   DW_AT_decl_column : 16
    <d8d>   DW_AT_type        : <0xd77>
    <d91>   DW_AT_external    : 1
    <d92>   DW_AT_declaration : 1
 <1><d93>: Abbrev Number: 10 (DW_TAG_variable)
    <d94>   DW_AT_name        : (indirect string, offset: 0x187): Tflag
    <d98>   DW_AT_decl_file   : 18
    <d99>   DW_AT_decl_line   : 511
    <d9b>   DW_AT_decl_column : 13
    <d9c>   DW_AT_type        : <0x515>
    <da0>   DW_AT_external    : 1
    <da1>   DW_AT_declaration : 1
 <1><da2>: Abbrev Number: 10 (DW_TAG_variable)
    <da3>   DW_AT_name        : (indirect string, offset: 0x7aa): Tflag_scale
    <da7>   DW_AT_decl_file   : 18
    <da8>   DW_AT_decl_line   : 512
    <daa>   DW_AT_decl_column : 12
    <dab>   DW_AT_type        : <0x64>
    <daf>   DW_AT_external    : 1
    <db0>   DW_AT_declaration : 1
 <1><db1>: Abbrev Number: 10 (DW_TAG_variable)
    <db2>   DW_AT_name        : (indirect string, offset: 0x83c): Tflag_width
    <db6>   DW_AT_decl_file   : 18
    <db7>   DW_AT_decl_line   : 513
    <db9>   DW_AT_decl_column : 12
    <dba>   DW_AT_type        : <0x64>
    <dbe>   DW_AT_external    : 1
    <dbf>   DW_AT_declaration : 1
 <1><dc0>: Abbrev Number: 10 (DW_TAG_variable)
    <dc1>   DW_AT_name        : (indirect string, offset: 0xe5b): iflag
    <dc5>   DW_AT_decl_file   : 18
    <dc6>   DW_AT_decl_line   : 514
    <dc8>   DW_AT_decl_column : 13
    <dc9>   DW_AT_type        : <0x515>
    <dcd>   DW_AT_external    : 1
    <dce>   DW_AT_declaration : 1
 <1><dcf>: Abbrev Number: 10 (DW_TAG_variable)
    <dd0>   DW_AT_name        : (indirect string, offset: 0x5a1): count_wallclock
    <dd4>   DW_AT_decl_file   : 18
    <dd5>   DW_AT_decl_line   : 515
    <dd7>   DW_AT_decl_column : 13
    <dd8>   DW_AT_type        : <0x515>
    <ddc>   DW_AT_external    : 1
    <ddd>   DW_AT_declaration : 1
 <1><dde>: Abbrev Number: 29 (DW_TAG_structure_type)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <de3>   DW_AT_byte_size   : 4
    <de4>   DW_AT_decl_file   : 18
    <de5>   DW_AT_decl_line   : 517
    <de7>   DW_AT_decl_column : 8
    <de8>   DW_AT_sibling     : <0xdfd>
 <2><dec>: Abbrev Number: 22 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <df1>   DW_AT_decl_file   : 18
    <df2>   DW_AT_decl_line   : 518
    <df4>   DW_AT_decl_column : 14
    <df5>   DW_AT_type        : <0x1c9>
    <df9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><dfc>: Abbrev Number: 0
 <1><dfd>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x75f): path_set
    <e02>   DW_AT_byte_size   : 12
    <e03>   DW_AT_decl_file   : 18
    <e04>   DW_AT_decl_line   : 522
    <e06>   DW_AT_decl_column : 15
    <e07>   DW_AT_sibling     : <0xe3c>
 <2><e0b>: Abbrev Number: 22 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x6ed): paths_selected
    <e10>   DW_AT_decl_file   : 18
    <e11>   DW_AT_decl_line   : 523
    <e13>   DW_AT_decl_column : 24
    <e14>   DW_AT_type        : <0xe3c>
    <e18>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e1b>: Abbrev Number: 22 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x1058): num_selected
    <e20>   DW_AT_decl_file   : 18
    <e21>   DW_AT_decl_line   : 524
    <e23>   DW_AT_decl_column : 9
    <e24>   DW_AT_type        : <0x122>
    <e28>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e2b>: Abbrev Number: 22 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0xb70): size
    <e30>   DW_AT_decl_file   : 18
    <e31>   DW_AT_decl_line   : 525
    <e33>   DW_AT_decl_column : 9
    <e34>   DW_AT_type        : <0x122>
    <e38>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e3b>: Abbrev Number: 0
 <1><e3c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e3d>   DW_AT_byte_size   : 4
    <e3e>   DW_AT_type        : <0xdde>
 <1><e42>: Abbrev Number: 10 (DW_TAG_variable)
    <e43>   DW_AT_name        : (indirect string, offset: 0x10a7): global_path_set
    <e47>   DW_AT_decl_file   : 18
    <e48>   DW_AT_decl_line   : 526
    <e4a>   DW_AT_decl_column : 3
    <e4b>   DW_AT_type        : <0xdfd>
    <e4f>   DW_AT_external    : 1
    <e50>   DW_AT_declaration : 1
 <1><e51>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e52>   DW_AT_name        : (indirect string, offset: 0xfb5): xflag_opts
    <e56>   DW_AT_encoding    : 7	(unsigned)
    <e57>   DW_AT_byte_size   : 4
    <e58>   DW_AT_type        : <0x2b>
    <e5c>   DW_AT_decl_file   : 18
    <e5d>   DW_AT_decl_line   : 528
    <e5f>   DW_AT_decl_column : 6
    <e60>   DW_AT_sibling     : <0xe83>
 <2><e64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e65>   DW_AT_name        : (indirect string, offset: 0xa28): HEXSTR_NONE
    <e69>   DW_AT_const_value : 0
 <2><e6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e6b>   DW_AT_name        : (indirect string, offset: 0xfea): HEXSTR_NON_ASCII
    <e6f>   DW_AT_const_value : 1
 <2><e70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e71>   DW_AT_name        : (indirect string, offset: 0x91e): HEXSTR_ALL
    <e75>   DW_AT_const_value : 2
 <2><e76>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e77>   DW_AT_name        : (indirect string, offset: 0x678): HEXSTR_NON_ASCII_CHARS
    <e7b>   DW_AT_const_value : 3
 <2><e7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x1072): NUM_HEXSTR_OPTS
    <e81>   DW_AT_const_value : 4
 <2><e82>: Abbrev Number: 0
 <1><e83>: Abbrev Number: 10 (DW_TAG_variable)
    <e84>   DW_AT_name        : (indirect string, offset: 0xe35): xflag
    <e88>   DW_AT_decl_file   : 18
    <e89>   DW_AT_decl_line   : 541
    <e8b>   DW_AT_decl_column : 17
    <e8c>   DW_AT_type        : <0x2b>
    <e90>   DW_AT_external    : 1
    <e91>   DW_AT_declaration : 1
 <1><e92>: Abbrev Number: 10 (DW_TAG_variable)
    <e93>   DW_AT_name        : (indirect string, offset: 0xc9f): followfork
    <e97>   DW_AT_decl_file   : 18
    <e98>   DW_AT_decl_line   : 542
    <e9a>   DW_AT_decl_column : 13
    <e9b>   DW_AT_type        : <0x515>
    <e9f>   DW_AT_external    : 1
    <ea0>   DW_AT_declaration : 1
 <1><ea1>: Abbrev Number: 10 (DW_TAG_variable)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x321): output_separately
    <ea6>   DW_AT_decl_file   : 18
    <ea7>   DW_AT_decl_line   : 543
    <ea9>   DW_AT_decl_column : 13
    <eaa>   DW_AT_type        : <0x515>
    <eae>   DW_AT_external    : 1
    <eaf>   DW_AT_declaration : 1
 <1><eb0>: Abbrev Number: 10 (DW_TAG_variable)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x228): stack_trace_enabled
    <eb5>   DW_AT_decl_file   : 18
    <eb6>   DW_AT_decl_line   : 546
    <eb8>   DW_AT_decl_column : 13
    <eb9>   DW_AT_type        : <0x515>
    <ebd>   DW_AT_external    : 1
    <ebe>   DW_AT_declaration : 1
 <1><ebf>: Abbrev Number: 10 (DW_TAG_variable)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x666): ptrace_setoptions
    <ec4>   DW_AT_decl_file   : 18
    <ec5>   DW_AT_decl_line   : 550
    <ec7>   DW_AT_decl_column : 17
    <ec8>   DW_AT_type        : <0x2b>
    <ecc>   DW_AT_external    : 1
    <ecd>   DW_AT_declaration : 1
 <1><ece>: Abbrev Number: 10 (DW_TAG_variable)
    <ecf>   DW_AT_name        : (indirect string, offset: 0xa1d): max_strlen
    <ed3>   DW_AT_decl_file   : 18
    <ed4>   DW_AT_decl_line   : 551
    <ed6>   DW_AT_decl_column : 17
    <ed7>   DW_AT_type        : <0x2b>
    <edb>   DW_AT_external    : 1
    <edc>   DW_AT_declaration : 1
 <1><edd>: Abbrev Number: 10 (DW_TAG_variable)
    <ede>   DW_AT_name        : (indirect string, offset: 0xa4b): os_release
    <ee2>   DW_AT_decl_file   : 18
    <ee3>   DW_AT_decl_line   : 552
    <ee5>   DW_AT_decl_column : 17
    <ee6>   DW_AT_type        : <0x2b>
    <eea>   DW_AT_external    : 1
    <eeb>   DW_AT_declaration : 1
 <1><eec>: Abbrev Number: 10 (DW_TAG_variable)
    <eed>   DW_AT_name        : (indirect string, offset: 0x6fc): xlat_verbosity
    <ef1>   DW_AT_decl_file   : 18
    <ef2>   DW_AT_decl_line   : 914
    <ef4>   DW_AT_decl_column : 24
    <ef5>   DW_AT_type        : <0xa2a>
    <ef9>   DW_AT_external    : 1
    <efa>   DW_AT_declaration : 1
 <1><efb>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <efc>   DW_AT_name        : (indirect string, offset: 0x584): xlat_style_private_flag_bits
    <f00>   DW_AT_encoding    : 7	(unsigned)
    <f01>   DW_AT_byte_size   : 4
    <f02>   DW_AT_type        : <0x2b>
    <f06>   DW_AT_decl_file   : 18
    <f07>   DW_AT_decl_line   : 934
    <f09>   DW_AT_decl_column : 6
    <f0a>   DW_AT_sibling     : <0xf27>
 <2><f0e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x2a0): PAF_PRINT_INDICES_BIT
    <f13>   DW_AT_const_value : 5
 <2><f14>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f15>   DW_AT_name        : (indirect string, offset: 0xb14): PAF_ARRAY_TRUNCATED_BIT
    <f19>   DW_AT_const_value : 6
 <2><f1a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x3e5): PXF_DEFAULT_STR_BIT
    <f1f>   DW_AT_const_value : 7
 <2><f20>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f21>   DW_AT_name        : (indirect string, offset: 0xc81): SPFF_AUXSTR_MODE_BIT
    <f25>   DW_AT_const_value : 8
 <2><f26>: Abbrev Number: 0
 <1><f27>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f28>   DW_AT_name        : (indirect string, offset: 0xd30): find_xlat_flag_bits
    <f2c>   DW_AT_encoding    : 7	(unsigned)
    <f2d>   DW_AT_byte_size   : 4
    <f2e>   DW_AT_type        : <0x2b>
    <f32>   DW_AT_decl_file   : 18
    <f33>   DW_AT_decl_line   : 1438
    <f35>   DW_AT_decl_column : 6
    <f36>   DW_AT_sibling     : <0xf41>
 <2><f3a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x95b): FXL_CASE_SENSITIVE_BIT
    <f3f>   DW_AT_const_value : 0
 <2><f40>: Abbrev Number: 0
 <1><f41>: Abbrev Number: 10 (DW_TAG_variable)
    <f42>   DW_AT_name        : (indirect string, offset: 0x9f9): printing_tcp
    <f46>   DW_AT_decl_file   : 18
    <f47>   DW_AT_decl_line   : 1684
    <f49>   DW_AT_decl_column : 20
    <f4a>   DW_AT_type        : <0x5f1>
    <f4e>   DW_AT_external    : 1
    <f4f>   DW_AT_declaration : 1
 <1><f50>: Abbrev Number: 10 (DW_TAG_variable)
    <f51>   DW_AT_name        : (indirect string, offset: 0x540): errnoent
    <f55>   DW_AT_decl_file   : 18
    <f56>   DW_AT_decl_line   : 1882
    <f58>   DW_AT_decl_column : 26
    <f59>   DW_AT_type        : <0x449>
    <f5d>   DW_AT_external    : 1
    <f5e>   DW_AT_declaration : 1
 <1><f5f>: Abbrev Number: 10 (DW_TAG_variable)
    <f60>   DW_AT_name        : (indirect string, offset: 0x848): signalent
    <f64>   DW_AT_decl_file   : 18
    <f65>   DW_AT_decl_line   : 1883
    <f67>   DW_AT_decl_column : 26
    <f68>   DW_AT_type        : <0x449>
    <f6c>   DW_AT_external    : 1
    <f6d>   DW_AT_declaration : 1
 <1><f6e>: Abbrev Number: 10 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xea3): nerrnos
    <f73>   DW_AT_decl_file   : 18
    <f74>   DW_AT_decl_line   : 1884
    <f76>   DW_AT_decl_column : 27
    <f77>   DW_AT_type        : <0x32>
    <f7b>   DW_AT_external    : 1
    <f7c>   DW_AT_declaration : 1
 <1><f7d>: Abbrev Number: 10 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x1041): nsignals
    <f82>   DW_AT_decl_file   : 18
    <f83>   DW_AT_decl_line   : 1885
    <f85>   DW_AT_decl_column : 27
    <f86>   DW_AT_type        : <0x32>
    <f8a>   DW_AT_external    : 1
    <f8b>   DW_AT_declaration : 1
 <1><f8c>: Abbrev Number: 15 (DW_TAG_array_type)
    <f8d>   DW_AT_type        : <0x849>
    <f91>   DW_AT_sibling     : <0xf97>
 <2><f95>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><f96>: Abbrev Number: 0
 <1><f97>: Abbrev Number: 3 (DW_TAG_const_type)
    <f98>   DW_AT_type        : <0xf8c>
 <1><f9c>: Abbrev Number: 10 (DW_TAG_variable)
    <f9d>   DW_AT_name        : (indirect string, offset: 0xcfb): sysent0
    <fa1>   DW_AT_decl_file   : 18
    <fa2>   DW_AT_decl_line   : 1887
    <fa4>   DW_AT_decl_column : 28
    <fa5>   DW_AT_type        : <0xf97>
    <fa9>   DW_AT_external    : 1
    <faa>   DW_AT_declaration : 1
 <1><fab>: Abbrev Number: 15 (DW_TAG_array_type)
    <fac>   DW_AT_type        : <0x8b0>
    <fb0>   DW_AT_sibling     : <0xfb6>
 <2><fb4>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb5>: Abbrev Number: 0
 <1><fb6>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb7>   DW_AT_type        : <0xfab>
 <1><fbb>: Abbrev Number: 10 (DW_TAG_variable)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x109d): ioctlent0
    <fc0>   DW_AT_decl_file   : 18
    <fc1>   DW_AT_decl_line   : 1888
    <fc3>   DW_AT_decl_column : 30
    <fc4>   DW_AT_type        : <0xfb6>
    <fc8>   DW_AT_external    : 1
    <fc9>   DW_AT_declaration : 1
 <1><fca>: Abbrev Number: 10 (DW_TAG_variable)
    <fcb>   DW_AT_name        : (indirect string, offset: 0x457): personality_names
    <fcf>   DW_AT_decl_file   : 18
    <fd0>   DW_AT_decl_line   : 1890
    <fd2>   DW_AT_decl_column : 26
    <fd3>   DW_AT_type        : <0x449>
    <fd7>   DW_AT_external    : 1
    <fd8>   DW_AT_declaration : 1
 <1><fd9>: Abbrev Number: 10 (DW_TAG_variable)
    <fda>   DW_AT_name        : (indirect string, offset: 0x868): sysent
    <fde>   DW_AT_decl_file   : 18
    <fdf>   DW_AT_decl_line   : 1893
    <fe1>   DW_AT_decl_column : 29
    <fe2>   DW_AT_type        : <0x995>
    <fe6>   DW_AT_external    : 1
    <fe7>   DW_AT_declaration : 1
 <1><fe8>: Abbrev Number: 10 (DW_TAG_variable)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xc96): ioctlent
    <fed>   DW_AT_decl_file   : 18
    <fee>   DW_AT_decl_line   : 1894
    <ff0>   DW_AT_decl_column : 31
    <ff1>   DW_AT_type        : <0xff7>
    <ff5>   DW_AT_external    : 1
    <ff6>   DW_AT_declaration : 1
 <1><ff7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ff8>   DW_AT_byte_size   : 4
    <ff9>   DW_AT_type        : <0x8b0>
 <1><ffd>: Abbrev Number: 10 (DW_TAG_variable)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x852): nsyscalls
    <1002>   DW_AT_decl_file   : 18
    <1003>   DW_AT_decl_line   : 1900
    <1005>   DW_AT_decl_column : 17
    <1006>   DW_AT_type        : <0x2b>
    <100a>   DW_AT_external    : 1
    <100b>   DW_AT_declaration : 1
 <1><100c>: Abbrev Number: 10 (DW_TAG_variable)
    <100d>   DW_AT_name        : (indirect string, offset: 0xebd): nioctlents
    <1011>   DW_AT_decl_file   : 18
    <1012>   DW_AT_decl_line   : 1901
    <1014>   DW_AT_decl_column : 17
    <1015>   DW_AT_type        : <0x2b>
    <1019>   DW_AT_external    : 1
    <101a>   DW_AT_declaration : 1
 <1><101b>: Abbrev Number: 15 (DW_TAG_array_type)
    <101c>   DW_AT_type        : <0x32>
    <1020>   DW_AT_sibling     : <0x102b>
 <2><1024>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1025>   DW_AT_type        : <0x2b>
    <1029>   DW_AT_upper_bound : 2
 <2><102a>: Abbrev Number: 0
 <1><102b>: Abbrev Number: 3 (DW_TAG_const_type)
    <102c>   DW_AT_type        : <0x101b>
 <1><1030>: Abbrev Number: 10 (DW_TAG_variable)
    <1031>   DW_AT_name        : (indirect string, offset: 0xf1d): nsyscall_vec
    <1035>   DW_AT_decl_file   : 18
    <1036>   DW_AT_decl_line   : 1903
    <1038>   DW_AT_decl_column : 27
    <1039>   DW_AT_type        : <0x102b>
    <103d>   DW_AT_external    : 1
    <103e>   DW_AT_declaration : 1
 <1><103f>: Abbrev Number: 15 (DW_TAG_array_type)
    <1040>   DW_AT_type        : <0x99b>
    <1044>   DW_AT_sibling     : <0x104f>
 <2><1048>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1049>   DW_AT_type        : <0x2b>
    <104d>   DW_AT_upper_bound : 2
 <2><104e>: Abbrev Number: 0
 <1><104f>: Abbrev Number: 3 (DW_TAG_const_type)
    <1050>   DW_AT_type        : <0x103f>
 <1><1054>: Abbrev Number: 10 (DW_TAG_variable)
    <1055>   DW_AT_name        : (indirect string, offset: 0x797): sysent_vec
    <1059>   DW_AT_decl_file   : 18
    <105a>   DW_AT_decl_line   : 1904
    <105c>   DW_AT_decl_column : 35
    <105d>   DW_AT_type        : <0x104f>
    <1061>   DW_AT_external    : 1
    <1062>   DW_AT_declaration : 1
 <1><1063>: Abbrev Number: 10 (DW_TAG_variable)
    <1064>   DW_AT_name        : (indirect string, offset: 0x386): inject_vec
    <1068>   DW_AT_decl_file   : 18
    <1069>   DW_AT_decl_line   : 1905
    <106b>   DW_AT_decl_column : 28
    <106c>   DW_AT_type        : <0x9a0>
    <1070>   DW_AT_external    : 1
    <1071>   DW_AT_declaration : 1
 <1><1072>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1073>   DW_AT_name        : (indirect string, offset: 0xd84): audit_arch_t
    <1077>   DW_AT_byte_size   : 8
    <1078>   DW_AT_decl_file   : 18
    <1079>   DW_AT_decl_line   : 1907
    <107b>   DW_AT_decl_column : 8
    <107c>   DW_AT_sibling     : <0x10a1>
 <2><1080>: Abbrev Number: 22 (DW_TAG_member)
    <1081>   DW_AT_name        : (indirect string, offset: 0x56a): arch
    <1085>   DW_AT_decl_file   : 18
    <1086>   DW_AT_decl_line   : 1908
    <1088>   DW_AT_decl_column : 15
    <1089>   DW_AT_type        : <0x2b>
    <108d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1090>: Abbrev Number: 22 (DW_TAG_member)
    <1091>   DW_AT_name        : (indirect string, offset: 0x9df): flag
    <1095>   DW_AT_decl_file   : 18
    <1096>   DW_AT_decl_line   : 1909
    <1098>   DW_AT_decl_column : 15
    <1099>   DW_AT_type        : <0x2b>
    <109d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10a0>: Abbrev Number: 0
 <1><10a1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10a2>   DW_AT_type        : <0x1072>
 <1><10a6>: Abbrev Number: 15 (DW_TAG_array_type)
    <10a7>   DW_AT_type        : <0x10a1>
    <10ab>   DW_AT_sibling     : <0x10b6>
 <2><10af>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10b0>   DW_AT_type        : <0x2b>
    <10b4>   DW_AT_upper_bound : 2
 <2><10b5>: Abbrev Number: 0
 <1><10b6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b7>   DW_AT_type        : <0x10a6>
 <1><10bb>: Abbrev Number: 10 (DW_TAG_variable)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x94c): audit_arch_vec
    <10c0>   DW_AT_decl_file   : 18
    <10c1>   DW_AT_decl_line   : 1912
    <10c3>   DW_AT_decl_column : 34
    <10c4>   DW_AT_type        : <0x10b6>
    <10c8>   DW_AT_external    : 1
    <10c9>   DW_AT_declaration : 1
 <1><10ca>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10cb>   DW_AT_byte_size   : 180
    <10cc>   DW_AT_decl_file   : 20
    <10cd>   DW_AT_decl_line   : 2
    <10ce>   DW_AT_decl_column : 9
    <10cf>   DW_AT_sibling     : <0x1384>
 <2><10d3>: Abbrev Number: 9 (DW_TAG_member)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x1d4): block_ioctl
    <10d8>   DW_AT_decl_file   : 20
    <10d9>   DW_AT_decl_line   : 3
    <10da>   DW_AT_decl_column : 8
    <10db>   DW_AT_type        : <0x139e>
    <10df>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10e2>: Abbrev Number: 9 (DW_TAG_member)
    <10e3>   DW_AT_name        : (indirect string, offset: 0xab3): btrfs_ioctl
    <10e7>   DW_AT_decl_file   : 20
    <10e8>   DW_AT_decl_line   : 6
    <10e9>   DW_AT_decl_column : 8
    <10ea>   DW_AT_type        : <0x139e>
    <10ee>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10f1>: Abbrev Number: 9 (DW_TAG_member)
    <10f2>   DW_AT_name        : (indirect string, offset: 0x735): evdev_write_ioctl_mpers
    <10f6>   DW_AT_decl_file   : 20
    <10f7>   DW_AT_decl_line   : 9
    <10f8>   DW_AT_decl_column : 8
    <10f9>   DW_AT_type        : <0x139e>
    <10fd>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1100>: Abbrev Number: 9 (DW_TAG_member)
    <1101>   DW_AT_name        : (indirect string, offset: 0x70b): get_sock_fprog_size
    <1105>   DW_AT_decl_file   : 20
    <1106>   DW_AT_decl_line   : 12
    <1107>   DW_AT_decl_column : 17
    <1108>   DW_AT_type        : <0x13aa>
    <110c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><110f>: Abbrev Number: 9 (DW_TAG_member)
    <1110>   DW_AT_name        : (indirect string, offset: 0x1a3): fetch_bpf_fprog
    <1114>   DW_AT_decl_file   : 20
    <1115>   DW_AT_decl_line   : 15
    <1116>   DW_AT_decl_column : 10
    <1117>   DW_AT_type        : <0x13ca>
    <111b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><111e>: Abbrev Number: 9 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0x939): fetch_struct_flock
    <1123>   DW_AT_decl_file   : 20
    <1124>   DW_AT_decl_line   : 18
    <1125>   DW_AT_decl_column : 10
    <1126>   DW_AT_type        : <0x13ca>
    <112a>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><112d>: Abbrev Number: 9 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0xcaa): fetch_struct_flock64
    <1132>   DW_AT_decl_file   : 20
    <1133>   DW_AT_decl_line   : 21
    <1134>   DW_AT_decl_column : 10
    <1135>   DW_AT_type        : <0x13ca>
    <1139>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><113c>: Abbrev Number: 9 (DW_TAG_member)
    <113d>   DW_AT_name        : (indirect string, offset: 0x154): fetch_struct_iovec
    <1141>   DW_AT_decl_file   : 20
    <1142>   DW_AT_decl_line   : 24
    <1143>   DW_AT_decl_column : 10
    <1144>   DW_AT_type        : <0x13ca>
