Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x16e4 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5ba): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x795): mpers-m32/struct_msghdr.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe83): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3a6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xff3): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x97c): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdda): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x475): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x87c): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xed4): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8ac): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x765): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb49): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb7f): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2c5): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xccb): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc40): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3f2): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x43e): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x525): __socklen_t
    <f7>   DW_AT_decl_file   : 1
    <f8>   DW_AT_decl_line   : 209
    <f9>   DW_AT_decl_column : 23
    <fa>   DW_AT_type        : <0x2b>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x355): uint8_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 24
    <105>   DW_AT_decl_column : 19
    <106>   DW_AT_type        : <0x45>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xb6a): uint16_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 25
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x58>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xf7c): uint32_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 26
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x70>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xdea): uint64_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 27
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x8f>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x32): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xaf2): timespec
    <144>   DW_AT_byte_size   : 8
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x10c9): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xc1>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe10): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xd4>
    <167>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 12
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xab4): long double
 <1><172>: Abbrev Number: 2 (DW_TAG_base_type)
    <173>   DW_AT_byte_size   : 16
    <174>   DW_AT_encoding    : 4	(float)
    <175>   DW_AT_name        : (indirect string, offset: 0xfb7): _Float128
 <1><179>: Abbrev Number: 10 (DW_TAG_typedef)
    <17a>   DW_AT_name        : (indirect string, offset: 0x11): socklen_t
    <17e>   DW_AT_decl_file   : 5
    <17f>   DW_AT_decl_line   : 274
    <181>   DW_AT_decl_column : 21
    <182>   DW_AT_type        : <0xf2>
 <1><186>: Abbrev Number: 11 (DW_TAG_variable)
    <187>   DW_AT_name        : (indirect string, offset: 0x27c): __environ
    <18b>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 543
    <18e>   DW_AT_decl_column : 15
    <18f>   DW_AT_type        : <0x195>
    <193>   DW_AT_external    : 1
    <194>   DW_AT_declaration : 1
 <1><195>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <196>   DW_AT_byte_size   : 4
    <197>   DW_AT_type        : <0xe0>
 <1><19b>: Abbrev Number: 11 (DW_TAG_variable)
    <19c>   DW_AT_name        : (indirect string, offset: 0x39e): environ
    <1a0>   DW_AT_decl_file   : 5
    <1a1>   DW_AT_decl_line   : 545
    <1a3>   DW_AT_decl_column : 15
    <1a4>   DW_AT_type        : <0x195>
    <1a8>   DW_AT_external    : 1
    <1a9>   DW_AT_declaration : 1
 <1><1aa>: Abbrev Number: 12 (DW_TAG_variable)
    <1ab>   DW_AT_name        : (indirect string, offset: 0xfdd): optarg
    <1af>   DW_AT_decl_file   : 6
    <1b0>   DW_AT_decl_line   : 36
    <1b1>   DW_AT_decl_column : 14
    <1b2>   DW_AT_type        : <0xe0>
    <1b6>   DW_AT_external    : 1
    <1b7>   DW_AT_declaration : 1
 <1><1b8>: Abbrev Number: 12 (DW_TAG_variable)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x738): optind
    <1bd>   DW_AT_decl_file   : 6
    <1be>   DW_AT_decl_line   : 50
    <1bf>   DW_AT_decl_column : 12
    <1c0>   DW_AT_type        : <0x64>
    <1c4>   DW_AT_external    : 1
    <1c5>   DW_AT_declaration : 1
 <1><1c6>: Abbrev Number: 12 (DW_TAG_variable)
    <1c7>   DW_AT_name        : (indirect string, offset: 0xc2f): opterr
    <1cb>   DW_AT_decl_file   : 6
    <1cc>   DW_AT_decl_line   : 55
    <1cd>   DW_AT_decl_column : 12
    <1ce>   DW_AT_type        : <0x64>
    <1d2>   DW_AT_external    : 1
    <1d3>   DW_AT_declaration : 1
 <1><1d4>: Abbrev Number: 12 (DW_TAG_variable)
    <1d5>   DW_AT_name        : (indirect string, offset: 0xb2f): optopt
    <1d9>   DW_AT_decl_file   : 6
    <1da>   DW_AT_decl_line   : 59
    <1db>   DW_AT_decl_column : 12
    <1dc>   DW_AT_type        : <0x64>
    <1e0>   DW_AT_external    : 1
    <1e1>   DW_AT_declaration : 1
 <1><1e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e3>   DW_AT_byte_size   : 4
    <1e4>   DW_AT_type        : <0xed>
 <1><1e8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e9>   DW_AT_type        : <0x1e2>
 <1><1ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ee>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x1f3>
 <1><1f3>: Abbrev Number: 13 (DW_TAG_const_type)
 <1><1f4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x35d): _IO_FILE
    <1f9>   DW_AT_byte_size   : 148
    <1fa>   DW_AT_decl_file   : 7
    <1fb>   DW_AT_decl_line   : 49
    <1fc>   DW_AT_decl_column : 8
    <1fd>   DW_AT_sibling     : <0x3b5>
 <2><201>: Abbrev Number: 9 (DW_TAG_member)
    <202>   DW_AT_name        : (indirect string, offset: 0xa06): _flags
    <206>   DW_AT_decl_file   : 7
    <207>   DW_AT_decl_line   : 51
    <208>   DW_AT_decl_column : 7
    <209>   DW_AT_type        : <0x64>
    <20d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><210>: Abbrev Number: 9 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0x4d7): _IO_read_ptr
    <215>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 54
    <217>   DW_AT_decl_column : 9
    <218>   DW_AT_type        : <0xe0>
    <21c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><21f>: Abbrev Number: 9 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0xf29): _IO_read_end
    <224>   DW_AT_decl_file   : 7
    <225>   DW_AT_decl_line   : 55
    <226>   DW_AT_decl_column : 9
    <227>   DW_AT_type        : <0xe0>
    <22b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><22e>: Abbrev Number: 9 (DW_TAG_member)
    <22f>   DW_AT_name        : (indirect string, offset: 0x7bb): _IO_read_base
    <233>   DW_AT_decl_file   : 7
    <234>   DW_AT_decl_line   : 56
    <235>   DW_AT_decl_column : 9
    <236>   DW_AT_type        : <0xe0>
    <23a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><23d>: Abbrev Number: 9 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <242>   DW_AT_decl_file   : 7
    <243>   DW_AT_decl_line   : 57
    <244>   DW_AT_decl_column : 9
    <245>   DW_AT_type        : <0xe0>
    <249>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><24c>: Abbrev Number: 9 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x1035): _IO_write_ptr
    <251>   DW_AT_decl_file   : 7
    <252>   DW_AT_decl_line   : 58
    <253>   DW_AT_decl_column : 9
    <254>   DW_AT_type        : <0xe0>
    <258>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25b>: Abbrev Number: 9 (DW_TAG_member)
    <25c>   DW_AT_name        : (indirect string, offset: 0x8f4): _IO_write_end
    <260>   DW_AT_decl_file   : 7
    <261>   DW_AT_decl_line   : 59
    <262>   DW_AT_decl_column : 9
    <263>   DW_AT_type        : <0xe0>
    <267>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><26a>: Abbrev Number: 9 (DW_TAG_member)
    <26b>   DW_AT_name        : (indirect string, offset: 0x965): _IO_buf_base
    <26f>   DW_AT_decl_file   : 7
    <270>   DW_AT_decl_line   : 60
    <271>   DW_AT_decl_column : 9
    <272>   DW_AT_type        : <0xe0>
    <276>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><279>: Abbrev Number: 9 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0xd72): _IO_buf_end
    <27e>   DW_AT_decl_file   : 7
    <27f>   DW_AT_decl_line   : 61
    <280>   DW_AT_decl_column : 9
    <281>   DW_AT_type        : <0xe0>
    <285>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><288>: Abbrev Number: 9 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0x1c8): _IO_save_base
    <28d>   DW_AT_decl_file   : 7
    <28e>   DW_AT_decl_line   : 64
    <28f>   DW_AT_decl_column : 9
    <290>   DW_AT_type        : <0xe0>
    <294>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><297>: Abbrev Number: 9 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xc92): _IO_backup_base
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 65
    <29e>   DW_AT_decl_column : 9
    <29f>   DW_AT_type        : <0xe0>
    <2a3>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2a6>: Abbrev Number: 9 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0xbf): _IO_save_end
    <2ab>   DW_AT_decl_file   : 7
    <2ac>   DW_AT_decl_line   : 66
    <2ad>   DW_AT_decl_column : 9
    <2ae>   DW_AT_type        : <0xe0>
    <2b2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b5>: Abbrev Number: 9 (DW_TAG_member)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x566): _markers
    <2ba>   DW_AT_decl_file   : 7
    <2bb>   DW_AT_decl_line   : 68
    <2bc>   DW_AT_decl_column : 22
    <2bd>   DW_AT_type        : <0x3cf>
    <2c1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c4>: Abbrev Number: 9 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2c9>   DW_AT_decl_file   : 7
    <2ca>   DW_AT_decl_line   : 70
    <2cb>   DW_AT_decl_column : 20
    <2cc>   DW_AT_type        : <0x3d5>
    <2d0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d3>: Abbrev Number: 9 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0xfa2): _fileno
    <2d8>   DW_AT_decl_file   : 7
    <2d9>   DW_AT_decl_line   : 72
    <2da>   DW_AT_decl_column : 7
    <2db>   DW_AT_type        : <0x64>
    <2df>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e2>: Abbrev Number: 9 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x78d): _flags2
    <2e7>   DW_AT_decl_file   : 7
    <2e8>   DW_AT_decl_line   : 73
    <2e9>   DW_AT_decl_column : 7
    <2ea>   DW_AT_type        : <0x64>
    <2ee>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f1>: Abbrev Number: 9 (DW_TAG_member)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x828): _old_offset
    <2f6>   DW_AT_decl_file   : 7
    <2f7>   DW_AT_decl_line   : 74
    <2f8>   DW_AT_decl_column : 11
    <2f9>   DW_AT_type        : <0xa2>
    <2fd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><300>: Abbrev Number: 9 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0x239): _cur_column
    <305>   DW_AT_decl_file   : 7
    <306>   DW_AT_decl_line   : 77
    <307>   DW_AT_decl_column : 18
    <308>   DW_AT_type        : <0x24>
    <30c>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><30f>: Abbrev Number: 9 (DW_TAG_member)
    <310>   DW_AT_name        : (indirect string, offset: 0xe36): _vtable_offset
    <314>   DW_AT_decl_file   : 7
    <315>   DW_AT_decl_line   : 78
    <316>   DW_AT_decl_column : 15
    <317>   DW_AT_type        : <0x3e>
    <31b>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><31e>: Abbrev Number: 9 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0xca2): _shortbuf
    <323>   DW_AT_decl_file   : 7
    <324>   DW_AT_decl_line   : 79
    <325>   DW_AT_decl_column : 8
    <326>   DW_AT_type        : <0x3db>
    <32a>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><32d>: Abbrev Number: 9 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <332>   DW_AT_decl_file   : 7
    <333>   DW_AT_decl_line   : 81
    <334>   DW_AT_decl_column : 15
    <335>   DW_AT_type        : <0x3eb>
    <339>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><33c>: Abbrev Number: 9 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0x6d0): _offset
    <341>   DW_AT_decl_file   : 7
    <342>   DW_AT_decl_line   : 89
    <343>   DW_AT_decl_column : 13
    <344>   DW_AT_type        : <0xb5>
    <348>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><34b>: Abbrev Number: 9 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0xa46): _codecvt
    <350>   DW_AT_decl_file   : 7
    <351>   DW_AT_decl_line   : 91
    <352>   DW_AT_decl_column : 23
    <353>   DW_AT_type        : <0x3f7>
    <357>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><35a>: Abbrev Number: 9 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0xfc1): _wide_data
    <35f>   DW_AT_decl_file   : 7
    <360>   DW_AT_decl_line   : 92
    <361>   DW_AT_decl_column : 25
    <362>   DW_AT_type        : <0x403>
    <366>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><369>: Abbrev Number: 9 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0x3c2): _freeres_list
    <36e>   DW_AT_decl_file   : 7
    <36f>   DW_AT_decl_line   : 93
    <370>   DW_AT_decl_column : 20
    <371>   DW_AT_type        : <0x3d5>
    <375>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><378>: Abbrev Number: 9 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xc05): _freeres_buf
    <37d>   DW_AT_decl_file   : 7
    <37e>   DW_AT_decl_line   : 94
    <37f>   DW_AT_decl_column : 9
    <380>   DW_AT_type        : <0xcd>
    <384>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><387>: Abbrev Number: 9 (DW_TAG_member)
    <388>   DW_AT_name        : (indirect string, offset: 0x9ba): __pad5
    <38c>   DW_AT_decl_file   : 7
    <38d>   DW_AT_decl_line   : 95
    <38e>   DW_AT_decl_column : 10
    <38f>   DW_AT_type        : <0x12e>
    <393>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><396>: Abbrev Number: 9 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0xa2a): _mode
    <39b>   DW_AT_decl_file   : 7
    <39c>   DW_AT_decl_line   : 96
    <39d>   DW_AT_decl_column : 7
    <39e>   DW_AT_type        : <0x64>
    <3a2>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3a5>: Abbrev Number: 9 (DW_TAG_member)
    <3a6>   DW_AT_name        : (indirect string, offset: 0x7d5): _unused2
    <3aa>   DW_AT_decl_file   : 7
    <3ab>   DW_AT_decl_line   : 98
    <3ac>   DW_AT_decl_column : 8
    <3ad>   DW_AT_type        : <0x409>
    <3b1>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3b4>: Abbrev Number: 0
 <1><3b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b6>   DW_AT_name        : (indirect string, offset: 0xad4): FILE
    <3ba>   DW_AT_decl_file   : 8
    <3bb>   DW_AT_decl_line   : 7
    <3bc>   DW_AT_decl_column : 25
    <3bd>   DW_AT_type        : <0x1f4>
 <1><3c1>: Abbrev Number: 14 (DW_TAG_typedef)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x46a): _IO_lock_t
    <3c6>   DW_AT_decl_file   : 7
    <3c7>   DW_AT_decl_line   : 43
    <3c8>   DW_AT_decl_column : 14
 <1><3c9>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x307): _IO_marker
    <3ce>   DW_AT_declaration : 1
 <1><3cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d0>   DW_AT_byte_size   : 4
    <3d1>   DW_AT_type        : <0x3c9>
 <1><3d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d6>   DW_AT_byte_size   : 4
    <3d7>   DW_AT_type        : <0x1f4>
 <1><3db>: Abbrev Number: 16 (DW_TAG_array_type)
    <3dc>   DW_AT_type        : <0xe6>
    <3e0>   DW_AT_sibling     : <0x3eb>
 <2><3e4>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <3e5>   DW_AT_type        : <0x2b>
    <3e9>   DW_AT_upper_bound : 0
 <2><3ea>: Abbrev Number: 0
 <1><3eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3ec>   DW_AT_byte_size   : 4
    <3ed>   DW_AT_type        : <0x3c1>
 <1><3f1>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x82): _IO_codecvt
    <3f6>   DW_AT_declaration : 1
 <1><3f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f8>   DW_AT_byte_size   : 4
    <3f9>   DW_AT_type        : <0x3f1>
 <1><3fd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x371): _IO_wide_data
    <402>   DW_AT_declaration : 1
 <1><403>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <404>   DW_AT_byte_size   : 4
    <405>   DW_AT_type        : <0x3fd>
 <1><409>: Abbrev Number: 16 (DW_TAG_array_type)
    <40a>   DW_AT_type        : <0xe6>
    <40e>   DW_AT_sibling     : <0x419>
 <2><412>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <413>   DW_AT_type        : <0x2b>
    <417>   DW_AT_upper_bound : 39
 <2><418>: Abbrev Number: 0
 <1><419>: Abbrev Number: 12 (DW_TAG_variable)
    <41a>   DW_AT_name        : (indirect string, offset: 0x531): stdin
    <41e>   DW_AT_decl_file   : 9
    <41f>   DW_AT_decl_line   : 137
    <420>   DW_AT_decl_column : 14
    <421>   DW_AT_type        : <0x427>
    <425>   DW_AT_external    : 1
    <426>   DW_AT_declaration : 1
 <1><427>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <428>   DW_AT_byte_size   : 4
    <429>   DW_AT_type        : <0x3b5>
 <1><42d>: Abbrev Number: 12 (DW_TAG_variable)
    <42e>   DW_AT_name        : (indirect string, offset: 0x1006): stdout
    <432>   DW_AT_decl_file   : 9
    <433>   DW_AT_decl_line   : 138
    <434>   DW_AT_decl_column : 14
    <435>   DW_AT_type        : <0x427>
    <439>   DW_AT_external    : 1
    <43a>   DW_AT_declaration : 1
 <1><43b>: Abbrev Number: 12 (DW_TAG_variable)
    <43c>   DW_AT_name        : (indirect string, offset: 0xdd3): stderr
    <440>   DW_AT_decl_file   : 9
    <441>   DW_AT_decl_line   : 139
    <442>   DW_AT_decl_column : 14
    <443>   DW_AT_type        : <0x427>
    <447>   DW_AT_external    : 1
    <448>   DW_AT_declaration : 1
 <1><449>: Abbrev Number: 12 (DW_TAG_variable)
    <44a>   DW_AT_name        : (indirect string, offset: 0x245): sys_nerr
    <44e>   DW_AT_decl_file   : 10
    <44f>   DW_AT_decl_line   : 26
    <450>   DW_AT_decl_column : 12
    <451>   DW_AT_type        : <0x64>
    <455>   DW_AT_external    : 1
    <456>   DW_AT_declaration : 1
 <1><457>: Abbrev Number: 16 (DW_TAG_array_type)
    <458>   DW_AT_type        : <0x1e8>
    <45c>   DW_AT_sibling     : <0x462>
 <2><460>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><461>: Abbrev Number: 0
 <1><462>: Abbrev Number: 3 (DW_TAG_const_type)
    <463>   DW_AT_type        : <0x457>
 <1><467>: Abbrev Number: 12 (DW_TAG_variable)
    <468>   DW_AT_name        : (indirect string, offset: 0x540): sys_errlist
    <46c>   DW_AT_decl_file   : 10
    <46d>   DW_AT_decl_line   : 27
    <46e>   DW_AT_decl_column : 26
    <46f>   DW_AT_type        : <0x462>
    <473>   DW_AT_external    : 1
    <474>   DW_AT_declaration : 1
 <1><475>: Abbrev Number: 12 (DW_TAG_variable)
    <476>   DW_AT_name        : (indirect string, offset: 0x269): _sys_nerr
    <47a>   DW_AT_decl_file   : 10
    <47b>   DW_AT_decl_line   : 30
    <47c>   DW_AT_decl_column : 12
    <47d>   DW_AT_type        : <0x64>
    <481>   DW_AT_external    : 1
    <482>   DW_AT_declaration : 1
 <1><483>: Abbrev Number: 12 (DW_TAG_variable)
    <484>   DW_AT_name        : (indirect string, offset: 0xe45): _sys_errlist
    <488>   DW_AT_decl_file   : 10
    <489>   DW_AT_decl_line   : 31
    <48a>   DW_AT_decl_column : 26
    <48b>   DW_AT_type        : <0x462>
    <48f>   DW_AT_external    : 1
    <490>   DW_AT_declaration : 1
 <1><491>: Abbrev Number: 12 (DW_TAG_variable)
    <492>   DW_AT_name        : (indirect string, offset: 0x6a9): program_invocation_name
    <496>   DW_AT_decl_file   : 11
    <497>   DW_AT_decl_line   : 45
    <498>   DW_AT_decl_column : 14
    <499>   DW_AT_type        : <0xe0>
    <49d>   DW_AT_external    : 1
    <49e>   DW_AT_declaration : 1
 <1><49f>: Abbrev Number: 12 (DW_TAG_variable)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xbaa): program_invocation_short_name
    <4a4>   DW_AT_decl_file   : 11
    <4a5>   DW_AT_decl_line   : 46
    <4a6>   DW_AT_decl_column : 14
    <4a7>   DW_AT_type        : <0xe0>
    <4ab>   DW_AT_external    : 1
    <4ac>   DW_AT_declaration : 1
 <1><4ad>: Abbrev Number: 16 (DW_TAG_array_type)
    <4ae>   DW_AT_type        : <0xe0>
    <4b2>   DW_AT_sibling     : <0x4bd>
 <2><4b6>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <4b7>   DW_AT_type        : <0x2b>
    <4bb>   DW_AT_upper_bound : 1
 <2><4bc>: Abbrev Number: 0
 <1><4bd>: Abbrev Number: 12 (DW_TAG_variable)
    <4be>   DW_AT_name        : (indirect string, offset: 0x1b5): __tzname
    <4c2>   DW_AT_decl_file   : 12
    <4c3>   DW_AT_decl_line   : 159
    <4c4>   DW_AT_decl_column : 14
    <4c5>   DW_AT_type        : <0x4ad>
    <4c9>   DW_AT_external    : 1
    <4ca>   DW_AT_declaration : 1
 <1><4cb>: Abbrev Number: 12 (DW_TAG_variable)
    <4cc>   DW_AT_name        : (indirect string, offset: 0xebb): __daylight
    <4d0>   DW_AT_decl_file   : 12
    <4d1>   DW_AT_decl_line   : 160
    <4d2>   DW_AT_decl_column : 12
    <4d3>   DW_AT_type        : <0x64>
    <4d7>   DW_AT_external    : 1
    <4d8>   DW_AT_declaration : 1
 <1><4d9>: Abbrev Number: 12 (DW_TAG_variable)
    <4da>   DW_AT_name        : (indirect string, offset: 0x366): __timezone
    <4de>   DW_AT_decl_file   : 12
    <4df>   DW_AT_decl_line   : 161
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0xae>
    <4e5>   DW_AT_external    : 1
    <4e6>   DW_AT_declaration : 1
 <1><4e7>: Abbrev Number: 12 (DW_TAG_variable)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x9b3): tzname
    <4ec>   DW_AT_decl_file   : 12
    <4ed>   DW_AT_decl_line   : 166
    <4ee>   DW_AT_decl_column : 14
    <4ef>   DW_AT_type        : <0x4ad>
    <4f3>   DW_AT_external    : 1
    <4f4>   DW_AT_declaration : 1
 <1><4f5>: Abbrev Number: 12 (DW_TAG_variable)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x107f): daylight
    <4fa>   DW_AT_decl_file   : 12
    <4fb>   DW_AT_decl_line   : 174
    <4fc>   DW_AT_decl_column : 12
    <4fd>   DW_AT_type        : <0x64>
    <501>   DW_AT_external    : 1
    <502>   DW_AT_declaration : 1
 <1><503>: Abbrev Number: 12 (DW_TAG_variable)
    <504>   DW_AT_name        : (indirect string, offset: 0x4b6): timezone
    <508>   DW_AT_decl_file   : 12
    <509>   DW_AT_decl_line   : 175
    <50a>   DW_AT_decl_column : 17
    <50b>   DW_AT_type        : <0xae>
    <50f>   DW_AT_external    : 1
    <510>   DW_AT_declaration : 1
 <1><511>: Abbrev Number: 11 (DW_TAG_variable)
    <512>   DW_AT_name        : (indirect string, offset: 0xf50): getdate_err
    <516>   DW_AT_decl_file   : 12
    <517>   DW_AT_decl_line   : 274
    <519>   DW_AT_decl_column : 12
    <51a>   DW_AT_type        : <0x64>
    <51e>   DW_AT_external    : 1
    <51f>   DW_AT_declaration : 1
 <1><520>: Abbrev Number: 12 (DW_TAG_variable)
    <521>   DW_AT_name        : (indirect string, offset: 0x9c6): debug_flag
    <525>   DW_AT_decl_file   : 13
    <526>   DW_AT_decl_line   : 20
    <527>   DW_AT_decl_column : 13
    <528>   DW_AT_type        : <0x52e>
    <52c>   DW_AT_external    : 1
    <52d>   DW_AT_declaration : 1
 <1><52e>: Abbrev Number: 2 (DW_TAG_base_type)
    <52f>   DW_AT_byte_size   : 1
    <530>   DW_AT_encoding    : 2	(boolean)
    <531>   DW_AT_name        : (indirect string, offset: 0x404): _Bool
 <1><535>: Abbrev Number: 3 (DW_TAG_const_type)
    <536>   DW_AT_type        : <0x52e>
 <1><53a>: Abbrev Number: 4 (DW_TAG_typedef)
    <53b>   DW_AT_name        : (indirect string, offset: 0xa8a): __kernel_long_t
    <53f>   DW_AT_decl_file   : 14
    <540>   DW_AT_decl_line   : 15
    <541>   DW_AT_decl_column : 15
    <542>   DW_AT_type        : <0xae>
 <1><546>: Abbrev Number: 4 (DW_TAG_typedef)
    <547>   DW_AT_name        : (indirect string, offset: 0x42): __kernel_ulong_t
    <54b>   DW_AT_decl_file   : 14
    <54c>   DW_AT_decl_line   : 16
    <54d>   DW_AT_decl_column : 23
    <54e>   DW_AT_type        : <0x37>
 <1><552>: Abbrev Number: 4 (DW_TAG_typedef)
    <553>   DW_AT_name        : (indirect string, offset: 0x3d0): kernel_long_t
    <557>   DW_AT_decl_file   : 15
    <558>   DW_AT_decl_line   : 16
    <559>   DW_AT_decl_column : 25
    <55a>   DW_AT_type        : <0x53a>
 <1><55e>: Abbrev Number: 4 (DW_TAG_typedef)
    <55f>   DW_AT_name        : (indirect string, offset: 0x89d): kernel_ulong_t
    <563>   DW_AT_decl_file   : 15
    <564>   DW_AT_decl_line   : 17
    <565>   DW_AT_decl_column : 26
    <566>   DW_AT_type        : <0x546>
 <1><56a>: Abbrev Number: 3 (DW_TAG_const_type)
    <56b>   DW_AT_type        : <0x55e>
 <1><56f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <570>   DW_AT_name        : (indirect string, offset: 0xbc8): list_item
    <574>   DW_AT_byte_size   : 8
    <575>   DW_AT_decl_file   : 16
    <576>   DW_AT_decl_line   : 92
    <577>   DW_AT_decl_column : 8
    <578>   DW_AT_sibling     : <0x59b>
 <2><57c>: Abbrev Number: 9 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0x10c4): prev
    <581>   DW_AT_decl_file   : 16
    <582>   DW_AT_decl_line   : 93
    <583>   DW_AT_decl_column : 20
    <584>   DW_AT_type        : <0x59b>
    <588>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58b>: Abbrev Number: 9 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0x10ba): next
    <590>   DW_AT_decl_file   : 16
    <591>   DW_AT_decl_line   : 94
    <592>   DW_AT_decl_column : 20
    <593>   DW_AT_type        : <0x59b>
    <597>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59a>: Abbrev Number: 0
 <1><59b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59c>   DW_AT_byte_size   : 4
    <59d>   DW_AT_type        : <0x56f>
 <1><5a1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a2>   DW_AT_name        : (indirect string, offset: 0x875): sysent
    <5a6>   DW_AT_byte_size   : 20
    <5a7>   DW_AT_decl_file   : 17
    <5a8>   DW_AT_decl_line   : 13
    <5a9>   DW_AT_decl_column : 16
    <5aa>   DW_AT_sibling     : <0x5fa>
 <2><5ae>: Abbrev Number: 9 (DW_TAG_member)
    <5af>   DW_AT_name        : (indirect string, offset: 0x101d): nargs
    <5b3>   DW_AT_decl_file   : 17
    <5b4>   DW_AT_decl_line   : 14
    <5b5>   DW_AT_decl_column : 11
    <5b6>   DW_AT_type        : <0x2b>
    <5ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bd>: Abbrev Number: 9 (DW_TAG_member)
    <5be>   DW_AT_name        : (indirect string, offset: 0x972): sys_flags
    <5c2>   DW_AT_decl_file   : 17
    <5c3>   DW_AT_decl_line   : 15
    <5c4>   DW_AT_decl_column : 6
    <5c5>   DW_AT_type        : <0x64>
    <5c9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cc>: Abbrev Number: 19 (DW_TAG_member)
    <5cd>   DW_AT_name        : sen
    <5d1>   DW_AT_decl_file   : 17
    <5d2>   DW_AT_decl_line   : 16
    <5d3>   DW_AT_decl_column : 6
    <5d4>   DW_AT_type        : <0x64>
    <5d8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5db>: Abbrev Number: 9 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x2fe): sys_func
    <5e0>   DW_AT_decl_file   : 17
    <5e1>   DW_AT_decl_line   : 17
    <5e2>   DW_AT_decl_column : 8
    <5e3>   DW_AT_type        : <0x861>
    <5e7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ea>: Abbrev Number: 9 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x273): sys_name
    <5ef>   DW_AT_decl_file   : 17
    <5f0>   DW_AT_decl_line   : 18
    <5f1>   DW_AT_decl_column : 14
    <5f2>   DW_AT_type        : <0x1e2>
    <5f6>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5fb>   DW_AT_prototyped  : 1
    <5fc>   DW_AT_type        : <0x64>
    <600>   DW_AT_sibling     : <0x60a>
 <2><604>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <605>   DW_AT_type        : <0x60a>
 <2><609>: Abbrev Number: 0
 <1><60a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60b>   DW_AT_byte_size   : 4
    <60c>   DW_AT_type        : <0x615>
 <1><610>: Abbrev Number: 3 (DW_TAG_const_type)
    <611>   DW_AT_type        : <0x60a>
 <1><615>: Abbrev Number: 22 (DW_TAG_structure_type)
    <616>   DW_AT_name        : tcb
    <61a>   DW_AT_byte_size   : 204
    <61b>   DW_AT_decl_file   : 18
    <61c>   DW_AT_decl_line   : 262
    <61e>   DW_AT_decl_column : 8
    <61f>   DW_AT_sibling     : <0x861>
 <2><623>: Abbrev Number: 23 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x4d1): flags
    <628>   DW_AT_decl_file   : 18
    <629>   DW_AT_decl_line   : 263
    <62b>   DW_AT_decl_column : 6
    <62c>   DW_AT_type        : <0x64>
    <630>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><633>: Abbrev Number: 24 (DW_TAG_member)
    <634>   DW_AT_name        : pid
    <638>   DW_AT_decl_file   : 18
    <639>   DW_AT_decl_line   : 264
    <63b>   DW_AT_decl_column : 6
    <63c>   DW_AT_type        : <0x64>
    <640>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><643>: Abbrev Number: 23 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x61): qual_flg
    <648>   DW_AT_decl_file   : 18
    <649>   DW_AT_decl_line   : 265
    <64b>   DW_AT_decl_column : 6
    <64c>   DW_AT_type        : <0x64>
    <650>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><653>: Abbrev Number: 23 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0x38a): currpers
    <658>   DW_AT_decl_file   : 18
    <659>   DW_AT_decl_line   : 267
    <65b>   DW_AT_decl_column : 15
    <65c>   DW_AT_type        : <0x2b>
    <660>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><663>: Abbrev Number: 23 (DW_TAG_member)
    <664>   DW_AT_name        : (indirect string, offset: 0xb27): u_error
    <668>   DW_AT_decl_file   : 18
    <669>   DW_AT_decl_line   : 269
    <66b>   DW_AT_decl_column : 16
    <66c>   DW_AT_type        : <0x37>
    <670>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><673>: Abbrev Number: 23 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <678>   DW_AT_decl_file   : 18
    <679>   DW_AT_decl_line   : 270
    <67b>   DW_AT_decl_column : 17
    <67c>   DW_AT_type        : <0x55e>
    <680>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><683>: Abbrev Number: 23 (DW_TAG_member)
    <684>   DW_AT_name        : (indirect string, offset: 0xb60): true_scno
    <688>   DW_AT_decl_file   : 18
    <689>   DW_AT_decl_line   : 271
    <68b>   DW_AT_decl_column : 17
    <68c>   DW_AT_type        : <0x55e>
    <690>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><693>: Abbrev Number: 23 (DW_TAG_member)
    <694>   DW_AT_name        : (indirect string, offset: 0x19f): u_arg
    <698>   DW_AT_decl_file   : 18
    <699>   DW_AT_decl_line   : 272
    <69b>   DW_AT_decl_column : 17
    <69c>   DW_AT_type        : <0x991>
    <6a0>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a3>: Abbrev Number: 23 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x989): u_rval
    <6a8>   DW_AT_decl_file   : 18
    <6a9>   DW_AT_decl_line   : 273
    <6ab>   DW_AT_decl_column : 16
    <6ac>   DW_AT_type        : <0x552>
    <6b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b3>: Abbrev Number: 23 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xaa6): sys_func_rval
    <6b8>   DW_AT_decl_file   : 18
    <6b9>   DW_AT_decl_line   : 274
    <6bb>   DW_AT_decl_column : 6
    <6bc>   DW_AT_type        : <0x64>
    <6c0>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c3>: Abbrev Number: 23 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0xcbc): curcol
    <6c8>   DW_AT_decl_file   : 18
    <6c9>   DW_AT_decl_line   : 275
    <6cb>   DW_AT_decl_column : 6
    <6cc>   DW_AT_type        : <0x64>
    <6d0>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d3>: Abbrev Number: 23 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x99b): outf
    <6d8>   DW_AT_decl_file   : 18
    <6d9>   DW_AT_decl_line   : 276
    <6db>   DW_AT_decl_column : 8
    <6dc>   DW_AT_type        : <0x427>
    <6e0>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e3>: Abbrev Number: 23 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0xefa): staged_output_data
    <6e8>   DW_AT_decl_file   : 18
    <6e9>   DW_AT_decl_line   : 277
    <6eb>   DW_AT_decl_column : 29
    <6ec>   DW_AT_type        : <0x9a7>
    <6f0>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f3>: Abbrev Number: 23 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xa71): auxstr
    <6f8>   DW_AT_decl_file   : 18
    <6f9>   DW_AT_decl_line   : 279
    <6fb>   DW_AT_decl_column : 14
    <6fc>   DW_AT_type        : <0x1e2>
    <700>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><703>: Abbrev Number: 23 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <708>   DW_AT_decl_file   : 18
    <709>   DW_AT_decl_line   : 280
    <70b>   DW_AT_decl_column : 8
    <70c>   DW_AT_type        : <0xcd>
    <710>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><713>: Abbrev Number: 23 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0xbf5): _free_priv_data
    <718>   DW_AT_decl_file   : 18
    <719>   DW_AT_decl_line   : 281
    <71b>   DW_AT_decl_column : 9
    <71c>   DW_AT_type        : <0x9b9>
    <720>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><723>: Abbrev Number: 23 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <728>   DW_AT_decl_file   : 18
    <729>   DW_AT_decl_line   : 282
    <72b>   DW_AT_decl_column : 23
    <72c>   DW_AT_type        : <0x9bf>
    <730>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><733>: Abbrev Number: 23 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x20): s_prev_ent
    <738>   DW_AT_decl_file   : 18
    <739>   DW_AT_decl_line   : 285
    <73b>   DW_AT_decl_column : 23
    <73c>   DW_AT_type        : <0x9bf>
    <740>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><743>: Abbrev Number: 23 (DW_TAG_member)
    <744>   DW_AT_name        : (indirect string, offset: 0x37f): inject_vec
    <748>   DW_AT_decl_file   : 18
    <749>   DW_AT_decl_line   : 286
    <74b>   DW_AT_decl_column : 22
    <74c>   DW_AT_type        : <0x9ca>
    <750>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><753>: Abbrev Number: 23 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x7e6): stime
    <758>   DW_AT_decl_file   : 18
    <759>   DW_AT_decl_line   : 287
    <75b>   DW_AT_decl_column : 18
    <75c>   DW_AT_type        : <0x13f>
    <760>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><763>: Abbrev Number: 23 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x393): ltime
    <768>   DW_AT_decl_file   : 18
    <769>   DW_AT_decl_line   : 288
    <76b>   DW_AT_decl_column : 18
    <76c>   DW_AT_type        : <0x13f>
    <770>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><773>: Abbrev Number: 23 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0xfe4): atime
    <778>   DW_AT_decl_file   : 18
    <779>   DW_AT_decl_line   : 289
    <77b>   DW_AT_decl_column : 18
    <77c>   DW_AT_type        : <0x13f>
    <780>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><783>: Abbrev Number: 23 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x4cb): etime
    <788>   DW_AT_decl_file   : 18
    <789>   DW_AT_decl_line   : 290
    <78b>   DW_AT_decl_column : 18
    <78c>   DW_AT_type        : <0x13f>
    <790>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><794>: Abbrev Number: 23 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0xd20): delay_expiration_time
    <799>   DW_AT_decl_file   : 18
    <79a>   DW_AT_decl_line   : 291
    <79c>   DW_AT_decl_column : 18
    <79d>   DW_AT_type        : <0x13f>
    <7a1>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a5>: Abbrev Number: 23 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x2b): pid_ns
    <7aa>   DW_AT_decl_file   : 18
    <7ab>   DW_AT_decl_line   : 298
    <7ad>   DW_AT_decl_column : 15
    <7ae>   DW_AT_type        : <0x2b>
    <7b2>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b6>: Abbrev Number: 23 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xf36): last_dirfd
    <7bb>   DW_AT_decl_file   : 18
    <7bc>   DW_AT_decl_line   : 301
    <7be>   DW_AT_decl_column : 6
    <7bf>   DW_AT_type        : <0x64>
    <7c3>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c7>: Abbrev Number: 23 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0xf5c): mmap_cache
    <7cc>   DW_AT_decl_file   : 18
    <7cd>   DW_AT_decl_line   : 304
    <7cf>   DW_AT_decl_column : 23
    <7d0>   DW_AT_type        : <0x9e6>
    <7d4>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d8>: Abbrev Number: 23 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0xb36): wait_data_idx
    <7dd>   DW_AT_decl_file   : 18
    <7de>   DW_AT_decl_line   : 311
    <7e0>   DW_AT_decl_column : 9
    <7e1>   DW_AT_type        : <0x12e>
    <7e5>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e9>: Abbrev Number: 23 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0xa78): delayed_wait_data
    <7ee>   DW_AT_decl_file   : 18
    <7ef>   DW_AT_decl_line   : 313
    <7f1>   DW_AT_decl_column : 24
    <7f2>   DW_AT_type        : <0x9f2>
    <7f6>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7fa>: Abbrev Number: 23 (DW_TAG_member)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xae8): wait_list
    <7ff>   DW_AT_decl_file   : 18
    <800>   DW_AT_decl_line   : 314
    <802>   DW_AT_decl_column : 19
    <803>   DW_AT_type        : <0x56f>
    <807>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80b>: Abbrev Number: 23 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x6c1): vcpu_info_list
    <810>   DW_AT_decl_file   : 18
    <811>   DW_AT_decl_line   : 318
    <813>   DW_AT_decl_column : 20
    <814>   DW_AT_type        : <0x9fe>
    <818>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81c>: Abbrev Number: 23 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xc87): unwind_ctx
    <821>   DW_AT_decl_file   : 18
    <822>   DW_AT_decl_line   : 322
    <824>   DW_AT_decl_column : 8
    <825>   DW_AT_type        : <0xcd>
    <829>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82d>: Abbrev Number: 23 (DW_TAG_member)
    <82e>   DW_AT_name        : (indirect string, offset: 0x4a9): unwind_queue
    <832>   DW_AT_decl_file   : 18
    <833>   DW_AT_decl_line   : 323
    <835>   DW_AT_decl_column : 25
    <836>   DW_AT_type        : <0xa0a>
    <83a>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83e>: Abbrev Number: 23 (DW_TAG_member)
    <83f>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <843>   DW_AT_decl_file   : 18
    <844>   DW_AT_decl_line   : 327
    <846>   DW_AT_decl_column : 7
    <847>   DW_AT_type        : <0xa10>
    <84b>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84f>: Abbrev Number: 23 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0x21b): start_prc
    <854>   DW_AT_decl_file   : 18
    <855>   DW_AT_decl_line   : 329
    <857>   DW_AT_decl_column : 16
    <858>   DW_AT_type        : <0x37>
    <85c>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><860>: Abbrev Number: 0
 <1><861>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <862>   DW_AT_byte_size   : 4
    <863>   DW_AT_type        : <0x5fa>
 <1><867>: Abbrev Number: 4 (DW_TAG_typedef)
    <868>   DW_AT_name        : (indirect string, offset: 0x517): struct_sysent
    <86c>   DW_AT_decl_file   : 17
    <86d>   DW_AT_decl_line   : 19
    <86e>   DW_AT_decl_column : 3
    <86f>   DW_AT_type        : <0x5a1>
 <1><873>: Abbrev Number: 3 (DW_TAG_const_type)
    <874>   DW_AT_type        : <0x867>
 <1><878>: Abbrev Number: 12 (DW_TAG_variable)
    <879>   DW_AT_name        : (indirect string, offset: 0xd0c): current_personality
    <87d>   DW_AT_decl_file   : 18
    <87e>   DW_AT_decl_line   : 158
    <87f>   DW_AT_decl_column : 17
    <880>   DW_AT_type        : <0x2b>
    <884>   DW_AT_external    : 1
    <885>   DW_AT_declaration : 1
 <1><886>: Abbrev Number: 12 (DW_TAG_variable)
    <887>   DW_AT_name        : (indirect string, offset: 0x817): current_wordsize
    <88b>   DW_AT_decl_file   : 18
    <88c>   DW_AT_decl_line   : 171
    <88d>   DW_AT_decl_column : 17
    <88e>   DW_AT_type        : <0x2b>
    <892>   DW_AT_external    : 1
    <893>   DW_AT_declaration : 1
 <1><894>: Abbrev Number: 12 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0xa4f): current_klongsize
    <899>   DW_AT_decl_file   : 18
    <89a>   DW_AT_decl_line   : 176
    <89b>   DW_AT_decl_column : 17
    <89c>   DW_AT_type        : <0x2b>
    <8a0>   DW_AT_external    : 1
    <8a1>   DW_AT_declaration : 1
 <1><8a2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a3>   DW_AT_name        : (indirect string, offset: 0xc5e): ioctlent
    <8a7>   DW_AT_byte_size   : 8
    <8a8>   DW_AT_decl_file   : 18
    <8a9>   DW_AT_decl_line   : 217
    <8aa>   DW_AT_decl_column : 16
    <8ab>   DW_AT_sibling     : <0x8ce>
 <2><8af>: Abbrev Number: 9 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0xf22): symbol
    <8b4>   DW_AT_decl_file   : 18
    <8b5>   DW_AT_decl_line   : 218
    <8b6>   DW_AT_decl_column : 14
    <8b7>   DW_AT_type        : <0x1e2>
    <8bb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8be>: Abbrev Number: 9 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xcd5): code
    <8c3>   DW_AT_decl_file   : 18
    <8c4>   DW_AT_decl_line   : 219
    <8c5>   DW_AT_decl_column : 15
    <8c6>   DW_AT_type        : <0x2b>
    <8ca>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8cd>: Abbrev Number: 0
 <1><8ce>: Abbrev Number: 4 (DW_TAG_typedef)
    <8cf>   DW_AT_name        : (indirect string, offset: 0xc1f): struct_ioctlent
    <8d3>   DW_AT_decl_file   : 18
    <8d4>   DW_AT_decl_line   : 220
    <8d5>   DW_AT_decl_column : 3
    <8d6>   DW_AT_type        : <0x8a2>
 <1><8da>: Abbrev Number: 3 (DW_TAG_const_type)
    <8db>   DW_AT_type        : <0x8ce>
 <1><8df>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x80b): inject_data
    <8e4>   DW_AT_byte_size   : 10
    <8e5>   DW_AT_decl_file   : 18
    <8e6>   DW_AT_decl_line   : 241
    <8e7>   DW_AT_decl_column : 8
    <8e8>   DW_AT_sibling     : <0x947>
 <2><8ec>: Abbrev Number: 9 (DW_TAG_member)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x4d1): flags
    <8f1>   DW_AT_decl_file   : 18
    <8f2>   DW_AT_decl_line   : 242
    <8f3>   DW_AT_decl_column : 10
    <8f4>   DW_AT_type        : <0xfe>
    <8f8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8fb>: Abbrev Number: 9 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x926): signo
    <900>   DW_AT_decl_file   : 18
    <901>   DW_AT_decl_line   : 243
    <902>   DW_AT_decl_column : 10
    <903>   DW_AT_type        : <0xfe>
    <907>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><90a>: Abbrev Number: 9 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <90f>   DW_AT_decl_file   : 18
    <910>   DW_AT_decl_line   : 244
    <911>   DW_AT_decl_column : 11
    <912>   DW_AT_type        : <0x10a>
    <916>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><919>: Abbrev Number: 9 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0xcb2): delay_idx
    <91e>   DW_AT_decl_file   : 18
    <91f>   DW_AT_decl_line   : 245
    <920>   DW_AT_decl_column : 11
    <921>   DW_AT_type        : <0x10a>
    <925>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><928>: Abbrev Number: 9 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x558): poke_idx
    <92d>   DW_AT_decl_file   : 18
    <92e>   DW_AT_decl_line   : 246
    <92f>   DW_AT_decl_column : 11
    <930>   DW_AT_type        : <0x10a>
    <934>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><937>: Abbrev Number: 9 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <93c>   DW_AT_decl_file   : 18
    <93d>   DW_AT_decl_line   : 247
    <93e>   DW_AT_decl_column : 11
    <93f>   DW_AT_type        : <0x10a>
    <943>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 8 (DW_TAG_structure_type)
    <948>   DW_AT_name        : (indirect string, offset: 0xe6): inject_opts
    <94c>   DW_AT_byte_size   : 16
    <94d>   DW_AT_decl_file   : 18
    <94e>   DW_AT_decl_line   : 250
    <94f>   DW_AT_decl_column : 8
    <950>   DW_AT_sibling     : <0x991>
 <2><954>: Abbrev Number: 9 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0xa24): first
    <959>   DW_AT_decl_file   : 18
    <95a>   DW_AT_decl_line   : 251
    <95b>   DW_AT_decl_column : 11
    <95c>   DW_AT_type        : <0x10a>
    <960>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><963>: Abbrev Number: 9 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x10ed): last
    <968>   DW_AT_decl_file   : 18
    <969>   DW_AT_decl_line   : 252
    <96a>   DW_AT_decl_column : 11
    <96b>   DW_AT_type        : <0x10a>
    <96f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><972>: Abbrev Number: 9 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x399): step
    <977>   DW_AT_decl_file   : 18
    <978>   DW_AT_decl_line   : 253
    <979>   DW_AT_decl_column : 11
    <97a>   DW_AT_type        : <0x10a>
    <97e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><981>: Abbrev Number: 9 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x10bf): data
    <986>   DW_AT_decl_file   : 18
    <987>   DW_AT_decl_line   : 254
    <988>   DW_AT_decl_column : 21
    <989>   DW_AT_type        : <0x8df>
    <98d>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><990>: Abbrev Number: 0
 <1><991>: Abbrev Number: 16 (DW_TAG_array_type)
    <992>   DW_AT_type        : <0x55e>
    <996>   DW_AT_sibling     : <0x9a1>
 <2><99a>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <99b>   DW_AT_type        : <0x2b>
    <99f>   DW_AT_upper_bound : 5
 <2><9a0>: Abbrev Number: 0
 <1><9a1>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9a2>   DW_AT_name        : (indirect string, offset: 0xefa): staged_output_data
    <9a6>   DW_AT_declaration : 1
 <1><9a7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a8>   DW_AT_byte_size   : 4
    <9a9>   DW_AT_type        : <0x9a1>
 <1><9ad>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9ae>   DW_AT_prototyped  : 1
    <9af>   DW_AT_sibling     : <0x9b9>
 <2><9b3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9b4>   DW_AT_type        : <0xcd>
 <2><9b8>: Abbrev Number: 0
 <1><9b9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ba>   DW_AT_byte_size   : 4
    <9bb>   DW_AT_type        : <0x9ad>
 <1><9bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c0>   DW_AT_byte_size   : 4
    <9c1>   DW_AT_type        : <0x873>
 <1><9c5>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c6>   DW_AT_type        : <0x9bf>
 <1><9ca>: Abbrev Number: 16 (DW_TAG_array_type)
    <9cb>   DW_AT_type        : <0x9da>
    <9cf>   DW_AT_sibling     : <0x9da>
 <2><9d3>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9d4>   DW_AT_type        : <0x2b>
    <9d8>   DW_AT_upper_bound : 2
 <2><9d9>: Abbrev Number: 0
 <1><9da>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9db>   DW_AT_byte_size   : 4
    <9dc>   DW_AT_type        : <0x947>
 <1><9e0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9e1>   DW_AT_name        : (indirect string, offset: 0xb2): mmap_cache_t
    <9e5>   DW_AT_declaration : 1
 <1><9e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e7>   DW_AT_byte_size   : 4
    <9e8>   DW_AT_type        : <0x9e0>
 <1><9ec>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x3b4): tcb_wait_data
    <9f1>   DW_AT_declaration : 1
 <1><9f2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f3>   DW_AT_byte_size   : 4
    <9f4>   DW_AT_type        : <0x9ec>
 <1><9f8>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <9fd>   DW_AT_declaration : 1
 <1><9fe>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ff>   DW_AT_byte_size   : 4
    <a00>   DW_AT_type        : <0x9f8>
 <1><a04>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a05>   DW_AT_name        : (indirect string, offset: 0xede): unwind_queue_t
    <a09>   DW_AT_declaration : 1
 <1><a0a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0b>   DW_AT_byte_size   : 4
    <a0c>   DW_AT_type        : <0xa04>
 <1><a10>: Abbrev Number: 16 (DW_TAG_array_type)
    <a11>   DW_AT_type        : <0xe6>
    <a15>   DW_AT_sibling     : <0xa20>
 <2><a19>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a1a>   DW_AT_type        : <0x2b>
    <a1e>   DW_AT_upper_bound : 15
 <2><a1f>: Abbrev Number: 0
 <1><a20>: Abbrev Number: 11 (DW_TAG_variable)
    <a21>   DW_AT_name        : (indirect string, offset: 0xb73): stub_sysent
    <a25>   DW_AT_decl_file   : 18
    <a26>   DW_AT_decl_line   : 403
    <a28>   DW_AT_decl_column : 28
    <a29>   DW_AT_type        : <0x873>
    <a2d>   DW_AT_external    : 1
    <a2e>   DW_AT_declaration : 1
 <1><a2f>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a30>   DW_AT_name        : (indirect string, offset: 0x10a2): xlat_type
    <a34>   DW_AT_encoding    : 7	(unsigned)
    <a35>   DW_AT_byte_size   : 4
    <a36>   DW_AT_type        : <0x2b>
    <a3a>   DW_AT_decl_file   : 19
    <a3b>   DW_AT_decl_line   : 13
    <a3c>   DW_AT_decl_column : 6
    <a3d>   DW_AT_sibling     : <0xa54>
 <2><a41>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0x2ce): XT_NORMAL
    <a46>   DW_AT_const_value : 0
 <2><a47>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0xc36): XT_SORTED
    <a4c>   DW_AT_const_value : 1
 <2><a4d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xdb2): XT_INDEXED
    <a52>   DW_AT_const_value : 2
 <2><a53>: Abbrev Number: 0
 <1><a54>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a55>   DW_AT_name        : (indirect string, offset: 0xb9f): xlat_style
    <a59>   DW_AT_encoding    : 7	(unsigned)
    <a5a>   DW_AT_byte_size   : 4
    <a5b>   DW_AT_type        : <0x2b>
    <a5f>   DW_AT_decl_file   : 19
    <a60>   DW_AT_decl_line   : 19
    <a61>   DW_AT_decl_column : 6
    <a62>   DW_AT_sibling     : <0xa91>
 <2><a66>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0xf2): XLAT_STYLE_DEFAULT
    <a6b>   DW_AT_const_value : 0
 <2><a6c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0xbd2): XLAT_STYLE_RAW
    <a71>   DW_AT_const_value : 1
 <2><a72>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x106d): XLAT_STYLE_ABBREV
    <a77>   DW_AT_const_value : 2
 <2><a78>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x2eb): XLAT_STYLE_VERBOSE
    <a7d>   DW_AT_const_value : 3
 <2><a7e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x258): XLAT_STYLE_FMT_X
    <a83>   DW_AT_const_value : 0
 <2><a84>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a85>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a89>   DW_AT_const_value : 4
 <2><a8a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x10dc): XLAT_STYLE_FMT_D
    <a8f>   DW_AT_const_value : 8
 <2><a90>: Abbrev Number: 0
 <1><a91>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a92>   DW_AT_name        : (indirect string, offset: 0x31c): xlat_data
    <a96>   DW_AT_byte_size   : 12
    <a97>   DW_AT_decl_file   : 19
    <a98>   DW_AT_decl_line   : 51
    <a99>   DW_AT_decl_column : 8
    <a9a>   DW_AT_sibling     : <0xabd>
 <2><a9e>: Abbrev Number: 19 (DW_TAG_member)
    <a9f>   DW_AT_name        : val
    <aa3>   DW_AT_decl_file   : 19
    <aa4>   DW_AT_decl_line   : 52
    <aa5>   DW_AT_decl_column : 11
    <aa6>   DW_AT_type        : <0x122>
    <aaa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aad>: Abbrev Number: 19 (DW_TAG_member)
    <aae>   DW_AT_name        : str
    <ab2>   DW_AT_decl_file   : 19
    <ab3>   DW_AT_decl_line   : 53
    <ab4>   DW_AT_decl_column : 14
    <ab5>   DW_AT_type        : <0x1e2>
    <ab9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><abc>: Abbrev Number: 0
 <1><abd>: Abbrev Number: 3 (DW_TAG_const_type)
    <abe>   DW_AT_type        : <0xa91>
 <1><ac2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x1b): xlat
    <ac7>   DW_AT_byte_size   : 24
    <ac8>   DW_AT_decl_file   : 19
    <ac9>   DW_AT_decl_line   : 56
    <aca>   DW_AT_decl_column : 8
    <acb>   DW_AT_sibling     : <0xb1b>
 <2><acf>: Abbrev Number: 9 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x10bf): data
    <ad4>   DW_AT_decl_file   : 19
    <ad5>   DW_AT_decl_line   : 57
    <ad6>   DW_AT_decl_column : 26
    <ad7>   DW_AT_type        : <0xb20>
    <adb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ade>: Abbrev Number: 9 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x869): flags_strsz
    <ae3>   DW_AT_decl_file   : 19
    <ae4>   DW_AT_decl_line   : 58
    <ae5>   DW_AT_decl_column : 9
    <ae6>   DW_AT_type        : <0x12e>
    <aea>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><aed>: Abbrev Number: 9 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0xb44): size
    <af2>   DW_AT_decl_file   : 19
    <af3>   DW_AT_decl_line   : 59
    <af4>   DW_AT_decl_column : 11
    <af5>   DW_AT_type        : <0x116>
    <af9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><afc>: Abbrev Number: 9 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0x19a): type
    <b01>   DW_AT_decl_file   : 19
    <b02>   DW_AT_decl_line   : 60
    <b03>   DW_AT_decl_column : 17
    <b04>   DW_AT_type        : <0xa2f>
    <b08>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b0b>: Abbrev Number: 9 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x715): flags_mask
    <b10>   DW_AT_decl_file   : 19
    <b11>   DW_AT_decl_line   : 61
    <b12>   DW_AT_decl_column : 11
    <b13>   DW_AT_type        : <0x122>
    <b17>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b1a>: Abbrev Number: 0
 <1><b1b>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1c>   DW_AT_type        : <0xac2>
 <1><b20>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b21>   DW_AT_byte_size   : 4
    <b22>   DW_AT_type        : <0xabd>
 <1><b26>: Abbrev Number: 16 (DW_TAG_array_type)
    <b27>   DW_AT_type        : <0xb1b>
    <b2b>   DW_AT_sibling     : <0xb31>
 <2><b2f>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b30>: Abbrev Number: 0
 <1><b31>: Abbrev Number: 3 (DW_TAG_const_type)
    <b32>   DW_AT_type        : <0xb26>
 <1><b36>: Abbrev Number: 11 (DW_TAG_variable)
    <b37>   DW_AT_name        : (indirect string, offset: 0xe23): addrfams
    <b3b>   DW_AT_decl_file   : 18
    <b3c>   DW_AT_decl_line   : 409
    <b3e>   DW_AT_decl_column : 26
    <b3f>   DW_AT_type        : <0xb31>
    <b43>   DW_AT_external    : 1
    <b44>   DW_AT_declaration : 1
 <1><b45>: Abbrev Number: 11 (DW_TAG_variable)
    <b46>   DW_AT_name        : (indirect string, offset: 0xce5): arp_hardware_types
    <b4a>   DW_AT_decl_file   : 18
    <b4b>   DW_AT_decl_line   : 410
    <b4d>   DW_AT_decl_column : 26
    <b4e>   DW_AT_type        : <0xb31>
    <b52>   DW_AT_external    : 1
    <b53>   DW_AT_declaration : 1
 <1><b54>: Abbrev Number: 11 (DW_TAG_variable)
    <b55>   DW_AT_name        : (indirect string, offset: 0xfea): at_flags
    <b59>   DW_AT_decl_file   : 18
    <b5a>   DW_AT_decl_line   : 411
    <b5c>   DW_AT_decl_column : 26
    <b5d>   DW_AT_type        : <0xb31>
    <b61>   DW_AT_external    : 1
    <b62>   DW_AT_declaration : 1
 <1><b63>: Abbrev Number: 11 (DW_TAG_variable)
    <b64>   DW_AT_name        : (indirect string, offset: 0x480): clocknames
    <b68>   DW_AT_decl_file   : 18
    <b69>   DW_AT_decl_line   : 412
    <b6b>   DW_AT_decl_column : 26
    <b6c>   DW_AT_type        : <0xb31>
    <b70>   DW_AT_external    : 1
    <b71>   DW_AT_declaration : 1
 <1><b72>: Abbrev Number: 11 (DW_TAG_variable)
    <b73>   DW_AT_name        : (indirect string, offset: 0xfaa): dirent_types
    <b77>   DW_AT_decl_file   : 18
    <b78>   DW_AT_decl_line   : 413
    <b7a>   DW_AT_decl_column : 26
    <b7b>   DW_AT_type        : <0xb31>
    <b7f>   DW_AT_external    : 1
    <b80>   DW_AT_declaration : 1
 <1><b81>: Abbrev Number: 11 (DW_TAG_variable)
    <b82>   DW_AT_name        : (indirect string, offset: 0x8ba): ethernet_protocols
    <b86>   DW_AT_decl_file   : 18
    <b87>   DW_AT_decl_line   : 414
    <b89>   DW_AT_decl_column : 26
    <b8a>   DW_AT_type        : <0xb31>
    <b8e>   DW_AT_external    : 1
    <b8f>   DW_AT_declaration : 1
 <1><b90>: Abbrev Number: 11 (DW_TAG_variable)
    <b91>   DW_AT_name        : (indirect string, offset: 0x5ab): inet_protocols
    <b95>   DW_AT_decl_file   : 18
    <b96>   DW_AT_decl_line   : 415
    <b98>   DW_AT_decl_column : 26
    <b99>   DW_AT_type        : <0xb31>
    <b9d>   DW_AT_external    : 1
    <b9e>   DW_AT_declaration : 1
 <1><b9f>: Abbrev Number: 11 (DW_TAG_variable)
    <ba0>   DW_AT_name        : (indirect string, offset: 0x2bb): evdev_abs
    <ba4>   DW_AT_decl_file   : 18
    <ba5>   DW_AT_decl_line   : 416
    <ba7>   DW_AT_decl_column : 26
    <ba8>   DW_AT_type        : <0xb31>
    <bac>   DW_AT_external    : 1
    <bad>   DW_AT_declaration : 1
 <1><bae>: Abbrev Number: 11 (DW_TAG_variable)
    <baf>   DW_AT_name        : (indirect string, offset: 0x70a): audit_arch
    <bb3>   DW_AT_decl_file   : 18
    <bb4>   DW_AT_decl_line   : 417
    <bb6>   DW_AT_decl_column : 26
    <bb7>   DW_AT_type        : <0xb31>
    <bbb>   DW_AT_external    : 1
    <bbc>   DW_AT_declaration : 1
 <1><bbd>: Abbrev Number: 11 (DW_TAG_variable)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x9e): evdev_ev
    <bc2>   DW_AT_decl_file   : 18
    <bc3>   DW_AT_decl_line   : 418
    <bc5>   DW_AT_decl_column : 26
    <bc6>   DW_AT_type        : <0xb31>
    <bca>   DW_AT_external    : 1
    <bcb>   DW_AT_declaration : 1
 <1><bcc>: Abbrev Number: 11 (DW_TAG_variable)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x461): iffflags
    <bd1>   DW_AT_decl_file   : 18
    <bd2>   DW_AT_decl_line   : 419
    <bd4>   DW_AT_decl_column : 26
    <bd5>   DW_AT_type        : <0xb31>
    <bd9>   DW_AT_external    : 1
    <bda>   DW_AT_declaration : 1
 <1><bdb>: Abbrev Number: 11 (DW_TAG_variable)
    <bdc>   DW_AT_name        : (indirect string, offset: 0xbe1): ip_type_of_services
    <be0>   DW_AT_decl_file   : 18
    <be1>   DW_AT_decl_line   : 420
    <be3>   DW_AT_decl_column : 26
    <be4>   DW_AT_type        : <0xb31>
    <be8>   DW_AT_external    : 1
    <be9>   DW_AT_declaration : 1
 <1><bea>: Abbrev Number: 11 (DW_TAG_variable)
    <beb>   DW_AT_name        : (indirect string, offset: 0x69d): ipc_private
    <bef>   DW_AT_decl_file   : 18
    <bf0>   DW_AT_decl_line   : 421
    <bf2>   DW_AT_decl_column : 26
    <bf3>   DW_AT_type        : <0xb31>
    <bf7>   DW_AT_external    : 1
    <bf8>   DW_AT_declaration : 1
 <1><bf9>: Abbrev Number: 11 (DW_TAG_variable)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x312): msg_flags
    <bfe>   DW_AT_decl_file   : 18
    <bff>   DW_AT_decl_line   : 422
    <c01>   DW_AT_decl_column : 26
    <c02>   DW_AT_type        : <0xb31>
    <c06>   DW_AT_external    : 1
    <c07>   DW_AT_declaration : 1
 <1><c08>: Abbrev Number: 11 (DW_TAG_variable)
    <c09>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c0d>   DW_AT_decl_file   : 18
    <c0e>   DW_AT_decl_line   : 423
    <c10>   DW_AT_decl_column : 26
    <c11>   DW_AT_type        : <0xb31>
    <c15>   DW_AT_external    : 1
    <c16>   DW_AT_declaration : 1
 <1><c17>: Abbrev Number: 11 (DW_TAG_variable)
    <c18>   DW_AT_name        : (indirect string, offset: 0xf0d): nl_bridge_vlan_flags
    <c1c>   DW_AT_decl_file   : 18
    <c1d>   DW_AT_decl_line   : 424
    <c1f>   DW_AT_decl_column : 26
    <c20>   DW_AT_type        : <0xb31>
    <c24>   DW_AT_external    : 1
    <c25>   DW_AT_declaration : 1
 <1><c26>: Abbrev Number: 11 (DW_TAG_variable)
    <c27>   DW_AT_name        : (indirect string, offset: 0xd9b): nl_netfilter_msg_types
    <c2b>   DW_AT_decl_file   : 18
    <c2c>   DW_AT_decl_line   : 425
    <c2e>   DW_AT_decl_column : 26
    <c2f>   DW_AT_type        : <0xb31>
    <c33>   DW_AT_external    : 1
    <c34>   DW_AT_declaration : 1
 <1><c35>: Abbrev Number: 11 (DW_TAG_variable)
    <c36>   DW_AT_name        : (indirect string, offset: 0x443): nl_route_types
    <c3a>   DW_AT_decl_file   : 18
    <c3b>   DW_AT_decl_line   : 426
    <c3d>   DW_AT_decl_column : 26
    <c3e>   DW_AT_type        : <0xb31>
    <c42>   DW_AT_external    : 1
    <c43>   DW_AT_declaration : 1
 <1><c44>: Abbrev Number: 11 (DW_TAG_variable)
    <c45>   DW_AT_name        : (indirect string, offset: 0xe5a): open_access_modes
    <c49>   DW_AT_decl_file   : 18
    <c4a>   DW_AT_decl_line   : 427
    <c4c>   DW_AT_decl_column : 26
    <c4d>   DW_AT_type        : <0xb31>
    <c51>   DW_AT_external    : 1
    <c52>   DW_AT_declaration : 1
 <1><c53>: Abbrev Number: 11 (DW_TAG_variable)
    <c54>   DW_AT_name        : (indirect string, offset: 0x8e): open_mode_flags
    <c58>   DW_AT_decl_file   : 18
    <c59>   DW_AT_decl_line   : 428
    <c5b>   DW_AT_decl_column : 26
    <c5c>   DW_AT_type        : <0xb31>
    <c60>   DW_AT_external    : 1
    <c61>   DW_AT_declaration : 1
 <1><c62>: Abbrev Number: 11 (DW_TAG_variable)
    <c63>   DW_AT_name        : (indirect string, offset: 0xc12): perf_type_id
    <c67>   DW_AT_decl_file   : 18
    <c68>   DW_AT_decl_line   : 429
    <c6a>   DW_AT_decl_column : 26
    <c6b>   DW_AT_type        : <0xb31>
    <c6f>   DW_AT_external    : 1
    <c70>   DW_AT_declaration : 1
 <1><c71>: Abbrev Number: 11 (DW_TAG_variable)
    <c72>   DW_AT_name        : (indirect string, offset: 0xe2c): pollflags
    <c76>   DW_AT_decl_file   : 18
    <c77>   DW_AT_decl_line   : 430
    <c79>   DW_AT_decl_column : 26
    <c7a>   DW_AT_type        : <0xb31>
    <c7e>   DW_AT_external    : 1
    <c7f>   DW_AT_declaration : 1
 <1><c80>: Abbrev Number: 11 (DW_TAG_variable)
    <c81>   DW_AT_name        : (indirect string, offset: 0x54c): ptrace_cmds
    <c85>   DW_AT_decl_file   : 18
    <c86>   DW_AT_decl_line   : 431
    <c88>   DW_AT_decl_column : 26
    <c89>   DW_AT_type        : <0xb31>
    <c8d>   DW_AT_external    : 1
    <c8e>   DW_AT_declaration : 1
 <1><c8f>: Abbrev Number: 11 (DW_TAG_variable)
    <c90>   DW_AT_name        : (indirect string, offset: 0x7fc): resource_flags
    <c94>   DW_AT_decl_file   : 18
    <c95>   DW_AT_decl_line   : 432
    <c97>   DW_AT_decl_column : 26
    <c98>   DW_AT_type        : <0xb31>
    <c9c>   DW_AT_external    : 1
    <c9d>   DW_AT_declaration : 1
 <1><c9e>: Abbrev Number: 11 (DW_TAG_variable)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x291): route_nexthop_flags
    <ca3>   DW_AT_decl_file   : 18
    <ca4>   DW_AT_decl_line   : 433
    <ca6>   DW_AT_decl_column : 26
    <ca7>   DW_AT_type        : <0xb31>
    <cab>   DW_AT_external    : 1
    <cac>   DW_AT_declaration : 1
 <1><cad>: Abbrev Number: 11 (DW_TAG_variable)
    <cae>   DW_AT_name        : (indirect string, offset: 0xe98): routing_protocols
    <cb2>   DW_AT_decl_file   : 18
    <cb3>   DW_AT_decl_line   : 434
    <cb5>   DW_AT_decl_column : 26
    <cb6>   DW_AT_type        : <0xb31>
    <cba>   DW_AT_external    : 1
    <cbb>   DW_AT_declaration : 1
 <1><cbc>: Abbrev Number: 11 (DW_TAG_variable)
    <cbd>   DW_AT_name        : (indirect string, offset: 0x452): routing_scopes
    <cc1>   DW_AT_decl_file   : 18
    <cc2>   DW_AT_decl_line   : 435
    <cc4>   DW_AT_decl_column : 26
    <cc5>   DW_AT_type        : <0xb31>
    <cc9>   DW_AT_external    : 1
    <cca>   DW_AT_declaration : 1
 <1><ccb>: Abbrev Number: 11 (DW_TAG_variable)
    <ccc>   DW_AT_name        : (indirect string, offset: 0xd89): routing_table_ids
    <cd0>   DW_AT_decl_file   : 18
    <cd1>   DW_AT_decl_line   : 436
    <cd3>   DW_AT_decl_column : 26
    <cd4>   DW_AT_type        : <0xb31>
    <cd8>   DW_AT_external    : 1
    <cd9>   DW_AT_declaration : 1
 <1><cda>: Abbrev Number: 11 (DW_TAG_variable)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x67a): routing_types
    <cdf>   DW_AT_decl_file   : 18
    <ce0>   DW_AT_decl_line   : 437
    <ce2>   DW_AT_decl_column : 26
    <ce3>   DW_AT_type        : <0xb31>
    <ce7>   DW_AT_external    : 1
    <ce8>   DW_AT_declaration : 1
 <1><ce9>: Abbrev Number: 11 (DW_TAG_variable)
    <cea>   DW_AT_name        : (indirect string, offset: 0x1be): rwf_flags
    <cee>   DW_AT_decl_file   : 18
    <cef>   DW_AT_decl_line   : 438
    <cf1>   DW_AT_decl_column : 26
    <cf2>   DW_AT_type        : <0xb31>
    <cf6>   DW_AT_external    : 1
    <cf7>   DW_AT_declaration : 1
 <1><cf8>: Abbrev Number: 11 (DW_TAG_variable)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x834): seccomp_filter_flags
    <cfd>   DW_AT_decl_file   : 18
    <cfe>   DW_AT_decl_line   : 439
    <d00>   DW_AT_decl_column : 26
    <d01>   DW_AT_type        : <0xb31>
    <d05>   DW_AT_external    : 1
    <d06>   DW_AT_declaration : 1
 <1><d07>: Abbrev Number: 11 (DW_TAG_variable)
    <d08>   DW_AT_name        : (indirect string, offset: 0x2d8): seccomp_ret_action
    <d0c>   DW_AT_decl_file   : 18
    <d0d>   DW_AT_decl_line   : 440
    <d0f>   DW_AT_decl_column : 26
    <d10>   DW_AT_type        : <0xb31>
    <d14>   DW_AT_external    : 1
    <d15>   DW_AT_declaration : 1
 <1><d16>: Abbrev Number: 11 (DW_TAG_variable)
    <d17>   DW_AT_name        : (indirect string, offset: 0x41e): setns_types
    <d1b>   DW_AT_decl_file   : 18
    <d1c>   DW_AT_decl_line   : 441
    <d1e>   DW_AT_decl_column : 26
    <d1f>   DW_AT_type        : <0xb31>
    <d23>   DW_AT_external    : 1
    <d24>   DW_AT_declaration : 1
 <1><d25>: Abbrev Number: 11 (DW_TAG_variable)
    <d26>   DW_AT_name        : (indirect string, offset: 0xe18): sg_io_info
    <d2a>   DW_AT_decl_file   : 18
    <d2b>   DW_AT_decl_line   : 442
    <d2d>   DW_AT_decl_column : 26
    <d2e>   DW_AT_type        : <0xb31>
    <d32>   DW_AT_external    : 1
    <d33>   DW_AT_declaration : 1
 <1><d34>: Abbrev Number: 11 (DW_TAG_variable)
    <d35>   DW_AT_name        : (indirect string, offset: 0xb87): socketlayers
    <d39>   DW_AT_decl_file   : 18
    <d3a>   DW_AT_decl_line   : 443
    <d3c>   DW_AT_decl_column : 26
    <d3d>   DW_AT_type        : <0xb31>
    <d41>   DW_AT_external    : 1
    <d42>   DW_AT_declaration : 1
 <1><d43>: Abbrev Number: 11 (DW_TAG_variable)
    <d44>   DW_AT_name        : (indirect string, offset: 0xd59): socktypes
    <d48>   DW_AT_decl_file   : 18
    <d49>   DW_AT_decl_line   : 444
    <d4b>   DW_AT_decl_column : 26
    <d4c>   DW_AT_type        : <0xb31>
    <d50>   DW_AT_external    : 1
    <d51>   DW_AT_declaration : 1
 <1><d52>: Abbrev Number: 11 (DW_TAG_variable)
    <d53>   DW_AT_name        : (indirect string, offset: 0xa61): tcp_state_flags
    <d57>   DW_AT_decl_file   : 18
    <d58>   DW_AT_decl_line   : 445
    <d5a>   DW_AT_decl_column : 26
    <d5b>   DW_AT_type        : <0xb31>
    <d5f>   DW_AT_external    : 1
    <d60>   DW_AT_declaration : 1
 <1><d61>: Abbrev Number: 11 (DW_TAG_variable)
    <d62>   DW_AT_name        : (indirect string, offset: 0x73f): tcp_states
    <d66>   DW_AT_decl_file   : 18
    <d67>   DW_AT_decl_line   : 446
    <d69>   DW_AT_decl_column : 26
    <d6a>   DW_AT_type        : <0xb31>
    <d6e>   DW_AT_external    : 1
    <d6f>   DW_AT_declaration : 1
 <1><d70>: Abbrev Number: 11 (DW_TAG_variable)
    <d71>   DW_AT_name        : (indirect string, offset: 0x1050): whence_codes
    <d75>   DW_AT_decl_file   : 18
    <d76>   DW_AT_decl_line   : 447
    <d78>   DW_AT_decl_column : 26
    <d79>   DW_AT_type        : <0xb31>
    <d7d>   DW_AT_external    : 1
    <d7e>   DW_AT_declaration : 1
 <1><d7f>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d80>   DW_AT_encoding    : 7	(unsigned)
    <d81>   DW_AT_byte_size   : 4
    <d82>   DW_AT_type        : <0x2b>
    <d86>   DW_AT_decl_file   : 18
    <d87>   DW_AT_decl_line   : 508
    <d89>   DW_AT_decl_column : 14
    <d8a>   DW_AT_sibling     : <0xda1>
 <2><d8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x990): CFLAG_NONE
    <d93>   DW_AT_const_value : 0
 <2><d94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d95>   DW_AT_name        : (indirect string, offset: 0x8cd): CFLAG_ONLY_STATS
    <d99>   DW_AT_const_value : 1
 <2><d9a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xb94): CFLAG_BOTH
    <d9f>   DW_AT_const_value : 2
 <2><da0>: Abbrev Number: 0
 <1><da1>: Abbrev Number: 10 (DW_TAG_typedef)
    <da2>   DW_AT_name        : (indirect string, offset: 0x10f2): cflag_t
    <da6>   DW_AT_decl_file   : 18
    <da7>   DW_AT_decl_line   : 512
    <da9>   DW_AT_decl_column : 3
    <daa>   DW_AT_type        : <0xd7f>
 <1><dae>: Abbrev Number: 11 (DW_TAG_variable)
    <daf>   DW_AT_name        : (indirect string, offset: 0xcac): cflag
    <db3>   DW_AT_decl_file   : 18
    <db4>   DW_AT_decl_line   : 513
    <db6>   DW_AT_decl_column : 16
    <db7>   DW_AT_type        : <0xda1>
    <dbb>   DW_AT_external    : 1
    <dbc>   DW_AT_declaration : 1
 <1><dbd>: Abbrev Number: 11 (DW_TAG_variable)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dc2>   DW_AT_decl_file   : 18
    <dc3>   DW_AT_decl_line   : 514
    <dc5>   DW_AT_decl_column : 13
    <dc6>   DW_AT_type        : <0x52e>
    <dca>   DW_AT_external    : 1
    <dcb>   DW_AT_declaration : 1
 <1><dcc>: Abbrev Number: 11 (DW_TAG_variable)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x7af): Tflag_scale
    <dd1>   DW_AT_decl_file   : 18
    <dd2>   DW_AT_decl_line   : 515
    <dd4>   DW_AT_decl_column : 12
    <dd5>   DW_AT_type        : <0x64>
    <dd9>   DW_AT_external    : 1
    <dda>   DW_AT_declaration : 1
 <1><ddb>: Abbrev Number: 11 (DW_TAG_variable)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x849): Tflag_width
    <de0>   DW_AT_decl_file   : 18
    <de1>   DW_AT_decl_line   : 516
    <de3>   DW_AT_decl_column : 12
    <de4>   DW_AT_type        : <0x64>
    <de8>   DW_AT_external    : 1
    <de9>   DW_AT_declaration : 1
 <1><dea>: Abbrev Number: 11 (DW_TAG_variable)
    <deb>   DW_AT_name        : (indirect string, offset: 0xe0a): iflag
    <def>   DW_AT_decl_file   : 18
    <df0>   DW_AT_decl_line   : 517
    <df2>   DW_AT_decl_column : 13
    <df3>   DW_AT_type        : <0x52e>
    <df7>   DW_AT_external    : 1
    <df8>   DW_AT_declaration : 1
 <1><df9>: Abbrev Number: 11 (DW_TAG_variable)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x58c): count_wallclock
    <dfe>   DW_AT_decl_file   : 18
    <dff>   DW_AT_decl_line   : 518
    <e01>   DW_AT_decl_column : 13
    <e02>   DW_AT_type        : <0x52e>
    <e06>   DW_AT_external    : 1
    <e07>   DW_AT_declaration : 1
 <1><e08>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e09>   DW_AT_name        : (indirect string, offset: 0x53): path_set_item
    <e0d>   DW_AT_byte_size   : 4
    <e0e>   DW_AT_decl_file   : 18
    <e0f>   DW_AT_decl_line   : 520
    <e11>   DW_AT_decl_column : 8
    <e12>   DW_AT_sibling     : <0xe27>
 <2><e16>: Abbrev Number: 23 (DW_TAG_member)
    <e17>   DW_AT_name        : (indirect string, offset: 0xcc): path
    <e1b>   DW_AT_decl_file   : 18
    <e1c>   DW_AT_decl_line   : 521
    <e1e>   DW_AT_decl_column : 14
    <e1f>   DW_AT_type        : <0x1e2>
    <e23>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e26>: Abbrev Number: 0
 <1><e27>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e28>   DW_AT_name        : (indirect string, offset: 0x74a): path_set
    <e2c>   DW_AT_byte_size   : 12
    <e2d>   DW_AT_decl_file   : 18
    <e2e>   DW_AT_decl_line   : 525
    <e30>   DW_AT_decl_column : 15
    <e31>   DW_AT_sibling     : <0xe66>
 <2><e35>: Abbrev Number: 23 (DW_TAG_member)
    <e36>   DW_AT_name        : (indirect string, offset: 0x6d8): paths_selected
    <e3a>   DW_AT_decl_file   : 18
    <e3b>   DW_AT_decl_line   : 526
    <e3d>   DW_AT_decl_column : 24
    <e3e>   DW_AT_type        : <0xe66>
    <e42>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e45>: Abbrev Number: 23 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x1043): num_selected
    <e4a>   DW_AT_decl_file   : 18
    <e4b>   DW_AT_decl_line   : 527
    <e4d>   DW_AT_decl_column : 9
    <e4e>   DW_AT_type        : <0x12e>
    <e52>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e55>: Abbrev Number: 23 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0xb44): size
    <e5a>   DW_AT_decl_file   : 18
    <e5b>   DW_AT_decl_line   : 528
    <e5d>   DW_AT_decl_column : 9
    <e5e>   DW_AT_type        : <0x12e>
    <e62>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e65>: Abbrev Number: 0
 <1><e66>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e67>   DW_AT_byte_size   : 4
    <e68>   DW_AT_type        : <0xe08>
 <1><e6c>: Abbrev Number: 11 (DW_TAG_variable)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x1092): global_path_set
    <e71>   DW_AT_decl_file   : 18
    <e72>   DW_AT_decl_line   : 529
    <e74>   DW_AT_decl_column : 3
    <e75>   DW_AT_type        : <0xe27>
    <e79>   DW_AT_external    : 1
    <e7a>   DW_AT_declaration : 1
 <1><e7b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xf85): xflag_opts
    <e80>   DW_AT_encoding    : 7	(unsigned)
    <e81>   DW_AT_byte_size   : 4
    <e82>   DW_AT_type        : <0x2b>
    <e86>   DW_AT_decl_file   : 18
    <e87>   DW_AT_decl_line   : 531
    <e89>   DW_AT_decl_column : 6
    <e8a>   DW_AT_sibling     : <0xead>
 <2><e8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0xa18): HEXSTR_NONE
    <e93>   DW_AT_const_value : 0
 <2><e94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0xfcc): HEXSTR_NON_ASCII
    <e99>   DW_AT_const_value : 1
 <2><e9a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x911): HEXSTR_ALL
    <e9f>   DW_AT_const_value : 2
 <2><ea0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x663): HEXSTR_NON_ASCII_CHARS
    <ea5>   DW_AT_const_value : 3
 <2><ea6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x105d): NUM_HEXSTR_OPTS
    <eab>   DW_AT_const_value : 4
 <2><eac>: Abbrev Number: 0
 <1><ead>: Abbrev Number: 11 (DW_TAG_variable)
    <eae>   DW_AT_name        : (indirect string, offset: 0xde4): xflag
    <eb2>   DW_AT_decl_file   : 18
    <eb3>   DW_AT_decl_line   : 544
    <eb5>   DW_AT_decl_column : 17
    <eb6>   DW_AT_type        : <0x2b>
    <eba>   DW_AT_external    : 1
    <ebb>   DW_AT_declaration : 1
 <1><ebc>: Abbrev Number: 11 (DW_TAG_variable)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xc67): followfork
    <ec1>   DW_AT_decl_file   : 18
    <ec2>   DW_AT_decl_line   : 545
    <ec4>   DW_AT_decl_column : 13
    <ec5>   DW_AT_type        : <0x52e>
    <ec9>   DW_AT_external    : 1
    <eca>   DW_AT_declaration : 1
 <1><ecb>: Abbrev Number: 11 (DW_TAG_variable)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x326): output_separately
    <ed0>   DW_AT_decl_file   : 18
    <ed1>   DW_AT_decl_line   : 546
    <ed3>   DW_AT_decl_column : 13
    <ed4>   DW_AT_type        : <0x52e>
    <ed8>   DW_AT_external    : 1
    <ed9>   DW_AT_declaration : 1
 <1><eda>: Abbrev Number: 11 (DW_TAG_variable)
    <edb>   DW_AT_name        : (indirect string, offset: 0x225): stack_trace_enabled
    <edf>   DW_AT_decl_file   : 18
    <ee0>   DW_AT_decl_line   : 549
    <ee2>   DW_AT_decl_column : 13
    <ee3>   DW_AT_type        : <0x52e>
    <ee7>   DW_AT_external    : 1
    <ee8>   DW_AT_declaration : 1
 <1><ee9>: Abbrev Number: 11 (DW_TAG_variable)
    <eea>   DW_AT_name        : (indirect string, offset: 0x651): ptrace_setoptions
    <eee>   DW_AT_decl_file   : 18
    <eef>   DW_AT_decl_line   : 553
    <ef1>   DW_AT_decl_column : 17
    <ef2>   DW_AT_type        : <0x2b>
    <ef6>   DW_AT_external    : 1
    <ef7>   DW_AT_declaration : 1
 <1><ef8>: Abbrev Number: 11 (DW_TAG_variable)
    <ef9>   DW_AT_name        : (indirect string, offset: 0xa0d): max_strlen
    <efd>   DW_AT_decl_file   : 18
    <efe>   DW_AT_decl_line   : 554
    <f00>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0x2b>
    <f05>   DW_AT_external    : 1
    <f06>   DW_AT_declaration : 1
 <1><f07>: Abbrev Number: 11 (DW_TAG_variable)
    <f08>   DW_AT_name        : (indirect string, offset: 0xa3b): os_release
    <f0c>   DW_AT_decl_file   : 18
    <f0d>   DW_AT_decl_line   : 555
    <f0f>   DW_AT_decl_column : 17
    <f10>   DW_AT_type        : <0x2b>
    <f14>   DW_AT_external    : 1
    <f15>   DW_AT_declaration : 1
 <1><f16>: Abbrev Number: 11 (DW_TAG_variable)
    <f17>   DW_AT_name        : (indirect string, offset: 0x6e7): xlat_verbosity
    <f1b>   DW_AT_decl_file   : 18
    <f1c>   DW_AT_decl_line   : 917
    <f1e>   DW_AT_decl_column : 24
    <f1f>   DW_AT_type        : <0xa54>
    <f23>   DW_AT_external    : 1
    <f24>   DW_AT_declaration : 1
 <1><f25>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f26>   DW_AT_name        : (indirect string, offset: 0x56f): xlat_style_private_flag_bits
    <f2a>   DW_AT_encoding    : 7	(unsigned)
    <f2b>   DW_AT_byte_size   : 4
    <f2c>   DW_AT_type        : <0x2b>
    <f30>   DW_AT_decl_file   : 18
    <f31>   DW_AT_decl_line   : 937
    <f33>   DW_AT_decl_column : 6
    <f34>   DW_AT_sibling     : <0xf51>
 <2><f38>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0x2a5): PAF_PRINT_INDICES_BIT
    <f3d>   DW_AT_const_value : 5
 <2><f3e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f3f>   DW_AT_name        : (indirect string, offset: 0xafb): PAF_ARRAY_TRUNCATED_BIT
    <f43>   DW_AT_const_value : 6
 <2><f44>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0x3de): PXF_DEFAULT_STR_BIT
    <f49>   DW_AT_const_value : 7
 <2><f4a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xc49): SPFF_AUXSTR_MODE_BIT
    <f4f>   DW_AT_const_value : 8
 <2><f50>: Abbrev Number: 0
 <1><f51>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f52>   DW_AT_name        : (indirect string, offset: 0xcf8): find_xlat_flag_bits
    <f56>   DW_AT_encoding    : 7	(unsigned)
    <f57>   DW_AT_byte_size   : 4
    <f58>   DW_AT_type        : <0x2b>
    <f5c>   DW_AT_decl_file   : 18
    <f5d>   DW_AT_decl_line   : 1441
    <f5f>   DW_AT_decl_column : 6
    <f60>   DW_AT_sibling     : <0xf6b>
 <2><f64>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f65>   DW_AT_name        : (indirect string, offset: 0x94e): FXL_CASE_SENSITIVE_BIT
    <f69>   DW_AT_const_value : 0
 <2><f6a>: Abbrev Number: 0
 <1><f6b>: Abbrev Number: 11 (DW_TAG_variable)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x9db): printing_tcp
    <f70>   DW_AT_decl_file   : 18
    <f71>   DW_AT_decl_line   : 1687
    <f73>   DW_AT_decl_column : 20
    <f74>   DW_AT_type        : <0x60a>
    <f78>   DW_AT_external    : 1
    <f79>   DW_AT_declaration : 1
 <1><f7a>: Abbrev Number: 11 (DW_TAG_variable)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x537): errnoent
    <f7f>   DW_AT_decl_file   : 18
    <f80>   DW_AT_decl_line   : 1885
    <f82>   DW_AT_decl_column : 26
    <f83>   DW_AT_type        : <0x462>
    <f87>   DW_AT_external    : 1
    <f88>   DW_AT_declaration : 1
 <1><f89>: Abbrev Number: 11 (DW_TAG_variable)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x855): signalent
    <f8e>   DW_AT_decl_file   : 18
    <f8f>   DW_AT_decl_line   : 1886
    <f91>   DW_AT_decl_column : 26
    <f92>   DW_AT_type        : <0x462>
    <f96>   DW_AT_external    : 1
    <f97>   DW_AT_declaration : 1
 <1><f98>: Abbrev Number: 11 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0xe52): nerrnos
    <f9d>   DW_AT_decl_file   : 18
    <f9e>   DW_AT_decl_line   : 1887
    <fa0>   DW_AT_decl_column : 27
    <fa1>   DW_AT_type        : <0x32>
    <fa5>   DW_AT_external    : 1
    <fa6>   DW_AT_declaration : 1
 <1><fa7>: Abbrev Number: 11 (DW_TAG_variable)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x102c): nsignals
    <fac>   DW_AT_decl_file   : 18
    <fad>   DW_AT_decl_line   : 1888
    <faf>   DW_AT_decl_column : 27
    <fb0>   DW_AT_type        : <0x32>
    <fb4>   DW_AT_external    : 1
    <fb5>   DW_AT_declaration : 1
 <1><fb6>: Abbrev Number: 16 (DW_TAG_array_type)
    <fb7>   DW_AT_type        : <0x873>
    <fbb>   DW_AT_sibling     : <0xfc1>
 <2><fbf>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fc0>: Abbrev Number: 0
 <1><fc1>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc2>   DW_AT_type        : <0xfb6>
 <1><fc6>: Abbrev Number: 11 (DW_TAG_variable)
    <fc7>   DW_AT_name        : (indirect string, offset: 0xcc3): sysent0
    <fcb>   DW_AT_decl_file   : 18
    <fcc>   DW_AT_decl_line   : 1890
    <fce>   DW_AT_decl_column : 28
    <fcf>   DW_AT_type        : <0xfc1>
    <fd3>   DW_AT_external    : 1
    <fd4>   DW_AT_declaration : 1
 <1><fd5>: Abbrev Number: 16 (DW_TAG_array_type)
    <fd6>   DW_AT_type        : <0x8da>
    <fda>   DW_AT_sibling     : <0xfe0>
 <2><fde>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fdf>: Abbrev Number: 0
 <1><fe0>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe1>   DW_AT_type        : <0xfd5>
 <1><fe5>: Abbrev Number: 11 (DW_TAG_variable)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x1088): ioctlent0
    <fea>   DW_AT_decl_file   : 18
    <feb>   DW_AT_decl_line   : 1891
    <fed>   DW_AT_decl_column : 30
    <fee>   DW_AT_type        : <0xfe0>
    <ff2>   DW_AT_external    : 1
    <ff3>   DW_AT_declaration : 1
 <1><ff4>: Abbrev Number: 11 (DW_TAG_variable)
    <ff5>   DW_AT_name        : (indirect string, offset: 0xf90): personality_names
    <ff9>   DW_AT_decl_file   : 18
    <ffa>   DW_AT_decl_line   : 1893
    <ffc>   DW_AT_decl_column : 26
    <ffd>   DW_AT_type        : <0x462>
    <1001>   DW_AT_external    : 1
    <1002>   DW_AT_declaration : 1
 <1><1003>: Abbrev Number: 11 (DW_TAG_variable)
    <1004>   DW_AT_name        : (indirect string, offset: 0x875): sysent
    <1008>   DW_AT_decl_file   : 18
    <1009>   DW_AT_decl_line   : 1896
    <100b>   DW_AT_decl_column : 29
    <100c>   DW_AT_type        : <0x9bf>
    <1010>   DW_AT_external    : 1
    <1011>   DW_AT_declaration : 1
 <1><1012>: Abbrev Number: 11 (DW_TAG_variable)
    <1013>   DW_AT_name        : (indirect string, offset: 0xc5e): ioctlent
    <1017>   DW_AT_decl_file   : 18
    <1018>   DW_AT_decl_line   : 1897
    <101a>   DW_AT_decl_column : 31
    <101b>   DW_AT_type        : <0x1021>
    <101f>   DW_AT_external    : 1
    <1020>   DW_AT_declaration : 1
 <1><1021>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1022>   DW_AT_byte_size   : 4
    <1023>   DW_AT_type        : <0x8da>
 <1><1027>: Abbrev Number: 11 (DW_TAG_variable)
    <1028>   DW_AT_name        : (indirect string, offset: 0x85f): nsyscalls
    <102c>   DW_AT_decl_file   : 18
    <102d>   DW_AT_decl_line   : 1903
    <102f>   DW_AT_decl_column : 17
    <1030>   DW_AT_type        : <0x2b>
    <1034>   DW_AT_external    : 1
    <1035>   DW_AT_declaration : 1
 <1><1036>: Abbrev Number: 11 (DW_TAG_variable)
    <1037>   DW_AT_name        : (indirect string, offset: 0xe78): nioctlents
    <103b>   DW_AT_decl_file   : 18
    <103c>   DW_AT_decl_line   : 1904
    <103e>   DW_AT_decl_column : 17
    <103f>   DW_AT_type        : <0x2b>
    <1043>   DW_AT_external    : 1
    <1044>   DW_AT_declaration : 1
 <1><1045>: Abbrev Number: 16 (DW_TAG_array_type)
    <1046>   DW_AT_type        : <0x32>
    <104a>   DW_AT_sibling     : <0x1055>
 <2><104e>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <104f>   DW_AT_type        : <0x2b>
    <1053>   DW_AT_upper_bound : 2
 <2><1054>: Abbrev Number: 0
 <1><1055>: Abbrev Number: 3 (DW_TAG_const_type)
    <1056>   DW_AT_type        : <0x1045>
 <1><105a>: Abbrev Number: 11 (DW_TAG_variable)
    <105b>   DW_AT_name        : (indirect string, offset: 0xeed): nsyscall_vec
    <105f>   DW_AT_decl_file   : 18
    <1060>   DW_AT_decl_line   : 1906
    <1062>   DW_AT_decl_column : 27
    <1063>   DW_AT_type        : <0x1055>
    <1067>   DW_AT_external    : 1
    <1068>   DW_AT_declaration : 1
 <1><1069>: Abbrev Number: 16 (DW_TAG_array_type)
    <106a>   DW_AT_type        : <0x9c5>
    <106e>   DW_AT_sibling     : <0x1079>
 <2><1072>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1073>   DW_AT_type        : <0x2b>
    <1077>   DW_AT_upper_bound : 2
 <2><1078>: Abbrev Number: 0
 <1><1079>: Abbrev Number: 3 (DW_TAG_const_type)
    <107a>   DW_AT_type        : <0x1069>
 <1><107e>: Abbrev Number: 11 (DW_TAG_variable)
    <107f>   DW_AT_name        : (indirect string, offset: 0x782): sysent_vec
    <1083>   DW_AT_decl_file   : 18
    <1084>   DW_AT_decl_line   : 1907
    <1086>   DW_AT_decl_column : 35
    <1087>   DW_AT_type        : <0x1079>
    <108b>   DW_AT_external    : 1
    <108c>   DW_AT_declaration : 1
 <1><108d>: Abbrev Number: 11 (DW_TAG_variable)
    <108e>   DW_AT_name        : (indirect string, offset: 0x37f): inject_vec
    <1092>   DW_AT_decl_file   : 18
    <1093>   DW_AT_decl_line   : 1908
    <1095>   DW_AT_decl_column : 28
    <1096>   DW_AT_type        : <0x9ca>
    <109a>   DW_AT_external    : 1
    <109b>   DW_AT_declaration : 1
 <1><109c>: Abbrev Number: 29 (DW_TAG_structure_type)
    <109d>   DW_AT_name        : (indirect string, offset: 0xd4c): audit_arch_t
    <10a1>   DW_AT_byte_size   : 8
    <10a2>   DW_AT_decl_file   : 18
    <10a3>   DW_AT_decl_line   : 1910
    <10a5>   DW_AT_decl_column : 8
    <10a6>   DW_AT_sibling     : <0x10cb>
 <2><10aa>: Abbrev Number: 23 (DW_TAG_member)
    <10ab>   DW_AT_name        : (indirect string, offset: 0x561): arch
    <10af>   DW_AT_decl_file   : 18
    <10b0>   DW_AT_decl_line   : 1911
    <10b2>   DW_AT_decl_column : 15
    <10b3>   DW_AT_type        : <0x2b>
    <10b7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ba>: Abbrev Number: 23 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x9c1): flag
    <10bf>   DW_AT_decl_file   : 18
    <10c0>   DW_AT_decl_line   : 1912
    <10c2>   DW_AT_decl_column : 15
    <10c3>   DW_AT_type        : <0x2b>
    <10c7>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10ca>: Abbrev Number: 0
 <1><10cb>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cc>   DW_AT_type        : <0x109c>
 <1><10d0>: Abbrev Number: 16 (DW_TAG_array_type)
    <10d1>   DW_AT_type        : <0x10cb>
    <10d5>   DW_AT_sibling     : <0x10e0>
 <2><10d9>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <10da>   DW_AT_type        : <0x2b>
    <10de>   DW_AT_upper_bound : 2
 <2><10df>: Abbrev Number: 0
 <1><10e0>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e1>   DW_AT_type        : <0x10d0>
 <1><10e5>: Abbrev Number: 11 (DW_TAG_variable)
    <10e6>   DW_AT_name        : (indirect string, offset: 0x93f): audit_arch_vec
    <10ea>   DW_AT_decl_file   : 18
    <10eb>   DW_AT_decl_line   : 1915
    <10ed>   DW_AT_decl_column : 34
    <10ee>   DW_AT_type        : <0x10e0>
    <10f2>   DW_AT_external    : 1
    <10f3>   DW_AT_declaration : 1
 <1><10f4>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f5>   DW_AT_byte_size   : 180
    <10f6>   DW_AT_decl_file   : 20
    <10f7>   DW_AT_decl_line   : 2
    <10f8>   DW_AT_decl_column : 9
    <10f9>   DW_AT_sibling     : <0x13ae>
 <2><10fd>: Abbrev Number: 9 (DW_TAG_member)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x1d6): block_ioctl
    <1102>   DW_AT_decl_file   : 20
    <1103>   DW_AT_decl_line   : 3
    <1104>   DW_AT_decl_column : 8
    <1105>   DW_AT_type        : <0x13c8>
    <1109>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110c>: Abbrev Number: 9 (DW_TAG_member)
    <110d>   DW_AT_name        : (indirect string, offset: 0xa9a): btrfs_ioctl
    <1111>   DW_AT_decl_file   : 20
    <1112>   DW_AT_decl_line   : 6
    <1113>   DW_AT_decl_column : 8
    <1114>   DW_AT_type        : <0x13c8>
    <1118>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111b>: Abbrev Number: 9 (DW_TAG_member)
    <111c>   DW_AT_name        : (indirect string, offset: 0x720): evdev_write_ioctl_mpers
    <1120>   DW_AT_decl_file   : 20
    <1121>   DW_AT_decl_line   : 9
    <1122>   DW_AT_decl_column : 8
    <1123>   DW_AT_type        : <0x13c8>
    <1127>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><112a>: Abbrev Number: 9 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0x6f6): get_sock_fprog_size
    <112f>   DW_AT_decl_file   : 20
    <1130>   DW_AT_decl_line   : 12
    <1131>   DW_AT_decl_column : 17
    <1132>   DW_AT_type        : <0x13d4>
    <1136>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1139>: Abbrev Number: 9 (DW_TAG_member)
    <113a>   DW_AT_name        : (indirect string, offset: 0x1a5): fetch_bpf_fprog
    <113e>   DW_AT_decl_file   : 20
    <113f>   DW_AT_decl_line   : 15
    <1140>   DW_AT_decl_column : 10
    <1141>   DW_AT_type        : <0x13f4>
    <1145>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1148>: Abbrev Number: 9 (DW_TAG_member)
    <1149>   DW_AT_name        : (indirect string, offset: 0x92c): fetch_struct_flock
    <114d>   DW_AT_decl_file   : 20
    <114e>   DW_AT_decl_line   : 18
    <114f>   DW_AT_decl_column : 10
    <1150>   DW_AT_type        : <0x13f4>
    <1154>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1157>: Abbrev Number: 9 (DW_TAG_member)
