Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x16f5 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5c0): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x79b): mpers-m32/struct_msghdr.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa30): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3ac): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1003): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x982): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdf6): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x47b): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x882): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xedb): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8b2): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x76b): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb65): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb9b): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2cb): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xce7): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc5c): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3f8): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x444): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x52b): __socklen_t
    <f7>   DW_AT_decl_file   : 1
    <f8>   DW_AT_decl_line   : 209
    <f9>   DW_AT_decl_column : 23
    <fa>   DW_AT_type        : <0x2b>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x35b): uint8_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 24
    <105>   DW_AT_decl_column : 19
    <106>   DW_AT_type        : <0x45>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xb86): uint16_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 25
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x58>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xf83): uint32_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 26
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x70>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xe06): uint64_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 27
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x8f>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x32): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xb0e): timespec
    <144>   DW_AT_byte_size   : 8
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x10d9): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xc1>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe2c): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xd4>
    <167>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 12
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xad0): long double
 <1><172>: Abbrev Number: 2 (DW_TAG_base_type)
    <173>   DW_AT_byte_size   : 16
    <174>   DW_AT_encoding    : 4	(float)
    <175>   DW_AT_name        : (indirect string, offset: 0xfbe): _Float128
 <1><179>: Abbrev Number: 10 (DW_TAG_typedef)
    <17a>   DW_AT_name        : (indirect string, offset: 0x11): socklen_t
    <17e>   DW_AT_decl_file   : 5
    <17f>   DW_AT_decl_line   : 274
    <181>   DW_AT_decl_column : 21
    <182>   DW_AT_type        : <0xf2>
 <1><186>: Abbrev Number: 11 (DW_TAG_variable)
    <187>   DW_AT_name        : (indirect string, offset: 0x282): __environ
    <18b>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 543
    <18e>   DW_AT_decl_column : 15
    <18f>   DW_AT_type        : <0x195>
    <193>   DW_AT_external    : 1
    <194>   DW_AT_declaration : 1
 <1><195>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <196>   DW_AT_byte_size   : 4
    <197>   DW_AT_type        : <0xe0>
 <1><19b>: Abbrev Number: 11 (DW_TAG_variable)
    <19c>   DW_AT_name        : (indirect string, offset: 0x3a4): environ
    <1a0>   DW_AT_decl_file   : 5
    <1a1>   DW_AT_decl_line   : 545
    <1a3>   DW_AT_decl_column : 15
    <1a4>   DW_AT_type        : <0x195>
    <1a8>   DW_AT_external    : 1
    <1a9>   DW_AT_declaration : 1
 <1><1aa>: Abbrev Number: 12 (DW_TAG_variable)
    <1ab>   DW_AT_name        : (indirect string, offset: 0xfed): optarg
    <1af>   DW_AT_decl_file   : 6
    <1b0>   DW_AT_decl_line   : 36
    <1b1>   DW_AT_decl_column : 14
    <1b2>   DW_AT_type        : <0xe0>
    <1b6>   DW_AT_external    : 1
    <1b7>   DW_AT_declaration : 1
 <1><1b8>: Abbrev Number: 12 (DW_TAG_variable)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x73e): optind
    <1bd>   DW_AT_decl_file   : 6
    <1be>   DW_AT_decl_line   : 50
    <1bf>   DW_AT_decl_column : 12
    <1c0>   DW_AT_type        : <0x64>
    <1c4>   DW_AT_external    : 1
    <1c5>   DW_AT_declaration : 1
 <1><1c6>: Abbrev Number: 12 (DW_TAG_variable)
    <1c7>   DW_AT_name        : (indirect string, offset: 0xc4b): opterr
    <1cb>   DW_AT_decl_file   : 6
    <1cc>   DW_AT_decl_line   : 55
    <1cd>   DW_AT_decl_column : 12
    <1ce>   DW_AT_type        : <0x64>
    <1d2>   DW_AT_external    : 1
    <1d3>   DW_AT_declaration : 1
 <1><1d4>: Abbrev Number: 12 (DW_TAG_variable)
    <1d5>   DW_AT_name        : (indirect string, offset: 0xb4b): optopt
    <1d9>   DW_AT_decl_file   : 6
    <1da>   DW_AT_decl_line   : 59
    <1db>   DW_AT_decl_column : 12
    <1dc>   DW_AT_type        : <0x64>
    <1e0>   DW_AT_external    : 1
    <1e1>   DW_AT_declaration : 1
 <1><1e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e3>   DW_AT_byte_size   : 4
    <1e4>   DW_AT_type        : <0xed>
 <1><1e8>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e9>   DW_AT_type        : <0x1e2>
 <1><1ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ee>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x1f3>
 <1><1f3>: Abbrev Number: 13 (DW_TAG_const_type)
 <1><1f4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x363): _IO_FILE
    <1f9>   DW_AT_byte_size   : 148
    <1fa>   DW_AT_decl_file   : 7
    <1fb>   DW_AT_decl_line   : 49
    <1fc>   DW_AT_decl_column : 8
    <1fd>   DW_AT_sibling     : <0x3b5>
 <2><201>: Abbrev Number: 9 (DW_TAG_member)
    <202>   DW_AT_name        : (indirect string, offset: 0xa0c): _flags
    <206>   DW_AT_decl_file   : 7
    <207>   DW_AT_decl_line   : 51
    <208>   DW_AT_decl_column : 7
    <209>   DW_AT_type        : <0x64>
    <20d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><210>: Abbrev Number: 9 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0x4dd): _IO_read_ptr
    <215>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 54
    <217>   DW_AT_decl_column : 9
    <218>   DW_AT_type        : <0xe0>
    <21c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><21f>: Abbrev Number: 9 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0xf30): _IO_read_end
    <224>   DW_AT_decl_file   : 7
    <225>   DW_AT_decl_line   : 55
    <226>   DW_AT_decl_column : 9
    <227>   DW_AT_type        : <0xe0>
    <22b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><22e>: Abbrev Number: 9 (DW_TAG_member)
    <22f>   DW_AT_name        : (indirect string, offset: 0x7c1): _IO_read_base
    <233>   DW_AT_decl_file   : 7
    <234>   DW_AT_decl_line   : 56
    <235>   DW_AT_decl_column : 9
    <236>   DW_AT_type        : <0xe0>
    <23a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><23d>: Abbrev Number: 9 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_base
    <242>   DW_AT_decl_file   : 7
    <243>   DW_AT_decl_line   : 57
    <244>   DW_AT_decl_column : 9
    <245>   DW_AT_type        : <0xe0>
    <249>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><24c>: Abbrev Number: 9 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x1045): _IO_write_ptr
    <251>   DW_AT_decl_file   : 7
    <252>   DW_AT_decl_line   : 58
    <253>   DW_AT_decl_column : 9
    <254>   DW_AT_type        : <0xe0>
    <258>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25b>: Abbrev Number: 9 (DW_TAG_member)
    <25c>   DW_AT_name        : (indirect string, offset: 0x8fa): _IO_write_end
    <260>   DW_AT_decl_file   : 7
    <261>   DW_AT_decl_line   : 59
    <262>   DW_AT_decl_column : 9
    <263>   DW_AT_type        : <0xe0>
    <267>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><26a>: Abbrev Number: 9 (DW_TAG_member)
    <26b>   DW_AT_name        : (indirect string, offset: 0x96b): _IO_buf_base
    <26f>   DW_AT_decl_file   : 7
    <270>   DW_AT_decl_line   : 60
    <271>   DW_AT_decl_column : 9
    <272>   DW_AT_type        : <0xe0>
    <276>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><279>: Abbrev Number: 9 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0xd8e): _IO_buf_end
    <27e>   DW_AT_decl_file   : 7
    <27f>   DW_AT_decl_line   : 61
    <280>   DW_AT_decl_column : 9
    <281>   DW_AT_type        : <0xe0>
    <285>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><288>: Abbrev Number: 9 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0x1c8): _IO_save_base
    <28d>   DW_AT_decl_file   : 7
    <28e>   DW_AT_decl_line   : 64
    <28f>   DW_AT_decl_column : 9
    <290>   DW_AT_type        : <0xe0>
    <294>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><297>: Abbrev Number: 9 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xcae): _IO_backup_base
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 65
    <29e>   DW_AT_decl_column : 9
    <29f>   DW_AT_type        : <0xe0>
    <2a3>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2a6>: Abbrev Number: 9 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0xbf): _IO_save_end
    <2ab>   DW_AT_decl_file   : 7
    <2ac>   DW_AT_decl_line   : 66
    <2ad>   DW_AT_decl_column : 9
    <2ae>   DW_AT_type        : <0xe0>
    <2b2>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b5>: Abbrev Number: 9 (DW_TAG_member)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x56c): _markers
    <2ba>   DW_AT_decl_file   : 7
    <2bb>   DW_AT_decl_line   : 68
    <2bc>   DW_AT_decl_column : 22
    <2bd>   DW_AT_type        : <0x3cf>
    <2c1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c4>: Abbrev Number: 9 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x20b): _chain
    <2c9>   DW_AT_decl_file   : 7
    <2ca>   DW_AT_decl_line   : 70
    <2cb>   DW_AT_decl_column : 20
    <2cc>   DW_AT_type        : <0x3d5>
    <2d0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d3>: Abbrev Number: 9 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0xfa9): _fileno
    <2d8>   DW_AT_decl_file   : 7
    <2d9>   DW_AT_decl_line   : 72
    <2da>   DW_AT_decl_column : 7
    <2db>   DW_AT_type        : <0x64>
    <2df>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e2>: Abbrev Number: 9 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x793): _flags2
    <2e7>   DW_AT_decl_file   : 7
    <2e8>   DW_AT_decl_line   : 73
    <2e9>   DW_AT_decl_column : 7
    <2ea>   DW_AT_type        : <0x64>
    <2ee>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f1>: Abbrev Number: 9 (DW_TAG_member)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x82e): _old_offset
    <2f6>   DW_AT_decl_file   : 7
    <2f7>   DW_AT_decl_line   : 74
    <2f8>   DW_AT_decl_column : 11
    <2f9>   DW_AT_type        : <0xa2>
    <2fd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><300>: Abbrev Number: 9 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0x239): _cur_column
    <305>   DW_AT_decl_file   : 7
    <306>   DW_AT_decl_line   : 77
    <307>   DW_AT_decl_column : 18
    <308>   DW_AT_type        : <0x24>
    <30c>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><30f>: Abbrev Number: 9 (DW_TAG_member)
    <310>   DW_AT_name        : (indirect string, offset: 0xe52): _vtable_offset
    <314>   DW_AT_decl_file   : 7
    <315>   DW_AT_decl_line   : 78
    <316>   DW_AT_decl_column : 15
    <317>   DW_AT_type        : <0x3e>
    <31b>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><31e>: Abbrev Number: 9 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0xcbe): _shortbuf
    <323>   DW_AT_decl_file   : 7
    <324>   DW_AT_decl_line   : 79
    <325>   DW_AT_decl_column : 8
    <326>   DW_AT_type        : <0x3db>
    <32a>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><32d>: Abbrev Number: 9 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x178): _lock
    <332>   DW_AT_decl_file   : 7
    <333>   DW_AT_decl_line   : 81
    <334>   DW_AT_decl_column : 15
    <335>   DW_AT_type        : <0x3eb>
    <339>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><33c>: Abbrev Number: 9 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0x6d6): _offset
    <341>   DW_AT_decl_file   : 7
    <342>   DW_AT_decl_line   : 89
    <343>   DW_AT_decl_column : 13
    <344>   DW_AT_type        : <0xb5>
    <348>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><34b>: Abbrev Number: 9 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0xa62): _codecvt
    <350>   DW_AT_decl_file   : 7
    <351>   DW_AT_decl_line   : 91
    <352>   DW_AT_decl_column : 23
    <353>   DW_AT_type        : <0x3f7>
    <357>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><35a>: Abbrev Number: 9 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0xfd1): _wide_data
    <35f>   DW_AT_decl_file   : 7
    <360>   DW_AT_decl_line   : 92
    <361>   DW_AT_decl_column : 25
    <362>   DW_AT_type        : <0x403>
    <366>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><369>: Abbrev Number: 9 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0x3c8): _freeres_list
    <36e>   DW_AT_decl_file   : 7
    <36f>   DW_AT_decl_line   : 93
    <370>   DW_AT_decl_column : 20
    <371>   DW_AT_type        : <0x3d5>
    <375>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><378>: Abbrev Number: 9 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xc21): _freeres_buf
    <37d>   DW_AT_decl_file   : 7
    <37e>   DW_AT_decl_line   : 94
    <37f>   DW_AT_decl_column : 9
    <380>   DW_AT_type        : <0xcd>
    <384>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><387>: Abbrev Number: 9 (DW_TAG_member)
    <388>   DW_AT_name        : (indirect string, offset: 0x9c0): __pad5
    <38c>   DW_AT_decl_file   : 7
    <38d>   DW_AT_decl_line   : 95
    <38e>   DW_AT_decl_column : 10
    <38f>   DW_AT_type        : <0x12e>
    <393>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><396>: Abbrev Number: 9 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0x258): _mode
    <39b>   DW_AT_decl_file   : 7
    <39c>   DW_AT_decl_line   : 96
    <39d>   DW_AT_decl_column : 7
    <39e>   DW_AT_type        : <0x64>
    <3a2>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3a5>: Abbrev Number: 9 (DW_TAG_member)
    <3a6>   DW_AT_name        : (indirect string, offset: 0x7db): _unused2
    <3aa>   DW_AT_decl_file   : 7
    <3ab>   DW_AT_decl_line   : 98
    <3ac>   DW_AT_decl_column : 8
    <3ad>   DW_AT_type        : <0x409>
    <3b1>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3b4>: Abbrev Number: 0
 <1><3b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b6>   DW_AT_name        : (indirect string, offset: 0xaf0): FILE
    <3ba>   DW_AT_decl_file   : 8
    <3bb>   DW_AT_decl_line   : 7
    <3bc>   DW_AT_decl_column : 25
    <3bd>   DW_AT_type        : <0x1f4>
 <1><3c1>: Abbrev Number: 14 (DW_TAG_typedef)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x470): _IO_lock_t
    <3c6>   DW_AT_decl_file   : 7
    <3c7>   DW_AT_decl_line   : 43
    <3c8>   DW_AT_decl_column : 14
 <1><3c9>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x30d): _IO_marker
    <3ce>   DW_AT_declaration : 1
 <1><3cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d0>   DW_AT_byte_size   : 4
    <3d1>   DW_AT_type        : <0x3c9>
 <1><3d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d6>   DW_AT_byte_size   : 4
    <3d7>   DW_AT_type        : <0x1f4>
 <1><3db>: Abbrev Number: 16 (DW_TAG_array_type)
    <3dc>   DW_AT_type        : <0xe6>
    <3e0>   DW_AT_sibling     : <0x3eb>
 <2><3e4>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <3e5>   DW_AT_type        : <0x2b>
    <3e9>   DW_AT_upper_bound : 0
 <2><3ea>: Abbrev Number: 0
 <1><3eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3ec>   DW_AT_byte_size   : 4
    <3ed>   DW_AT_type        : <0x3c1>
 <1><3f1>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x82): _IO_codecvt
    <3f6>   DW_AT_declaration : 1
 <1><3f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f8>   DW_AT_byte_size   : 4
    <3f9>   DW_AT_type        : <0x3f1>
 <1><3fd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x377): _IO_wide_data
    <402>   DW_AT_declaration : 1
 <1><403>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <404>   DW_AT_byte_size   : 4
    <405>   DW_AT_type        : <0x3fd>
 <1><409>: Abbrev Number: 16 (DW_TAG_array_type)
    <40a>   DW_AT_type        : <0xe6>
    <40e>   DW_AT_sibling     : <0x419>
 <2><412>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <413>   DW_AT_type        : <0x2b>
    <417>   DW_AT_upper_bound : 39
 <2><418>: Abbrev Number: 0
 <1><419>: Abbrev Number: 12 (DW_TAG_variable)
    <41a>   DW_AT_name        : (indirect string, offset: 0x537): stdin
    <41e>   DW_AT_decl_file   : 9
    <41f>   DW_AT_decl_line   : 137
    <420>   DW_AT_decl_column : 14
    <421>   DW_AT_type        : <0x427>
    <425>   DW_AT_external    : 1
    <426>   DW_AT_declaration : 1
 <1><427>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <428>   DW_AT_byte_size   : 4
    <429>   DW_AT_type        : <0x3b5>
 <1><42d>: Abbrev Number: 12 (DW_TAG_variable)
    <42e>   DW_AT_name        : (indirect string, offset: 0x1016): stdout
    <432>   DW_AT_decl_file   : 9
    <433>   DW_AT_decl_line   : 138
    <434>   DW_AT_decl_column : 14
    <435>   DW_AT_type        : <0x427>
    <439>   DW_AT_external    : 1
    <43a>   DW_AT_declaration : 1
 <1><43b>: Abbrev Number: 12 (DW_TAG_variable)
    <43c>   DW_AT_name        : (indirect string, offset: 0xdef): stderr
    <440>   DW_AT_decl_file   : 9
    <441>   DW_AT_decl_line   : 139
    <442>   DW_AT_decl_column : 14
    <443>   DW_AT_type        : <0x427>
    <447>   DW_AT_external    : 1
    <448>   DW_AT_declaration : 1
 <1><449>: Abbrev Number: 12 (DW_TAG_variable)
    <44a>   DW_AT_name        : (indirect string, offset: 0x245): sys_nerr
    <44e>   DW_AT_decl_file   : 10
    <44f>   DW_AT_decl_line   : 26
    <450>   DW_AT_decl_column : 12
    <451>   DW_AT_type        : <0x64>
    <455>   DW_AT_external    : 1
    <456>   DW_AT_declaration : 1
 <1><457>: Abbrev Number: 16 (DW_TAG_array_type)
    <458>   DW_AT_type        : <0x1e8>
    <45c>   DW_AT_sibling     : <0x462>
 <2><460>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><461>: Abbrev Number: 0
 <1><462>: Abbrev Number: 3 (DW_TAG_const_type)
    <463>   DW_AT_type        : <0x457>
 <1><467>: Abbrev Number: 12 (DW_TAG_variable)
    <468>   DW_AT_name        : (indirect string, offset: 0x546): sys_errlist
    <46c>   DW_AT_decl_file   : 10
    <46d>   DW_AT_decl_line   : 27
    <46e>   DW_AT_decl_column : 26
    <46f>   DW_AT_type        : <0x462>
    <473>   DW_AT_external    : 1
    <474>   DW_AT_declaration : 1
 <1><475>: Abbrev Number: 12 (DW_TAG_variable)
    <476>   DW_AT_name        : (indirect string, offset: 0x26f): _sys_nerr
    <47a>   DW_AT_decl_file   : 10
    <47b>   DW_AT_decl_line   : 30
    <47c>   DW_AT_decl_column : 12
    <47d>   DW_AT_type        : <0x64>
    <481>   DW_AT_external    : 1
    <482>   DW_AT_declaration : 1
 <1><483>: Abbrev Number: 12 (DW_TAG_variable)
    <484>   DW_AT_name        : (indirect string, offset: 0xe61): _sys_errlist
    <488>   DW_AT_decl_file   : 10
    <489>   DW_AT_decl_line   : 31
    <48a>   DW_AT_decl_column : 26
    <48b>   DW_AT_type        : <0x462>
    <48f>   DW_AT_external    : 1
    <490>   DW_AT_declaration : 1
 <1><491>: Abbrev Number: 12 (DW_TAG_variable)
    <492>   DW_AT_name        : (indirect string, offset: 0x6af): program_invocation_name
    <496>   DW_AT_decl_file   : 11
    <497>   DW_AT_decl_line   : 45
    <498>   DW_AT_decl_column : 14
    <499>   DW_AT_type        : <0xe0>
    <49d>   DW_AT_external    : 1
    <49e>   DW_AT_declaration : 1
 <1><49f>: Abbrev Number: 12 (DW_TAG_variable)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xbc6): program_invocation_short_name
    <4a4>   DW_AT_decl_file   : 11
    <4a5>   DW_AT_decl_line   : 46
    <4a6>   DW_AT_decl_column : 14
    <4a7>   DW_AT_type        : <0xe0>
    <4ab>   DW_AT_external    : 1
    <4ac>   DW_AT_declaration : 1
 <1><4ad>: Abbrev Number: 16 (DW_TAG_array_type)
    <4ae>   DW_AT_type        : <0xe0>
    <4b2>   DW_AT_sibling     : <0x4bd>
 <2><4b6>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <4b7>   DW_AT_type        : <0x2b>
    <4bb>   DW_AT_upper_bound : 1
 <2><4bc>: Abbrev Number: 0
 <1><4bd>: Abbrev Number: 12 (DW_TAG_variable)
    <4be>   DW_AT_name        : (indirect string, offset: 0x1b5): __tzname
    <4c2>   DW_AT_decl_file   : 12
    <4c3>   DW_AT_decl_line   : 159
    <4c4>   DW_AT_decl_column : 14
    <4c5>   DW_AT_type        : <0x4ad>
    <4c9>   DW_AT_external    : 1
    <4ca>   DW_AT_declaration : 1
 <1><4cb>: Abbrev Number: 12 (DW_TAG_variable)
    <4cc>   DW_AT_name        : (indirect string, offset: 0xec2): __daylight
    <4d0>   DW_AT_decl_file   : 12
    <4d1>   DW_AT_decl_line   : 160
    <4d2>   DW_AT_decl_column : 12
    <4d3>   DW_AT_type        : <0x64>
    <4d7>   DW_AT_external    : 1
    <4d8>   DW_AT_declaration : 1
 <1><4d9>: Abbrev Number: 12 (DW_TAG_variable)
    <4da>   DW_AT_name        : (indirect string, offset: 0x36c): __timezone
    <4de>   DW_AT_decl_file   : 12
    <4df>   DW_AT_decl_line   : 161
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0xae>
    <4e5>   DW_AT_external    : 1
    <4e6>   DW_AT_declaration : 1
 <1><4e7>: Abbrev Number: 12 (DW_TAG_variable)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x9b9): tzname
    <4ec>   DW_AT_decl_file   : 12
    <4ed>   DW_AT_decl_line   : 166
    <4ee>   DW_AT_decl_column : 14
    <4ef>   DW_AT_type        : <0x4ad>
    <4f3>   DW_AT_external    : 1
    <4f4>   DW_AT_declaration : 1
 <1><4f5>: Abbrev Number: 12 (DW_TAG_variable)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x108f): daylight
    <4fa>   DW_AT_decl_file   : 12
    <4fb>   DW_AT_decl_line   : 174
    <4fc>   DW_AT_decl_column : 12
    <4fd>   DW_AT_type        : <0x64>
    <501>   DW_AT_external    : 1
    <502>   DW_AT_declaration : 1
 <1><503>: Abbrev Number: 12 (DW_TAG_variable)
    <504>   DW_AT_name        : (indirect string, offset: 0x4bc): timezone
    <508>   DW_AT_decl_file   : 12
    <509>   DW_AT_decl_line   : 175
    <50a>   DW_AT_decl_column : 17
    <50b>   DW_AT_type        : <0xae>
    <50f>   DW_AT_external    : 1
    <510>   DW_AT_declaration : 1
 <1><511>: Abbrev Number: 11 (DW_TAG_variable)
    <512>   DW_AT_name        : (indirect string, offset: 0xf57): getdate_err
    <516>   DW_AT_decl_file   : 12
    <517>   DW_AT_decl_line   : 274
    <519>   DW_AT_decl_column : 12
    <51a>   DW_AT_type        : <0x64>
    <51e>   DW_AT_external    : 1
    <51f>   DW_AT_declaration : 1
 <1><520>: Abbrev Number: 12 (DW_TAG_variable)
    <521>   DW_AT_name        : (indirect string, offset: 0x9cc): debug_flag
    <525>   DW_AT_decl_file   : 13
    <526>   DW_AT_decl_line   : 20
    <527>   DW_AT_decl_column : 13
    <528>   DW_AT_type        : <0x52e>
    <52c>   DW_AT_external    : 1
    <52d>   DW_AT_declaration : 1
 <1><52e>: Abbrev Number: 2 (DW_TAG_base_type)
    <52f>   DW_AT_byte_size   : 1
    <530>   DW_AT_encoding    : 2	(boolean)
    <531>   DW_AT_name        : (indirect string, offset: 0x40a): _Bool
 <1><535>: Abbrev Number: 3 (DW_TAG_const_type)
    <536>   DW_AT_type        : <0x52e>
 <1><53a>: Abbrev Number: 4 (DW_TAG_typedef)
    <53b>   DW_AT_name        : (indirect string, offset: 0xaa6): __kernel_long_t
    <53f>   DW_AT_decl_file   : 14
    <540>   DW_AT_decl_line   : 15
    <541>   DW_AT_decl_column : 15
    <542>   DW_AT_type        : <0xae>
 <1><546>: Abbrev Number: 4 (DW_TAG_typedef)
    <547>   DW_AT_name        : (indirect string, offset: 0x42): __kernel_ulong_t
    <54b>   DW_AT_decl_file   : 14
    <54c>   DW_AT_decl_line   : 16
    <54d>   DW_AT_decl_column : 23
    <54e>   DW_AT_type        : <0x37>
 <1><552>: Abbrev Number: 4 (DW_TAG_typedef)
    <553>   DW_AT_name        : (indirect string, offset: 0x3d6): kernel_long_t
    <557>   DW_AT_decl_file   : 15
    <558>   DW_AT_decl_line   : 16
    <559>   DW_AT_decl_column : 25
    <55a>   DW_AT_type        : <0x53a>
 <1><55e>: Abbrev Number: 4 (DW_TAG_typedef)
    <55f>   DW_AT_name        : (indirect string, offset: 0x8a3): kernel_ulong_t
    <563>   DW_AT_decl_file   : 15
    <564>   DW_AT_decl_line   : 17
    <565>   DW_AT_decl_column : 26
    <566>   DW_AT_type        : <0x546>
 <1><56a>: Abbrev Number: 3 (DW_TAG_const_type)
    <56b>   DW_AT_type        : <0x55e>
 <1><56f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <570>   DW_AT_name        : (indirect string, offset: 0xbe4): list_item
    <574>   DW_AT_byte_size   : 8
    <575>   DW_AT_decl_file   : 16
    <576>   DW_AT_decl_line   : 92
    <577>   DW_AT_decl_column : 8
    <578>   DW_AT_sibling     : <0x59b>
 <2><57c>: Abbrev Number: 9 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0x10d4): prev
    <581>   DW_AT_decl_file   : 16
    <582>   DW_AT_decl_line   : 93
    <583>   DW_AT_decl_column : 20
    <584>   DW_AT_type        : <0x59b>
    <588>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58b>: Abbrev Number: 9 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0x10ca): next
    <590>   DW_AT_decl_file   : 16
    <591>   DW_AT_decl_line   : 94
    <592>   DW_AT_decl_column : 20
    <593>   DW_AT_type        : <0x59b>
    <597>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59a>: Abbrev Number: 0
 <1><59b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59c>   DW_AT_byte_size   : 4
    <59d>   DW_AT_type        : <0x56f>
 <1><5a1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a2>   DW_AT_name        : (indirect string, offset: 0x87b): sysent
    <5a6>   DW_AT_byte_size   : 20
    <5a7>   DW_AT_decl_file   : 17
    <5a8>   DW_AT_decl_line   : 13
    <5a9>   DW_AT_decl_column : 16
    <5aa>   DW_AT_sibling     : <0x5fa>
 <2><5ae>: Abbrev Number: 9 (DW_TAG_member)
    <5af>   DW_AT_name        : (indirect string, offset: 0x102d): nargs
    <5b3>   DW_AT_decl_file   : 17
    <5b4>   DW_AT_decl_line   : 14
    <5b5>   DW_AT_decl_column : 11
    <5b6>   DW_AT_type        : <0x2b>
    <5ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bd>: Abbrev Number: 9 (DW_TAG_member)
    <5be>   DW_AT_name        : (indirect string, offset: 0x978): sys_flags
    <5c2>   DW_AT_decl_file   : 17
    <5c3>   DW_AT_decl_line   : 15
    <5c4>   DW_AT_decl_column : 6
    <5c5>   DW_AT_type        : <0x64>
    <5c9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cc>: Abbrev Number: 19 (DW_TAG_member)
    <5cd>   DW_AT_name        : sen
    <5d1>   DW_AT_decl_file   : 17
    <5d2>   DW_AT_decl_line   : 16
    <5d3>   DW_AT_decl_column : 6
    <5d4>   DW_AT_type        : <0x64>
    <5d8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5db>: Abbrev Number: 9 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x304): sys_func
    <5e0>   DW_AT_decl_file   : 17
    <5e1>   DW_AT_decl_line   : 17
    <5e2>   DW_AT_decl_column : 8
    <5e3>   DW_AT_type        : <0x872>
    <5e7>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ea>: Abbrev Number: 9 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x279): sys_name
    <5ef>   DW_AT_decl_file   : 17
    <5f0>   DW_AT_decl_line   : 18
    <5f1>   DW_AT_decl_column : 14
    <5f2>   DW_AT_type        : <0x1e2>
    <5f6>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5fb>   DW_AT_prototyped  : 1
    <5fc>   DW_AT_type        : <0x64>
    <600>   DW_AT_sibling     : <0x60a>
 <2><604>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <605>   DW_AT_type        : <0x60a>
 <2><609>: Abbrev Number: 0
 <1><60a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60b>   DW_AT_byte_size   : 4
    <60c>   DW_AT_type        : <0x615>
 <1><610>: Abbrev Number: 3 (DW_TAG_const_type)
    <611>   DW_AT_type        : <0x60a>
 <1><615>: Abbrev Number: 22 (DW_TAG_structure_type)
    <616>   DW_AT_name        : tcb
    <61a>   DW_AT_byte_size   : 220
    <61b>   DW_AT_decl_file   : 18
    <61c>   DW_AT_decl_line   : 262
    <61e>   DW_AT_decl_column : 8
    <61f>   DW_AT_sibling     : <0x872>
 <2><623>: Abbrev Number: 23 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x4d7): flags
    <628>   DW_AT_decl_file   : 18
    <629>   DW_AT_decl_line   : 263
    <62b>   DW_AT_decl_column : 6
    <62c>   DW_AT_type        : <0x64>
    <630>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><633>: Abbrev Number: 24 (DW_TAG_member)
    <634>   DW_AT_name        : pid
    <638>   DW_AT_decl_file   : 18
    <639>   DW_AT_decl_line   : 264
    <63b>   DW_AT_decl_column : 6
    <63c>   DW_AT_type        : <0x64>
    <640>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><643>: Abbrev Number: 23 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x61): qual_flg
    <648>   DW_AT_decl_file   : 18
    <649>   DW_AT_decl_line   : 265
    <64b>   DW_AT_decl_column : 6
    <64c>   DW_AT_type        : <0x64>
    <650>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><653>: Abbrev Number: 23 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0x390): currpers
    <658>   DW_AT_decl_file   : 18
    <659>   DW_AT_decl_line   : 267
    <65b>   DW_AT_decl_column : 15
    <65c>   DW_AT_type        : <0x2b>
    <660>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><663>: Abbrev Number: 23 (DW_TAG_member)
    <664>   DW_AT_name        : (indirect string, offset: 0xb43): u_error
    <668>   DW_AT_decl_file   : 18
    <669>   DW_AT_decl_line   : 269
    <66b>   DW_AT_decl_column : 16
    <66c>   DW_AT_type        : <0x37>
    <670>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><673>: Abbrev Number: 23 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <678>   DW_AT_decl_file   : 18
    <679>   DW_AT_decl_line   : 270
    <67b>   DW_AT_decl_column : 17
    <67c>   DW_AT_type        : <0x55e>
    <680>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><683>: Abbrev Number: 23 (DW_TAG_member)
    <684>   DW_AT_name        : (indirect string, offset: 0xb7c): true_scno
    <688>   DW_AT_decl_file   : 18
    <689>   DW_AT_decl_line   : 271
    <68b>   DW_AT_decl_column : 17
    <68c>   DW_AT_type        : <0x55e>
    <690>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><693>: Abbrev Number: 23 (DW_TAG_member)
    <694>   DW_AT_name        : (indirect string, offset: 0x19f): u_arg
    <698>   DW_AT_decl_file   : 18
    <699>   DW_AT_decl_line   : 272
    <69b>   DW_AT_decl_column : 17
    <69c>   DW_AT_type        : <0x9a2>
    <6a0>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a3>: Abbrev Number: 23 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x98f): u_rval
    <6a8>   DW_AT_decl_file   : 18
    <6a9>   DW_AT_decl_line   : 273
    <6ab>   DW_AT_decl_column : 16
    <6ac>   DW_AT_type        : <0x552>
    <6b0>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b3>: Abbrev Number: 23 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xac2): sys_func_rval
    <6b8>   DW_AT_decl_file   : 18
    <6b9>   DW_AT_decl_line   : 274
    <6bb>   DW_AT_decl_column : 6
    <6bc>   DW_AT_type        : <0x64>
    <6c0>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c3>: Abbrev Number: 23 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0xcd8): curcol
    <6c8>   DW_AT_decl_file   : 18
    <6c9>   DW_AT_decl_line   : 275
    <6cb>   DW_AT_decl_column : 6
    <6cc>   DW_AT_type        : <0x64>
    <6d0>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d3>: Abbrev Number: 23 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x9a1): outf
    <6d8>   DW_AT_decl_file   : 18
    <6d9>   DW_AT_decl_line   : 276
    <6db>   DW_AT_decl_column : 8
    <6dc>   DW_AT_type        : <0x427>
    <6e0>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e3>: Abbrev Number: 23 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0xf01): staged_output_data
    <6e8>   DW_AT_decl_file   : 18
    <6e9>   DW_AT_decl_line   : 277
    <6eb>   DW_AT_decl_column : 29
    <6ec>   DW_AT_type        : <0x9b8>
    <6f0>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f3>: Abbrev Number: 23 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xa8d): auxstr
    <6f8>   DW_AT_decl_file   : 18
    <6f9>   DW_AT_decl_line   : 279
    <6fb>   DW_AT_decl_column : 14
    <6fc>   DW_AT_type        : <0x1e2>
    <700>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><703>: Abbrev Number: 23 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0x17e): _priv_data
    <708>   DW_AT_decl_file   : 18
    <709>   DW_AT_decl_line   : 280
    <70b>   DW_AT_decl_column : 8
    <70c>   DW_AT_type        : <0xcd>
    <710>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><713>: Abbrev Number: 23 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0xc11): _free_priv_data
    <718>   DW_AT_decl_file   : 18
    <719>   DW_AT_decl_line   : 281
    <71b>   DW_AT_decl_column : 9
    <71c>   DW_AT_type        : <0x9ca>
    <720>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><723>: Abbrev Number: 23 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x18f): s_ent
    <728>   DW_AT_decl_file   : 18
    <729>   DW_AT_decl_line   : 282
    <72b>   DW_AT_decl_column : 23
    <72c>   DW_AT_type        : <0x9d0>
    <730>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><733>: Abbrev Number: 23 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x20): s_prev_ent
    <738>   DW_AT_decl_file   : 18
    <739>   DW_AT_decl_line   : 285
    <73b>   DW_AT_decl_column : 23
    <73c>   DW_AT_type        : <0x9d0>
    <740>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><743>: Abbrev Number: 23 (DW_TAG_member)
    <744>   DW_AT_name        : (indirect string, offset: 0x385): inject_vec
    <748>   DW_AT_decl_file   : 18
    <749>   DW_AT_decl_line   : 286
    <74b>   DW_AT_decl_column : 22
    <74c>   DW_AT_type        : <0x9db>
    <750>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><753>: Abbrev Number: 23 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x7ec): stime
    <758>   DW_AT_decl_file   : 18
    <759>   DW_AT_decl_line   : 287
    <75b>   DW_AT_decl_column : 18
    <75c>   DW_AT_type        : <0x13f>
    <760>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><763>: Abbrev Number: 23 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x399): ltime
    <768>   DW_AT_decl_file   : 18
    <769>   DW_AT_decl_line   : 288
    <76b>   DW_AT_decl_column : 18
    <76c>   DW_AT_type        : <0x13f>
    <770>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><773>: Abbrev Number: 23 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0xff4): atime
    <778>   DW_AT_decl_file   : 18
    <779>   DW_AT_decl_line   : 289
    <77b>   DW_AT_decl_column : 18
    <77c>   DW_AT_type        : <0x13f>
    <780>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><783>: Abbrev Number: 23 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x4d1): etime
    <788>   DW_AT_decl_file   : 18
    <789>   DW_AT_decl_line   : 290
    <78b>   DW_AT_decl_column : 18
    <78c>   DW_AT_type        : <0x13f>
    <790>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><794>: Abbrev Number: 23 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0xd3c): delay_expiration_time
    <799>   DW_AT_decl_file   : 18
    <79a>   DW_AT_decl_line   : 291
    <79c>   DW_AT_decl_column : 18
    <79d>   DW_AT_type        : <0x13f>
    <7a1>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a5>: Abbrev Number: 23 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x2b): pid_ns
    <7aa>   DW_AT_decl_file   : 18
    <7ab>   DW_AT_decl_line   : 298
    <7ad>   DW_AT_decl_column : 15
    <7ae>   DW_AT_type        : <0x2b>
    <7b2>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b6>: Abbrev Number: 23 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xf3d): last_dirfd
    <7bb>   DW_AT_decl_file   : 18
    <7bc>   DW_AT_decl_line   : 301
    <7be>   DW_AT_decl_column : 6
    <7bf>   DW_AT_type        : <0x64>
    <7c3>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c7>: Abbrev Number: 23 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0xf63): mmap_cache
    <7cc>   DW_AT_decl_file   : 18
    <7cd>   DW_AT_decl_line   : 304
    <7cf>   DW_AT_decl_column : 23
    <7d0>   DW_AT_type        : <0x9f7>
    <7d4>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d8>: Abbrev Number: 23 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0xb52): wait_data_idx
    <7dd>   DW_AT_decl_file   : 18
    <7de>   DW_AT_decl_line   : 311
    <7e0>   DW_AT_decl_column : 9
    <7e1>   DW_AT_type        : <0x12e>
    <7e5>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e9>: Abbrev Number: 23 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0xa94): delayed_wait_data
    <7ee>   DW_AT_decl_file   : 18
    <7ef>   DW_AT_decl_line   : 313
    <7f1>   DW_AT_decl_column : 24
    <7f2>   DW_AT_type        : <0xa03>
    <7f6>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7fa>: Abbrev Number: 23 (DW_TAG_member)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xb04): wait_list
    <7ff>   DW_AT_decl_file   : 18
    <800>   DW_AT_decl_line   : 314
    <802>   DW_AT_decl_column : 19
    <803>   DW_AT_type        : <0x56f>
    <807>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80b>: Abbrev Number: 23 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x6c7): vcpu_info_list
    <810>   DW_AT_decl_file   : 18
    <811>   DW_AT_decl_line   : 318
    <813>   DW_AT_decl_column : 20
    <814>   DW_AT_type        : <0xa0f>
    <818>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81c>: Abbrev Number: 23 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xca3): unwind_ctx
    <821>   DW_AT_decl_file   : 18
    <822>   DW_AT_decl_line   : 322
    <824>   DW_AT_decl_column : 8
    <825>   DW_AT_type        : <0xcd>
    <829>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82d>: Abbrev Number: 23 (DW_TAG_member)
    <82e>   DW_AT_name        : (indirect string, offset: 0x4af): unwind_queue
    <832>   DW_AT_decl_file   : 18
    <833>   DW_AT_decl_line   : 323
    <835>   DW_AT_decl_column : 25
    <836>   DW_AT_type        : <0xa1b>
    <83a>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83e>: Abbrev Number: 23 (DW_TAG_member)
    <83f>   DW_AT_name        : (indirect string, offset: 0x173): comm
    <843>   DW_AT_decl_file   : 18
    <844>   DW_AT_decl_line   : 327
    <846>   DW_AT_decl_column : 7
    <847>   DW_AT_type        : <0xa21>
    <84b>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84f>: Abbrev Number: 23 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0x21b): start_prc
    <854>   DW_AT_decl_file   : 18
    <855>   DW_AT_decl_line   : 329
    <857>   DW_AT_decl_column : 16
    <858>   DW_AT_type        : <0x37>
    <85c>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><860>: Abbrev Number: 23 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0xfc8): pre_comm
    <865>   DW_AT_decl_file   : 18
    <866>   DW_AT_decl_line   : 330
    <868>   DW_AT_decl_column : 7
    <869>   DW_AT_type        : <0xa21>
    <86d>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><871>: Abbrev Number: 0
 <1><872>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <873>   DW_AT_byte_size   : 4
    <874>   DW_AT_type        : <0x5fa>
 <1><878>: Abbrev Number: 4 (DW_TAG_typedef)
    <879>   DW_AT_name        : (indirect string, offset: 0x51d): struct_sysent
    <87d>   DW_AT_decl_file   : 17
    <87e>   DW_AT_decl_line   : 19
    <87f>   DW_AT_decl_column : 3
    <880>   DW_AT_type        : <0x5a1>
 <1><884>: Abbrev Number: 3 (DW_TAG_const_type)
    <885>   DW_AT_type        : <0x878>
 <1><889>: Abbrev Number: 12 (DW_TAG_variable)
    <88a>   DW_AT_name        : (indirect string, offset: 0xd28): current_personality
    <88e>   DW_AT_decl_file   : 18
    <88f>   DW_AT_decl_line   : 158
    <890>   DW_AT_decl_column : 17
    <891>   DW_AT_type        : <0x2b>
    <895>   DW_AT_external    : 1
    <896>   DW_AT_declaration : 1
 <1><897>: Abbrev Number: 12 (DW_TAG_variable)
    <898>   DW_AT_name        : (indirect string, offset: 0x81d): current_wordsize
    <89c>   DW_AT_decl_file   : 18
    <89d>   DW_AT_decl_line   : 171
    <89e>   DW_AT_decl_column : 17
    <89f>   DW_AT_type        : <0x2b>
    <8a3>   DW_AT_external    : 1
    <8a4>   DW_AT_declaration : 1
 <1><8a5>: Abbrev Number: 12 (DW_TAG_variable)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xa6b): current_klongsize
    <8aa>   DW_AT_decl_file   : 18
    <8ab>   DW_AT_decl_line   : 176
    <8ac>   DW_AT_decl_column : 17
    <8ad>   DW_AT_type        : <0x2b>
    <8b1>   DW_AT_external    : 1
    <8b2>   DW_AT_declaration : 1
 <1><8b3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xc7a): ioctlent
    <8b8>   DW_AT_byte_size   : 8
    <8b9>   DW_AT_decl_file   : 18
    <8ba>   DW_AT_decl_line   : 217
    <8bb>   DW_AT_decl_column : 16
    <8bc>   DW_AT_sibling     : <0x8df>
 <2><8c0>: Abbrev Number: 9 (DW_TAG_member)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xf29): symbol
    <8c5>   DW_AT_decl_file   : 18
    <8c6>   DW_AT_decl_line   : 218
    <8c7>   DW_AT_decl_column : 14
    <8c8>   DW_AT_type        : <0x1e2>
    <8cc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8cf>: Abbrev Number: 9 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0xcf1): code
    <8d4>   DW_AT_decl_file   : 18
    <8d5>   DW_AT_decl_line   : 219
    <8d6>   DW_AT_decl_column : 15
    <8d7>   DW_AT_type        : <0x2b>
    <8db>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8de>: Abbrev Number: 0
 <1><8df>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e0>   DW_AT_name        : (indirect string, offset: 0xc3b): struct_ioctlent
    <8e4>   DW_AT_decl_file   : 18
    <8e5>   DW_AT_decl_line   : 220
    <8e6>   DW_AT_decl_column : 3
    <8e7>   DW_AT_type        : <0x8b3>
 <1><8eb>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ec>   DW_AT_type        : <0x8df>
 <1><8f0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x811): inject_data
    <8f5>   DW_AT_byte_size   : 10
    <8f6>   DW_AT_decl_file   : 18
    <8f7>   DW_AT_decl_line   : 241
    <8f8>   DW_AT_decl_column : 8
    <8f9>   DW_AT_sibling     : <0x958>
 <2><8fd>: Abbrev Number: 9 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x4d7): flags
    <902>   DW_AT_decl_file   : 18
    <903>   DW_AT_decl_line   : 242
    <904>   DW_AT_decl_column : 10
    <905>   DW_AT_type        : <0xfe>
    <909>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90c>: Abbrev Number: 9 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0x92c): signo
    <911>   DW_AT_decl_file   : 18
    <912>   DW_AT_decl_line   : 243
    <913>   DW_AT_decl_column : 10
    <914>   DW_AT_type        : <0xfe>
    <918>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><91b>: Abbrev Number: 9 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0x105): rval_idx
    <920>   DW_AT_decl_file   : 18
    <921>   DW_AT_decl_line   : 244
    <922>   DW_AT_decl_column : 11
    <923>   DW_AT_type        : <0x10a>
    <927>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><92a>: Abbrev Number: 9 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0xcce): delay_idx
    <92f>   DW_AT_decl_file   : 18
    <930>   DW_AT_decl_line   : 245
    <931>   DW_AT_decl_column : 11
    <932>   DW_AT_type        : <0x10a>
    <936>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><939>: Abbrev Number: 9 (DW_TAG_member)
    <93a>   DW_AT_name        : (indirect string, offset: 0x55e): poke_idx
    <93e>   DW_AT_decl_file   : 18
    <93f>   DW_AT_decl_line   : 246
    <940>   DW_AT_decl_column : 11
    <941>   DW_AT_type        : <0x10a>
    <945>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><948>: Abbrev Number: 9 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0x195): scno
    <94d>   DW_AT_decl_file   : 18
    <94e>   DW_AT_decl_line   : 247
    <94f>   DW_AT_decl_column : 11
    <950>   DW_AT_type        : <0x10a>
    <954>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><957>: Abbrev Number: 0
 <1><958>: Abbrev Number: 8 (DW_TAG_structure_type)
    <959>   DW_AT_name        : (indirect string, offset: 0xe6): inject_opts
    <95d>   DW_AT_byte_size   : 16
    <95e>   DW_AT_decl_file   : 18
    <95f>   DW_AT_decl_line   : 250
    <960>   DW_AT_decl_column : 8
    <961>   DW_AT_sibling     : <0x9a2>
 <2><965>: Abbrev Number: 9 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0xa2a): first
    <96a>   DW_AT_decl_file   : 18
    <96b>   DW_AT_decl_line   : 251
    <96c>   DW_AT_decl_column : 11
    <96d>   DW_AT_type        : <0x10a>
    <971>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><974>: Abbrev Number: 9 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x10fd): last
    <979>   DW_AT_decl_file   : 18
    <97a>   DW_AT_decl_line   : 252
    <97b>   DW_AT_decl_column : 11
    <97c>   DW_AT_type        : <0x10a>
    <980>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><983>: Abbrev Number: 9 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0x39f): step
    <988>   DW_AT_decl_file   : 18
    <989>   DW_AT_decl_line   : 253
    <98a>   DW_AT_decl_column : 11
    <98b>   DW_AT_type        : <0x10a>
    <98f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><992>: Abbrev Number: 9 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x10cf): data
    <997>   DW_AT_decl_file   : 18
    <998>   DW_AT_decl_line   : 254
    <999>   DW_AT_decl_column : 21
    <99a>   DW_AT_type        : <0x8f0>
    <99e>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a1>: Abbrev Number: 0
 <1><9a2>: Abbrev Number: 16 (DW_TAG_array_type)
    <9a3>   DW_AT_type        : <0x55e>
    <9a7>   DW_AT_sibling     : <0x9b2>
 <2><9ab>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9ac>   DW_AT_type        : <0x2b>
    <9b0>   DW_AT_upper_bound : 5
 <2><9b1>: Abbrev Number: 0
 <1><9b2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9b3>   DW_AT_name        : (indirect string, offset: 0xf01): staged_output_data
    <9b7>   DW_AT_declaration : 1
 <1><9b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x9b2>
 <1><9be>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9bf>   DW_AT_prototyped  : 1
    <9c0>   DW_AT_sibling     : <0x9ca>
 <2><9c4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9c5>   DW_AT_type        : <0xcd>
 <2><9c9>: Abbrev Number: 0
 <1><9ca>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_type        : <0x9be>
 <1><9d0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d1>   DW_AT_byte_size   : 4
    <9d2>   DW_AT_type        : <0x884>
 <1><9d6>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d7>   DW_AT_type        : <0x9d0>
 <1><9db>: Abbrev Number: 16 (DW_TAG_array_type)
    <9dc>   DW_AT_type        : <0x9eb>
    <9e0>   DW_AT_sibling     : <0x9eb>
 <2><9e4>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9e5>   DW_AT_type        : <0x2b>
    <9e9>   DW_AT_upper_bound : 2
 <2><9ea>: Abbrev Number: 0
 <1><9eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ec>   DW_AT_byte_size   : 4
    <9ed>   DW_AT_type        : <0x958>
 <1><9f1>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9f2>   DW_AT_name        : (indirect string, offset: 0xb2): mmap_cache_t
    <9f6>   DW_AT_declaration : 1
 <1><9f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f8>   DW_AT_byte_size   : 4
    <9f9>   DW_AT_type        : <0x9f1>
 <1><9fd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x3ba): tcb_wait_data
    <a02>   DW_AT_declaration : 1
 <1><a03>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a04>   DW_AT_byte_size   : 4
    <a05>   DW_AT_type        : <0x9fd>
 <1><a09>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x169): vcpu_info
    <a0e>   DW_AT_declaration : 1
 <1><a0f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a10>   DW_AT_byte_size   : 4
    <a11>   DW_AT_type        : <0xa09>
 <1><a15>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a16>   DW_AT_name        : (indirect string, offset: 0xee5): unwind_queue_t
    <a1a>   DW_AT_declaration : 1
 <1><a1b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1c>   DW_AT_byte_size   : 4
    <a1d>   DW_AT_type        : <0xa15>
 <1><a21>: Abbrev Number: 16 (DW_TAG_array_type)
    <a22>   DW_AT_type        : <0xe6>
    <a26>   DW_AT_sibling     : <0xa31>
 <2><a2a>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a2b>   DW_AT_type        : <0x2b>
    <a2f>   DW_AT_upper_bound : 15
 <2><a30>: Abbrev Number: 0
 <1><a31>: Abbrev Number: 11 (DW_TAG_variable)
    <a32>   DW_AT_name        : (indirect string, offset: 0xb8f): stub_sysent
    <a36>   DW_AT_decl_file   : 18
    <a37>   DW_AT_decl_line   : 405
    <a39>   DW_AT_decl_column : 28
    <a3a>   DW_AT_type        : <0x884>
    <a3e>   DW_AT_external    : 1
    <a3f>   DW_AT_declaration : 1
 <1><a40>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a41>   DW_AT_name        : (indirect string, offset: 0x10b2): xlat_type
    <a45>   DW_AT_encoding    : 7	(unsigned)
    <a46>   DW_AT_byte_size   : 4
    <a47>   DW_AT_type        : <0x2b>
    <a4b>   DW_AT_decl_file   : 19
    <a4c>   DW_AT_decl_line   : 13
    <a4d>   DW_AT_decl_column : 6
    <a4e>   DW_AT_sibling     : <0xa65>
 <2><a52>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0x2d4): XT_NORMAL
    <a57>   DW_AT_const_value : 0
 <2><a58>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0xc52): XT_SORTED
    <a5d>   DW_AT_const_value : 1
 <2><a5e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xdce): XT_INDEXED
    <a63>   DW_AT_const_value : 2
 <2><a64>: Abbrev Number: 0
 <1><a65>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a66>   DW_AT_name        : (indirect string, offset: 0xbbb): xlat_style
    <a6a>   DW_AT_encoding    : 7	(unsigned)
    <a6b>   DW_AT_byte_size   : 4
    <a6c>   DW_AT_type        : <0x2b>
    <a70>   DW_AT_decl_file   : 19
    <a71>   DW_AT_decl_line   : 19
    <a72>   DW_AT_decl_column : 6
    <a73>   DW_AT_sibling     : <0xaa2>
 <2><a77>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0xf2): XLAT_STYLE_DEFAULT
    <a7c>   DW_AT_const_value : 0
 <2><a7d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0xbee): XLAT_STYLE_RAW
    <a82>   DW_AT_const_value : 1
 <2><a83>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x107d): XLAT_STYLE_ABBREV
    <a88>   DW_AT_const_value : 2
 <2><a89>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x2f1): XLAT_STYLE_VERBOSE
    <a8e>   DW_AT_const_value : 3
 <2><a8f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0x25e): XLAT_STYLE_FMT_X
    <a94>   DW_AT_const_value : 0
 <2><a95>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a9a>   DW_AT_const_value : 4
 <2><a9b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x10ec): XLAT_STYLE_FMT_D
    <aa0>   DW_AT_const_value : 8
 <2><aa1>: Abbrev Number: 0
 <1><aa2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x322): xlat_data
    <aa7>   DW_AT_byte_size   : 12
    <aa8>   DW_AT_decl_file   : 19
    <aa9>   DW_AT_decl_line   : 51
    <aaa>   DW_AT_decl_column : 8
    <aab>   DW_AT_sibling     : <0xace>
 <2><aaf>: Abbrev Number: 19 (DW_TAG_member)
    <ab0>   DW_AT_name        : val
    <ab4>   DW_AT_decl_file   : 19
    <ab5>   DW_AT_decl_line   : 52
    <ab6>   DW_AT_decl_column : 11
    <ab7>   DW_AT_type        : <0x122>
    <abb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><abe>: Abbrev Number: 19 (DW_TAG_member)
    <abf>   DW_AT_name        : str
    <ac3>   DW_AT_decl_file   : 19
    <ac4>   DW_AT_decl_line   : 53
    <ac5>   DW_AT_decl_column : 14
    <ac6>   DW_AT_type        : <0x1e2>
    <aca>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><acd>: Abbrev Number: 0
 <1><ace>: Abbrev Number: 3 (DW_TAG_const_type)
    <acf>   DW_AT_type        : <0xaa2>
 <1><ad3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x1b): xlat
    <ad8>   DW_AT_byte_size   : 24
    <ad9>   DW_AT_decl_file   : 19
    <ada>   DW_AT_decl_line   : 56
    <adb>   DW_AT_decl_column : 8
    <adc>   DW_AT_sibling     : <0xb2c>
 <2><ae0>: Abbrev Number: 9 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x10cf): data
    <ae5>   DW_AT_decl_file   : 19
    <ae6>   DW_AT_decl_line   : 57
    <ae7>   DW_AT_decl_column : 26
    <ae8>   DW_AT_type        : <0xb31>
    <aec>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aef>: Abbrev Number: 9 (DW_TAG_member)
    <af0>   DW_AT_name        : (indirect string, offset: 0x86f): flags_strsz
    <af4>   DW_AT_decl_file   : 19
    <af5>   DW_AT_decl_line   : 58
    <af6>   DW_AT_decl_column : 9
    <af7>   DW_AT_type        : <0x12e>
    <afb>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><afe>: Abbrev Number: 9 (DW_TAG_member)
    <aff>   DW_AT_name        : (indirect string, offset: 0xb60): size
    <b03>   DW_AT_decl_file   : 19
    <b04>   DW_AT_decl_line   : 59
    <b05>   DW_AT_decl_column : 11
    <b06>   DW_AT_type        : <0x116>
    <b0a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b0d>: Abbrev Number: 9 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x19a): type
    <b12>   DW_AT_decl_file   : 19
    <b13>   DW_AT_decl_line   : 60
    <b14>   DW_AT_decl_column : 17
    <b15>   DW_AT_type        : <0xa40>
    <b19>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b1c>: Abbrev Number: 9 (DW_TAG_member)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x71b): flags_mask
    <b21>   DW_AT_decl_file   : 19
    <b22>   DW_AT_decl_line   : 61
    <b23>   DW_AT_decl_column : 11
    <b24>   DW_AT_type        : <0x122>
    <b28>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b2b>: Abbrev Number: 0
 <1><b2c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2d>   DW_AT_type        : <0xad3>
 <1><b31>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b32>   DW_AT_byte_size   : 4
    <b33>   DW_AT_type        : <0xace>
 <1><b37>: Abbrev Number: 16 (DW_TAG_array_type)
    <b38>   DW_AT_type        : <0xb2c>
    <b3c>   DW_AT_sibling     : <0xb42>
 <2><b40>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b41>: Abbrev Number: 0
 <1><b42>: Abbrev Number: 3 (DW_TAG_const_type)
    <b43>   DW_AT_type        : <0xb37>
 <1><b47>: Abbrev Number: 11 (DW_TAG_variable)
    <b48>   DW_AT_name        : (indirect string, offset: 0xe3f): addrfams
    <b4c>   DW_AT_decl_file   : 18
    <b4d>   DW_AT_decl_line   : 411
    <b4f>   DW_AT_decl_column : 26
    <b50>   DW_AT_type        : <0xb42>
    <b54>   DW_AT_external    : 1
    <b55>   DW_AT_declaration : 1
 <1><b56>: Abbrev Number: 11 (DW_TAG_variable)
    <b57>   DW_AT_name        : (indirect string, offset: 0xd01): arp_hardware_types
    <b5b>   DW_AT_decl_file   : 18
    <b5c>   DW_AT_decl_line   : 412
    <b5e>   DW_AT_decl_column : 26
    <b5f>   DW_AT_type        : <0xb42>
    <b63>   DW_AT_external    : 1
    <b64>   DW_AT_declaration : 1
 <1><b65>: Abbrev Number: 11 (DW_TAG_variable)
    <b66>   DW_AT_name        : (indirect string, offset: 0xffa): at_flags
    <b6a>   DW_AT_decl_file   : 18
    <b6b>   DW_AT_decl_line   : 413
    <b6d>   DW_AT_decl_column : 26
    <b6e>   DW_AT_type        : <0xb42>
    <b72>   DW_AT_external    : 1
    <b73>   DW_AT_declaration : 1
 <1><b74>: Abbrev Number: 11 (DW_TAG_variable)
    <b75>   DW_AT_name        : (indirect string, offset: 0x486): clocknames
    <b79>   DW_AT_decl_file   : 18
    <b7a>   DW_AT_decl_line   : 414
    <b7c>   DW_AT_decl_column : 26
    <b7d>   DW_AT_type        : <0xb42>
    <b81>   DW_AT_external    : 1
    <b82>   DW_AT_declaration : 1
 <1><b83>: Abbrev Number: 11 (DW_TAG_variable)
    <b84>   DW_AT_name        : (indirect string, offset: 0xfb1): dirent_types
    <b88>   DW_AT_decl_file   : 18
    <b89>   DW_AT_decl_line   : 415
    <b8b>   DW_AT_decl_column : 26
    <b8c>   DW_AT_type        : <0xb42>
    <b90>   DW_AT_external    : 1
    <b91>   DW_AT_declaration : 1
 <1><b92>: Abbrev Number: 11 (DW_TAG_variable)
    <b93>   DW_AT_name        : (indirect string, offset: 0x8c0): ethernet_protocols
    <b97>   DW_AT_decl_file   : 18
    <b98>   DW_AT_decl_line   : 416
    <b9a>   DW_AT_decl_column : 26
    <b9b>   DW_AT_type        : <0xb42>
    <b9f>   DW_AT_external    : 1
    <ba0>   DW_AT_declaration : 1
 <1><ba1>: Abbrev Number: 11 (DW_TAG_variable)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x5b1): inet_protocols
    <ba6>   DW_AT_decl_file   : 18
    <ba7>   DW_AT_decl_line   : 417
    <ba9>   DW_AT_decl_column : 26
    <baa>   DW_AT_type        : <0xb42>
    <bae>   DW_AT_external    : 1
    <baf>   DW_AT_declaration : 1
 <1><bb0>: Abbrev Number: 11 (DW_TAG_variable)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x2c1): evdev_abs
    <bb5>   DW_AT_decl_file   : 18
    <bb6>   DW_AT_decl_line   : 418
    <bb8>   DW_AT_decl_column : 26
    <bb9>   DW_AT_type        : <0xb42>
    <bbd>   DW_AT_external    : 1
    <bbe>   DW_AT_declaration : 1
 <1><bbf>: Abbrev Number: 11 (DW_TAG_variable)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x710): audit_arch
    <bc4>   DW_AT_decl_file   : 18
    <bc5>   DW_AT_decl_line   : 419
    <bc7>   DW_AT_decl_column : 26
    <bc8>   DW_AT_type        : <0xb42>
    <bcc>   DW_AT_external    : 1
    <bcd>   DW_AT_declaration : 1
 <1><bce>: Abbrev Number: 11 (DW_TAG_variable)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x9e): evdev_ev
    <bd3>   DW_AT_decl_file   : 18
    <bd4>   DW_AT_decl_line   : 420
    <bd6>   DW_AT_decl_column : 26
    <bd7>   DW_AT_type        : <0xb42>
    <bdb>   DW_AT_external    : 1
    <bdc>   DW_AT_declaration : 1
 <1><bdd>: Abbrev Number: 11 (DW_TAG_variable)
    <bde>   DW_AT_name        : (indirect string, offset: 0x467): iffflags
    <be2>   DW_AT_decl_file   : 18
    <be3>   DW_AT_decl_line   : 421
    <be5>   DW_AT_decl_column : 26
    <be6>   DW_AT_type        : <0xb42>
    <bea>   DW_AT_external    : 1
    <beb>   DW_AT_declaration : 1
 <1><bec>: Abbrev Number: 11 (DW_TAG_variable)
    <bed>   DW_AT_name        : (indirect string, offset: 0xbfd): ip_type_of_services
    <bf1>   DW_AT_decl_file   : 18
    <bf2>   DW_AT_decl_line   : 422
    <bf4>   DW_AT_decl_column : 26
    <bf5>   DW_AT_type        : <0xb42>
    <bf9>   DW_AT_external    : 1
    <bfa>   DW_AT_declaration : 1
 <1><bfb>: Abbrev Number: 11 (DW_TAG_variable)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x6a3): ipc_private
    <c00>   DW_AT_decl_file   : 18
    <c01>   DW_AT_decl_line   : 423
    <c03>   DW_AT_decl_column : 26
    <c04>   DW_AT_type        : <0xb42>
    <c08>   DW_AT_external    : 1
    <c09>   DW_AT_declaration : 1
 <1><c0a>: Abbrev Number: 11 (DW_TAG_variable)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x318): msg_flags
    <c0f>   DW_AT_decl_file   : 18
    <c10>   DW_AT_decl_line   : 424
    <c12>   DW_AT_decl_column : 26
    <c13>   DW_AT_type        : <0xb42>
    <c17>   DW_AT_external    : 1
    <c18>   DW_AT_declaration : 1
 <1><c19>: Abbrev Number: 11 (DW_TAG_variable)
    <c1a>   DW_AT_name        : (indirect string, offset: 0x10e): netlink_protocols
    <c1e>   DW_AT_decl_file   : 18
    <c1f>   DW_AT_decl_line   : 425
    <c21>   DW_AT_decl_column : 26
    <c22>   DW_AT_type        : <0xb42>
    <c26>   DW_AT_external    : 1
    <c27>   DW_AT_declaration : 1
 <1><c28>: Abbrev Number: 11 (DW_TAG_variable)
    <c29>   DW_AT_name        : (indirect string, offset: 0xf14): nl_bridge_vlan_flags
    <c2d>   DW_AT_decl_file   : 18
    <c2e>   DW_AT_decl_line   : 426
    <c30>   DW_AT_decl_column : 26
    <c31>   DW_AT_type        : <0xb42>
    <c35>   DW_AT_external    : 1
    <c36>   DW_AT_declaration : 1
 <1><c37>: Abbrev Number: 11 (DW_TAG_variable)
    <c38>   DW_AT_name        : (indirect string, offset: 0xdb7): nl_netfilter_msg_types
    <c3c>   DW_AT_decl_file   : 18
    <c3d>   DW_AT_decl_line   : 427
    <c3f>   DW_AT_decl_column : 26
    <c40>   DW_AT_type        : <0xb42>
    <c44>   DW_AT_external    : 1
    <c45>   DW_AT_declaration : 1
 <1><c46>: Abbrev Number: 11 (DW_TAG_variable)
    <c47>   DW_AT_name        : (indirect string, offset: 0x449): nl_route_types
    <c4b>   DW_AT_decl_file   : 18
    <c4c>   DW_AT_decl_line   : 428
    <c4e>   DW_AT_decl_column : 26
    <c4f>   DW_AT_type        : <0xb42>
    <c53>   DW_AT_external    : 1
    <c54>   DW_AT_declaration : 1
 <1><c55>: Abbrev Number: 11 (DW_TAG_variable)
    <c56>   DW_AT_name        : (indirect string, offset: 0xe76): open_access_modes
    <c5a>   DW_AT_decl_file   : 18
    <c5b>   DW_AT_decl_line   : 429
    <c5d>   DW_AT_decl_column : 26
    <c5e>   DW_AT_type        : <0xb42>
    <c62>   DW_AT_external    : 1
    <c63>   DW_AT_declaration : 1
 <1><c64>: Abbrev Number: 11 (DW_TAG_variable)
    <c65>   DW_AT_name        : (indirect string, offset: 0x8e): open_mode_flags
    <c69>   DW_AT_decl_file   : 18
    <c6a>   DW_AT_decl_line   : 430
    <c6c>   DW_AT_decl_column : 26
    <c6d>   DW_AT_type        : <0xb42>
    <c71>   DW_AT_external    : 1
    <c72>   DW_AT_declaration : 1
 <1><c73>: Abbrev Number: 11 (DW_TAG_variable)
    <c74>   DW_AT_name        : (indirect string, offset: 0xc2e): perf_type_id
    <c78>   DW_AT_decl_file   : 18
    <c79>   DW_AT_decl_line   : 431
    <c7b>   DW_AT_decl_column : 26
    <c7c>   DW_AT_type        : <0xb42>
    <c80>   DW_AT_external    : 1
    <c81>   DW_AT_declaration : 1
 <1><c82>: Abbrev Number: 11 (DW_TAG_variable)
    <c83>   DW_AT_name        : (indirect string, offset: 0xe48): pollflags
    <c87>   DW_AT_decl_file   : 18
    <c88>   DW_AT_decl_line   : 432
    <c8a>   DW_AT_decl_column : 26
    <c8b>   DW_AT_type        : <0xb42>
    <c8f>   DW_AT_external    : 1
    <c90>   DW_AT_declaration : 1
 <1><c91>: Abbrev Number: 11 (DW_TAG_variable)
    <c92>   DW_AT_name        : (indirect string, offset: 0x552): ptrace_cmds
    <c96>   DW_AT_decl_file   : 18
    <c97>   DW_AT_decl_line   : 433
    <c99>   DW_AT_decl_column : 26
    <c9a>   DW_AT_type        : <0xb42>
    <c9e>   DW_AT_external    : 1
    <c9f>   DW_AT_declaration : 1
 <1><ca0>: Abbrev Number: 11 (DW_TAG_variable)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x802): resource_flags
    <ca5>   DW_AT_decl_file   : 18
    <ca6>   DW_AT_decl_line   : 434
    <ca8>   DW_AT_decl_column : 26
    <ca9>   DW_AT_type        : <0xb42>
    <cad>   DW_AT_external    : 1
    <cae>   DW_AT_declaration : 1
 <1><caf>: Abbrev Number: 11 (DW_TAG_variable)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x297): route_nexthop_flags
    <cb4>   DW_AT_decl_file   : 18
    <cb5>   DW_AT_decl_line   : 435
    <cb7>   DW_AT_decl_column : 26
    <cb8>   DW_AT_type        : <0xb42>
    <cbc>   DW_AT_external    : 1
    <cbd>   DW_AT_declaration : 1
 <1><cbe>: Abbrev Number: 11 (DW_TAG_variable)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xe9f): routing_protocols
    <cc3>   DW_AT_decl_file   : 18
    <cc4>   DW_AT_decl_line   : 436
    <cc6>   DW_AT_decl_column : 26
    <cc7>   DW_AT_type        : <0xb42>
    <ccb>   DW_AT_external    : 1
    <ccc>   DW_AT_declaration : 1
 <1><ccd>: Abbrev Number: 11 (DW_TAG_variable)
    <cce>   DW_AT_name        : (indirect string, offset: 0x458): routing_scopes
    <cd2>   DW_AT_decl_file   : 18
    <cd3>   DW_AT_decl_line   : 437
    <cd5>   DW_AT_decl_column : 26
    <cd6>   DW_AT_type        : <0xb42>
    <cda>   DW_AT_external    : 1
    <cdb>   DW_AT_declaration : 1
 <1><cdc>: Abbrev Number: 11 (DW_TAG_variable)
    <cdd>   DW_AT_name        : (indirect string, offset: 0xda5): routing_table_ids
    <ce1>   DW_AT_decl_file   : 18
    <ce2>   DW_AT_decl_line   : 438
    <ce4>   DW_AT_decl_column : 26
    <ce5>   DW_AT_type        : <0xb42>
    <ce9>   DW_AT_external    : 1
    <cea>   DW_AT_declaration : 1
 <1><ceb>: Abbrev Number: 11 (DW_TAG_variable)
    <cec>   DW_AT_name        : (indirect string, offset: 0x680): routing_types
    <cf0>   DW_AT_decl_file   : 18
    <cf1>   DW_AT_decl_line   : 439
    <cf3>   DW_AT_decl_column : 26
    <cf4>   DW_AT_type        : <0xb42>
    <cf8>   DW_AT_external    : 1
    <cf9>   DW_AT_declaration : 1
 <1><cfa>: Abbrev Number: 11 (DW_TAG_variable)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x1be): rwf_flags
    <cff>   DW_AT_decl_file   : 18
    <d00>   DW_AT_decl_line   : 440
    <d02>   DW_AT_decl_column : 26
    <d03>   DW_AT_type        : <0xb42>
    <d07>   DW_AT_external    : 1
    <d08>   DW_AT_declaration : 1
 <1><d09>: Abbrev Number: 11 (DW_TAG_variable)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x83a): seccomp_filter_flags
    <d0e>   DW_AT_decl_file   : 18
    <d0f>   DW_AT_decl_line   : 441
    <d11>   DW_AT_decl_column : 26
    <d12>   DW_AT_type        : <0xb42>
    <d16>   DW_AT_external    : 1
    <d17>   DW_AT_declaration : 1
 <1><d18>: Abbrev Number: 11 (DW_TAG_variable)
    <d19>   DW_AT_name        : (indirect string, offset: 0x2de): seccomp_ret_action
    <d1d>   DW_AT_decl_file   : 18
    <d1e>   DW_AT_decl_line   : 442
    <d20>   DW_AT_decl_column : 26
    <d21>   DW_AT_type        : <0xb42>
    <d25>   DW_AT_external    : 1
    <d26>   DW_AT_declaration : 1
 <1><d27>: Abbrev Number: 11 (DW_TAG_variable)
    <d28>   DW_AT_name        : (indirect string, offset: 0x424): setns_types
    <d2c>   DW_AT_decl_file   : 18
    <d2d>   DW_AT_decl_line   : 443
    <d2f>   DW_AT_decl_column : 26
    <d30>   DW_AT_type        : <0xb42>
    <d34>   DW_AT_external    : 1
    <d35>   DW_AT_declaration : 1
 <1><d36>: Abbrev Number: 11 (DW_TAG_variable)
    <d37>   DW_AT_name        : (indirect string, offset: 0xe34): sg_io_info
    <d3b>   DW_AT_decl_file   : 18
    <d3c>   DW_AT_decl_line   : 444
    <d3e>   DW_AT_decl_column : 26
    <d3f>   DW_AT_type        : <0xb42>
    <d43>   DW_AT_external    : 1
    <d44>   DW_AT_declaration : 1
 <1><d45>: Abbrev Number: 11 (DW_TAG_variable)
    <d46>   DW_AT_name        : (indirect string, offset: 0xba3): socketlayers
    <d4a>   DW_AT_decl_file   : 18
    <d4b>   DW_AT_decl_line   : 445
    <d4d>   DW_AT_decl_column : 26
    <d4e>   DW_AT_type        : <0xb42>
    <d52>   DW_AT_external    : 1
    <d53>   DW_AT_declaration : 1
 <1><d54>: Abbrev Number: 11 (DW_TAG_variable)
    <d55>   DW_AT_name        : (indirect string, offset: 0xd75): socktypes
    <d59>   DW_AT_decl_file   : 18
    <d5a>   DW_AT_decl_line   : 446
    <d5c>   DW_AT_decl_column : 26
    <d5d>   DW_AT_type        : <0xb42>
    <d61>   DW_AT_external    : 1
    <d62>   DW_AT_declaration : 1
 <1><d63>: Abbrev Number: 11 (DW_TAG_variable)
    <d64>   DW_AT_name        : (indirect string, offset: 0xa7d): tcp_state_flags
    <d68>   DW_AT_decl_file   : 18
    <d69>   DW_AT_decl_line   : 447
    <d6b>   DW_AT_decl_column : 26
    <d6c>   DW_AT_type        : <0xb42>
    <d70>   DW_AT_external    : 1
    <d71>   DW_AT_declaration : 1
 <1><d72>: Abbrev Number: 11 (DW_TAG_variable)
    <d73>   DW_AT_name        : (indirect string, offset: 0x745): tcp_states
    <d77>   DW_AT_decl_file   : 18
    <d78>   DW_AT_decl_line   : 448
    <d7a>   DW_AT_decl_column : 26
    <d7b>   DW_AT_type        : <0xb42>
    <d7f>   DW_AT_external    : 1
    <d80>   DW_AT_declaration : 1
 <1><d81>: Abbrev Number: 11 (DW_TAG_variable)
    <d82>   DW_AT_name        : (indirect string, offset: 0x1060): whence_codes
    <d86>   DW_AT_decl_file   : 18
    <d87>   DW_AT_decl_line   : 449
    <d89>   DW_AT_decl_column : 26
    <d8a>   DW_AT_type        : <0xb42>
    <d8e>   DW_AT_external    : 1
    <d8f>   DW_AT_declaration : 1
 <1><d90>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d91>   DW_AT_encoding    : 7	(unsigned)
    <d92>   DW_AT_byte_size   : 4
    <d93>   DW_AT_type        : <0x2b>
    <d97>   DW_AT_decl_file   : 18
    <d98>   DW_AT_decl_line   : 510
    <d9a>   DW_AT_decl_column : 14
    <d9b>   DW_AT_sibling     : <0xdb2>
 <2><d9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x996): CFLAG_NONE
    <da4>   DW_AT_const_value : 0
 <2><da5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x8d3): CFLAG_ONLY_STATS
    <daa>   DW_AT_const_value : 1
 <2><dab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dac>   DW_AT_name        : (indirect string, offset: 0xbb0): CFLAG_BOTH
    <db0>   DW_AT_const_value : 2
 <2><db1>: Abbrev Number: 0
 <1><db2>: Abbrev Number: 10 (DW_TAG_typedef)
    <db3>   DW_AT_name        : (indirect string, offset: 0x1102): cflag_t
    <db7>   DW_AT_decl_file   : 18
    <db8>   DW_AT_decl_line   : 514
    <dba>   DW_AT_decl_column : 3
    <dbb>   DW_AT_type        : <0xd90>
 <1><dbf>: Abbrev Number: 11 (DW_TAG_variable)
    <dc0>   DW_AT_name        : (indirect string, offset: 0xcc8): cflag
    <dc4>   DW_AT_decl_file   : 18
    <dc5>   DW_AT_decl_line   : 515
    <dc7>   DW_AT_decl_column : 16
    <dc8>   DW_AT_type        : <0xdb2>
    <dcc>   DW_AT_external    : 1
    <dcd>   DW_AT_declaration : 1
 <1><dce>: Abbrev Number: 11 (DW_TAG_variable)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x189): Tflag
    <dd3>   DW_AT_decl_file   : 18
    <dd4>   DW_AT_decl_line   : 516
    <dd6>   DW_AT_decl_column : 13
    <dd7>   DW_AT_type        : <0x52e>
    <ddb>   DW_AT_external    : 1
    <ddc>   DW_AT_declaration : 1
 <1><ddd>: Abbrev Number: 11 (DW_TAG_variable)
    <dde>   DW_AT_name        : (indirect string, offset: 0x7b5): Tflag_scale
    <de2>   DW_AT_decl_file   : 18
    <de3>   DW_AT_decl_line   : 517
    <de5>   DW_AT_decl_column : 12
    <de6>   DW_AT_type        : <0x64>
    <dea>   DW_AT_external    : 1
    <deb>   DW_AT_declaration : 1
 <1><dec>: Abbrev Number: 11 (DW_TAG_variable)
    <ded>   DW_AT_name        : (indirect string, offset: 0x84f): Tflag_width
    <df1>   DW_AT_decl_file   : 18
    <df2>   DW_AT_decl_line   : 518
    <df4>   DW_AT_decl_column : 12
    <df5>   DW_AT_type        : <0x64>
    <df9>   DW_AT_external    : 1
    <dfa>   DW_AT_declaration : 1
 <1><dfb>: Abbrev Number: 11 (DW_TAG_variable)
    <dfc>   DW_AT_name        : (indirect string, offset: 0xe26): iflag
    <e00>   DW_AT_decl_file   : 18
    <e01>   DW_AT_decl_line   : 519
    <e03>   DW_AT_decl_column : 13
    <e04>   DW_AT_type        : <0x52e>
    <e08>   DW_AT_external    : 1
    <e09>   DW_AT_declaration : 1
 <1><e0a>: Abbrev Number: 11 (DW_TAG_variable)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x592): count_wallclock
    <e0f>   DW_AT_decl_file   : 18
    <e10>   DW_AT_decl_line   : 520
    <e12>   DW_AT_decl_column : 13
    <e13>   DW_AT_type        : <0x52e>
    <e17>   DW_AT_external    : 1
    <e18>   DW_AT_declaration : 1
 <1><e19>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x53): path_set_item
    <e1e>   DW_AT_byte_size   : 4
    <e1f>   DW_AT_decl_file   : 18
    <e20>   DW_AT_decl_line   : 522
    <e22>   DW_AT_decl_column : 8
    <e23>   DW_AT_sibling     : <0xe38>
 <2><e27>: Abbrev Number: 23 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0xcc): path
    <e2c>   DW_AT_decl_file   : 18
    <e2d>   DW_AT_decl_line   : 523
    <e2f>   DW_AT_decl_column : 14
    <e30>   DW_AT_type        : <0x1e2>
    <e34>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e37>: Abbrev Number: 0
 <1><e38>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e39>   DW_AT_name        : (indirect string, offset: 0x750): path_set
    <e3d>   DW_AT_byte_size   : 12
    <e3e>   DW_AT_decl_file   : 18
    <e3f>   DW_AT_decl_line   : 527
    <e41>   DW_AT_decl_column : 15
    <e42>   DW_AT_sibling     : <0xe77>
 <2><e46>: Abbrev Number: 23 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0x6de): paths_selected
    <e4b>   DW_AT_decl_file   : 18
    <e4c>   DW_AT_decl_line   : 528
    <e4e>   DW_AT_decl_column : 24
    <e4f>   DW_AT_type        : <0xe77>
    <e53>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e56>: Abbrev Number: 23 (DW_TAG_member)
    <e57>   DW_AT_name        : (indirect string, offset: 0x1053): num_selected
    <e5b>   DW_AT_decl_file   : 18
    <e5c>   DW_AT_decl_line   : 529
    <e5e>   DW_AT_decl_column : 9
    <e5f>   DW_AT_type        : <0x12e>
    <e63>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e66>: Abbrev Number: 23 (DW_TAG_member)
    <e67>   DW_AT_name        : (indirect string, offset: 0xb60): size
    <e6b>   DW_AT_decl_file   : 18
    <e6c>   DW_AT_decl_line   : 530
    <e6e>   DW_AT_decl_column : 9
    <e6f>   DW_AT_type        : <0x12e>
    <e73>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e76>: Abbrev Number: 0
 <1><e77>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e78>   DW_AT_byte_size   : 4
    <e79>   DW_AT_type        : <0xe19>
 <1><e7d>: Abbrev Number: 11 (DW_TAG_variable)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x10a2): global_path_set
    <e82>   DW_AT_decl_file   : 18
    <e83>   DW_AT_decl_line   : 531
    <e85>   DW_AT_decl_column : 3
    <e86>   DW_AT_type        : <0xe38>
    <e8a>   DW_AT_external    : 1
    <e8b>   DW_AT_declaration : 1
 <1><e8c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e8d>   DW_AT_name        : (indirect string, offset: 0xf8c): xflag_opts
    <e91>   DW_AT_encoding    : 7	(unsigned)
    <e92>   DW_AT_byte_size   : 4
    <e93>   DW_AT_type        : <0x2b>
    <e97>   DW_AT_decl_file   : 18
    <e98>   DW_AT_decl_line   : 533
    <e9a>   DW_AT_decl_column : 6
    <e9b>   DW_AT_sibling     : <0xebe>
 <2><e9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xa1e): HEXSTR_NONE
    <ea4>   DW_AT_const_value : 0
 <2><ea5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xfdc): HEXSTR_NON_ASCII
    <eaa>   DW_AT_const_value : 1
 <2><eab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0x917): HEXSTR_ALL
    <eb0>   DW_AT_const_value : 2
 <2><eb1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x669): HEXSTR_NON_ASCII_CHARS
    <eb6>   DW_AT_const_value : 3
 <2><eb7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x106d): NUM_HEXSTR_OPTS
    <ebc>   DW_AT_const_value : 4
 <2><ebd>: Abbrev Number: 0
 <1><ebe>: Abbrev Number: 11 (DW_TAG_variable)
    <ebf>   DW_AT_name        : (indirect string, offset: 0xe00): xflag
    <ec3>   DW_AT_decl_file   : 18
    <ec4>   DW_AT_decl_line   : 546
    <ec6>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0x2b>
    <ecb>   DW_AT_external    : 1
    <ecc>   DW_AT_declaration : 1
 <1><ecd>: Abbrev Number: 11 (DW_TAG_variable)
    <ece>   DW_AT_name        : (indirect string, offset: 0xc83): followfork
    <ed2>   DW_AT_decl_file   : 18
    <ed3>   DW_AT_decl_line   : 547
    <ed5>   DW_AT_decl_column : 13
    <ed6>   DW_AT_type        : <0x52e>
    <eda>   DW_AT_external    : 1
    <edb>   DW_AT_declaration : 1
 <1><edc>: Abbrev Number: 11 (DW_TAG_variable)
    <edd>   DW_AT_name        : (indirect string, offset: 0x32c): output_separately
    <ee1>   DW_AT_decl_file   : 18
    <ee2>   DW_AT_decl_line   : 548
    <ee4>   DW_AT_decl_column : 13
    <ee5>   DW_AT_type        : <0x52e>
    <ee9>   DW_AT_external    : 1
    <eea>   DW_AT_declaration : 1
 <1><eeb>: Abbrev Number: 11 (DW_TAG_variable)
    <eec>   DW_AT_name        : (indirect string, offset: 0x225): stack_trace_enabled
    <ef0>   DW_AT_decl_file   : 18
    <ef1>   DW_AT_decl_line   : 551
    <ef3>   DW_AT_decl_column : 13
    <ef4>   DW_AT_type        : <0x52e>
    <ef8>   DW_AT_external    : 1
    <ef9>   DW_AT_declaration : 1
 <1><efa>: Abbrev Number: 11 (DW_TAG_variable)
    <efb>   DW_AT_name        : (indirect string, offset: 0x657): ptrace_setoptions
    <eff>   DW_AT_decl_file   : 18
    <f00>   DW_AT_decl_line   : 555
    <f02>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0x2b>
    <f07>   DW_AT_external    : 1
    <f08>   DW_AT_declaration : 1
 <1><f09>: Abbrev Number: 11 (DW_TAG_variable)
    <f0a>   DW_AT_name        : (indirect string, offset: 0xa13): max_strlen
    <f0e>   DW_AT_decl_file   : 18
    <f0f>   DW_AT_decl_line   : 556
    <f11>   DW_AT_decl_column : 17
    <f12>   DW_AT_type        : <0x2b>
    <f16>   DW_AT_external    : 1
    <f17>   DW_AT_declaration : 1
 <1><f18>: Abbrev Number: 11 (DW_TAG_variable)
    <f19>   DW_AT_name        : (indirect string, offset: 0xa57): os_release
    <f1d>   DW_AT_decl_file   : 18
    <f1e>   DW_AT_decl_line   : 557
    <f20>   DW_AT_decl_column : 17
    <f21>   DW_AT_type        : <0x2b>
    <f25>   DW_AT_external    : 1
    <f26>   DW_AT_declaration : 1
 <1><f27>: Abbrev Number: 11 (DW_TAG_variable)
    <f28>   DW_AT_name        : (indirect string, offset: 0x6ed): xlat_verbosity
    <f2c>   DW_AT_decl_file   : 18
    <f2d>   DW_AT_decl_line   : 919
    <f2f>   DW_AT_decl_column : 24
    <f30>   DW_AT_type        : <0xa65>
    <f34>   DW_AT_external    : 1
    <f35>   DW_AT_declaration : 1
 <1><f36>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f37>   DW_AT_name        : (indirect string, offset: 0x575): xlat_style_private_flag_bits
    <f3b>   DW_AT_encoding    : 7	(unsigned)
    <f3c>   DW_AT_byte_size   : 4
    <f3d>   DW_AT_type        : <0x2b>
    <f41>   DW_AT_decl_file   : 18
    <f42>   DW_AT_decl_line   : 939
    <f44>   DW_AT_decl_column : 6
    <f45>   DW_AT_sibling     : <0xf62>
 <2><f49>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x2ab): PAF_PRINT_INDICES_BIT
    <f4e>   DW_AT_const_value : 5
 <2><f4f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0xb17): PAF_ARRAY_TRUNCATED_BIT
    <f54>   DW_AT_const_value : 6
 <2><f55>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0x3e4): PXF_DEFAULT_STR_BIT
    <f5a>   DW_AT_const_value : 7
 <2><f5b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0xc65): SPFF_AUXSTR_MODE_BIT
    <f60>   DW_AT_const_value : 8
 <2><f61>: Abbrev Number: 0
 <1><f62>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f63>   DW_AT_name        : (indirect string, offset: 0xd14): find_xlat_flag_bits
    <f67>   DW_AT_encoding    : 7	(unsigned)
    <f68>   DW_AT_byte_size   : 4
    <f69>   DW_AT_type        : <0x2b>
    <f6d>   DW_AT_decl_file   : 18
    <f6e>   DW_AT_decl_line   : 1443
    <f70>   DW_AT_decl_column : 6
    <f71>   DW_AT_sibling     : <0xf7c>
 <2><f75>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f76>   DW_AT_name        : (indirect string, offset: 0x954): FXL_CASE_SENSITIVE_BIT
    <f7a>   DW_AT_const_value : 0
 <2><f7b>: Abbrev Number: 0
 <1><f7c>: Abbrev Number: 11 (DW_TAG_variable)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x9e1): printing_tcp
    <f81>   DW_AT_decl_file   : 18
    <f82>   DW_AT_decl_line   : 1689
    <f84>   DW_AT_decl_column : 20
    <f85>   DW_AT_type        : <0x60a>
    <f89>   DW_AT_external    : 1
    <f8a>   DW_AT_declaration : 1
 <1><f8b>: Abbrev Number: 11 (DW_TAG_variable)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x53d): errnoent
    <f90>   DW_AT_decl_file   : 18
    <f91>   DW_AT_decl_line   : 1887
    <f93>   DW_AT_decl_column : 26
    <f94>   DW_AT_type        : <0x462>
    <f98>   DW_AT_external    : 1
    <f99>   DW_AT_declaration : 1
 <1><f9a>: Abbrev Number: 11 (DW_TAG_variable)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x85b): signalent
    <f9f>   DW_AT_decl_file   : 18
    <fa0>   DW_AT_decl_line   : 1888
    <fa2>   DW_AT_decl_column : 26
    <fa3>   DW_AT_type        : <0x462>
    <fa7>   DW_AT_external    : 1
    <fa8>   DW_AT_declaration : 1
 <1><fa9>: Abbrev Number: 11 (DW_TAG_variable)
    <faa>   DW_AT_name        : (indirect string, offset: 0xe6e): nerrnos
    <fae>   DW_AT_decl_file   : 18
    <faf>   DW_AT_decl_line   : 1889
    <fb1>   DW_AT_decl_column : 27
    <fb2>   DW_AT_type        : <0x32>
    <fb6>   DW_AT_external    : 1
    <fb7>   DW_AT_declaration : 1
 <1><fb8>: Abbrev Number: 11 (DW_TAG_variable)
    <fb9>   DW_AT_name        : (indirect string, offset: 0x103c): nsignals
    <fbd>   DW_AT_decl_file   : 18
    <fbe>   DW_AT_decl_line   : 1890
    <fc0>   DW_AT_decl_column : 27
    <fc1>   DW_AT_type        : <0x32>
    <fc5>   DW_AT_external    : 1
    <fc6>   DW_AT_declaration : 1
 <1><fc7>: Abbrev Number: 16 (DW_TAG_array_type)
    <fc8>   DW_AT_type        : <0x884>
    <fcc>   DW_AT_sibling     : <0xfd2>
 <2><fd0>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fd1>: Abbrev Number: 0
 <1><fd2>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd3>   DW_AT_type        : <0xfc7>
 <1><fd7>: Abbrev Number: 11 (DW_TAG_variable)
    <fd8>   DW_AT_name        : (indirect string, offset: 0xcdf): sysent0
    <fdc>   DW_AT_decl_file   : 18
    <fdd>   DW_AT_decl_line   : 1892
    <fdf>   DW_AT_decl_column : 28
    <fe0>   DW_AT_type        : <0xfd2>
    <fe4>   DW_AT_external    : 1
    <fe5>   DW_AT_declaration : 1
 <1><fe6>: Abbrev Number: 16 (DW_TAG_array_type)
    <fe7>   DW_AT_type        : <0x8eb>
    <feb>   DW_AT_sibling     : <0xff1>
 <2><fef>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><ff0>: Abbrev Number: 0
 <1><ff1>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff2>   DW_AT_type        : <0xfe6>
 <1><ff6>: Abbrev Number: 11 (DW_TAG_variable)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x1098): ioctlent0
    <ffb>   DW_AT_decl_file   : 18
    <ffc>   DW_AT_decl_line   : 1893
    <ffe>   DW_AT_decl_column : 30
    <fff>   DW_AT_type        : <0xff1>
    <1003>   DW_AT_external    : 1
    <1004>   DW_AT_declaration : 1
 <1><1005>: Abbrev Number: 11 (DW_TAG_variable)
    <1006>   DW_AT_name        : (indirect string, offset: 0xf97): personality_names
    <100a>   DW_AT_decl_file   : 18
    <100b>   DW_AT_decl_line   : 1895
    <100d>   DW_AT_decl_column : 26
    <100e>   DW_AT_type        : <0x462>
    <1012>   DW_AT_external    : 1
    <1013>   DW_AT_declaration : 1
 <1><1014>: Abbrev Number: 11 (DW_TAG_variable)
    <1015>   DW_AT_name        : (indirect string, offset: 0x87b): sysent
    <1019>   DW_AT_decl_file   : 18
    <101a>   DW_AT_decl_line   : 1898
    <101c>   DW_AT_decl_column : 29
    <101d>   DW_AT_type        : <0x9d0>
    <1021>   DW_AT_external    : 1
    <1022>   DW_AT_declaration : 1
 <1><1023>: Abbrev Number: 11 (DW_TAG_variable)
    <1024>   DW_AT_name        : (indirect string, offset: 0xc7a): ioctlent
    <1028>   DW_AT_decl_file   : 18
    <1029>   DW_AT_decl_line   : 1899
    <102b>   DW_AT_decl_column : 31
    <102c>   DW_AT_type        : <0x1032>
    <1030>   DW_AT_external    : 1
    <1031>   DW_AT_declaration : 1
 <1><1032>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1033>   DW_AT_byte_size   : 4
    <1034>   DW_AT_type        : <0x8eb>
 <1><1038>: Abbrev Number: 11 (DW_TAG_variable)
    <1039>   DW_AT_name        : (indirect string, offset: 0x865): nsyscalls
    <103d>   DW_AT_decl_file   : 18
    <103e>   DW_AT_decl_line   : 1905
    <1040>   DW_AT_decl_column : 17
    <1041>   DW_AT_type        : <0x2b>
    <1045>   DW_AT_external    : 1
    <1046>   DW_AT_declaration : 1
 <1><1047>: Abbrev Number: 11 (DW_TAG_variable)
    <1048>   DW_AT_name        : (indirect string, offset: 0xe94): nioctlents
    <104c>   DW_AT_decl_file   : 18
    <104d>   DW_AT_decl_line   : 1906
    <104f>   DW_AT_decl_column : 17
    <1050>   DW_AT_type        : <0x2b>
    <1054>   DW_AT_external    : 1
    <1055>   DW_AT_declaration : 1
 <1><1056>: Abbrev Number: 16 (DW_TAG_array_type)
    <1057>   DW_AT_type        : <0x32>
    <105b>   DW_AT_sibling     : <0x1066>
 <2><105f>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1060>   DW_AT_type        : <0x2b>
    <1064>   DW_AT_upper_bound : 2
 <2><1065>: Abbrev Number: 0
 <1><1066>: Abbrev Number: 3 (DW_TAG_const_type)
    <1067>   DW_AT_type        : <0x1056>
 <1><106b>: Abbrev Number: 11 (DW_TAG_variable)
    <106c>   DW_AT_name        : (indirect string, offset: 0xef4): nsyscall_vec
    <1070>   DW_AT_decl_file   : 18
    <1071>   DW_AT_decl_line   : 1908
    <1073>   DW_AT_decl_column : 27
    <1074>   DW_AT_type        : <0x1066>
    <1078>   DW_AT_external    : 1
    <1079>   DW_AT_declaration : 1
 <1><107a>: Abbrev Number: 16 (DW_TAG_array_type)
    <107b>   DW_AT_type        : <0x9d6>
    <107f>   DW_AT_sibling     : <0x108a>
 <2><1083>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1084>   DW_AT_type        : <0x2b>
    <1088>   DW_AT_upper_bound : 2
 <2><1089>: Abbrev Number: 0
 <1><108a>: Abbrev Number: 3 (DW_TAG_const_type)
    <108b>   DW_AT_type        : <0x107a>
 <1><108f>: Abbrev Number: 11 (DW_TAG_variable)
    <1090>   DW_AT_name        : (indirect string, offset: 0x788): sysent_vec
    <1094>   DW_AT_decl_file   : 18
    <1095>   DW_AT_decl_line   : 1909
    <1097>   DW_AT_decl_column : 35
    <1098>   DW_AT_type        : <0x108a>
    <109c>   DW_AT_external    : 1
    <109d>   DW_AT_declaration : 1
 <1><109e>: Abbrev Number: 11 (DW_TAG_variable)
    <109f>   DW_AT_name        : (indirect string, offset: 0x385): inject_vec
    <10a3>   DW_AT_decl_file   : 18
    <10a4>   DW_AT_decl_line   : 1910
    <10a6>   DW_AT_decl_column : 28
    <10a7>   DW_AT_type        : <0x9db>
    <10ab>   DW_AT_external    : 1
    <10ac>   DW_AT_declaration : 1
 <1><10ad>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10ae>   DW_AT_name        : (indirect string, offset: 0xd68): audit_arch_t
    <10b2>   DW_AT_byte_size   : 8
    <10b3>   DW_AT_decl_file   : 18
    <10b4>   DW_AT_decl_line   : 1912
    <10b6>   DW_AT_decl_column : 8
    <10b7>   DW_AT_sibling     : <0x10dc>
 <2><10bb>: Abbrev Number: 23 (DW_TAG_member)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x567): arch
    <10c0>   DW_AT_decl_file   : 18
    <10c1>   DW_AT_decl_line   : 1913
    <10c3>   DW_AT_decl_column : 15
    <10c4>   DW_AT_type        : <0x2b>
    <10c8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10cb>: Abbrev Number: 23 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x9c7): flag
    <10d0>   DW_AT_decl_file   : 18
    <10d1>   DW_AT_decl_line   : 1914
    <10d3>   DW_AT_decl_column : 15
    <10d4>   DW_AT_type        : <0x2b>
    <10d8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10db>: Abbrev Number: 0
 <1><10dc>: Abbrev Number: 3 (DW_TAG_const_type)
    <10dd>   DW_AT_type        : <0x10ad>
 <1><10e1>: Abbrev Number: 16 (DW_TAG_array_type)
    <10e2>   DW_AT_type        : <0x10dc>
    <10e6>   DW_AT_sibling     : <0x10f1>
 <2><10ea>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <10eb>   DW_AT_type        : <0x2b>
    <10ef>   DW_AT_upper_bound : 2
 <2><10f0>: Abbrev Number: 0
 <1><10f1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f2>   DW_AT_type        : <0x10e1>
 <1><10f6>: Abbrev Number: 11 (DW_TAG_variable)
    <10f7>   DW_AT_name        : (indirect string, offset: 0x945): audit_arch_vec
    <10fb>   DW_AT_decl_file   : 18
    <10fc>   DW_AT_decl_line   : 1917
    <10fe>   DW_AT_decl_column : 34
    <10ff>   DW_AT_type        : <0x10f1>
    <1103>   DW_AT_external    : 1
    <1104>   DW_AT_declaration : 1
 <1><1105>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1106>   DW_AT_byte_size   : 180
    <1107>   DW_AT_decl_file   : 20
    <1108>   DW_AT_decl_line   : 2
    <1109>   DW_AT_decl_column : 9
    <110a>   DW_AT_sibling     : <0x13bf>
 <2><110e>: Abbrev Number: 9 (DW_TAG_member)
    <110f>   DW_AT_name        : (indirect string, offset: 0x1d6): block_ioctl
    <1113>   DW_AT_decl_file   : 20
    <1114>   DW_AT_decl_line   : 3
    <1115>   DW_AT_decl_column : 8
    <1116>   DW_AT_type        : <0x13d9>
    <111a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><111d>: Abbrev Number: 9 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0xab6): btrfs_ioctl
    <1122>   DW_AT_decl_file   : 20
    <1123>   DW_AT_decl_line   : 6
    <1124>   DW_AT_decl_column : 8
    <1125>   DW_AT_type        : <0x13d9>
    <1129>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><112c>: Abbrev Number: 9 (DW_TAG_member)
    <112d>   DW_AT_name        : (indirect string, offset: 0x726): evdev_write_ioctl_mpers
    <1131>   DW_AT_decl_file   : 20
    <1132>   DW_AT_decl_line   : 9
    <1133>   DW_AT_decl_column : 8
    <1134>   DW_AT_type        : <0x13d9>
    <1138>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><113b>: Abbrev Number: 9 (DW_TAG_member)
    <113c>   DW_AT_name        : (indirect string, offset: 0x6fc): get_sock_fprog_size
    <1140>   DW_AT_decl_file   : 20
    <1141>   DW_AT_decl_line   : 12
    <1142>   DW_AT_decl_column : 17
    <1143>   DW_AT_type        : <0x13e5>
    <1147>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><114a>: Abbrev Number: 9 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0x1a5): fetch_bpf_fprog
    <114f>   DW_AT_decl_file   : 20
    <1150>   DW_AT_decl_line   : 15
    <1151>   DW_AT_decl_column : 10
    <1152>   DW_AT_type        : <0x1405>
    <1156>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1159>: Abbrev Number: 9 (DW_TAG_member)
