Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1c2b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x654): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x7ec): mpers-m32/struct_rt_sigframe.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x104d): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3ff): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1200): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0xa79): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x949): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0x10b4): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x982): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x831): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xcaf): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0x1127): __uid_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 146
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0x2b>
 <1><ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0xce5): __off_t
    <b3>   DW_AT_decl_file   : 1
    <b4>   DW_AT_decl_line   : 152
    <b5>   DW_AT_decl_column : 25
    <b6>   DW_AT_type        : <0xba>
 <1><ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <bb>   DW_AT_byte_size   : 4
    <bc>   DW_AT_encoding    : 5	(signed)
    <bd>   DW_AT_name        : (indirect string, offset: 0x303): long int
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xe5c): __off64_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 153
    <c8>   DW_AT_decl_column : 27
    <c9>   DW_AT_type        : <0x7c>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xc3b): __pid_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 154
    <d4>   DW_AT_decl_column : 25
    <d5>   DW_AT_type        : <0x64>
 <1><d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0xb3c): __clock_t
    <de>   DW_AT_decl_file   : 1
    <df>   DW_AT_decl_line   : 156
    <e0>   DW_AT_decl_column : 27
    <e1>   DW_AT_type        : <0xba>
 <1><e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0xdd1): __time_t
    <ea>   DW_AT_decl_file   : 1
    <eb>   DW_AT_decl_line   : 160
    <ec>   DW_AT_decl_column : 26
    <ed>   DW_AT_type        : <0xba>
 <1><f1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <f4>   DW_AT_type        : <0xf1>
 <1><f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indirect string, offset: 0x453): __syscall_slong_t
    <fd>   DW_AT_decl_file   : 1
    <fe>   DW_AT_decl_line   : 196
    <ff>   DW_AT_decl_column : 33
    <100>   DW_AT_type        : <0xba>
 <1><104>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <105>   DW_AT_byte_size   : 4
    <106>   DW_AT_type        : <0x10a>
 <1><10a>: Abbrev Number: 2 (DW_TAG_base_type)
    <10b>   DW_AT_byte_size   : 1
    <10c>   DW_AT_encoding    : 6	(signed char)
    <10d>   DW_AT_name        : (indirect string, offset: 0x49f): char
 <1><111>: Abbrev Number: 3 (DW_TAG_const_type)
    <112>   DW_AT_type        : <0x10a>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0x393): uint8_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 24
    <11d>   DW_AT_decl_column : 19
    <11e>   DW_AT_type        : <0x45>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xcd0): uint16_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 25
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x58>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x1189): uint32_t
    <133>   DW_AT_decl_file   : 2
    <134>   DW_AT_decl_line   : 26
    <135>   DW_AT_decl_column : 20
    <136>   DW_AT_type        : <0x70>
 <1><13a>: Abbrev Number: 4 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0xf94): uint64_t
    <13f>   DW_AT_decl_file   : 2
    <140>   DW_AT_decl_line   : 27
    <141>   DW_AT_decl_column : 20
    <142>   DW_AT_type        : <0x8f>
 <1><146>: Abbrev Number: 4 (DW_TAG_typedef)
    <147>   DW_AT_name        : (indirect string, offset: 0x4e): size_t
    <14b>   DW_AT_decl_file   : 3
    <14c>   DW_AT_decl_line   : 209
    <14d>   DW_AT_decl_column : 23
    <14e>   DW_AT_type        : <0x2b>
 <1><152>: Abbrev Number: 3 (DW_TAG_const_type)
    <153>   DW_AT_type        : <0x146>
 <1><157>: Abbrev Number: 8 (DW_TAG_structure_type)
    <158>   DW_AT_byte_size   : 128
    <159>   DW_AT_decl_file   : 4
    <15a>   DW_AT_decl_line   : 5
    <15b>   DW_AT_decl_column : 9
    <15c>   DW_AT_sibling     : <0x170>
 <2><160>: Abbrev Number: 9 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x103c): __val
    <165>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 7
    <167>   DW_AT_decl_column : 21
    <168>   DW_AT_type        : <0x170>
    <16c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><16f>: Abbrev Number: 0
 <1><170>: Abbrev Number: 10 (DW_TAG_array_type)
    <171>   DW_AT_type        : <0x37>
    <175>   DW_AT_sibling     : <0x180>
 <2><179>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <17a>   DW_AT_type        : <0x2b>
    <17e>   DW_AT_upper_bound : 31
 <2><17f>: Abbrev Number: 0
 <1><180>: Abbrev Number: 4 (DW_TAG_typedef)
    <181>   DW_AT_name        : (indirect string, offset: 0x12c7): __sigset_t
    <185>   DW_AT_decl_file   : 4
    <186>   DW_AT_decl_line   : 8
    <187>   DW_AT_decl_column : 3
    <188>   DW_AT_type        : <0x157>
 <1><18c>: Abbrev Number: 4 (DW_TAG_typedef)
    <18d>   DW_AT_name        : (indirect string, offset: 0x16a): sigset_t
    <191>   DW_AT_decl_file   : 5
    <192>   DW_AT_decl_line   : 7
    <193>   DW_AT_decl_column : 20
    <194>   DW_AT_type        : <0x180>
 <1><198>: Abbrev Number: 12 (DW_TAG_structure_type)
    <199>   DW_AT_name        : (indirect string, offset: 0xc53): timespec
    <19d>   DW_AT_byte_size   : 8
    <19e>   DW_AT_decl_file   : 6
    <19f>   DW_AT_decl_line   : 10
    <1a0>   DW_AT_decl_column : 8
    <1a1>   DW_AT_sibling     : <0x1c4>
 <2><1a5>: Abbrev Number: 9 (DW_TAG_member)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x12dc): tv_sec
    <1aa>   DW_AT_decl_file   : 6
    <1ab>   DW_AT_decl_line   : 12
    <1ac>   DW_AT_decl_column : 12
    <1ad>   DW_AT_type        : <0xe5>
    <1b1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1b4>: Abbrev Number: 9 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xfc7): tv_nsec
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 16
    <1bb>   DW_AT_decl_column : 21
    <1bc>   DW_AT_type        : <0xf8>
    <1c0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1c3>: Abbrev Number: 0
 <1><1c4>: Abbrev Number: 2 (DW_TAG_base_type)
    <1c5>   DW_AT_byte_size   : 12
    <1c6>   DW_AT_encoding    : 4	(float)
    <1c7>   DW_AT_name        : (indirect string, offset: 0xbf9): long double
 <1><1cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <1cc>   DW_AT_byte_size   : 16
    <1cd>   DW_AT_encoding    : 4	(float)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x11c4): _Float128
 <1><1d2>: Abbrev Number: 13 (DW_TAG_variable)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x2ba): __environ
    <1d7>   DW_AT_decl_file   : 7
    <1d8>   DW_AT_decl_line   : 543
    <1da>   DW_AT_decl_column : 15
    <1db>   DW_AT_type        : <0x1e1>
    <1df>   DW_AT_external    : 1
    <1e0>   DW_AT_declaration : 1
 <1><1e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e2>   DW_AT_byte_size   : 4
    <1e3>   DW_AT_type        : <0x104>
 <1><1e7>: Abbrev Number: 13 (DW_TAG_variable)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x3ed): environ
    <1ec>   DW_AT_decl_file   : 7
    <1ed>   DW_AT_decl_line   : 545
    <1ef>   DW_AT_decl_column : 15
    <1f0>   DW_AT_type        : <0x1e1>
    <1f4>   DW_AT_external    : 1
    <1f5>   DW_AT_declaration : 1
 <1><1f6>: Abbrev Number: 14 (DW_TAG_variable)
    <1f7>   DW_AT_name        : (indirect string, offset: 0x11ea): optarg
    <1fb>   DW_AT_decl_file   : 8
    <1fc>   DW_AT_decl_line   : 36
    <1fd>   DW_AT_decl_column : 14
    <1fe>   DW_AT_type        : <0x104>
    <202>   DW_AT_external    : 1
    <203>   DW_AT_declaration : 1
 <1><204>: Abbrev Number: 14 (DW_TAG_variable)
    <205>   DW_AT_name        : (indirect string, offset: 0x7e5): optind
    <209>   DW_AT_decl_file   : 8
    <20a>   DW_AT_decl_line   : 50
    <20b>   DW_AT_decl_column : 12
    <20c>   DW_AT_type        : <0x64>
    <210>   DW_AT_external    : 1
    <211>   DW_AT_declaration : 1
 <1><212>: Abbrev Number: 14 (DW_TAG_variable)
    <213>   DW_AT_name        : (indirect string, offset: 0xdc0): opterr
    <217>   DW_AT_decl_file   : 8
    <218>   DW_AT_decl_line   : 55
    <219>   DW_AT_decl_column : 12
    <21a>   DW_AT_type        : <0x64>
    <21e>   DW_AT_external    : 1
    <21f>   DW_AT_declaration : 1
 <1><220>: Abbrev Number: 14 (DW_TAG_variable)
    <221>   DW_AT_name        : (indirect string, offset: 0xc95): optopt
    <225>   DW_AT_decl_file   : 8
    <226>   DW_AT_decl_line   : 59
    <227>   DW_AT_decl_column : 12
    <228>   DW_AT_type        : <0x64>
    <22c>   DW_AT_external    : 1
    <22d>   DW_AT_declaration : 1
 <1><22e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <22f>   DW_AT_byte_size   : 4
    <230>   DW_AT_type        : <0x111>
 <1><234>: Abbrev Number: 3 (DW_TAG_const_type)
    <235>   DW_AT_type        : <0x22e>
 <1><239>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <23a>   DW_AT_byte_size   : 4
    <23b>   DW_AT_type        : <0x23f>
 <1><23f>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><240>: Abbrev Number: 12 (DW_TAG_structure_type)
    <241>   DW_AT_name        : (indirect string, offset: 0x39b): _IO_FILE
    <245>   DW_AT_byte_size   : 148
    <246>   DW_AT_decl_file   : 9
    <247>   DW_AT_decl_line   : 49
    <248>   DW_AT_decl_column : 8
    <249>   DW_AT_sibling     : <0x401>
 <2><24d>: Abbrev Number: 9 (DW_TAG_member)
    <24e>   DW_AT_name        : (indirect string, offset: 0xb2a): _flags
    <252>   DW_AT_decl_file   : 9
    <253>   DW_AT_decl_line   : 51
    <254>   DW_AT_decl_column : 7
    <255>   DW_AT_type        : <0x64>
    <259>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><25c>: Abbrev Number: 9 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x54d): _IO_read_ptr
    <261>   DW_AT_decl_file   : 9
    <262>   DW_AT_decl_line   : 54
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x104>
    <268>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><26b>: Abbrev Number: 9 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0x112f): _IO_read_end
    <270>   DW_AT_decl_file   : 9
    <271>   DW_AT_decl_line   : 55
    <272>   DW_AT_decl_column : 9
    <273>   DW_AT_type        : <0x104>
    <277>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><27a>: Abbrev Number: 9 (DW_TAG_member)
    <27b>   DW_AT_name        : (indirect string, offset: 0x87a): _IO_read_base
    <27f>   DW_AT_decl_file   : 9
    <280>   DW_AT_decl_line   : 56
    <281>   DW_AT_decl_column : 9
    <282>   DW_AT_type        : <0x104>
    <286>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><289>: Abbrev Number: 9 (DW_TAG_member)
    <28a>   DW_AT_name        : (indirect string, offset: 0xb01): _IO_write_base
    <28e>   DW_AT_decl_file   : 9
    <28f>   DW_AT_decl_line   : 57
    <290>   DW_AT_decl_column : 9
    <291>   DW_AT_type        : <0x104>
    <295>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><298>: Abbrev Number: 9 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x1239): _IO_write_ptr
    <29d>   DW_AT_decl_file   : 9
    <29e>   DW_AT_decl_line   : 58
    <29f>   DW_AT_decl_column : 9
    <2a0>   DW_AT_type        : <0x104>
    <2a4>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><2a7>: Abbrev Number: 9 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x9d6): _IO_write_end
    <2ac>   DW_AT_decl_file   : 9
    <2ad>   DW_AT_decl_line   : 59
    <2ae>   DW_AT_decl_column : 9
    <2af>   DW_AT_type        : <0x104>
    <2b3>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><2b6>: Abbrev Number: 9 (DW_TAG_member)
    <2b7>   DW_AT_name        : (indirect string, offset: 0xa53): _IO_buf_base
    <2bb>   DW_AT_decl_file   : 9
    <2bc>   DW_AT_decl_line   : 60
    <2bd>   DW_AT_decl_column : 9
    <2be>   DW_AT_type        : <0x104>
    <2c2>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><2c5>: Abbrev Number: 9 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0xf15): _IO_buf_end
    <2ca>   DW_AT_decl_file   : 9
    <2cb>   DW_AT_decl_line   : 61
    <2cc>   DW_AT_decl_column : 9
    <2cd>   DW_AT_type        : <0x104>
    <2d1>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2d4>: Abbrev Number: 9 (DW_TAG_member)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x20e): _IO_save_base
    <2d9>   DW_AT_decl_file   : 9
    <2da>   DW_AT_decl_line   : 64
    <2db>   DW_AT_decl_column : 9
    <2dc>   DW_AT_type        : <0x104>
    <2e0>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2e3>: Abbrev Number: 9 (DW_TAG_member)
    <2e4>   DW_AT_name        : (indirect string, offset: 0xe23): _IO_backup_base
    <2e8>   DW_AT_decl_file   : 9
    <2e9>   DW_AT_decl_line   : 65
    <2ea>   DW_AT_decl_column : 9
    <2eb>   DW_AT_type        : <0x104>
    <2ef>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2f2>: Abbrev Number: 9 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0xdf): _IO_save_end
    <2f7>   DW_AT_decl_file   : 9
    <2f8>   DW_AT_decl_line   : 66
    <2f9>   DW_AT_decl_column : 9
    <2fa>   DW_AT_type        : <0x104>
    <2fe>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><301>: Abbrev Number: 9 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x600): _markers
    <306>   DW_AT_decl_file   : 9
    <307>   DW_AT_decl_line   : 68
    <308>   DW_AT_decl_column : 22
    <309>   DW_AT_type        : <0x41b>
    <30d>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><310>: Abbrev Number: 9 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x251): _chain
    <315>   DW_AT_decl_file   : 9
    <316>   DW_AT_decl_line   : 70
    <317>   DW_AT_decl_column : 20
    <318>   DW_AT_type        : <0x421>
    <31c>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><31f>: Abbrev Number: 9 (DW_TAG_member)
    <320>   DW_AT_name        : (indirect string, offset: 0x11af): _fileno
    <324>   DW_AT_decl_file   : 9
    <325>   DW_AT_decl_line   : 72
    <326>   DW_AT_decl_column : 7
    <327>   DW_AT_type        : <0x64>
    <32b>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><32e>: Abbrev Number: 9 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x866): _flags2
    <333>   DW_AT_decl_file   : 9
    <334>   DW_AT_decl_line   : 73
    <335>   DW_AT_decl_column : 7
    <336>   DW_AT_type        : <0x64>
    <33a>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><33d>: Abbrev Number: 9 (DW_TAG_member)
    <33e>   DW_AT_name        : (indirect string, offset: 0x8f5): _old_offset
    <342>   DW_AT_decl_file   : 9
    <343>   DW_AT_decl_line   : 74
    <344>   DW_AT_decl_column : 11
    <345>   DW_AT_type        : <0xae>
    <349>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><34c>: Abbrev Number: 9 (DW_TAG_member)
    <34d>   DW_AT_name        : (indirect string, offset: 0x27f): _cur_column
    <351>   DW_AT_decl_file   : 9
    <352>   DW_AT_decl_line   : 77
    <353>   DW_AT_decl_column : 18
    <354>   DW_AT_type        : <0x24>
    <358>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><35b>: Abbrev Number: 9 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0xfed): _vtable_offset
    <360>   DW_AT_decl_file   : 9
    <361>   DW_AT_decl_line   : 78
    <362>   DW_AT_decl_column : 15
    <363>   DW_AT_type        : <0x3e>
    <367>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><36a>: Abbrev Number: 9 (DW_TAG_member)
    <36b>   DW_AT_name        : (indirect string, offset: 0xe33): _shortbuf
    <36f>   DW_AT_decl_file   : 9
    <370>   DW_AT_decl_line   : 79
    <371>   DW_AT_decl_column : 8
    <372>   DW_AT_type        : <0x427>
    <376>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><379>: Abbrev Number: 9 (DW_TAG_member)
    <37a>   DW_AT_name        : (indirect string, offset: 0x1a5): _lock
    <37e>   DW_AT_decl_file   : 9
    <37f>   DW_AT_decl_line   : 81
    <380>   DW_AT_decl_column : 15
    <381>   DW_AT_type        : <0x437>
    <385>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><388>: Abbrev Number: 9 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0x773): _offset
    <38d>   DW_AT_decl_file   : 9
    <38e>   DW_AT_decl_line   : 89
    <38f>   DW_AT_decl_column : 13
    <390>   DW_AT_type        : <0xc1>
    <394>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><397>: Abbrev Number: 9 (DW_TAG_member)
    <398>   DW_AT_name        : (indirect string, offset: 0xb74): _codecvt
    <39c>   DW_AT_decl_file   : 9
    <39d>   DW_AT_decl_line   : 91
    <39e>   DW_AT_decl_column : 23
    <39f>   DW_AT_type        : <0x443>
    <3a3>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><3a6>: Abbrev Number: 9 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x11ce): _wide_data
    <3ab>   DW_AT_decl_file   : 9
    <3ac>   DW_AT_decl_line   : 92
    <3ad>   DW_AT_decl_column : 25
    <3ae>   DW_AT_type        : <0x44f>
    <3b2>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><3b5>: Abbrev Number: 9 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x41b): _freeres_list
    <3ba>   DW_AT_decl_file   : 9
    <3bb>   DW_AT_decl_line   : 93
    <3bc>   DW_AT_decl_column : 20
    <3bd>   DW_AT_type        : <0x421>
    <3c1>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><3c4>: Abbrev Number: 9 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0xd89): _freeres_buf
    <3c9>   DW_AT_decl_file   : 9
    <3ca>   DW_AT_decl_line   : 94
    <3cb>   DW_AT_decl_column : 9
    <3cc>   DW_AT_type        : <0xf1>
    <3d0>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><3d3>: Abbrev Number: 9 (DW_TAG_member)
    <3d4>   DW_AT_name        : (indirect string, offset: 0xaca): __pad5
    <3d8>   DW_AT_decl_file   : 9
    <3d9>   DW_AT_decl_line   : 95
    <3da>   DW_AT_decl_column : 10
    <3db>   DW_AT_type        : <0x146>
    <3df>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3e2>: Abbrev Number: 9 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0xb58): _mode
    <3e7>   DW_AT_decl_file   : 9
    <3e8>   DW_AT_decl_line   : 96
    <3e9>   DW_AT_decl_column : 7
    <3ea>   DW_AT_type        : <0x64>
    <3ee>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3f1>: Abbrev Number: 9 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x894): _unused2
    <3f6>   DW_AT_decl_file   : 9
    <3f7>   DW_AT_decl_line   : 98
    <3f8>   DW_AT_decl_column : 8
    <3f9>   DW_AT_type        : <0x455>
    <3fd>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><400>: Abbrev Number: 0
 <1><401>: Abbrev Number: 4 (DW_TAG_typedef)
    <402>   DW_AT_name        : (indirect string, offset: 0xc36): FILE
    <406>   DW_AT_decl_file   : 10
    <407>   DW_AT_decl_line   : 7
    <408>   DW_AT_decl_column : 25
    <409>   DW_AT_type        : <0x240>
 <1><40d>: Abbrev Number: 16 (DW_TAG_typedef)
    <40e>   DW_AT_name        : (indirect string, offset: 0x4dc): _IO_lock_t
    <412>   DW_AT_decl_file   : 9
    <413>   DW_AT_decl_line   : 43
    <414>   DW_AT_decl_column : 14
 <1><415>: Abbrev Number: 17 (DW_TAG_structure_type)
    <416>   DW_AT_name        : (indirect string, offset: 0x345): _IO_marker
    <41a>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41c>   DW_AT_byte_size   : 4
    <41d>   DW_AT_type        : <0x415>
 <1><421>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <422>   DW_AT_byte_size   : 4
    <423>   DW_AT_type        : <0x240>
 <1><427>: Abbrev Number: 10 (DW_TAG_array_type)
    <428>   DW_AT_type        : <0x10a>
    <42c>   DW_AT_sibling     : <0x437>
 <2><430>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <431>   DW_AT_type        : <0x2b>
    <435>   DW_AT_upper_bound : 0
 <2><436>: Abbrev Number: 0
 <1><437>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <438>   DW_AT_byte_size   : 4
    <439>   DW_AT_type        : <0x40d>
 <1><43d>: Abbrev Number: 17 (DW_TAG_structure_type)
    <43e>   DW_AT_name        : (indirect string, offset: 0xa2): _IO_codecvt
    <442>   DW_AT_declaration : 1
 <1><443>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <444>   DW_AT_byte_size   : 4
    <445>   DW_AT_type        : <0x43d>
 <1><449>: Abbrev Number: 17 (DW_TAG_structure_type)
    <44a>   DW_AT_name        : (indirect string, offset: 0x3af): _IO_wide_data
    <44e>   DW_AT_declaration : 1
 <1><44f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <450>   DW_AT_byte_size   : 4
    <451>   DW_AT_type        : <0x449>
 <1><455>: Abbrev Number: 10 (DW_TAG_array_type)
    <456>   DW_AT_type        : <0x10a>
    <45a>   DW_AT_sibling     : <0x465>
 <2><45e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <45f>   DW_AT_type        : <0x2b>
    <463>   DW_AT_upper_bound : 39
 <2><464>: Abbrev Number: 0
 <1><465>: Abbrev Number: 14 (DW_TAG_variable)
    <466>   DW_AT_name        : (indirect string, offset: 0x5c0): stdin
    <46a>   DW_AT_decl_file   : 11
    <46b>   DW_AT_decl_line   : 137
    <46c>   DW_AT_decl_column : 14
    <46d>   DW_AT_type        : <0x473>
    <471>   DW_AT_external    : 1
    <472>   DW_AT_declaration : 1
 <1><473>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <474>   DW_AT_byte_size   : 4
    <475>   DW_AT_type        : <0x401>
 <1><479>: Abbrev Number: 14 (DW_TAG_variable)
    <47a>   DW_AT_name        : (indirect string, offset: 0x1213): stdout
    <47e>   DW_AT_decl_file   : 11
    <47f>   DW_AT_decl_line   : 138
    <480>   DW_AT_decl_column : 14
    <481>   DW_AT_type        : <0x473>
    <485>   DW_AT_external    : 1
    <486>   DW_AT_declaration : 1
 <1><487>: Abbrev Number: 14 (DW_TAG_variable)
    <488>   DW_AT_name        : (indirect string, offset: 0xf7d): stderr
    <48c>   DW_AT_decl_file   : 11
    <48d>   DW_AT_decl_line   : 139
    <48e>   DW_AT_decl_column : 14
    <48f>   DW_AT_type        : <0x473>
    <493>   DW_AT_external    : 1
    <494>   DW_AT_declaration : 1
 <1><495>: Abbrev Number: 14 (DW_TAG_variable)
    <496>   DW_AT_name        : (indirect string, offset: 0x28b): sys_nerr
    <49a>   DW_AT_decl_file   : 12
    <49b>   DW_AT_decl_line   : 26
    <49c>   DW_AT_decl_column : 12
    <49d>   DW_AT_type        : <0x64>
    <4a1>   DW_AT_external    : 1
    <4a2>   DW_AT_declaration : 1
 <1><4a3>: Abbrev Number: 10 (DW_TAG_array_type)
    <4a4>   DW_AT_type        : <0x234>
    <4a8>   DW_AT_sibling     : <0x4ae>
 <2><4ac>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><4ad>: Abbrev Number: 0
 <1><4ae>: Abbrev Number: 3 (DW_TAG_const_type)
    <4af>   DW_AT_type        : <0x4a3>
 <1><4b3>: Abbrev Number: 14 (DW_TAG_variable)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x5cf): sys_errlist
    <4b8>   DW_AT_decl_file   : 12
    <4b9>   DW_AT_decl_line   : 27
    <4ba>   DW_AT_decl_column : 26
    <4bb>   DW_AT_type        : <0x4ae>
    <4bf>   DW_AT_external    : 1
    <4c0>   DW_AT_declaration : 1
 <1><4c1>: Abbrev Number: 14 (DW_TAG_variable)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x2a7): _sys_nerr
    <4c6>   DW_AT_decl_file   : 12
    <4c7>   DW_AT_decl_line   : 30
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0x64>
    <4cd>   DW_AT_external    : 1
    <4ce>   DW_AT_declaration : 1
 <1><4cf>: Abbrev Number: 14 (DW_TAG_variable)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xffc): _sys_errlist
    <4d4>   DW_AT_decl_file   : 12
    <4d5>   DW_AT_decl_line   : 31
    <4d6>   DW_AT_decl_column : 26
    <4d7>   DW_AT_type        : <0x4ae>
    <4db>   DW_AT_external    : 1
    <4dc>   DW_AT_declaration : 1
 <1><4dd>: Abbrev Number: 14 (DW_TAG_variable)
    <4de>   DW_AT_name        : (indirect string, offset: 0x74c): program_invocation_name
    <4e2>   DW_AT_decl_file   : 13
    <4e3>   DW_AT_decl_line   : 45
    <4e4>   DW_AT_decl_column : 14
    <4e5>   DW_AT_type        : <0x104>
    <4e9>   DW_AT_external    : 1
    <4ea>   DW_AT_declaration : 1
 <1><4eb>: Abbrev Number: 14 (DW_TAG_variable)
    <4ec>   DW_AT_name        : (indirect string, offset: 0xd1f): program_invocation_short_name
    <4f0>   DW_AT_decl_file   : 13
    <4f1>   DW_AT_decl_line   : 46
    <4f2>   DW_AT_decl_column : 14
    <4f3>   DW_AT_type        : <0x104>
    <4f7>   DW_AT_external    : 1
    <4f8>   DW_AT_declaration : 1
 <1><4f9>: Abbrev Number: 10 (DW_TAG_array_type)
    <4fa>   DW_AT_type        : <0x104>
    <4fe>   DW_AT_sibling     : <0x509>
 <2><502>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <503>   DW_AT_type        : <0x2b>
    <507>   DW_AT_upper_bound : 1
 <2><508>: Abbrev Number: 0
 <1><509>: Abbrev Number: 14 (DW_TAG_variable)
    <50a>   DW_AT_name        : (indirect string, offset: 0x1fb): __tzname
    <50e>   DW_AT_decl_file   : 14
    <50f>   DW_AT_decl_line   : 159
    <510>   DW_AT_decl_column : 14
    <511>   DW_AT_type        : <0x4f9>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 14 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x109b): __daylight
    <51c>   DW_AT_decl_file   : 14
    <51d>   DW_AT_decl_line   : 160
    <51e>   DW_AT_decl_column : 12
    <51f>   DW_AT_type        : <0x64>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 14 (DW_TAG_variable)
    <526>   DW_AT_name        : (indirect string, offset: 0x3a4): __timezone
    <52a>   DW_AT_decl_file   : 14
    <52b>   DW_AT_decl_line   : 161
    <52c>   DW_AT_decl_column : 17
    <52d>   DW_AT_type        : <0xba>
    <531>   DW_AT_external    : 1
    <532>   DW_AT_declaration : 1
 <1><533>: Abbrev Number: 14 (DW_TAG_variable)
    <534>   DW_AT_name        : (indirect string, offset: 0xaba): tzname
    <538>   DW_AT_decl_file   : 14
    <539>   DW_AT_decl_line   : 166
    <53a>   DW_AT_decl_column : 14
    <53b>   DW_AT_type        : <0x4f9>
    <53f>   DW_AT_external    : 1
    <540>   DW_AT_declaration : 1
 <1><541>: Abbrev Number: 14 (DW_TAG_variable)
    <542>   DW_AT_name        : (indirect string, offset: 0x1283): daylight
    <546>   DW_AT_decl_file   : 14
    <547>   DW_AT_decl_line   : 174
    <548>   DW_AT_decl_column : 12
    <549>   DW_AT_type        : <0x64>
    <54d>   DW_AT_external    : 1
    <54e>   DW_AT_declaration : 1
 <1><54f>: Abbrev Number: 14 (DW_TAG_variable)
    <550>   DW_AT_name        : (indirect string, offset: 0x521): timezone
    <554>   DW_AT_decl_file   : 14
    <555>   DW_AT_decl_line   : 175
    <556>   DW_AT_decl_column : 17
    <557>   DW_AT_type        : <0xba>
    <55b>   DW_AT_external    : 1
    <55c>   DW_AT_declaration : 1
 <1><55d>: Abbrev Number: 13 (DW_TAG_variable)
    <55e>   DW_AT_name        : (indirect string, offset: 0x1156): getdate_err
    <562>   DW_AT_decl_file   : 14
    <563>   DW_AT_decl_line   : 274
    <565>   DW_AT_decl_column : 12
    <566>   DW_AT_type        : <0x64>
    <56a>   DW_AT_external    : 1
    <56b>   DW_AT_declaration : 1
 <1><56c>: Abbrev Number: 14 (DW_TAG_variable)
    <56d>   DW_AT_name        : (indirect string, offset: 0xad6): debug_flag
    <571>   DW_AT_decl_file   : 15
    <572>   DW_AT_decl_line   : 20
    <573>   DW_AT_decl_column : 13
    <574>   DW_AT_type        : <0x57a>
    <578>   DW_AT_external    : 1
    <579>   DW_AT_declaration : 1
 <1><57a>: Abbrev Number: 2 (DW_TAG_base_type)
    <57b>   DW_AT_byte_size   : 1
    <57c>   DW_AT_encoding    : 2	(boolean)
    <57d>   DW_AT_name        : (indirect string, offset: 0x465): _Bool
 <1><581>: Abbrev Number: 3 (DW_TAG_const_type)
    <582>   DW_AT_type        : <0x57a>
 <1><586>: Abbrev Number: 4 (DW_TAG_typedef)
    <587>   DW_AT_name        : (indirect string, offset: 0xbb8): __kernel_long_t
    <58b>   DW_AT_decl_file   : 16
    <58c>   DW_AT_decl_line   : 15
    <58d>   DW_AT_decl_column : 15
    <58e>   DW_AT_type        : <0xba>
 <1><592>: Abbrev Number: 4 (DW_TAG_typedef)
    <593>   DW_AT_name        : (indirect string, offset: 0x5af): __kernel_ulong_t
    <597>   DW_AT_decl_file   : 16
    <598>   DW_AT_decl_line   : 16
    <599>   DW_AT_decl_column : 23
    <59a>   DW_AT_type        : <0x37>
 <1><59e>: Abbrev Number: 4 (DW_TAG_typedef)
    <59f>   DW_AT_name        : (indirect string, offset: 0x429): kernel_long_t
    <5a3>   DW_AT_decl_file   : 17
    <5a4>   DW_AT_decl_line   : 16
    <5a5>   DW_AT_decl_column : 25
    <5a6>   DW_AT_type        : <0x586>
 <1><5aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x973): kernel_ulong_t
    <5af>   DW_AT_decl_file   : 17
    <5b0>   DW_AT_decl_line   : 17
    <5b1>   DW_AT_decl_column : 26
    <5b2>   DW_AT_type        : <0x592>
 <1><5b6>: Abbrev Number: 3 (DW_TAG_const_type)
    <5b7>   DW_AT_type        : <0x5aa>
 <1><5bb>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5bc>   DW_AT_name        : (indirect string, offset: 0xd3d): list_item
    <5c0>   DW_AT_byte_size   : 8
    <5c1>   DW_AT_decl_file   : 18
    <5c2>   DW_AT_decl_line   : 92
    <5c3>   DW_AT_decl_column : 8
    <5c4>   DW_AT_sibling     : <0x5e7>
 <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x12d7): prev
    <5cd>   DW_AT_decl_file   : 18
    <5ce>   DW_AT_decl_line   : 93
    <5cf>   DW_AT_decl_column : 20
    <5d0>   DW_AT_type        : <0x5e7>
    <5d4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d7>: Abbrev Number: 9 (DW_TAG_member)
    <5d8>   DW_AT_name        : (indirect string, offset: 0xbc8): next
    <5dc>   DW_AT_decl_file   : 18
    <5dd>   DW_AT_decl_line   : 94
    <5de>   DW_AT_decl_column : 20
    <5df>   DW_AT_type        : <0x5e7>
    <5e3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e6>: Abbrev Number: 0
 <1><5e7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5e8>   DW_AT_byte_size   : 4
    <5e9>   DW_AT_type        : <0x5bb>
 <1><5ed>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x942): sysent
    <5f2>   DW_AT_byte_size   : 20
    <5f3>   DW_AT_decl_file   : 19
    <5f4>   DW_AT_decl_line   : 13
    <5f5>   DW_AT_decl_column : 16
    <5f6>   DW_AT_sibling     : <0x646>
 <2><5fa>: Abbrev Number: 9 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x122a): nargs
    <5ff>   DW_AT_decl_file   : 19
    <600>   DW_AT_decl_line   : 14
    <601>   DW_AT_decl_column : 11
    <602>   DW_AT_type        : <0x2b>
    <606>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><609>: Abbrev Number: 9 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xa6f): sys_flags
    <60e>   DW_AT_decl_file   : 19
    <60f>   DW_AT_decl_line   : 15
    <610>   DW_AT_decl_column : 6
    <611>   DW_AT_type        : <0x64>
    <615>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><618>: Abbrev Number: 19 (DW_TAG_member)
    <619>   DW_AT_name        : sen
    <61d>   DW_AT_decl_file   : 19
    <61e>   DW_AT_decl_line   : 16
    <61f>   DW_AT_decl_column : 6
    <620>   DW_AT_type        : <0x64>
    <624>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><627>: Abbrev Number: 9 (DW_TAG_member)
    <628>   DW_AT_name        : (indirect string, offset: 0x33c): sys_func
    <62c>   DW_AT_decl_file   : 19
    <62d>   DW_AT_decl_line   : 17
    <62e>   DW_AT_decl_column : 8
    <62f>   DW_AT_type        : <0x8ad>
    <633>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><636>: Abbrev Number: 9 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x2b1): sys_name
    <63b>   DW_AT_decl_file   : 19
    <63c>   DW_AT_decl_line   : 18
    <63d>   DW_AT_decl_column : 14
    <63e>   DW_AT_type        : <0x22e>
    <642>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><645>: Abbrev Number: 0
 <1><646>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <647>   DW_AT_prototyped  : 1
    <648>   DW_AT_type        : <0x64>
    <64c>   DW_AT_sibling     : <0x656>
 <2><650>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <651>   DW_AT_type        : <0x656>
 <2><655>: Abbrev Number: 0
 <1><656>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <657>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x661>
 <1><65c>: Abbrev Number: 3 (DW_TAG_const_type)
    <65d>   DW_AT_type        : <0x656>
 <1><661>: Abbrev Number: 22 (DW_TAG_structure_type)
    <662>   DW_AT_name        : tcb
    <666>   DW_AT_byte_size   : 204
    <667>   DW_AT_decl_file   : 20
    <668>   DW_AT_decl_line   : 262
    <66a>   DW_AT_decl_column : 8
    <66b>   DW_AT_sibling     : <0x8ad>
 <2><66f>: Abbrev Number: 23 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0x539): flags
    <674>   DW_AT_decl_file   : 20
    <675>   DW_AT_decl_line   : 263
    <677>   DW_AT_decl_column : 6
    <678>   DW_AT_type        : <0x64>
    <67c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><67f>: Abbrev Number: 24 (DW_TAG_member)
    <680>   DW_AT_name        : pid
    <684>   DW_AT_decl_file   : 20
    <685>   DW_AT_decl_line   : 264
    <687>   DW_AT_decl_column : 6
    <688>   DW_AT_type        : <0x64>
    <68c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><68f>: Abbrev Number: 23 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x81): qual_flg
    <694>   DW_AT_decl_file   : 20
    <695>   DW_AT_decl_line   : 265
    <697>   DW_AT_decl_column : 6
    <698>   DW_AT_type        : <0x64>
    <69c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><69f>: Abbrev Number: 23 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x3d1): currpers
    <6a4>   DW_AT_decl_file   : 20
    <6a5>   DW_AT_decl_line   : 267
    <6a7>   DW_AT_decl_column : 15
    <6a8>   DW_AT_type        : <0x2b>
    <6ac>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><6af>: Abbrev Number: 23 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0xc8d): u_error
    <6b4>   DW_AT_decl_file   : 20
    <6b5>   DW_AT_decl_line   : 269
    <6b7>   DW_AT_decl_column : 16
    <6b8>   DW_AT_type        : <0x37>
    <6bc>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><6bf>: Abbrev Number: 23 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x1db): scno
    <6c4>   DW_AT_decl_file   : 20
    <6c5>   DW_AT_decl_line   : 270
    <6c7>   DW_AT_decl_column : 17
    <6c8>   DW_AT_type        : <0x5aa>
    <6cc>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><6cf>: Abbrev Number: 23 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xcc6): true_scno
    <6d4>   DW_AT_decl_file   : 20
    <6d5>   DW_AT_decl_line   : 271
    <6d7>   DW_AT_decl_column : 17
    <6d8>   DW_AT_type        : <0x5aa>
    <6dc>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6df>: Abbrev Number: 23 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x1e5): u_arg
    <6e4>   DW_AT_decl_file   : 20
    <6e5>   DW_AT_decl_line   : 272
    <6e7>   DW_AT_decl_column : 17
    <6e8>   DW_AT_type        : <0x9dd>
    <6ec>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6ef>: Abbrev Number: 23 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0xa86): u_rval
    <6f4>   DW_AT_decl_file   : 20
    <6f5>   DW_AT_decl_line   : 273
    <6f7>   DW_AT_decl_column : 16
    <6f8>   DW_AT_type        : <0x59e>
    <6fc>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6ff>: Abbrev Number: 23 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0xbd9): sys_func_rval
    <704>   DW_AT_decl_file   : 20
    <705>   DW_AT_decl_line   : 274
    <707>   DW_AT_decl_column : 6
    <708>   DW_AT_type        : <0x64>
    <70c>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><70f>: Abbrev Number: 23 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0xe4d): curcol
    <714>   DW_AT_decl_file   : 20
    <715>   DW_AT_decl_line   : 275
    <717>   DW_AT_decl_column : 6
    <718>   DW_AT_type        : <0x64>
    <71c>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><71f>: Abbrev Number: 23 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0xa98): outf
    <724>   DW_AT_decl_file   : 20
    <725>   DW_AT_decl_line   : 276
    <727>   DW_AT_decl_column : 8
    <728>   DW_AT_type        : <0x473>
    <72c>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><72f>: Abbrev Number: 23 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0x10da): staged_output_data
    <734>   DW_AT_decl_file   : 20
    <735>   DW_AT_decl_line   : 277
    <737>   DW_AT_decl_column : 29
    <738>   DW_AT_type        : <0x9f3>
    <73c>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><73f>: Abbrev Number: 23 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0xb9f): auxstr
    <744>   DW_AT_decl_file   : 20
    <745>   DW_AT_decl_line   : 279
    <747>   DW_AT_decl_column : 14
    <748>   DW_AT_type        : <0x22e>
    <74c>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x1ab): _priv_data
    <754>   DW_AT_decl_file   : 20
    <755>   DW_AT_decl_line   : 280
    <757>   DW_AT_decl_column : 8
    <758>   DW_AT_type        : <0xf1>
    <75c>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><75f>: Abbrev Number: 23 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0xd72): _free_priv_data
    <764>   DW_AT_decl_file   : 20
    <765>   DW_AT_decl_line   : 281
    <767>   DW_AT_decl_column : 9
    <768>   DW_AT_type        : <0xa05>
    <76c>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><76f>: Abbrev Number: 23 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x1c5): s_ent
    <774>   DW_AT_decl_file   : 20
    <775>   DW_AT_decl_line   : 282
    <777>   DW_AT_decl_column : 23
    <778>   DW_AT_type        : <0xa0b>
    <77c>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><77f>: Abbrev Number: 23 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <784>   DW_AT_decl_file   : 20
    <785>   DW_AT_decl_line   : 285
    <787>   DW_AT_decl_column : 23
    <788>   DW_AT_type        : <0xa0b>
    <78c>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><78f>: Abbrev Number: 23 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x3c6): inject_vec
    <794>   DW_AT_decl_file   : 20
    <795>   DW_AT_decl_line   : 286
    <797>   DW_AT_decl_column : 22
    <798>   DW_AT_type        : <0xa16>
    <79c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><79f>: Abbrev Number: 23 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x8a9): stime
    <7a4>   DW_AT_decl_file   : 20
    <7a5>   DW_AT_decl_line   : 287
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x198>
    <7ac>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><7af>: Abbrev Number: 23 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x3da): ltime
    <7b4>   DW_AT_decl_file   : 20
    <7b5>   DW_AT_decl_line   : 288
    <7b7>   DW_AT_decl_column : 18
    <7b8>   DW_AT_type        : <0x198>
    <7bc>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><7bf>: Abbrev Number: 23 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x11f1): atime
    <7c4>   DW_AT_decl_file   : 20
    <7c5>   DW_AT_decl_line   : 289
    <7c7>   DW_AT_decl_column : 18
    <7c8>   DW_AT_type        : <0x198>
    <7cc>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><7cf>: Abbrev Number: 23 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x52a): etime
    <7d4>   DW_AT_decl_file   : 20
    <7d5>   DW_AT_decl_line   : 290
    <7d7>   DW_AT_decl_column : 18
    <7d8>   DW_AT_type        : <0x198>
    <7dc>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7e0>: Abbrev Number: 23 (DW_TAG_member)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xed2): delay_expiration_time
    <7e5>   DW_AT_decl_file   : 20
    <7e6>   DW_AT_decl_line   : 291
    <7e8>   DW_AT_decl_column : 18
    <7e9>   DW_AT_type        : <0x198>
    <7ed>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7f1>: Abbrev Number: 23 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x47): pid_ns
    <7f6>   DW_AT_decl_file   : 20
    <7f7>   DW_AT_decl_line   : 298
    <7f9>   DW_AT_decl_column : 15
    <7fa>   DW_AT_type        : <0x2b>
    <7fe>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><802>: Abbrev Number: 23 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x113c): last_dirfd
    <807>   DW_AT_decl_file   : 20
    <808>   DW_AT_decl_line   : 301
    <80a>   DW_AT_decl_column : 6
    <80b>   DW_AT_type        : <0x64>
    <80f>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><813>: Abbrev Number: 23 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0x1162): mmap_cache
    <818>   DW_AT_decl_file   : 20
    <819>   DW_AT_decl_line   : 304
    <81b>   DW_AT_decl_column : 23
    <81c>   DW_AT_type        : <0xa32>
    <820>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><824>: Abbrev Number: 23 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0xc9c): wait_data_idx
    <829>   DW_AT_decl_file   : 20
    <82a>   DW_AT_decl_line   : 311
    <82c>   DW_AT_decl_column : 9
    <82d>   DW_AT_type        : <0x146>
    <831>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><835>: Abbrev Number: 23 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0xba6): delayed_wait_data
    <83a>   DW_AT_decl_file   : 20
    <83b>   DW_AT_decl_line   : 313
    <83d>   DW_AT_decl_column : 24
    <83e>   DW_AT_type        : <0xa3e>
    <842>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><846>: Abbrev Number: 23 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0xc49): wait_list
    <84b>   DW_AT_decl_file   : 20
    <84c>   DW_AT_decl_line   : 314
    <84e>   DW_AT_decl_column : 19
    <84f>   DW_AT_type        : <0x5bb>
    <853>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><857>: Abbrev Number: 23 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0x764): vcpu_info_list
    <85c>   DW_AT_decl_file   : 20
    <85d>   DW_AT_decl_line   : 318
    <85f>   DW_AT_decl_column : 20
    <860>   DW_AT_type        : <0xa4a>
    <864>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><868>: Abbrev Number: 23 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0xe18): unwind_ctx
    <86d>   DW_AT_decl_file   : 20
    <86e>   DW_AT_decl_line   : 322
    <870>   DW_AT_decl_column : 8
    <871>   DW_AT_type        : <0xf1>
    <875>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><879>: Abbrev Number: 23 (DW_TAG_member)
    <87a>   DW_AT_name        : (indirect string, offset: 0x514): unwind_queue
    <87e>   DW_AT_decl_file   : 20
    <87f>   DW_AT_decl_line   : 323
    <881>   DW_AT_decl_column : 25
    <882>   DW_AT_type        : <0xa56>
    <886>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><88a>: Abbrev Number: 23 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x1a0): comm
    <88f>   DW_AT_decl_file   : 20
    <890>   DW_AT_decl_line   : 327
    <892>   DW_AT_decl_column : 7
    <893>   DW_AT_type        : <0xa5c>
    <897>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><89b>: Abbrev Number: 23 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x261): start_prc
    <8a0>   DW_AT_decl_file   : 20
    <8a1>   DW_AT_decl_line   : 329
    <8a3>   DW_AT_decl_column : 16
    <8a4>   DW_AT_type        : <0x37>
    <8a8>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><8ac>: Abbrev Number: 0
 <1><8ad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8ae>   DW_AT_byte_size   : 4
    <8af>   DW_AT_type        : <0x646>
 <1><8b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x5a1): struct_sysent
    <8b8>   DW_AT_decl_file   : 19
    <8b9>   DW_AT_decl_line   : 19
    <8ba>   DW_AT_decl_column : 3
    <8bb>   DW_AT_type        : <0x5ed>
 <1><8bf>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c0>   DW_AT_type        : <0x8b3>
 <1><8c4>: Abbrev Number: 14 (DW_TAG_variable)
    <8c5>   DW_AT_name        : (indirect string, offset: 0xebe): current_personality
    <8c9>   DW_AT_decl_file   : 20
    <8ca>   DW_AT_decl_line   : 158
    <8cb>   DW_AT_decl_column : 17
    <8cc>   DW_AT_type        : <0x2b>
    <8d0>   DW_AT_external    : 1
    <8d1>   DW_AT_declaration : 1
 <1><8d2>: Abbrev Number: 14 (DW_TAG_variable)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x8da): current_wordsize
    <8d7>   DW_AT_decl_file   : 20
    <8d8>   DW_AT_decl_line   : 171
    <8d9>   DW_AT_decl_column : 17
    <8da>   DW_AT_type        : <0x2b>
    <8de>   DW_AT_external    : 1
    <8df>   DW_AT_declaration : 1
 <1><8e0>: Abbrev Number: 14 (DW_TAG_variable)
    <8e1>   DW_AT_name        : (indirect string, offset: 0xb7d): current_klongsize
    <8e5>   DW_AT_decl_file   : 20
    <8e6>   DW_AT_decl_line   : 176
    <8e7>   DW_AT_decl_column : 17
    <8e8>   DW_AT_type        : <0x2b>
    <8ec>   DW_AT_external    : 1
    <8ed>   DW_AT_declaration : 1
 <1><8ee>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8ef>   DW_AT_name        : (indirect string, offset: 0xdef): ioctlent
    <8f3>   DW_AT_byte_size   : 8
    <8f4>   DW_AT_decl_file   : 20
    <8f5>   DW_AT_decl_line   : 217
    <8f6>   DW_AT_decl_column : 16
    <8f7>   DW_AT_sibling     : <0x91a>
 <2><8fb>: Abbrev Number: 9 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x1120): symbol
    <900>   DW_AT_decl_file   : 20
    <901>   DW_AT_decl_line   : 218
    <902>   DW_AT_decl_column : 14
    <903>   DW_AT_type        : <0x22e>
    <907>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90a>: Abbrev Number: 9 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0xe71): code
    <90f>   DW_AT_decl_file   : 20
    <910>   DW_AT_decl_line   : 219
    <911>   DW_AT_decl_column : 15
    <912>   DW_AT_type        : <0x2b>
    <916>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><919>: Abbrev Number: 0
 <1><91a>: Abbrev Number: 4 (DW_TAG_typedef)
    <91b>   DW_AT_name        : (indirect string, offset: 0xdb0): struct_ioctlent
    <91f>   DW_AT_decl_file   : 20
    <920>   DW_AT_decl_line   : 220
    <921>   DW_AT_decl_column : 3
    <922>   DW_AT_type        : <0x8ee>
 <1><926>: Abbrev Number: 3 (DW_TAG_const_type)
    <927>   DW_AT_type        : <0x91a>
 <1><92b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <92c>   DW_AT_name        : (indirect string, offset: 0x8ce): inject_data
    <930>   DW_AT_byte_size   : 10
    <931>   DW_AT_decl_file   : 20
    <932>   DW_AT_decl_line   : 241
    <933>   DW_AT_decl_column : 8
    <934>   DW_AT_sibling     : <0x993>
 <2><938>: Abbrev Number: 9 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x539): flags
    <93d>   DW_AT_decl_file   : 20
    <93e>   DW_AT_decl_line   : 242
    <93f>   DW_AT_decl_column : 10
    <940>   DW_AT_type        : <0x116>
    <944>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><947>: Abbrev Number: 9 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0xa08): signo
    <94c>   DW_AT_decl_file   : 20
    <94d>   DW_AT_decl_line   : 243
    <94e>   DW_AT_decl_column : 10
    <94f>   DW_AT_type        : <0x116>
    <953>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><956>: Abbrev Number: 9 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x138): rval_idx
    <95b>   DW_AT_decl_file   : 20
    <95c>   DW_AT_decl_line   : 244
    <95d>   DW_AT_decl_column : 11
    <95e>   DW_AT_type        : <0x122>
    <962>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><965>: Abbrev Number: 9 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0xe43): delay_idx
    <96a>   DW_AT_decl_file   : 20
    <96b>   DW_AT_decl_line   : 245
    <96c>   DW_AT_decl_column : 11
    <96d>   DW_AT_type        : <0x122>
    <971>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><974>: Abbrev Number: 9 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x5f2): poke_idx
    <979>   DW_AT_decl_file   : 20
    <97a>   DW_AT_decl_line   : 246
    <97b>   DW_AT_decl_column : 11
    <97c>   DW_AT_type        : <0x122>
    <980>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><983>: Abbrev Number: 9 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0x1db): scno
    <988>   DW_AT_decl_file   : 20
    <989>   DW_AT_decl_line   : 247
    <98a>   DW_AT_decl_column : 11
    <98b>   DW_AT_type        : <0x122>
    <98f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><992>: Abbrev Number: 0
 <1><993>: Abbrev Number: 12 (DW_TAG_structure_type)
    <994>   DW_AT_name        : (indirect string, offset: 0x106): inject_opts
    <998>   DW_AT_byte_size   : 16
    <999>   DW_AT_decl_file   : 20
    <99a>   DW_AT_decl_line   : 250
    <99b>   DW_AT_decl_column : 8
    <99c>   DW_AT_sibling     : <0x9dd>
 <2><9a0>: Abbrev Number: 9 (DW_TAG_member)
    <9a1>   DW_AT_name        : (indirect string, offset: 0xb52): first
    <9a5>   DW_AT_decl_file   : 20
    <9a6>   DW_AT_decl_line   : 251
    <9a7>   DW_AT_decl_column : 11
    <9a8>   DW_AT_type        : <0x122>
    <9ac>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><9af>: Abbrev Number: 9 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x130f): last
    <9b4>   DW_AT_decl_file   : 20
    <9b5>   DW_AT_decl_line   : 252
    <9b6>   DW_AT_decl_column : 11
    <9b7>   DW_AT_type        : <0x122>
    <9bb>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><9be>: Abbrev Number: 9 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x3e0): step
    <9c3>   DW_AT_decl_file   : 20
    <9c4>   DW_AT_decl_line   : 253
    <9c5>   DW_AT_decl_column : 11
    <9c6>   DW_AT_type        : <0x122>
    <9ca>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9cd>: Abbrev Number: 9 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x12d2): data
    <9d2>   DW_AT_decl_file   : 20
    <9d3>   DW_AT_decl_line   : 254
    <9d4>   DW_AT_decl_column : 21
    <9d5>   DW_AT_type        : <0x92b>
    <9d9>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9dc>: Abbrev Number: 0
 <1><9dd>: Abbrev Number: 10 (DW_TAG_array_type)
    <9de>   DW_AT_type        : <0x5aa>
    <9e2>   DW_AT_sibling     : <0x9ed>
 <2><9e6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9e7>   DW_AT_type        : <0x2b>
    <9eb>   DW_AT_upper_bound : 5
 <2><9ec>: Abbrev Number: 0
 <1><9ed>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x10da): staged_output_data
    <9f2>   DW_AT_declaration : 1
 <1><9f3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f4>   DW_AT_byte_size   : 4
    <9f5>   DW_AT_type        : <0x9ed>
 <1><9f9>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9fa>   DW_AT_prototyped  : 1
    <9fb>   DW_AT_sibling     : <0xa05>
 <2><9ff>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <a00>   DW_AT_type        : <0xf1>
 <2><a04>: Abbrev Number: 0
 <1><a05>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
    <a07>   DW_AT_type        : <0x9f9>
 <1><a0b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0c>   DW_AT_byte_size   : 4
    <a0d>   DW_AT_type        : <0x8bf>
 <1><a11>: Abbrev Number: 3 (DW_TAG_const_type)
    <a12>   DW_AT_type        : <0xa0b>
 <1><a16>: Abbrev Number: 10 (DW_TAG_array_type)
    <a17>   DW_AT_type        : <0xa26>
    <a1b>   DW_AT_sibling     : <0xa26>
 <2><a1f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a20>   DW_AT_type        : <0x2b>
    <a24>   DW_AT_upper_bound : 2
 <2><a25>: Abbrev Number: 0
 <1><a26>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_type        : <0x993>
 <1><a2c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xd2): mmap_cache_t
    <a31>   DW_AT_declaration : 1
 <1><a32>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a33>   DW_AT_byte_size   : 4
    <a34>   DW_AT_type        : <0xa2c>
 <1><a38>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a39>   DW_AT_name        : (indirect string, offset: 0x40d): tcb_wait_data
    <a3d>   DW_AT_declaration : 1
 <1><a3e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a3f>   DW_AT_byte_size   : 4
    <a40>   DW_AT_type        : <0xa38>
 <1><a44>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a45>   DW_AT_name        : (indirect string, offset: 0x196): vcpu_info
    <a49>   DW_AT_declaration : 1
 <1><a4a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a4b>   DW_AT_byte_size   : 4
    <a4c>   DW_AT_type        : <0xa44>
 <1><a50>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a51>   DW_AT_name        : (indirect string, offset: 0x10be): unwind_queue_t
    <a55>   DW_AT_declaration : 1
 <1><a56>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a57>   DW_AT_byte_size   : 4
    <a58>   DW_AT_type        : <0xa50>
 <1><a5c>: Abbrev Number: 10 (DW_TAG_array_type)
    <a5d>   DW_AT_type        : <0x10a>
    <a61>   DW_AT_sibling     : <0xa6c>
 <2><a65>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a66>   DW_AT_type        : <0x2b>
    <a6a>   DW_AT_upper_bound : 15
 <2><a6b>: Abbrev Number: 0
 <1><a6c>: Abbrev Number: 13 (DW_TAG_variable)
    <a6d>   DW_AT_name        : (indirect string, offset: 0xcd9): stub_sysent
    <a71>   DW_AT_decl_file   : 20
    <a72>   DW_AT_decl_line   : 403
    <a74>   DW_AT_decl_column : 28
    <a75>   DW_AT_type        : <0x8bf>
    <a79>   DW_AT_external    : 1
    <a7a>   DW_AT_declaration : 1
 <1><a7b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x12a6): xlat_type
    <a80>   DW_AT_encoding    : 7	(unsigned)
    <a81>   DW_AT_byte_size   : 4
    <a82>   DW_AT_type        : <0x2b>
    <a86>   DW_AT_decl_file   : 21
    <a87>   DW_AT_decl_line   : 13
    <a88>   DW_AT_decl_column : 6
    <a89>   DW_AT_sibling     : <0xaa0>
 <2><a8d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x30c): XT_NORMAL
    <a92>   DW_AT_const_value : 0
 <2><a93>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0xdc7): XT_SORTED
    <a98>   DW_AT_const_value : 1
 <2><a99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0xf5c): XT_INDEXED
    <a9e>   DW_AT_const_value : 2
 <2><a9f>: Abbrev Number: 0
 <1><aa0>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <aa1>   DW_AT_name        : (indirect string, offset: 0xd14): xlat_style
    <aa5>   DW_AT_encoding    : 7	(unsigned)
    <aa6>   DW_AT_byte_size   : 4
    <aa7>   DW_AT_type        : <0x2b>
    <aab>   DW_AT_decl_file   : 21
    <aac>   DW_AT_decl_line   : 19
    <aad>   DW_AT_decl_column : 6
    <aae>   DW_AT_sibling     : <0xadd>
 <2><ab2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x112): XLAT_STYLE_DEFAULT
    <ab7>   DW_AT_const_value : 0
 <2><ab8>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab9>   DW_AT_name        : (indirect string, offset: 0xd4f): XLAT_STYLE_RAW
    <abd>   DW_AT_const_value : 1
 <2><abe>: Abbrev Number: 27 (DW_TAG_enumerator)
    <abf>   DW_AT_name        : (indirect string, offset: 0x1271): XLAT_STYLE_ABBREV
    <ac3>   DW_AT_const_value : 2
 <2><ac4>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x329): XLAT_STYLE_VERBOSE
    <ac9>   DW_AT_const_value : 3
 <2><aca>: Abbrev Number: 27 (DW_TAG_enumerator)
    <acb>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <acf>   DW_AT_const_value : 0
 <2><ad0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ad5>   DW_AT_const_value : 4
 <2><ad6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x12f5): XLAT_STYLE_FMT_D
    <adb>   DW_AT_const_value : 8
 <2><adc>: Abbrev Number: 0
 <1><add>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ade>   DW_AT_name        : (indirect string, offset: 0x35a): xlat_data
    <ae2>   DW_AT_byte_size   : 12
    <ae3>   DW_AT_decl_file   : 21
    <ae4>   DW_AT_decl_line   : 51
    <ae5>   DW_AT_decl_column : 8
    <ae6>   DW_AT_sibling     : <0xb09>
 <2><aea>: Abbrev Number: 19 (DW_TAG_member)
    <aeb>   DW_AT_name        : val
    <aef>   DW_AT_decl_file   : 21
    <af0>   DW_AT_decl_line   : 52
    <af1>   DW_AT_decl_column : 11
    <af2>   DW_AT_type        : <0x13a>
    <af6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af9>: Abbrev Number: 19 (DW_TAG_member)
    <afa>   DW_AT_name        : str
    <afe>   DW_AT_decl_file   : 21
    <aff>   DW_AT_decl_line   : 53
    <b00>   DW_AT_decl_column : 14
    <b01>   DW_AT_type        : <0x22e>
    <b05>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0a>   DW_AT_type        : <0xadd>
 <1><b0e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <b13>   DW_AT_byte_size   : 24
    <b14>   DW_AT_decl_file   : 21
    <b15>   DW_AT_decl_line   : 56
    <b16>   DW_AT_decl_column : 8
    <b17>   DW_AT_sibling     : <0xb67>
 <2><b1b>: Abbrev Number: 9 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x12d2): data
    <b20>   DW_AT_decl_file   : 21
    <b21>   DW_AT_decl_line   : 57
    <b22>   DW_AT_decl_column : 26
    <b23>   DW_AT_type        : <0xb6c>
    <b27>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b2a>: Abbrev Number: 9 (DW_TAG_member)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x936): flags_strsz
    <b2f>   DW_AT_decl_file   : 21
    <b30>   DW_AT_decl_line   : 58
    <b31>   DW_AT_decl_column : 9
    <b32>   DW_AT_type        : <0x146>
    <b36>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b39>: Abbrev Number: 9 (DW_TAG_member)
    <b3a>   DW_AT_name        : (indirect string, offset: 0xcaa): size
    <b3e>   DW_AT_decl_file   : 21
    <b3f>   DW_AT_decl_line   : 59
    <b40>   DW_AT_decl_column : 11
    <b41>   DW_AT_type        : <0x12e>
    <b45>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b48>: Abbrev Number: 9 (DW_TAG_member)
    <b49>   DW_AT_name        : (indirect string, offset: 0x1e0): type
    <b4d>   DW_AT_decl_file   : 21
    <b4e>   DW_AT_decl_line   : 60
    <b4f>   DW_AT_decl_column : 17
    <b50>   DW_AT_type        : <0xa7b>
    <b54>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b57>: Abbrev Number: 9 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0x7c2): flags_mask
    <b5c>   DW_AT_decl_file   : 21
    <b5d>   DW_AT_decl_line   : 61
    <b5e>   DW_AT_decl_column : 11
    <b5f>   DW_AT_type        : <0x13a>
    <b63>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b66>: Abbrev Number: 0
 <1><b67>: Abbrev Number: 3 (DW_TAG_const_type)
    <b68>   DW_AT_type        : <0xb0e>
 <1><b6c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b6d>   DW_AT_byte_size   : 4
    <b6e>   DW_AT_type        : <0xb09>
 <1><b72>: Abbrev Number: 10 (DW_TAG_array_type)
    <b73>   DW_AT_type        : <0xb67>
    <b77>   DW_AT_sibling     : <0xb7d>
 <2><b7b>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b7c>: Abbrev Number: 0
 <1><b7d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b7e>   DW_AT_type        : <0xb72>
 <1><b82>: Abbrev Number: 13 (DW_TAG_variable)
    <b83>   DW_AT_name        : (indirect string, offset: 0xfda): addrfams
    <b87>   DW_AT_decl_file   : 20
    <b88>   DW_AT_decl_line   : 409
    <b8a>   DW_AT_decl_column : 26
    <b8b>   DW_AT_type        : <0xb7d>
    <b8f>   DW_AT_external    : 1
    <b90>   DW_AT_declaration : 1
 <1><b91>: Abbrev Number: 13 (DW_TAG_variable)
    <b92>   DW_AT_name        : (indirect string, offset: 0xe81): arp_hardware_types
    <b96>   DW_AT_decl_file   : 20
    <b97>   DW_AT_decl_line   : 410
    <b99>   DW_AT_decl_column : 26
    <b9a>   DW_AT_type        : <0xb7d>
    <b9e>   DW_AT_external    : 1
    <b9f>   DW_AT_declaration : 1
 <1><ba0>: Abbrev Number: 13 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x11f7): at_flags
    <ba5>   DW_AT_decl_file   : 20
    <ba6>   DW_AT_decl_line   : 411
    <ba8>   DW_AT_decl_column : 26
    <ba9>   DW_AT_type        : <0xb7d>
    <bad>   DW_AT_external    : 1
    <bae>   DW_AT_declaration : 1
 <1><baf>: Abbrev Number: 13 (DW_TAG_variable)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x4f2): clocknames
    <bb4>   DW_AT_decl_file   : 20
    <bb5>   DW_AT_decl_line   : 412
    <bb7>   DW_AT_decl_column : 26
    <bb8>   DW_AT_type        : <0xb7d>
    <bbc>   DW_AT_external    : 1
    <bbd>   DW_AT_declaration : 1
 <1><bbe>: Abbrev Number: 13 (DW_TAG_variable)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x11b7): dirent_types
    <bc3>   DW_AT_decl_file   : 20
    <bc4>   DW_AT_decl_line   : 413
    <bc6>   DW_AT_decl_column : 26
    <bc7>   DW_AT_type        : <0xb7d>
    <bcb>   DW_AT_external    : 1
    <bcc>   DW_AT_declaration : 1
 <1><bcd>: Abbrev Number: 13 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0x990): ethernet_protocols
    <bd2>   DW_AT_decl_file   : 20
    <bd3>   DW_AT_decl_line   : 414
    <bd5>   DW_AT_decl_column : 26
    <bd6>   DW_AT_type        : <0xb7d>
    <bda>   DW_AT_external    : 1
    <bdb>   DW_AT_declaration : 1
 <1><bdc>: Abbrev Number: 13 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x645): inet_protocols
    <be1>   DW_AT_decl_file   : 20
    <be2>   DW_AT_decl_line   : 415
    <be4>   DW_AT_decl_column : 26
    <be5>   DW_AT_type        : <0xb7d>
    <be9>   DW_AT_external    : 1
    <bea>   DW_AT_declaration : 1
 <1><beb>: Abbrev Number: 13 (DW_TAG_variable)
    <bec>   DW_AT_name        : (indirect string, offset: 0x2f9): evdev_abs
    <bf0>   DW_AT_decl_file   : 20
    <bf1>   DW_AT_decl_line   : 416
    <bf3>   DW_AT_decl_column : 26
    <bf4>   DW_AT_type        : <0xb7d>
    <bf8>   DW_AT_external    : 1
    <bf9>   DW_AT_declaration : 1
 <1><bfa>: Abbrev Number: 13 (DW_TAG_variable)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x7b7): audit_arch
    <bff>   DW_AT_decl_file   : 20
    <c00>   DW_AT_decl_line   : 417
    <c02>   DW_AT_decl_column : 26
    <c03>   DW_AT_type        : <0xb7d>
    <c07>   DW_AT_external    : 1
    <c08>   DW_AT_declaration : 1
 <1><c09>: Abbrev Number: 13 (DW_TAG_variable)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xbe): evdev_ev
    <c0e>   DW_AT_decl_file   : 20
    <c0f>   DW_AT_decl_line   : 418
    <c11>   DW_AT_decl_column : 26
    <c12>   DW_AT_type        : <0xb7d>
    <c16>   DW_AT_external    : 1
    <c17>   DW_AT_declaration : 1
 <1><c18>: Abbrev Number: 13 (DW_TAG_variable)
    <c19>   DW_AT_name        : (indirect string, offset: 0x4d3): iffflags
    <c1d>   DW_AT_decl_file   : 20
    <c1e>   DW_AT_decl_line   : 419
    <c20>   DW_AT_decl_column : 26
    <c21>   DW_AT_type        : <0xb7d>
    <c25>   DW_AT_external    : 1
    <c26>   DW_AT_declaration : 1
 <1><c27>: Abbrev Number: 13 (DW_TAG_variable)
    <c28>   DW_AT_name        : (indirect string, offset: 0xd5e): ip_type_of_services
    <c2c>   DW_AT_decl_file   : 20
    <c2d>   DW_AT_decl_line   : 420
    <c2f>   DW_AT_decl_column : 26
    <c30>   DW_AT_type        : <0xb7d>
    <c34>   DW_AT_external    : 1
    <c35>   DW_AT_declaration : 1
 <1><c36>: Abbrev Number: 13 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0x740): ipc_private
    <c3b>   DW_AT_decl_file   : 20
    <c3c>   DW_AT_decl_line   : 421
    <c3e>   DW_AT_decl_column : 26
    <c3f>   DW_AT_type        : <0xb7d>
    <c43>   DW_AT_external    : 1
    <c44>   DW_AT_declaration : 1
 <1><c45>: Abbrev Number: 13 (DW_TAG_variable)
    <c46>   DW_AT_name        : (indirect string, offset: 0x350): msg_flags
    <c4a>   DW_AT_decl_file   : 20
    <c4b>   DW_AT_decl_line   : 422
    <c4d>   DW_AT_decl_column : 26
    <c4e>   DW_AT_type        : <0xb7d>
    <c52>   DW_AT_external    : 1
    <c53>   DW_AT_declaration : 1
 <1><c54>: Abbrev Number: 13 (DW_TAG_variable)
    <c55>   DW_AT_name        : (indirect string, offset: 0x141): netlink_protocols
    <c59>   DW_AT_decl_file   : 20
    <c5a>   DW_AT_decl_line   : 423
    <c5c>   DW_AT_decl_column : 26
    <c5d>   DW_AT_type        : <0xb7d>
    <c61>   DW_AT_external    : 1
    <c62>   DW_AT_declaration : 1
 <1><c63>: Abbrev Number: 13 (DW_TAG_variable)
    <c64>   DW_AT_name        : (indirect string, offset: 0x1100): nl_bridge_vlan_flags
    <c68>   DW_AT_decl_file   : 20
    <c69>   DW_AT_decl_line   : 424
    <c6b>   DW_AT_decl_column : 26
    <c6c>   DW_AT_type        : <0xb7d>
    <c70>   DW_AT_external    : 1
    <c71>   DW_AT_declaration : 1
 <1><c72>: Abbrev Number: 13 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0xf45): nl_netfilter_msg_types
    <c77>   DW_AT_decl_file   : 20
    <c78>   DW_AT_decl_line   : 425
    <c7a>   DW_AT_decl_column : 26
    <c7b>   DW_AT_type        : <0xb7d>
    <c7f>   DW_AT_external    : 1
    <c80>   DW_AT_declaration : 1
 <1><c81>: Abbrev Number: 13 (DW_TAG_variable)
    <c82>   DW_AT_name        : (indirect string, offset: 0x4ae): nl_route_types
    <c86>   DW_AT_decl_file   : 20
    <c87>   DW_AT_decl_line   : 426
    <c89>   DW_AT_decl_column : 26
    <c8a>   DW_AT_type        : <0xb7d>
    <c8e>   DW_AT_external    : 1
    <c8f>   DW_AT_declaration : 1
 <1><c90>: Abbrev Number: 13 (DW_TAG_variable)
    <c91>   DW_AT_name        : (indirect string, offset: 0x1025): open_access_modes
    <c95>   DW_AT_decl_file   : 20
    <c96>   DW_AT_decl_line   : 427
    <c98>   DW_AT_decl_column : 26
    <c99>   DW_AT_type        : <0xb7d>
    <c9d>   DW_AT_external    : 1
    <c9e>   DW_AT_declaration : 1
 <1><c9f>: Abbrev Number: 13 (DW_TAG_variable)
    <ca0>   DW_AT_name        : (indirect string, offset: 0xae): open_mode_flags
    <ca4>   DW_AT_decl_file   : 20
    <ca5>   DW_AT_decl_line   : 428
    <ca7>   DW_AT_decl_column : 26
    <ca8>   DW_AT_type        : <0xb7d>
    <cac>   DW_AT_external    : 1
    <cad>   DW_AT_declaration : 1
 <1><cae>: Abbrev Number: 13 (DW_TAG_variable)
    <caf>   DW_AT_name        : (indirect string, offset: 0xd96): perf_type_id
    <cb3>   DW_AT_decl_file   : 20
    <cb4>   DW_AT_decl_line   : 429
    <cb6>   DW_AT_decl_column : 26
    <cb7>   DW_AT_type        : <0xb7d>
    <cbb>   DW_AT_external    : 1
    <cbc>   DW_AT_declaration : 1
 <1><cbd>: Abbrev Number: 13 (DW_TAG_variable)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xfe3): pollflags
    <cc2>   DW_AT_decl_file   : 20
    <cc3>   DW_AT_decl_line   : 430
    <cc5>   DW_AT_decl_column : 26
    <cc6>   DW_AT_type        : <0xb7d>
    <cca>   DW_AT_external    : 1
    <ccb>   DW_AT_declaration : 1
 <1><ccc>: Abbrev Number: 13 (DW_TAG_variable)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x5e6): ptrace_cmds
    <cd1>   DW_AT_decl_file   : 20
    <cd2>   DW_AT_decl_line   : 431
    <cd4>   DW_AT_decl_column : 26
    <cd5>   DW_AT_type        : <0xb7d>
    <cd9>   DW_AT_external    : 1
    <cda>   DW_AT_declaration : 1
 <1><cdb>: Abbrev Number: 13 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x8bf): resource_flags
    <ce0>   DW_AT_decl_file   : 20
    <ce1>   DW_AT_decl_line   : 432
    <ce3>   DW_AT_decl_column : 26
    <ce4>   DW_AT_type        : <0xb7d>
    <ce8>   DW_AT_external    : 1
    <ce9>   DW_AT_declaration : 1
 <1><cea>: Abbrev Number: 13 (DW_TAG_variable)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x2cf): route_nexthop_flags
    <cef>   DW_AT_decl_file   : 20
    <cf0>   DW_AT_decl_line   : 433
    <cf2>   DW_AT_decl_column : 26
    <cf3>   DW_AT_type        : <0xb7d>
    <cf7>   DW_AT_external    : 1
    <cf8>   DW_AT_declaration : 1
 <1><cf9>: Abbrev Number: 13 (DW_TAG_variable)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x1062): routing_protocols
    <cfe>   DW_AT_decl_file   : 20
    <cff>   DW_AT_decl_line   : 434
    <d01>   DW_AT_decl_column : 26
    <d02>   DW_AT_type        : <0xb7d>
    <d06>   DW_AT_external    : 1
    <d07>   DW_AT_declaration : 1
 <1><d08>: Abbrev Number: 13 (DW_TAG_variable)
    <d09>   DW_AT_name        : (indirect string, offset: 0x4c4): routing_scopes
    <d0d>   DW_AT_decl_file   : 20
    <d0e>   DW_AT_decl_line   : 435
    <d10>   DW_AT_decl_column : 26
    <d11>   DW_AT_type        : <0xb7d>
    <d15>   DW_AT_external    : 1
    <d16>   DW_AT_declaration : 1
 <1><d17>: Abbrev Number: 13 (DW_TAG_variable)
    <d18>   DW_AT_name        : (indirect string, offset: 0xf28): routing_table_ids
    <d1c>   DW_AT_decl_file   : 20
    <d1d>   DW_AT_decl_line   : 436
    <d1f>   DW_AT_decl_column : 26
    <d20>   DW_AT_type        : <0xb7d>
    <d24>   DW_AT_external    : 1
    <d25>   DW_AT_declaration : 1
 <1><d26>: Abbrev Number: 13 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0x71d): routing_types
    <d2b>   DW_AT_decl_file   : 20
    <d2c>   DW_AT_decl_line   : 437
    <d2e>   DW_AT_decl_column : 26
    <d2f>   DW_AT_type        : <0xb7d>
    <d33>   DW_AT_external    : 1
    <d34>   DW_AT_declaration : 1
 <1><d35>: Abbrev Number: 13 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0x204): rwf_flags
    <d3a>   DW_AT_decl_file   : 20
    <d3b>   DW_AT_decl_line   : 438
    <d3d>   DW_AT_decl_column : 26
    <d3e>   DW_AT_type        : <0xb7d>
    <d42>   DW_AT_external    : 1
    <d43>   DW_AT_declaration : 1
 <1><d44>: Abbrev Number: 13 (DW_TAG_variable)
    <d45>   DW_AT_name        : (indirect string, offset: 0x901): seccomp_filter_flags
    <d49>   DW_AT_decl_file   : 20
    <d4a>   DW_AT_decl_line   : 439
    <d4c>   DW_AT_decl_column : 26
    <d4d>   DW_AT_type        : <0xb7d>
    <d51>   DW_AT_external    : 1
    <d52>   DW_AT_declaration : 1
 <1><d53>: Abbrev Number: 13 (DW_TAG_variable)
    <d54>   DW_AT_name        : (indirect string, offset: 0x316): seccomp_ret_action
    <d58>   DW_AT_decl_file   : 20
    <d59>   DW_AT_decl_line   : 440
    <d5b>   DW_AT_decl_column : 26
    <d5c>   DW_AT_type        : <0xb7d>
    <d60>   DW_AT_external    : 1
    <d61>   DW_AT_declaration : 1
 <1><d62>: Abbrev Number: 13 (DW_TAG_variable)
    <d63>   DW_AT_name        : (indirect string, offset: 0x47f): setns_types
    <d67>   DW_AT_decl_file   : 20
    <d68>   DW_AT_decl_line   : 441
    <d6a>   DW_AT_decl_column : 26
    <d6b>   DW_AT_type        : <0xb7d>
    <d6f>   DW_AT_external    : 1
    <d70>   DW_AT_declaration : 1
 <1><d71>: Abbrev Number: 13 (DW_TAG_variable)
    <d72>   DW_AT_name        : (indirect string, offset: 0xfcf): sg_io_info
    <d76>   DW_AT_decl_file   : 20
    <d77>   DW_AT_decl_line   : 442
    <d79>   DW_AT_decl_column : 26
    <d7a>   DW_AT_type        : <0xb7d>
    <d7e>   DW_AT_external    : 1
    <d7f>   DW_AT_declaration : 1
 <1><d80>: Abbrev Number: 13 (DW_TAG_variable)
    <d81>   DW_AT_name        : (indirect string, offset: 0xced): socketlayers
    <d85>   DW_AT_decl_file   : 20
    <d86>   DW_AT_decl_line   : 443
    <d88>   DW_AT_decl_column : 26
    <d89>   DW_AT_type        : <0xb7d>
    <d8d>   DW_AT_external    : 1
    <d8e>   DW_AT_declaration : 1
 <1><d8f>: Abbrev Number: 13 (DW_TAG_variable)
    <d90>   DW_AT_name        : (indirect string, offset: 0xf0b): socktypes
    <d94>   DW_AT_decl_file   : 20
    <d95>   DW_AT_decl_line   : 444
    <d97>   DW_AT_decl_column : 26
    <d98>   DW_AT_type        : <0xb7d>
    <d9c>   DW_AT_external    : 1
    <d9d>   DW_AT_declaration : 1
 <1><d9e>: Abbrev Number: 13 (DW_TAG_variable)
    <d9f>   DW_AT_name        : (indirect string, offset: 0xb8f): tcp_state_flags
    <da3>   DW_AT_decl_file   : 20
    <da4>   DW_AT_decl_line   : 445
    <da6>   DW_AT_decl_column : 26
    <da7>   DW_AT_type        : <0xb7d>
    <dab>   DW_AT_external    : 1
    <dac>   DW_AT_declaration : 1
 <1><dad>: Abbrev Number: 13 (DW_TAG_variable)
    <dae>   DW_AT_name        : (indirect string, offset: 0x80b): tcp_states
    <db2>   DW_AT_decl_file   : 20
    <db3>   DW_AT_decl_line   : 446
    <db5>   DW_AT_decl_column : 26
    <db6>   DW_AT_type        : <0xb7d>
    <dba>   DW_AT_external    : 1
    <dbb>   DW_AT_declaration : 1
 <1><dbc>: Abbrev Number: 13 (DW_TAG_variable)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x1254): whence_codes
    <dc1>   DW_AT_decl_file   : 20
    <dc2>   DW_AT_decl_line   : 447
    <dc4>   DW_AT_decl_column : 26
    <dc5>   DW_AT_type        : <0xb7d>
    <dc9>   DW_AT_external    : 1
    <dca>   DW_AT_declaration : 1
 <1><dcb>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <dcc>   DW_AT_encoding    : 7	(unsigned)
    <dcd>   DW_AT_byte_size   : 4
    <dce>   DW_AT_type        : <0x2b>
    <dd2>   DW_AT_decl_file   : 20
    <dd3>   DW_AT_decl_line   : 508
    <dd5>   DW_AT_decl_column : 14
    <dd6>   DW_AT_sibling     : <0xded>
 <2><dda>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ddb>   DW_AT_name        : (indirect string, offset: 0xa8d): CFLAG_NONE
    <ddf>   DW_AT_const_value : 0
 <2><de0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <de1>   DW_AT_name        : (indirect string, offset: 0x9a3): CFLAG_ONLY_STATS
    <de5>   DW_AT_const_value : 1
 <2><de6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <de7>   DW_AT_name        : (indirect string, offset: 0xcfa): CFLAG_BOTH
    <deb>   DW_AT_const_value : 2
 <2><dec>: Abbrev Number: 0
 <1><ded>: Abbrev Number: 29 (DW_TAG_typedef)
    <dee>   DW_AT_name        : (indirect string, offset: 0x1314): cflag_t
    <df2>   DW_AT_decl_file   : 20
    <df3>   DW_AT_decl_line   : 512
    <df5>   DW_AT_decl_column : 3
    <df6>   DW_AT_type        : <0xdcb>
 <1><dfa>: Abbrev Number: 13 (DW_TAG_variable)
    <dfb>   DW_AT_name        : (indirect string, offset: 0xe3d): cflag
    <dff>   DW_AT_decl_file   : 20
    <e00>   DW_AT_decl_line   : 513
    <e02>   DW_AT_decl_column : 16
    <e03>   DW_AT_type        : <0xded>
    <e07>   DW_AT_external    : 1
    <e08>   DW_AT_declaration : 1
 <1><e09>: Abbrev Number: 13 (DW_TAG_variable)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x1b6): Tflag
    <e0e>   DW_AT_decl_file   : 20
    <e0f>   DW_AT_decl_line   : 514
    <e11>   DW_AT_decl_column : 13
    <e12>   DW_AT_type        : <0x57a>
    <e16>   DW_AT_external    : 1
    <e17>   DW_AT_declaration : 1
 <1><e18>: Abbrev Number: 13 (DW_TAG_variable)
    <e19>   DW_AT_name        : (indirect string, offset: 0x86e): Tflag_scale
    <e1d>   DW_AT_decl_file   : 20
    <e1e>   DW_AT_decl_line   : 515
    <e20>   DW_AT_decl_column : 12
    <e21>   DW_AT_type        : <0x64>
    <e25>   DW_AT_external    : 1
    <e26>   DW_AT_declaration : 1
 <1><e27>: Abbrev Number: 13 (DW_TAG_variable)
    <e28>   DW_AT_name        : (indirect string, offset: 0x916): Tflag_width
    <e2c>   DW_AT_decl_file   : 20
    <e2d>   DW_AT_decl_line   : 516
    <e2f>   DW_AT_decl_column : 12
    <e30>   DW_AT_type        : <0x64>
    <e34>   DW_AT_external    : 1
    <e35>   DW_AT_declaration : 1
 <1><e36>: Abbrev Number: 13 (DW_TAG_variable)
    <e37>   DW_AT_name        : (indirect string, offset: 0xfb4): iflag
    <e3b>   DW_AT_decl_file   : 20
    <e3c>   DW_AT_decl_line   : 517
    <e3e>   DW_AT_decl_column : 13
    <e3f>   DW_AT_type        : <0x57a>
    <e43>   DW_AT_external    : 1
    <e44>   DW_AT_declaration : 1
 <1><e45>: Abbrev Number: 13 (DW_TAG_variable)
    <e46>   DW_AT_name        : (indirect string, offset: 0x626): count_wallclock
    <e4a>   DW_AT_decl_file   : 20
    <e4b>   DW_AT_decl_line   : 518
    <e4d>   DW_AT_decl_column : 13
    <e4e>   DW_AT_type        : <0x57a>
    <e52>   DW_AT_external    : 1
    <e53>   DW_AT_declaration : 1
 <1><e54>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e55>   DW_AT_name        : (indirect string, offset: 0x73): path_set_item
    <e59>   DW_AT_byte_size   : 4
    <e5a>   DW_AT_decl_file   : 20
    <e5b>   DW_AT_decl_line   : 520
    <e5d>   DW_AT_decl_column : 8
    <e5e>   DW_AT_sibling     : <0xe73>
 <2><e62>: Abbrev Number: 23 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0xec): path
    <e67>   DW_AT_decl_file   : 20
    <e68>   DW_AT_decl_line   : 521
    <e6a>   DW_AT_decl_column : 14
    <e6b>   DW_AT_type        : <0x22e>
    <e6f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e72>: Abbrev Number: 0
 <1><e73>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e74>   DW_AT_name        : (indirect string, offset: 0x816): path_set
    <e78>   DW_AT_byte_size   : 12
    <e79>   DW_AT_decl_file   : 20
    <e7a>   DW_AT_decl_line   : 525
    <e7c>   DW_AT_decl_column : 15
    <e7d>   DW_AT_sibling     : <0xeb2>
 <2><e81>: Abbrev Number: 23 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x77b): paths_selected
    <e86>   DW_AT_decl_file   : 20
    <e87>   DW_AT_decl_line   : 526
    <e89>   DW_AT_decl_column : 24
    <e8a>   DW_AT_type        : <0xeb2>
    <e8e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e91>: Abbrev Number: 23 (DW_TAG_member)
    <e92>   DW_AT_name        : (indirect string, offset: 0x1247): num_selected
    <e96>   DW_AT_decl_file   : 20
    <e97>   DW_AT_decl_line   : 527
    <e99>   DW_AT_decl_column : 9
    <e9a>   DW_AT_type        : <0x146>
    <e9e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ea1>: Abbrev Number: 23 (DW_TAG_member)
    <ea2>   DW_AT_name        : (indirect string, offset: 0xcaa): size
    <ea6>   DW_AT_decl_file   : 20
    <ea7>   DW_AT_decl_line   : 528
    <ea9>   DW_AT_decl_column : 9
    <eaa>   DW_AT_type        : <0x146>
    <eae>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><eb1>: Abbrev Number: 0
 <1><eb2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <eb3>   DW_AT_byte_size   : 4
    <eb4>   DW_AT_type        : <0xe54>
 <1><eb8>: Abbrev Number: 13 (DW_TAG_variable)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x1296): global_path_set
    <ebd>   DW_AT_decl_file   : 20
    <ebe>   DW_AT_decl_line   : 529
    <ec0>   DW_AT_decl_column : 3
    <ec1>   DW_AT_type        : <0xe73>
    <ec5>   DW_AT_external    : 1
    <ec6>   DW_AT_declaration : 1
 <1><ec7>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x1192): xflag_opts
    <ecc>   DW_AT_encoding    : 7	(unsigned)
    <ecd>   DW_AT_byte_size   : 4
    <ece>   DW_AT_type        : <0x2b>
    <ed2>   DW_AT_decl_file   : 20
    <ed3>   DW_AT_decl_line   : 531
    <ed5>   DW_AT_decl_column : 6
    <ed6>   DW_AT_sibling     : <0xef9>
 <2><eda>: Abbrev Number: 27 (DW_TAG_enumerator)
    <edb>   DW_AT_name        : (indirect string, offset: 0xb46): HEXSTR_NONE
    <edf>   DW_AT_const_value : 0
 <2><ee0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ee1>   DW_AT_name        : (indirect string, offset: 0x11d9): HEXSTR_NON_ASCII
    <ee5>   DW_AT_const_value : 1
 <2><ee6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x9f3): HEXSTR_ALL
    <eeb>   DW_AT_const_value : 2
 <2><eec>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eed>   DW_AT_name        : (indirect string, offset: 0x706): HEXSTR_NON_ASCII_CHARS
    <ef1>   DW_AT_const_value : 3
 <2><ef2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x1261): NUM_HEXSTR_OPTS
    <ef7>   DW_AT_const_value : 4
 <2><ef8>: Abbrev Number: 0
 <1><ef9>: Abbrev Number: 13 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0xf8e): xflag
    <efe>   DW_AT_decl_file   : 20
    <eff>   DW_AT_decl_line   : 544
    <f01>   DW_AT_decl_column : 17
    <f02>   DW_AT_type        : <0x2b>
    <f06>   DW_AT_external    : 1
    <f07>   DW_AT_declaration : 1
 <1><f08>: Abbrev Number: 13 (DW_TAG_variable)
    <f09>   DW_AT_name        : (indirect string, offset: 0xdf8): followfork
    <f0d>   DW_AT_decl_file   : 20
    <f0e>   DW_AT_decl_line   : 545
    <f10>   DW_AT_decl_column : 13
    <f11>   DW_AT_type        : <0x57a>
    <f15>   DW_AT_external    : 1
    <f16>   DW_AT_declaration : 1
 <1><f17>: Abbrev Number: 13 (DW_TAG_variable)
    <f18>   DW_AT_name        : (indirect string, offset: 0x364): output_separately
    <f1c>   DW_AT_decl_file   : 20
    <f1d>   DW_AT_decl_line   : 546
    <f1f>   DW_AT_decl_column : 13
    <f20>   DW_AT_type        : <0x57a>
    <f24>   DW_AT_external    : 1
    <f25>   DW_AT_declaration : 1
 <1><f26>: Abbrev Number: 13 (DW_TAG_variable)
    <f27>   DW_AT_name        : (indirect string, offset: 0x26b): stack_trace_enabled
    <f2b>   DW_AT_decl_file   : 20
    <f2c>   DW_AT_decl_line   : 549
    <f2e>   DW_AT_decl_column : 13
    <f2f>   DW_AT_type        : <0x57a>
    <f33>   DW_AT_external    : 1
    <f34>   DW_AT_declaration : 1
 <1><f35>: Abbrev Number: 13 (DW_TAG_variable)
    <f36>   DW_AT_name        : (indirect string, offset: 0x6eb): ptrace_setoptions
    <f3a>   DW_AT_decl_file   : 20
    <f3b>   DW_AT_decl_line   : 553
    <f3d>   DW_AT_decl_column : 17
    <f3e>   DW_AT_type        : <0x2b>
    <f42>   DW_AT_external    : 1
    <f43>   DW_AT_declaration : 1
 <1><f44>: Abbrev Number: 13 (DW_TAG_variable)
    <f45>   DW_AT_name        : (indirect string, offset: 0xb31): max_strlen
    <f49>   DW_AT_decl_file   : 20
    <f4a>   DW_AT_decl_line   : 554
    <f4c>   DW_AT_decl_column : 17
    <f4d>   DW_AT_type        : <0x2b>
    <f51>   DW_AT_external    : 1
    <f52>   DW_AT_declaration : 1
 <1><f53>: Abbrev Number: 13 (DW_TAG_variable)
    <f54>   DW_AT_name        : (indirect string, offset: 0xb69): os_release
    <f58>   DW_AT_decl_file   : 20
    <f59>   DW_AT_decl_line   : 555
    <f5b>   DW_AT_decl_column : 17
    <f5c>   DW_AT_type        : <0x2b>
    <f60>   DW_AT_external    : 1
    <f61>   DW_AT_declaration : 1
 <1><f62>: Abbrev Number: 13 (DW_TAG_variable)
    <f63>   DW_AT_name        : (indirect string, offset: 0x78a): xlat_verbosity
    <f67>   DW_AT_decl_file   : 20
    <f68>   DW_AT_decl_line   : 917
    <f6a>   DW_AT_decl_column : 24
    <f6b>   DW_AT_type        : <0xaa0>
    <f6f>   DW_AT_external    : 1
    <f70>   DW_AT_declaration : 1
 <1><f71>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f72>   DW_AT_name        : (indirect string, offset: 0x609): xlat_style_private_flag_bits
    <f76>   DW_AT_encoding    : 7	(unsigned)
    <f77>   DW_AT_byte_size   : 4
    <f78>   DW_AT_type        : <0x2b>
    <f7c>   DW_AT_decl_file   : 20
    <f7d>   DW_AT_decl_line   : 937
    <f7f>   DW_AT_decl_column : 6
    <f80>   DW_AT_sibling     : <0xf9d>
 <2><f84>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f85>   DW_AT_name        : (indirect string, offset: 0x2e3): PAF_PRINT_INDICES_BIT
    <f89>   DW_AT_const_value : 5
 <2><f8a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xc61): PAF_ARRAY_TRUNCATED_BIT
    <f8f>   DW_AT_const_value : 6
 <2><f90>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f91>   DW_AT_name        : (indirect string, offset: 0x43f): PXF_DEFAULT_STR_BIT
    <f95>   DW_AT_const_value : 7
 <2><f96>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f97>   DW_AT_name        : (indirect string, offset: 0xdda): SPFF_AUXSTR_MODE_BIT
    <f9b>   DW_AT_const_value : 8
 <2><f9c>: Abbrev Number: 0
 <1><f9d>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f9e>   DW_AT_name        : (indirect string, offset: 0xea0): find_xlat_flag_bits
    <fa2>   DW_AT_encoding    : 7	(unsigned)
    <fa3>   DW_AT_byte_size   : 4
    <fa4>   DW_AT_type        : <0x2b>
    <fa8>   DW_AT_decl_file   : 20
    <fa9>   DW_AT_decl_line   : 1441
    <fab>   DW_AT_decl_column : 6
    <fac>   DW_AT_sibling     : <0xfb7>
 <2><fb0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fb1>   DW_AT_name        : (indirect string, offset: 0xa3c): FXL_CASE_SENSITIVE_BIT
    <fb5>   DW_AT_const_value : 0
 <2><fb6>: Abbrev Number: 0
 <1><fb7>: Abbrev Number: 13 (DW_TAG_variable)
    <fb8>   DW_AT_name        : (indirect string, offset: 0xaeb): printing_tcp
    <fbc>   DW_AT_decl_file   : 20
    <fbd>   DW_AT_decl_line   : 1687
    <fbf>   DW_AT_decl_column : 20
    <fc0>   DW_AT_type        : <0x656>
    <fc4>   DW_AT_external    : 1
    <fc5>   DW_AT_declaration : 1
 <1><fc6>: Abbrev Number: 13 (DW_TAG_variable)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x5c6): errnoent
    <fcb>   DW_AT_decl_file   : 20
    <fcc>   DW_AT_decl_line   : 1885
    <fce>   DW_AT_decl_column : 26
    <fcf>   DW_AT_type        : <0x4ae>
    <fd3>   DW_AT_external    : 1
    <fd4>   DW_AT_declaration : 1
 <1><fd5>: Abbrev Number: 13 (DW_TAG_variable)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x922): signalent
    <fda>   DW_AT_decl_file   : 20
    <fdb>   DW_AT_decl_line   : 1886
    <fdd>   DW_AT_decl_column : 26
    <fde>   DW_AT_type        : <0x4ae>
    <fe2>   DW_AT_external    : 1
    <fe3>   DW_AT_declaration : 1
 <1><fe4>: Abbrev Number: 13 (DW_TAG_variable)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x101d): nerrnos
    <fe9>   DW_AT_decl_file   : 20
    <fea>   DW_AT_decl_line   : 1887
    <fec>   DW_AT_decl_column : 27
    <fed>   DW_AT_type        : <0x32>
    <ff1>   DW_AT_external    : 1
    <ff2>   DW_AT_declaration : 1
 <1><ff3>: Abbrev Number: 13 (DW_TAG_variable)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x1230): nsignals
    <ff8>   DW_AT_decl_file   : 20
    <ff9>   DW_AT_decl_line   : 1888
    <ffb>   DW_AT_decl_column : 27
    <ffc>   DW_AT_type        : <0x32>
    <1000>   DW_AT_external    : 1
    <1001>   DW_AT_declaration : 1
 <1><1002>: Abbrev Number: 10 (DW_TAG_array_type)
    <1003>   DW_AT_type        : <0x8bf>
    <1007>   DW_AT_sibling     : <0x100d>
 <2><100b>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><100c>: Abbrev Number: 0
 <1><100d>: Abbrev Number: 3 (DW_TAG_const_type)
    <100e>   DW_AT_type        : <0x1002>
 <1><1012>: Abbrev Number: 13 (DW_TAG_variable)
    <1013>   DW_AT_name        : (indirect string, offset: 0xe54): sysent0
    <1017>   DW_AT_decl_file   : 20
    <1018>   DW_AT_decl_line   : 1890
    <101a>   DW_AT_decl_column : 28
    <101b>   DW_AT_type        : <0x100d>
    <101f>   DW_AT_external    : 1
    <1020>   DW_AT_declaration : 1
 <1><1021>: Abbrev Number: 10 (DW_TAG_array_type)
    <1022>   DW_AT_type        : <0x926>
    <1026>   DW_AT_sibling     : <0x102c>
 <2><102a>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><102b>: Abbrev Number: 0
 <1><102c>: Abbrev Number: 3 (DW_TAG_const_type)
    <102d>   DW_AT_type        : <0x1021>
 <1><1031>: Abbrev Number: 13 (DW_TAG_variable)
    <1032>   DW_AT_name        : (indirect string, offset: 0x128c): ioctlent0
    <1036>   DW_AT_decl_file   : 20
    <1037>   DW_AT_decl_line   : 1891
    <1039>   DW_AT_decl_column : 30
    <103a>   DW_AT_type        : <0x102c>
    <103e>   DW_AT_external    : 1
    <103f>   DW_AT_declaration : 1
 <1><1040>: Abbrev Number: 13 (DW_TAG_variable)
    <1041>   DW_AT_name        : (indirect string, offset: 0x119d): personality_names
    <1045>   DW_AT_decl_file   : 20
    <1046>   DW_AT_decl_line   : 1893
    <1048>   DW_AT_decl_column : 26
    <1049>   DW_AT_type        : <0x4ae>
    <104d>   DW_AT_external    : 1
    <104e>   DW_AT_declaration : 1
 <1><104f>: Abbrev Number: 13 (DW_TAG_variable)
    <1050>   DW_AT_name        : (indirect string, offset: 0x942): sysent
    <1054>   DW_AT_decl_file   : 20
    <1055>   DW_AT_decl_line   : 1896
    <1057>   DW_AT_decl_column : 29
    <1058>   DW_AT_type        : <0xa0b>
    <105c>   DW_AT_external    : 1
    <105d>   DW_AT_declaration : 1
 <1><105e>: Abbrev Number: 13 (DW_TAG_variable)
    <105f>   DW_AT_name        : (indirect string, offset: 0xdef): ioctlent
    <1063>   DW_AT_decl_file   : 20
    <1064>   DW_AT_decl_line   : 1897
    <1066>   DW_AT_decl_column : 31
    <1067>   DW_AT_type        : <0x106d>
    <106b>   DW_AT_external    : 1
    <106c>   DW_AT_declaration : 1
 <1><106d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <106e>   DW_AT_byte_size   : 4
    <106f>   DW_AT_type        : <0x926>
 <1><1073>: Abbrev Number: 13 (DW_TAG_variable)
    <1074>   DW_AT_name        : (indirect string, offset: 0x92c): nsyscalls
    <1078>   DW_AT_decl_file   : 20
    <1079>   DW_AT_decl_line   : 1903
    <107b>   DW_AT_decl_column : 17
    <107c>   DW_AT_type        : <0x2b>
    <1080>   DW_AT_external    : 1
    <1081>   DW_AT_declaration : 1
 <1><1082>: Abbrev Number: 13 (DW_TAG_variable)
    <1083>   DW_AT_name        : (indirect string, offset: 0x1042): nioctlents
    <1087>   DW_AT_decl_file   : 20
    <1088>   DW_AT_decl_line   : 1904
    <108a>   DW_AT_decl_column : 17
    <108b>   DW_AT_type        : <0x2b>
    <108f>   DW_AT_external    : 1
    <1090>   DW_AT_declaration : 1
 <1><1091>: Abbrev Number: 10 (DW_TAG_array_type)
    <1092>   DW_AT_type        : <0x32>
    <1096>   DW_AT_sibling     : <0x10a1>
 <2><109a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <109b>   DW_AT_type        : <0x2b>
    <109f>   DW_AT_upper_bound : 2
 <2><10a0>: Abbrev Number: 0
 <1><10a1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10a2>   DW_AT_type        : <0x1091>
 <1><10a6>: Abbrev Number: 13 (DW_TAG_variable)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x10cd): nsyscall_vec
    <10ab>   DW_AT_decl_file   : 20
    <10ac>   DW_AT_decl_line   : 1906
    <10ae>   DW_AT_decl_column : 27
    <10af>   DW_AT_type        : <0x10a1>
    <10b3>   DW_AT_external    : 1
    <10b4>   DW_AT_declaration : 1
 <1><10b5>: Abbrev Number: 10 (DW_TAG_array_type)
    <10b6>   DW_AT_type        : <0xa11>
    <10ba>   DW_AT_sibling     : <0x10c5>
 <2><10be>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10bf>   DW_AT_type        : <0x2b>
    <10c3>   DW_AT_upper_bound : 2
 <2><10c4>: Abbrev Number: 0
 <1><10c5>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c6>   DW_AT_type        : <0x10b5>
 <1><10ca>: Abbrev Number: 13 (DW_TAG_variable)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x854): sysent_vec
    <10cf>   DW_AT_decl_file   : 20
    <10d0>   DW_AT_decl_line   : 1907
    <10d2>   DW_AT_decl_column : 35
    <10d3>   DW_AT_type        : <0x10c5>
    <10d7>   DW_AT_external    : 1
    <10d8>   DW_AT_declaration : 1
 <1><10d9>: Abbrev Number: 13 (DW_TAG_variable)
    <10da>   DW_AT_name        : (indirect string, offset: 0x3c6): inject_vec
    <10de>   DW_AT_decl_file   : 20
    <10df>   DW_AT_decl_line   : 1908
    <10e1>   DW_AT_decl_column : 28
    <10e2>   DW_AT_type        : <0xa16>
    <10e6>   DW_AT_external    : 1
    <10e7>   DW_AT_declaration : 1
 <1><10e8>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10e9>   DW_AT_name        : (indirect string, offset: 0xefe): audit_arch_t
    <10ed>   DW_AT_byte_size   : 8
    <10ee>   DW_AT_decl_file   : 20
    <10ef>   DW_AT_decl_line   : 1910
    <10f1>   DW_AT_decl_column : 8
    <10f2>   DW_AT_sibling     : <0x1117>
 <2><10f6>: Abbrev Number: 23 (DW_TAG_member)
    <10f7>   DW_AT_name        : (indirect string, offset: 0x5fb): arch
    <10fb>   DW_AT_decl_file   : 20
    <10fc>   DW_AT_decl_line   : 1911
    <10fe>   DW_AT_decl_column : 15
    <10ff>   DW_AT_type        : <0x2b>
    <1103>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1106>: Abbrev Number: 23 (DW_TAG_member)
    <1107>   DW_AT_name        : (indirect string, offset: 0xad1): flag
    <110b>   DW_AT_decl_file   : 20
    <110c>   DW_AT_decl_line   : 1912
    <110e>   DW_AT_decl_column : 15
    <110f>   DW_AT_type        : <0x2b>
    <1113>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1116>: Abbrev Number: 0
 <1><1117>: Abbrev Number: 3 (DW_TAG_const_type)
    <1118>   DW_AT_type        : <0x10e8>
 <1><111c>: Abbrev Number: 10 (DW_TAG_array_type)
    <111d>   DW_AT_type        : <0x1117>
    <1121>   DW_AT_sibling     : <0x112c>
 <2><1125>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1126>   DW_AT_type        : <0x2b>
    <112a>   DW_AT_upper_bound : 2
 <2><112b>: Abbrev Number: 0
 <1><112c>: Abbrev Number: 3 (DW_TAG_const_type)
    <112d>   DW_AT_type        : <0x111c>
 <1><1131>: Abbrev Number: 13 (DW_TAG_variable)
    <1132>   DW_AT_name        : (indirect string, offset: 0xa2d): audit_arch_vec
    <1136>   DW_AT_decl_file   : 20
    <1137>   DW_AT_decl_line   : 1915
    <1139>   DW_AT_decl_column : 34
    <113a>   DW_AT_type        : <0x112c>
    <113e>   DW_AT_external    : 1
    <113f>   DW_AT_declaration : 1
 <1><1140>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1141>   DW_AT_byte_size   : 180
    <1142>   DW_AT_decl_file   : 22
    <1143>   DW_AT_decl_line   : 2
    <1144>   DW_AT_decl_column : 9
    <1145>   DW_AT_sibling     : <0x13fa>
 <2><1149>: Abbrev Number: 9 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0x21c): block_ioctl
    <114e>   DW_AT_decl_file   : 22
    <114f>   DW_AT_decl_line   : 3
    <1150>   DW_AT_decl_column : 8
    <1151>   DW_AT_type        : <0x1414>
    <1155>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1158>: Abbrev Number: 9 (DW_TAG_member)
    <1159>   DW_AT_name        : (indirect string, offset: 0xbcd): btrfs_ioctl
    <115d>   DW_AT_decl_file   : 22
    <115e>   DW_AT_decl_line   : 6
    <115f>   DW_AT_decl_column : 8
    <1160>   DW_AT_type        : <0x1414>
    <1164>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1167>: Abbrev Number: 9 (DW_TAG_member)
    <1168>   DW_AT_name        : (indirect string, offset: 0x7cd): evdev_write_ioctl_mpers
    <116c>   DW_AT_decl_file   : 22
    <116d>   DW_AT_decl_line   : 9
