Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1719 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5c7): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x6eb): mpers-m32/struct_loop_info.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xea4): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b5): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x100b): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9b5): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x358): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x25a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdfd): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x490): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8ac): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xef5): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8dc): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7ac): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb7e): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbb4): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2d4): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd10): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc7d): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x401): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x456): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x364): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb9f): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf9d): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe0d): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb1d): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10e9): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe33): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xe6>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 3
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xadf): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfc6): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x277): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xe0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3ad): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xfec): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xe0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x77f): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc6c): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xb5a): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xed>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x36c): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 9 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xa31): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 9 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4df): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xe0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 9 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf4a): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xe0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 9 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7f3): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xe0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 9 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xe0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 9 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x1044): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xe0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 9 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x92d): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xe0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 9 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x99e): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xe0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 9 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xda8): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xe0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 9 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xe0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 9 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xccf): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xe0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 9 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xe0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 9 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x573): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 9 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x212): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 9 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xfb1): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 9 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x7df): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 9 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x858): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 9 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x245): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 9 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe59): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 9 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xcdf): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 9 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 9 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x717): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 9 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa71): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 9 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfd0): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 9 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3d1): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 9 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc42): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xcd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 9 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x9f3): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x122>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 9 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0xa55): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 9 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x80d): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xaff): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x485): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x316): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 10 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xe6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x380): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 10 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xe6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x53e): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x101e): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xdf6): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x251): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 10 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x54d): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x264): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe68): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6d3): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xe0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbdf): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xe0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 10 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xe0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1bc): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xedc): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x375): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x9ec): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x109f): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4ca): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf71): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9ff): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x413): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0x69f): __kernel_old_dev_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 21
    <538>   DW_AT_decl_column : 24
    <539>   DW_AT_type        : <0x24>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0xab5): __kernel_long_t
    <542>   DW_AT_decl_file   : 15
    <543>   DW_AT_decl_line   : 15
    <544>   DW_AT_decl_column : 15
    <545>   DW_AT_type        : <0xae>
 <1><549>: Abbrev Number: 4 (DW_TAG_typedef)
    <54a>   DW_AT_name        : (indirect string, offset: 0x52d): __kernel_ulong_t
    <54e>   DW_AT_decl_file   : 15
    <54f>   DW_AT_decl_line   : 16
    <550>   DW_AT_decl_column : 23
    <551>   DW_AT_type        : <0x37>
 <1><555>: Abbrev Number: 4 (DW_TAG_typedef)
    <556>   DW_AT_name        : (indirect string, offset: 0x3df): kernel_long_t
    <55a>   DW_AT_decl_file   : 16
    <55b>   DW_AT_decl_line   : 16
    <55c>   DW_AT_decl_column : 25
    <55d>   DW_AT_type        : <0x53d>
 <1><561>: Abbrev Number: 4 (DW_TAG_typedef)
    <562>   DW_AT_name        : (indirect string, offset: 0x8cd): kernel_ulong_t
    <566>   DW_AT_decl_file   : 16
    <567>   DW_AT_decl_line   : 17
    <568>   DW_AT_decl_column : 26
    <569>   DW_AT_type        : <0x549>
 <1><56d>: Abbrev Number: 3 (DW_TAG_const_type)
    <56e>   DW_AT_type        : <0x561>
 <1><572>: Abbrev Number: 8 (DW_TAG_structure_type)
    <573>   DW_AT_name        : (indirect string, offset: 0xbfd): list_item
    <577>   DW_AT_byte_size   : 8
    <578>   DW_AT_decl_file   : 17
    <579>   DW_AT_decl_line   : 92
    <57a>   DW_AT_decl_column : 8
    <57b>   DW_AT_sibling     : <0x59e>
 <2><57f>: Abbrev Number: 9 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0x10e4): prev
    <584>   DW_AT_decl_file   : 17
    <585>   DW_AT_decl_line   : 93
    <586>   DW_AT_decl_column : 20
    <587>   DW_AT_type        : <0x59e>
    <58b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58e>: Abbrev Number: 9 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x10da): next
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 94
    <595>   DW_AT_decl_column : 20
    <596>   DW_AT_type        : <0x59e>
    <59a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59d>: Abbrev Number: 0
 <1><59e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59f>   DW_AT_byte_size   : 4
    <5a0>   DW_AT_type        : <0x572>
 <1><5a4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x8a5): sysent
    <5a9>   DW_AT_byte_size   : 20
    <5aa>   DW_AT_decl_file   : 18
    <5ab>   DW_AT_decl_line   : 13
    <5ac>   DW_AT_decl_column : 16
    <5ad>   DW_AT_sibling     : <0x5fd>
 <2><5b1>: Abbrev Number: 9 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x1035): nargs
    <5b6>   DW_AT_decl_file   : 18
    <5b7>   DW_AT_decl_line   : 14
    <5b8>   DW_AT_decl_column : 11
    <5b9>   DW_AT_type        : <0x2b>
    <5bd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c0>: Abbrev Number: 9 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x9ab): sys_flags
    <5c5>   DW_AT_decl_file   : 18
    <5c6>   DW_AT_decl_line   : 15
    <5c7>   DW_AT_decl_column : 6
    <5c8>   DW_AT_type        : <0x64>
    <5cc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cf>: Abbrev Number: 18 (DW_TAG_member)
    <5d0>   DW_AT_name        : sen
    <5d4>   DW_AT_decl_file   : 18
    <5d5>   DW_AT_decl_line   : 16
    <5d6>   DW_AT_decl_column : 6
    <5d7>   DW_AT_type        : <0x64>
    <5db>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5de>: Abbrev Number: 9 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x30d): sys_func
    <5e3>   DW_AT_decl_file   : 18
    <5e4>   DW_AT_decl_line   : 17
    <5e5>   DW_AT_decl_column : 8
    <5e6>   DW_AT_type        : <0x853>
    <5ea>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ed>: Abbrev Number: 9 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x26e): sys_name
    <5f2>   DW_AT_decl_file   : 18
    <5f3>   DW_AT_decl_line   : 18
    <5f4>   DW_AT_decl_column : 14
    <5f5>   DW_AT_type        : <0x1d9>
    <5f9>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5fc>: Abbrev Number: 0
 <1><5fd>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fe>   DW_AT_prototyped  : 1
    <5ff>   DW_AT_type        : <0x64>
    <603>   DW_AT_sibling     : <0x60d>
 <2><607>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <608>   DW_AT_type        : <0x60d>
 <2><60c>: Abbrev Number: 0
 <1><60d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60e>   DW_AT_byte_size   : 4
    <60f>   DW_AT_type        : <0x618>
 <1><613>: Abbrev Number: 3 (DW_TAG_const_type)
    <614>   DW_AT_type        : <0x60d>
 <1><618>: Abbrev Number: 21 (DW_TAG_structure_type)
    <619>   DW_AT_name        : tcb
    <61d>   DW_AT_byte_size   : 200
    <61e>   DW_AT_decl_file   : 19
    <61f>   DW_AT_decl_line   : 262
    <621>   DW_AT_decl_column : 8
    <622>   DW_AT_sibling     : <0x853>
 <2><626>: Abbrev Number: 22 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x4d9): flags
    <62b>   DW_AT_decl_file   : 19
    <62c>   DW_AT_decl_line   : 263
    <62e>   DW_AT_decl_column : 6
    <62f>   DW_AT_type        : <0x64>
    <633>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><636>: Abbrev Number: 23 (DW_TAG_member)
    <637>   DW_AT_name        : pid
    <63b>   DW_AT_decl_file   : 19
    <63c>   DW_AT_decl_line   : 264
    <63e>   DW_AT_decl_column : 6
    <63f>   DW_AT_type        : <0x64>
    <643>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><646>: Abbrev Number: 22 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <64b>   DW_AT_decl_file   : 19
    <64c>   DW_AT_decl_line   : 265
    <64e>   DW_AT_decl_column : 6
    <64f>   DW_AT_type        : <0x64>
    <653>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><656>: Abbrev Number: 22 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0x399): currpers
    <65b>   DW_AT_decl_file   : 19
    <65c>   DW_AT_decl_line   : 267
    <65e>   DW_AT_decl_column : 15
    <65f>   DW_AT_type        : <0x2b>
    <663>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><666>: Abbrev Number: 22 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xb52): u_error
    <66b>   DW_AT_decl_file   : 19
    <66c>   DW_AT_decl_line   : 269
    <66e>   DW_AT_decl_column : 16
    <66f>   DW_AT_type        : <0x37>
    <673>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><676>: Abbrev Number: 22 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <67b>   DW_AT_decl_file   : 19
    <67c>   DW_AT_decl_line   : 270
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x561>
    <683>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><686>: Abbrev Number: 22 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0xb95): true_scno
    <68b>   DW_AT_decl_file   : 19
    <68c>   DW_AT_decl_line   : 271
    <68e>   DW_AT_decl_column : 17
    <68f>   DW_AT_type        : <0x561>
    <693>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><696>: Abbrev Number: 22 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x1a6): u_arg
    <69b>   DW_AT_decl_file   : 19
    <69c>   DW_AT_decl_line   : 272
    <69e>   DW_AT_decl_column : 17
    <69f>   DW_AT_type        : <0x983>
    <6a3>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a6>: Abbrev Number: 22 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x9c2): u_rval
    <6ab>   DW_AT_decl_file   : 19
    <6ac>   DW_AT_decl_line   : 273
    <6ae>   DW_AT_decl_column : 16
    <6af>   DW_AT_type        : <0x555>
    <6b3>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b6>: Abbrev Number: 22 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xad1): sys_func_rval
    <6bb>   DW_AT_decl_file   : 19
    <6bc>   DW_AT_decl_line   : 274
    <6be>   DW_AT_decl_column : 6
    <6bf>   DW_AT_type        : <0x64>
    <6c3>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c6>: Abbrev Number: 22 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xd01): curcol
    <6cb>   DW_AT_decl_file   : 19
    <6cc>   DW_AT_decl_line   : 275
    <6ce>   DW_AT_decl_column : 6
    <6cf>   DW_AT_type        : <0x64>
    <6d3>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d6>: Abbrev Number: 22 (DW_TAG_member)
    <6d7>   DW_AT_name        : (indirect string, offset: 0x9d4): outf
    <6db>   DW_AT_decl_file   : 19
    <6dc>   DW_AT_decl_line   : 276
    <6de>   DW_AT_decl_column : 8
    <6df>   DW_AT_type        : <0x41e>
    <6e3>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e6>: Abbrev Number: 22 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xf1b): staged_output_data
    <6eb>   DW_AT_decl_file   : 19
    <6ec>   DW_AT_decl_line   : 277
    <6ee>   DW_AT_decl_column : 29
    <6ef>   DW_AT_type        : <0x999>
    <6f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f6>: Abbrev Number: 22 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xa9c): auxstr
    <6fb>   DW_AT_decl_file   : 19
    <6fc>   DW_AT_decl_line   : 279
    <6fe>   DW_AT_decl_column : 14
    <6ff>   DW_AT_type        : <0x1d9>
    <703>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><706>: Abbrev Number: 22 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <70b>   DW_AT_decl_file   : 19
    <70c>   DW_AT_decl_line   : 280
    <70e>   DW_AT_decl_column : 8
    <70f>   DW_AT_type        : <0xcd>
    <713>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><716>: Abbrev Number: 22 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0xc32): _free_priv_data
    <71b>   DW_AT_decl_file   : 19
    <71c>   DW_AT_decl_line   : 281
    <71e>   DW_AT_decl_column : 9
    <71f>   DW_AT_type        : <0x9ab>
    <723>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><726>: Abbrev Number: 22 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0x18c): s_ent
    <72b>   DW_AT_decl_file   : 19
    <72c>   DW_AT_decl_line   : 282
    <72e>   DW_AT_decl_column : 23
    <72f>   DW_AT_type        : <0x9b1>
    <733>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><736>: Abbrev Number: 22 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <73b>   DW_AT_decl_file   : 19
    <73c>   DW_AT_decl_line   : 285
    <73e>   DW_AT_decl_column : 23
    <73f>   DW_AT_type        : <0x9b1>
    <743>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><746>: Abbrev Number: 22 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x38e): inject_vec
    <74b>   DW_AT_decl_file   : 19
    <74c>   DW_AT_decl_line   : 286
    <74e>   DW_AT_decl_column : 22
    <74f>   DW_AT_type        : <0x9bc>
    <753>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><756>: Abbrev Number: 22 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x816): stime
    <75b>   DW_AT_decl_file   : 19
    <75c>   DW_AT_decl_line   : 287
    <75e>   DW_AT_decl_column : 18
    <75f>   DW_AT_type        : <0x133>
    <763>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><766>: Abbrev Number: 22 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x3a2): ltime
    <76b>   DW_AT_decl_file   : 19
    <76c>   DW_AT_decl_line   : 288
    <76e>   DW_AT_decl_column : 18
    <76f>   DW_AT_type        : <0x133>
    <773>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><776>: Abbrev Number: 22 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0xffc): atime
    <77b>   DW_AT_decl_file   : 19
    <77c>   DW_AT_decl_line   : 289
    <77e>   DW_AT_decl_column : 18
    <77f>   DW_AT_type        : <0x133>
    <783>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><786>: Abbrev Number: 22 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0x4d3): etime
    <78b>   DW_AT_decl_file   : 19
    <78c>   DW_AT_decl_line   : 290
    <78e>   DW_AT_decl_column : 18
    <78f>   DW_AT_type        : <0x133>
    <793>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><797>: Abbrev Number: 22 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0xd65): delay_expiration_time
    <79c>   DW_AT_decl_file   : 19
    <79d>   DW_AT_decl_line   : 291
    <79f>   DW_AT_decl_column : 18
    <7a0>   DW_AT_type        : <0x133>
    <7a4>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a8>: Abbrev Number: 22 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7ad>   DW_AT_decl_file   : 19
    <7ae>   DW_AT_decl_line   : 298
    <7b0>   DW_AT_decl_column : 15
    <7b1>   DW_AT_type        : <0x2b>
    <7b5>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b9>: Abbrev Number: 22 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0xf57): last_dirfd
    <7be>   DW_AT_decl_file   : 19
    <7bf>   DW_AT_decl_line   : 301
    <7c1>   DW_AT_decl_column : 6
    <7c2>   DW_AT_type        : <0x64>
    <7c6>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ca>: Abbrev Number: 22 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xf7d): mmap_cache
    <7cf>   DW_AT_decl_file   : 19
    <7d0>   DW_AT_decl_line   : 304
    <7d2>   DW_AT_decl_column : 23
    <7d3>   DW_AT_type        : <0x9d8>
    <7d7>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7db>: Abbrev Number: 22 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xb6b): wait_data_idx
    <7e0>   DW_AT_decl_file   : 19
    <7e1>   DW_AT_decl_line   : 311
    <7e3>   DW_AT_decl_column : 9
    <7e4>   DW_AT_type        : <0x122>
    <7e8>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7ec>: Abbrev Number: 22 (DW_TAG_member)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xaa3): delayed_wait_data
    <7f1>   DW_AT_decl_file   : 19
    <7f2>   DW_AT_decl_line   : 313
    <7f4>   DW_AT_decl_column : 24
    <7f5>   DW_AT_type        : <0x9e4>
    <7f9>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7fd>: Abbrev Number: 22 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xb13): wait_list
    <802>   DW_AT_decl_file   : 19
    <803>   DW_AT_decl_line   : 314
    <805>   DW_AT_decl_column : 19
    <806>   DW_AT_type        : <0x572>
    <80a>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x708): vcpu_info_list
    <813>   DW_AT_decl_file   : 19
    <814>   DW_AT_decl_line   : 318
    <816>   DW_AT_decl_column : 20
    <817>   DW_AT_type        : <0x9f0>
    <81b>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81f>: Abbrev Number: 22 (DW_TAG_member)
    <820>   DW_AT_name        : (indirect string, offset: 0xcc4): unwind_ctx
    <824>   DW_AT_decl_file   : 19
    <825>   DW_AT_decl_line   : 322
    <827>   DW_AT_decl_column : 8
    <828>   DW_AT_type        : <0xcd>
    <82c>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><830>: Abbrev Number: 22 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x4bd): unwind_queue
    <835>   DW_AT_decl_file   : 19
    <836>   DW_AT_decl_line   : 323
    <838>   DW_AT_decl_column : 25
    <839>   DW_AT_type        : <0x9fc>
    <83d>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><841>: Abbrev Number: 22 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <846>   DW_AT_decl_file   : 19
    <847>   DW_AT_decl_line   : 327
    <849>   DW_AT_decl_column : 7
    <84a>   DW_AT_type        : <0xa02>
    <84e>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><852>: Abbrev Number: 0
 <1><853>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <854>   DW_AT_byte_size   : 4
    <855>   DW_AT_type        : <0x5fd>
 <1><859>: Abbrev Number: 4 (DW_TAG_typedef)
    <85a>   DW_AT_name        : (indirect string, offset: 0x51f): struct_sysent
    <85e>   DW_AT_decl_file   : 18
    <85f>   DW_AT_decl_line   : 19
    <860>   DW_AT_decl_column : 3
    <861>   DW_AT_type        : <0x5a4>
 <1><865>: Abbrev Number: 3 (DW_TAG_const_type)
    <866>   DW_AT_type        : <0x859>
 <1><86a>: Abbrev Number: 13 (DW_TAG_variable)
    <86b>   DW_AT_name        : (indirect string, offset: 0xd51): current_personality
    <86f>   DW_AT_decl_file   : 19
    <870>   DW_AT_decl_line   : 158
    <871>   DW_AT_decl_column : 17
    <872>   DW_AT_type        : <0x2b>
    <876>   DW_AT_external    : 1
    <877>   DW_AT_declaration : 1
 <1><878>: Abbrev Number: 13 (DW_TAG_variable)
    <879>   DW_AT_name        : (indirect string, offset: 0x847): current_wordsize
    <87d>   DW_AT_decl_file   : 19
    <87e>   DW_AT_decl_line   : 171
    <87f>   DW_AT_decl_column : 17
    <880>   DW_AT_type        : <0x2b>
    <884>   DW_AT_external    : 1
    <885>   DW_AT_declaration : 1
 <1><886>: Abbrev Number: 13 (DW_TAG_variable)
    <887>   DW_AT_name        : (indirect string, offset: 0xa7a): current_klongsize
    <88b>   DW_AT_decl_file   : 19
    <88c>   DW_AT_decl_line   : 176
    <88d>   DW_AT_decl_column : 17
    <88e>   DW_AT_type        : <0x2b>
    <892>   DW_AT_external    : 1
    <893>   DW_AT_declaration : 1
 <1><894>: Abbrev Number: 8 (DW_TAG_structure_type)
    <895>   DW_AT_name        : (indirect string, offset: 0xc9b): ioctlent
    <899>   DW_AT_byte_size   : 8
    <89a>   DW_AT_decl_file   : 19
    <89b>   DW_AT_decl_line   : 217
    <89c>   DW_AT_decl_column : 16
    <89d>   DW_AT_sibling     : <0x8c0>
 <2><8a1>: Abbrev Number: 9 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xf43): symbol
    <8a6>   DW_AT_decl_file   : 19
    <8a7>   DW_AT_decl_line   : 218
    <8a8>   DW_AT_decl_column : 14
    <8a9>   DW_AT_type        : <0x1d9>
    <8ad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b0>: Abbrev Number: 9 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xd1a): code
    <8b5>   DW_AT_decl_file   : 19
    <8b6>   DW_AT_decl_line   : 219
    <8b7>   DW_AT_decl_column : 15
    <8b8>   DW_AT_type        : <0x2b>
    <8bc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8bf>: Abbrev Number: 0
 <1><8c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xc5c): struct_ioctlent
    <8c5>   DW_AT_decl_file   : 19
    <8c6>   DW_AT_decl_line   : 220
    <8c7>   DW_AT_decl_column : 3
    <8c8>   DW_AT_type        : <0x894>
 <1><8cc>: Abbrev Number: 3 (DW_TAG_const_type)
    <8cd>   DW_AT_type        : <0x8c0>
 <1><8d1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x83b): inject_data
    <8d6>   DW_AT_byte_size   : 10
    <8d7>   DW_AT_decl_file   : 19
    <8d8>   DW_AT_decl_line   : 241
    <8d9>   DW_AT_decl_column : 8
    <8da>   DW_AT_sibling     : <0x939>
 <2><8de>: Abbrev Number: 9 (DW_TAG_member)
    <8df>   DW_AT_name        : (indirect string, offset: 0x4d9): flags
    <8e3>   DW_AT_decl_file   : 19
    <8e4>   DW_AT_decl_line   : 242
    <8e5>   DW_AT_decl_column : 10
    <8e6>   DW_AT_type        : <0xf2>
    <8ea>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ed>: Abbrev Number: 9 (DW_TAG_member)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x95f): signo
    <8f2>   DW_AT_decl_file   : 19
    <8f3>   DW_AT_decl_line   : 243
    <8f4>   DW_AT_decl_column : 10
    <8f5>   DW_AT_type        : <0xf2>
    <8f9>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8fc>: Abbrev Number: 9 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <901>   DW_AT_decl_file   : 19
    <902>   DW_AT_decl_line   : 244
    <903>   DW_AT_decl_column : 11
    <904>   DW_AT_type        : <0xfe>
    <908>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><90b>: Abbrev Number: 9 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0xcef): delay_idx
    <910>   DW_AT_decl_file   : 19
    <911>   DW_AT_decl_line   : 245
    <912>   DW_AT_decl_column : 11
    <913>   DW_AT_type        : <0xfe>
    <917>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><91a>: Abbrev Number: 9 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x565): poke_idx
    <91f>   DW_AT_decl_file   : 19
    <920>   DW_AT_decl_line   : 246
    <921>   DW_AT_decl_column : 11
    <922>   DW_AT_type        : <0xfe>
    <926>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><929>: Abbrev Number: 9 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <92e>   DW_AT_decl_file   : 19
    <92f>   DW_AT_decl_line   : 247
    <930>   DW_AT_decl_column : 11
    <931>   DW_AT_type        : <0xfe>
    <935>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 8 (DW_TAG_structure_type)
    <93a>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <93e>   DW_AT_byte_size   : 16
    <93f>   DW_AT_decl_file   : 19
    <940>   DW_AT_decl_line   : 250
    <941>   DW_AT_decl_column : 8
    <942>   DW_AT_sibling     : <0x983>
 <2><946>: Abbrev Number: 9 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0xa4f): first
    <94b>   DW_AT_decl_file   : 19
    <94c>   DW_AT_decl_line   : 251
    <94d>   DW_AT_decl_column : 11
    <94e>   DW_AT_type        : <0xfe>
    <952>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><955>: Abbrev Number: 9 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x110d): last
    <95a>   DW_AT_decl_file   : 19
    <95b>   DW_AT_decl_line   : 252
    <95c>   DW_AT_decl_column : 11
    <95d>   DW_AT_type        : <0xfe>
    <961>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><964>: Abbrev Number: 9 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x3a8): step
    <969>   DW_AT_decl_file   : 19
    <96a>   DW_AT_decl_line   : 253
    <96b>   DW_AT_decl_column : 11
    <96c>   DW_AT_type        : <0xfe>
    <970>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><973>: Abbrev Number: 9 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x10df): data
    <978>   DW_AT_decl_file   : 19
    <979>   DW_AT_decl_line   : 254
    <97a>   DW_AT_decl_column : 21
    <97b>   DW_AT_type        : <0x8d1>
    <97f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><982>: Abbrev Number: 0
 <1><983>: Abbrev Number: 10 (DW_TAG_array_type)
    <984>   DW_AT_type        : <0x561>
    <988>   DW_AT_sibling     : <0x993>
 <2><98c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <98d>   DW_AT_type        : <0x2b>
    <991>   DW_AT_upper_bound : 5
 <2><992>: Abbrev Number: 0
 <1><993>: Abbrev Number: 16 (DW_TAG_structure_type)
    <994>   DW_AT_name        : (indirect string, offset: 0xf1b): staged_output_data
    <998>   DW_AT_declaration : 1
 <1><999>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <99a>   DW_AT_byte_size   : 4
    <99b>   DW_AT_type        : <0x993>
 <1><99f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a0>   DW_AT_prototyped  : 1
    <9a1>   DW_AT_sibling     : <0x9ab>
 <2><9a5>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9a6>   DW_AT_type        : <0xcd>
 <2><9aa>: Abbrev Number: 0
 <1><9ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ac>   DW_AT_byte_size   : 4
    <9ad>   DW_AT_type        : <0x99f>
 <1><9b1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b2>   DW_AT_byte_size   : 4
    <9b3>   DW_AT_type        : <0x865>
 <1><9b7>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b8>   DW_AT_type        : <0x9b1>
 <1><9bc>: Abbrev Number: 10 (DW_TAG_array_type)
    <9bd>   DW_AT_type        : <0x9cc>
    <9c1>   DW_AT_sibling     : <0x9cc>
 <2><9c5>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9c6>   DW_AT_type        : <0x2b>
    <9ca>   DW_AT_upper_bound : 2
 <2><9cb>: Abbrev Number: 0
 <1><9cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_type        : <0x939>
 <1><9d2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9d7>   DW_AT_declaration : 1
 <1><9d8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d9>   DW_AT_byte_size   : 4
    <9da>   DW_AT_type        : <0x9d2>
 <1><9de>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9df>   DW_AT_name        : (indirect string, offset: 0x3c3): tcb_wait_data
    <9e3>   DW_AT_declaration : 1
 <1><9e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e5>   DW_AT_byte_size   : 4
    <9e6>   DW_AT_type        : <0x9de>
 <1><9ea>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <9ef>   DW_AT_declaration : 1
 <1><9f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f1>   DW_AT_byte_size   : 4
    <9f2>   DW_AT_type        : <0x9ea>
 <1><9f6>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f7>   DW_AT_name        : (indirect string, offset: 0xeff): unwind_queue_t
    <9fb>   DW_AT_declaration : 1
 <1><9fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fd>   DW_AT_byte_size   : 4
    <9fe>   DW_AT_type        : <0x9f6>
 <1><a02>: Abbrev Number: 10 (DW_TAG_array_type)
    <a03>   DW_AT_type        : <0xe6>
    <a07>   DW_AT_sibling     : <0xa12>
 <2><a0b>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a0c>   DW_AT_type        : <0x2b>
    <a10>   DW_AT_upper_bound : 15
 <2><a11>: Abbrev Number: 0
 <1><a12>: Abbrev Number: 12 (DW_TAG_variable)
    <a13>   DW_AT_name        : (indirect string, offset: 0xba8): stub_sysent
    <a17>   DW_AT_decl_file   : 19
    <a18>   DW_AT_decl_line   : 400
    <a1a>   DW_AT_decl_column : 28
    <a1b>   DW_AT_type        : <0x865>
    <a1f>   DW_AT_external    : 1
    <a20>   DW_AT_declaration : 1
 <1><a21>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a22>   DW_AT_name        : (indirect string, offset: 0x10c2): xlat_type
    <a26>   DW_AT_encoding    : 7	(unsigned)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_type        : <0x2b>
    <a2c>   DW_AT_decl_file   : 20
    <a2d>   DW_AT_decl_line   : 13
    <a2e>   DW_AT_decl_column : 6
    <a2f>   DW_AT_sibling     : <0xa46>
 <2><a33>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a34>   DW_AT_name        : (indirect string, offset: 0x2dd): XT_NORMAL
    <a38>   DW_AT_const_value : 0
 <2><a39>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3a>   DW_AT_name        : (indirect string, offset: 0xc73): XT_SORTED
    <a3e>   DW_AT_const_value : 1
 <2><a3f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a40>   DW_AT_name        : (indirect string, offset: 0xddd): XT_INDEXED
    <a44>   DW_AT_const_value : 2
 <2><a45>: Abbrev Number: 0
 <1><a46>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a47>   DW_AT_name        : (indirect string, offset: 0xbd4): xlat_style
    <a4b>   DW_AT_encoding    : 7	(unsigned)
    <a4c>   DW_AT_byte_size   : 4
    <a4d>   DW_AT_type        : <0x2b>
    <a51>   DW_AT_decl_file   : 20
    <a52>   DW_AT_decl_line   : 19
    <a53>   DW_AT_decl_column : 6
    <a54>   DW_AT_sibling     : <0xa83>
 <2><a58>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a5d>   DW_AT_const_value : 0
 <2><a5e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xc0f): XLAT_STYLE_RAW
    <a63>   DW_AT_const_value : 1
 <2><a64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0x108d): XLAT_STYLE_ABBREV
    <a69>   DW_AT_const_value : 2
 <2><a6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x2fa): XLAT_STYLE_VERBOSE
    <a6f>   DW_AT_const_value : 3
 <2><a70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a71>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a75>   DW_AT_const_value : 0
 <2><a76>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a77>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a7b>   DW_AT_const_value : 4
 <2><a7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x10fc): XLAT_STYLE_FMT_D
    <a81>   DW_AT_const_value : 8
 <2><a82>: Abbrev Number: 0
 <1><a83>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a84>   DW_AT_name        : (indirect string, offset: 0x32b): xlat_data
    <a88>   DW_AT_byte_size   : 12
    <a89>   DW_AT_decl_file   : 20
    <a8a>   DW_AT_decl_line   : 51
    <a8b>   DW_AT_decl_column : 8
    <a8c>   DW_AT_sibling     : <0xaaf>
 <2><a90>: Abbrev Number: 18 (DW_TAG_member)
    <a91>   DW_AT_name        : val
    <a95>   DW_AT_decl_file   : 20
    <a96>   DW_AT_decl_line   : 52
    <a97>   DW_AT_decl_column : 11
    <a98>   DW_AT_type        : <0x116>
    <a9c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a9f>: Abbrev Number: 18 (DW_TAG_member)
    <aa0>   DW_AT_name        : str
    <aa4>   DW_AT_decl_file   : 20
    <aa5>   DW_AT_decl_line   : 53
    <aa6>   DW_AT_decl_column : 14
    <aa7>   DW_AT_type        : <0x1d9>
    <aab>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aae>: Abbrev Number: 0
 <1><aaf>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab0>   DW_AT_type        : <0xa83>
 <1><ab4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ab9>   DW_AT_byte_size   : 24
    <aba>   DW_AT_decl_file   : 20
    <abb>   DW_AT_decl_line   : 56
    <abc>   DW_AT_decl_column : 8
    <abd>   DW_AT_sibling     : <0xb0d>
 <2><ac1>: Abbrev Number: 9 (DW_TAG_member)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x10df): data
    <ac6>   DW_AT_decl_file   : 20
    <ac7>   DW_AT_decl_line   : 57
    <ac8>   DW_AT_decl_column : 26
    <ac9>   DW_AT_type        : <0xb12>
    <acd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad0>: Abbrev Number: 9 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x899): flags_strsz
    <ad5>   DW_AT_decl_file   : 20
    <ad6>   DW_AT_decl_line   : 58
    <ad7>   DW_AT_decl_column : 9
    <ad8>   DW_AT_type        : <0x122>
    <adc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><adf>: Abbrev Number: 9 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xb79): size
    <ae4>   DW_AT_decl_file   : 20
    <ae5>   DW_AT_decl_line   : 59
    <ae6>   DW_AT_decl_column : 11
    <ae7>   DW_AT_type        : <0x10a>
    <aeb>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aee>: Abbrev Number: 9 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x1a1): type
    <af3>   DW_AT_decl_file   : 20
    <af4>   DW_AT_decl_line   : 60
    <af5>   DW_AT_decl_column : 17
    <af6>   DW_AT_type        : <0xa21>
    <afa>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><afd>: Abbrev Number: 9 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x75c): flags_mask
    <b02>   DW_AT_decl_file   : 20
    <b03>   DW_AT_decl_line   : 61
    <b04>   DW_AT_decl_column : 11
    <b05>   DW_AT_type        : <0x116>
    <b09>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b0c>: Abbrev Number: 0
 <1><b0d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0e>   DW_AT_type        : <0xab4>
 <1><b12>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b13>   DW_AT_byte_size   : 4
    <b14>   DW_AT_type        : <0xaaf>
 <1><b18>: Abbrev Number: 10 (DW_TAG_array_type)
    <b19>   DW_AT_type        : <0xb0d>
    <b1d>   DW_AT_sibling     : <0xb23>
 <2><b21>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b22>: Abbrev Number: 0
 <1><b23>: Abbrev Number: 3 (DW_TAG_const_type)
    <b24>   DW_AT_type        : <0xb18>
 <1><b28>: Abbrev Number: 12 (DW_TAG_variable)
    <b29>   DW_AT_name        : (indirect string, offset: 0xe46): addrfams
    <b2d>   DW_AT_decl_file   : 19
    <b2e>   DW_AT_decl_line   : 406
    <b30>   DW_AT_decl_column : 26
    <b31>   DW_AT_type        : <0xb23>
    <b35>   DW_AT_external    : 1
    <b36>   DW_AT_declaration : 1
 <1><b37>: Abbrev Number: 12 (DW_TAG_variable)
    <b38>   DW_AT_name        : (indirect string, offset: 0xd2a): arp_hardware_types
    <b3c>   DW_AT_decl_file   : 19
    <b3d>   DW_AT_decl_line   : 407
    <b3f>   DW_AT_decl_column : 26
    <b40>   DW_AT_type        : <0xb23>
    <b44>   DW_AT_external    : 1
    <b45>   DW_AT_declaration : 1
 <1><b46>: Abbrev Number: 12 (DW_TAG_variable)
    <b47>   DW_AT_name        : (indirect string, offset: 0x1002): at_flags
    <b4b>   DW_AT_decl_file   : 19
    <b4c>   DW_AT_decl_line   : 408
    <b4e>   DW_AT_decl_column : 26
    <b4f>   DW_AT_type        : <0xb23>
    <b53>   DW_AT_external    : 1
    <b54>   DW_AT_declaration : 1
 <1><b55>: Abbrev Number: 12 (DW_TAG_variable)
    <b56>   DW_AT_name        : (indirect string, offset: 0x49b): clocknames
    <b5a>   DW_AT_decl_file   : 19
    <b5b>   DW_AT_decl_line   : 409
    <b5d>   DW_AT_decl_column : 26
    <b5e>   DW_AT_type        : <0xb23>
    <b62>   DW_AT_external    : 1
    <b63>   DW_AT_declaration : 1
 <1><b64>: Abbrev Number: 12 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0xfb9): dirent_types
    <b69>   DW_AT_decl_file   : 19
    <b6a>   DW_AT_decl_line   : 410
    <b6c>   DW_AT_decl_column : 26
    <b6d>   DW_AT_type        : <0xb23>
    <b71>   DW_AT_external    : 1
    <b72>   DW_AT_declaration : 1
 <1><b73>: Abbrev Number: 12 (DW_TAG_variable)
    <b74>   DW_AT_name        : (indirect string, offset: 0x8ea): ethernet_protocols
    <b78>   DW_AT_decl_file   : 19
    <b79>   DW_AT_decl_line   : 411
    <b7b>   DW_AT_decl_column : 26
    <b7c>   DW_AT_type        : <0xb23>
    <b80>   DW_AT_external    : 1
    <b81>   DW_AT_declaration : 1
 <1><b82>: Abbrev Number: 12 (DW_TAG_variable)
    <b83>   DW_AT_name        : (indirect string, offset: 0x5b8): inet_protocols
    <b87>   DW_AT_decl_file   : 19
    <b88>   DW_AT_decl_line   : 412
    <b8a>   DW_AT_decl_column : 26
    <b8b>   DW_AT_type        : <0xb23>
    <b8f>   DW_AT_external    : 1
    <b90>   DW_AT_declaration : 1
 <1><b91>: Abbrev Number: 12 (DW_TAG_variable)
    <b92>   DW_AT_name        : (indirect string, offset: 0x2ca): evdev_abs
    <b96>   DW_AT_decl_file   : 19
    <b97>   DW_AT_decl_line   : 413
    <b99>   DW_AT_decl_column : 26
    <b9a>   DW_AT_type        : <0xb23>
    <b9e>   DW_AT_external    : 1
    <b9f>   DW_AT_declaration : 1
 <1><ba0>: Abbrev Number: 12 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x751): audit_arch
    <ba5>   DW_AT_decl_file   : 19
    <ba6>   DW_AT_decl_line   : 414
    <ba8>   DW_AT_decl_column : 26
    <ba9>   DW_AT_type        : <0xb23>
    <bad>   DW_AT_external    : 1
    <bae>   DW_AT_declaration : 1
 <1><baf>: Abbrev Number: 12 (DW_TAG_variable)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bb4>   DW_AT_decl_file   : 19
    <bb5>   DW_AT_decl_line   : 415
    <bb7>   DW_AT_decl_column : 26
    <bb8>   DW_AT_type        : <0xb23>
    <bbc>   DW_AT_external    : 1
    <bbd>   DW_AT_declaration : 1
 <1><bbe>: Abbrev Number: 12 (DW_TAG_variable)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x47c): iffflags
    <bc3>   DW_AT_decl_file   : 19
    <bc4>   DW_AT_decl_line   : 416
    <bc6>   DW_AT_decl_column : 26
    <bc7>   DW_AT_type        : <0xb23>
    <bcb>   DW_AT_external    : 1
    <bcc>   DW_AT_declaration : 1
 <1><bcd>: Abbrev Number: 12 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0xc1e): ip_type_of_services
    <bd2>   DW_AT_decl_file   : 19
    <bd3>   DW_AT_decl_line   : 417
    <bd5>   DW_AT_decl_column : 26
    <bd6>   DW_AT_type        : <0xb23>
    <bda>   DW_AT_external    : 1
    <bdb>   DW_AT_declaration : 1
 <1><bdc>: Abbrev Number: 12 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x6c7): ipc_private
    <be1>   DW_AT_decl_file   : 19
    <be2>   DW_AT_decl_line   : 418
    <be4>   DW_AT_decl_column : 26
    <be5>   DW_AT_type        : <0xb23>
    <be9>   DW_AT_external    : 1
    <bea>   DW_AT_declaration : 1
 <1><beb>: Abbrev Number: 12 (DW_TAG_variable)
    <bec>   DW_AT_name        : (indirect string, offset: 0x321): msg_flags
    <bf0>   DW_AT_decl_file   : 19
    <bf1>   DW_AT_decl_line   : 419
    <bf3>   DW_AT_decl_column : 26
    <bf4>   DW_AT_type        : <0xb23>
    <bf8>   DW_AT_external    : 1
    <bf9>   DW_AT_declaration : 1
 <1><bfa>: Abbrev Number: 12 (DW_TAG_variable)
    <bfb>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <bff>   DW_AT_decl_file   : 19
    <c00>   DW_AT_decl_line   : 420
    <c02>   DW_AT_decl_column : 26
    <c03>   DW_AT_type        : <0xb23>
    <c07>   DW_AT_external    : 1
    <c08>   DW_AT_declaration : 1
 <1><c09>: Abbrev Number: 12 (DW_TAG_variable)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xf2e): nl_bridge_vlan_flags
    <c0e>   DW_AT_decl_file   : 19
    <c0f>   DW_AT_decl_line   : 421
    <c11>   DW_AT_decl_column : 26
    <c12>   DW_AT_type        : <0xb23>
    <c16>   DW_AT_external    : 1
    <c17>   DW_AT_declaration : 1
 <1><c18>: Abbrev Number: 12 (DW_TAG_variable)
    <c19>   DW_AT_name        : (indirect string, offset: 0xdc6): nl_netfilter_msg_types
    <c1d>   DW_AT_decl_file   : 19
    <c1e>   DW_AT_decl_line   : 422
    <c20>   DW_AT_decl_column : 26
    <c21>   DW_AT_type        : <0xb23>
    <c25>   DW_AT_external    : 1
    <c26>   DW_AT_declaration : 1
 <1><c27>: Abbrev Number: 12 (DW_TAG_variable)
    <c28>   DW_AT_name        : (indirect string, offset: 0x222): nl_route_types
    <c2c>   DW_AT_decl_file   : 19
    <c2d>   DW_AT_decl_line   : 423
    <c2f>   DW_AT_decl_column : 26
    <c30>   DW_AT_type        : <0xb23>
    <c34>   DW_AT_external    : 1
    <c35>   DW_AT_declaration : 1
 <1><c36>: Abbrev Number: 12 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0xe7d): open_access_modes
    <c3b>   DW_AT_decl_file   : 19
    <c3c>   DW_AT_decl_line   : 424
    <c3e>   DW_AT_decl_column : 26
    <c3f>   DW_AT_type        : <0xb23>
    <c43>   DW_AT_external    : 1
    <c44>   DW_AT_declaration : 1
 <1><c45>: Abbrev Number: 12 (DW_TAG_variable)
    <c46>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c4a>   DW_AT_decl_file   : 19
    <c4b>   DW_AT_decl_line   : 425
    <c4d>   DW_AT_decl_column : 26
    <c4e>   DW_AT_type        : <0xb23>
    <c52>   DW_AT_external    : 1
    <c53>   DW_AT_declaration : 1
 <1><c54>: Abbrev Number: 12 (DW_TAG_variable)
    <c55>   DW_AT_name        : (indirect string, offset: 0xc4f): perf_type_id
    <c59>   DW_AT_decl_file   : 19
    <c5a>   DW_AT_decl_line   : 426
    <c5c>   DW_AT_decl_column : 26
    <c5d>   DW_AT_type        : <0xb23>
    <c61>   DW_AT_external    : 1
    <c62>   DW_AT_declaration : 1
 <1><c63>: Abbrev Number: 12 (DW_TAG_variable)
    <c64>   DW_AT_name        : (indirect string, offset: 0xe4f): pollflags
    <c68>   DW_AT_decl_file   : 19
    <c69>   DW_AT_decl_line   : 427
    <c6b>   DW_AT_decl_column : 26
    <c6c>   DW_AT_type        : <0xb23>
    <c70>   DW_AT_external    : 1
    <c71>   DW_AT_declaration : 1
 <1><c72>: Abbrev Number: 12 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0x559): ptrace_cmds
    <c77>   DW_AT_decl_file   : 19
    <c78>   DW_AT_decl_line   : 428
    <c7a>   DW_AT_decl_column : 26
    <c7b>   DW_AT_type        : <0xb23>
    <c7f>   DW_AT_external    : 1
    <c80>   DW_AT_declaration : 1
 <1><c81>: Abbrev Number: 12 (DW_TAG_variable)
    <c82>   DW_AT_name        : (indirect string, offset: 0x82c): resource_flags
    <c86>   DW_AT_decl_file   : 19
    <c87>   DW_AT_decl_line   : 429
    <c89>   DW_AT_decl_column : 26
    <c8a>   DW_AT_type        : <0xb23>
    <c8e>   DW_AT_external    : 1
    <c8f>   DW_AT_declaration : 1
 <1><c90>: Abbrev Number: 12 (DW_TAG_variable)
    <c91>   DW_AT_name        : (indirect string, offset: 0x28c): route_nexthop_flags
    <c95>   DW_AT_decl_file   : 19
    <c96>   DW_AT_decl_line   : 430
    <c98>   DW_AT_decl_column : 26
    <c99>   DW_AT_type        : <0xb23>
    <c9d>   DW_AT_external    : 1
    <c9e>   DW_AT_declaration : 1
 <1><c9f>: Abbrev Number: 12 (DW_TAG_variable)
    <ca0>   DW_AT_name        : (indirect string, offset: 0xeb9): routing_protocols
    <ca4>   DW_AT_decl_file   : 19
    <ca5>   DW_AT_decl_line   : 431
    <ca7>   DW_AT_decl_column : 26
    <ca8>   DW_AT_type        : <0xb23>
    <cac>   DW_AT_external    : 1
    <cad>   DW_AT_declaration : 1
 <1><cae>: Abbrev Number: 12 (DW_TAG_variable)
    <caf>   DW_AT_name        : (indirect string, offset: 0x46d): routing_scopes
    <cb3>   DW_AT_decl_file   : 19
    <cb4>   DW_AT_decl_line   : 432
    <cb6>   DW_AT_decl_column : 26
    <cb7>   DW_AT_type        : <0xb23>
    <cbb>   DW_AT_external    : 1
    <cbc>   DW_AT_declaration : 1
 <1><cbd>: Abbrev Number: 12 (DW_TAG_variable)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xdb4): routing_table_ids
    <cc2>   DW_AT_decl_file   : 19
    <cc3>   DW_AT_decl_line   : 433
    <cc5>   DW_AT_decl_column : 26
    <cc6>   DW_AT_type        : <0xb23>
    <cca>   DW_AT_external    : 1
    <ccb>   DW_AT_declaration : 1
 <1><ccc>: Abbrev Number: 12 (DW_TAG_variable)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x691): routing_types
    <cd1>   DW_AT_decl_file   : 19
    <cd2>   DW_AT_decl_line   : 434
    <cd4>   DW_AT_decl_column : 26
    <cd5>   DW_AT_type        : <0xb23>
    <cd9>   DW_AT_external    : 1
    <cda>   DW_AT_declaration : 1
 <1><cdb>: Abbrev Number: 12 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x1c5): rwf_flags
    <ce0>   DW_AT_decl_file   : 19
    <ce1>   DW_AT_decl_line   : 435
    <ce3>   DW_AT_decl_column : 26
    <ce4>   DW_AT_type        : <0xb23>
    <ce8>   DW_AT_external    : 1
    <ce9>   DW_AT_declaration : 1
 <1><cea>: Abbrev Number: 12 (DW_TAG_variable)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x864): seccomp_filter_flags
    <cef>   DW_AT_decl_file   : 19
    <cf0>   DW_AT_decl_line   : 436
    <cf2>   DW_AT_decl_column : 26
    <cf3>   DW_AT_type        : <0xb23>
    <cf7>   DW_AT_external    : 1
    <cf8>   DW_AT_declaration : 1
 <1><cf9>: Abbrev Number: 12 (DW_TAG_variable)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x2e7): seccomp_ret_action
    <cfe>   DW_AT_decl_file   : 19
    <cff>   DW_AT_decl_line   : 437
    <d01>   DW_AT_decl_column : 26
    <d02>   DW_AT_type        : <0xb23>
    <d06>   DW_AT_external    : 1
    <d07>   DW_AT_declaration : 1
 <1><d08>: Abbrev Number: 12 (DW_TAG_variable)
    <d09>   DW_AT_name        : (indirect string, offset: 0x42d): setns_types
    <d0d>   DW_AT_decl_file   : 19
    <d0e>   DW_AT_decl_line   : 438
    <d10>   DW_AT_decl_column : 26
    <d11>   DW_AT_type        : <0xb23>
    <d15>   DW_AT_external    : 1
    <d16>   DW_AT_declaration : 1
 <1><d17>: Abbrev Number: 12 (DW_TAG_variable)
    <d18>   DW_AT_name        : (indirect string, offset: 0xe3b): sg_io_info
    <d1c>   DW_AT_decl_file   : 19
    <d1d>   DW_AT_decl_line   : 439
    <d1f>   DW_AT_decl_column : 26
    <d20>   DW_AT_type        : <0xb23>
    <d24>   DW_AT_external    : 1
    <d25>   DW_AT_declaration : 1
 <1><d26>: Abbrev Number: 12 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0xbbc): socketlayers
    <d2b>   DW_AT_decl_file   : 19
    <d2c>   DW_AT_decl_line   : 440
    <d2e>   DW_AT_decl_column : 26
    <d2f>   DW_AT_type        : <0xb23>
    <d33>   DW_AT_external    : 1
    <d34>   DW_AT_declaration : 1
 <1><d35>: Abbrev Number: 12 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0xd9e): socktypes
    <d3a>   DW_AT_decl_file   : 19
    <d3b>   DW_AT_decl_line   : 441
    <d3d>   DW_AT_decl_column : 26
    <d3e>   DW_AT_type        : <0xb23>
    <d42>   DW_AT_external    : 1
    <d43>   DW_AT_declaration : 1
 <1><d44>: Abbrev Number: 12 (DW_TAG_variable)
    <d45>   DW_AT_name        : (indirect string, offset: 0xa8c): tcp_state_flags
    <d49>   DW_AT_decl_file   : 19
    <d4a>   DW_AT_decl_line   : 442
    <d4c>   DW_AT_decl_column : 26
    <d4d>   DW_AT_type        : <0xb23>
    <d51>   DW_AT_external    : 1
    <d52>   DW_AT_declaration : 1
 <1><d53>: Abbrev Number: 12 (DW_TAG_variable)
    <d54>   DW_AT_name        : (indirect string, offset: 0x786): tcp_states
    <d58>   DW_AT_decl_file   : 19
    <d59>   DW_AT_decl_line   : 443
    <d5b>   DW_AT_decl_column : 26
    <d5c>   DW_AT_type        : <0xb23>
    <d60>   DW_AT_external    : 1
    <d61>   DW_AT_declaration : 1
 <1><d62>: Abbrev Number: 12 (DW_TAG_variable)
    <d63>   DW_AT_name        : (indirect string, offset: 0x1070): whence_codes
    <d67>   DW_AT_decl_file   : 19
    <d68>   DW_AT_decl_line   : 444
    <d6a>   DW_AT_decl_column : 26
    <d6b>   DW_AT_type        : <0xb23>
    <d6f>   DW_AT_external    : 1
    <d70>   DW_AT_declaration : 1
 <1><d71>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d72>   DW_AT_encoding    : 7	(unsigned)
    <d73>   DW_AT_byte_size   : 4
    <d74>   DW_AT_type        : <0x2b>
    <d78>   DW_AT_decl_file   : 19
    <d79>   DW_AT_decl_line   : 505
    <d7b>   DW_AT_decl_column : 14
    <d7c>   DW_AT_sibling     : <0xd93>
 <2><d80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d81>   DW_AT_name        : (indirect string, offset: 0x9c9): CFLAG_NONE
    <d85>   DW_AT_const_value : 0
 <2><d86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d87>   DW_AT_name        : (indirect string, offset: 0x8fd): CFLAG_ONLY_STATS
    <d8b>   DW_AT_const_value : 1
 <2><d8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xbc9): CFLAG_BOTH
    <d91>   DW_AT_const_value : 2
 <2><d92>: Abbrev Number: 0
 <1><d93>: Abbrev Number: 28 (DW_TAG_typedef)
    <d94>   DW_AT_name        : (indirect string, offset: 0x111b): cflag_t
    <d98>   DW_AT_decl_file   : 19
    <d99>   DW_AT_decl_line   : 509
    <d9b>   DW_AT_decl_column : 3
    <d9c>   DW_AT_type        : <0xd71>
 <1><da0>: Abbrev Number: 12 (DW_TAG_variable)
    <da1>   DW_AT_name        : (indirect string, offset: 0xce9): cflag
    <da5>   DW_AT_decl_file   : 19
    <da6>   DW_AT_decl_line   : 510
    <da8>   DW_AT_decl_column : 16
    <da9>   DW_AT_type        : <0xd93>
    <dad>   DW_AT_external    : 1
    <dae>   DW_AT_declaration : 1
 <1><daf>: Abbrev Number: 12 (DW_TAG_variable)
    <db0>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <db4>   DW_AT_decl_file   : 19
    <db5>   DW_AT_decl_line   : 511
    <db7>   DW_AT_decl_column : 13
    <db8>   DW_AT_type        : <0x525>
    <dbc>   DW_AT_external    : 1
    <dbd>   DW_AT_declaration : 1
 <1><dbe>: Abbrev Number: 12 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x7e7): Tflag_scale
    <dc3>   DW_AT_decl_file   : 19
    <dc4>   DW_AT_decl_line   : 512
    <dc6>   DW_AT_decl_column : 12
    <dc7>   DW_AT_type        : <0x64>
    <dcb>   DW_AT_external    : 1
    <dcc>   DW_AT_declaration : 1
 <1><dcd>: Abbrev Number: 12 (DW_TAG_variable)
    <dce>   DW_AT_name        : (indirect string, offset: 0x879): Tflag_width
    <dd2>   DW_AT_decl_file   : 19
    <dd3>   DW_AT_decl_line   : 513
    <dd5>   DW_AT_decl_column : 12
    <dd6>   DW_AT_type        : <0x64>
    <dda>   DW_AT_external    : 1
    <ddb>   DW_AT_declaration : 1
 <1><ddc>: Abbrev Number: 12 (DW_TAG_variable)
    <ddd>   DW_AT_name        : (indirect string, offset: 0xe2d): iflag
    <de1>   DW_AT_decl_file   : 19
    <de2>   DW_AT_decl_line   : 514
    <de4>   DW_AT_decl_column : 13
    <de5>   DW_AT_type        : <0x525>
    <de9>   DW_AT_external    : 1
    <dea>   DW_AT_declaration : 1
 <1><deb>: Abbrev Number: 12 (DW_TAG_variable)
    <dec>   DW_AT_name        : (indirect string, offset: 0x599): count_wallclock
    <df0>   DW_AT_decl_file   : 19
    <df1>   DW_AT_decl_line   : 515
    <df3>   DW_AT_decl_column : 13
    <df4>   DW_AT_type        : <0x525>
    <df8>   DW_AT_external    : 1
    <df9>   DW_AT_declaration : 1
 <1><dfa>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <dff>   DW_AT_byte_size   : 4
    <e00>   DW_AT_decl_file   : 19
    <e01>   DW_AT_decl_line   : 517
    <e03>   DW_AT_decl_column : 8
    <e04>   DW_AT_sibling     : <0xe19>
 <2><e08>: Abbrev Number: 22 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e0d>   DW_AT_decl_file   : 19
    <e0e>   DW_AT_decl_line   : 518
    <e10>   DW_AT_decl_column : 14
    <e11>   DW_AT_type        : <0x1d9>
    <e15>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e18>: Abbrev Number: 0
 <1><e19>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x791): path_set
    <e1e>   DW_AT_byte_size   : 12
    <e1f>   DW_AT_decl_file   : 19
    <e20>   DW_AT_decl_line   : 522
    <e22>   DW_AT_decl_column : 15
    <e23>   DW_AT_sibling     : <0xe58>
 <2><e27>: Abbrev Number: 22 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x71f): paths_selected
    <e2c>   DW_AT_decl_file   : 19
    <e2d>   DW_AT_decl_line   : 523
    <e2f>   DW_AT_decl_column : 24
    <e30>   DW_AT_type        : <0xe58>
    <e34>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e37>: Abbrev Number: 22 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x1063): num_selected
    <e3c>   DW_AT_decl_file   : 19
    <e3d>   DW_AT_decl_line   : 524
    <e3f>   DW_AT_decl_column : 9
    <e40>   DW_AT_type        : <0x122>
    <e44>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e47>: Abbrev Number: 22 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0xb79): size
    <e4c>   DW_AT_decl_file   : 19
    <e4d>   DW_AT_decl_line   : 525
    <e4f>   DW_AT_decl_column : 9
    <e50>   DW_AT_type        : <0x122>
    <e54>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e57>: Abbrev Number: 0
 <1><e58>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e59>   DW_AT_byte_size   : 4
    <e5a>   DW_AT_type        : <0xdfa>
 <1><e5e>: Abbrev Number: 12 (DW_TAG_variable)
    <e5f>   DW_AT_name        : (indirect string, offset: 0x10b2): global_path_set
    <e63>   DW_AT_decl_file   : 19
    <e64>   DW_AT_decl_line   : 526
    <e66>   DW_AT_decl_column : 3
    <e67>   DW_AT_type        : <0xe19>
    <e6b>   DW_AT_external    : 1
    <e6c>   DW_AT_declaration : 1
 <1><e6d>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6e>   DW_AT_name        : (indirect string, offset: 0xfa6): xflag_opts
    <e72>   DW_AT_encoding    : 7	(unsigned)
    <e73>   DW_AT_byte_size   : 4
    <e74>   DW_AT_type        : <0x2b>
    <e78>   DW_AT_decl_file   : 19
    <e79>   DW_AT_decl_line   : 528
    <e7b>   DW_AT_decl_column : 6
    <e7c>   DW_AT_sibling     : <0xe9f>
 <2><e80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e81>   DW_AT_name        : (indirect string, offset: 0xa43): HEXSTR_NONE
    <e85>   DW_AT_const_value : 0
 <2><e86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e87>   DW_AT_name        : (indirect string, offset: 0xfdb): HEXSTR_NON_ASCII
    <e8b>   DW_AT_const_value : 1
 <2><e8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x94a): HEXSTR_ALL
    <e91>   DW_AT_const_value : 2
 <2><e92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e93>   DW_AT_name        : (indirect string, offset: 0x670): HEXSTR_NON_ASCII_CHARS
    <e97>   DW_AT_const_value : 3
 <2><e98>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e99>   DW_AT_name        : (indirect string, offset: 0x107d): NUM_HEXSTR_OPTS
    <e9d>   DW_AT_const_value : 4
 <2><e9e>: Abbrev Number: 0
 <1><e9f>: Abbrev Number: 12 (DW_TAG_variable)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xe07): xflag
    <ea4>   DW_AT_decl_file   : 19
    <ea5>   DW_AT_decl_line   : 541
    <ea7>   DW_AT_decl_column : 17
    <ea8>   DW_AT_type        : <0x2b>
    <eac>   DW_AT_external    : 1
    <ead>   DW_AT_declaration : 1
 <1><eae>: Abbrev Number: 12 (DW_TAG_variable)
    <eaf>   DW_AT_name        : (indirect string, offset: 0xca4): followfork
    <eb3>   DW_AT_decl_file   : 19
    <eb4>   DW_AT_decl_line   : 542
    <eb6>   DW_AT_decl_column : 13
    <eb7>   DW_AT_type        : <0x525>
    <ebb>   DW_AT_external    : 1
    <ebc>   DW_AT_declaration : 1
 <1><ebd>: Abbrev Number: 12 (DW_TAG_variable)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x335): output_separately
    <ec2>   DW_AT_decl_file   : 19
    <ec3>   DW_AT_decl_line   : 543
    <ec5>   DW_AT_decl_column : 13
    <ec6>   DW_AT_type        : <0x525>
    <eca>   DW_AT_external    : 1
    <ecb>   DW_AT_declaration : 1
 <1><ecc>: Abbrev Number: 12 (DW_TAG_variable)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x231): stack_trace_enabled
    <ed1>   DW_AT_decl_file   : 19
    <ed2>   DW_AT_decl_line   : 546
    <ed4>   DW_AT_decl_column : 13
    <ed5>   DW_AT_type        : <0x525>
    <ed9>   DW_AT_external    : 1
    <eda>   DW_AT_declaration : 1
 <1><edb>: Abbrev Number: 12 (DW_TAG_variable)
    <edc>   DW_AT_name        : (indirect string, offset: 0x65e): ptrace_setoptions
    <ee0>   DW_AT_decl_file   : 19
    <ee1>   DW_AT_decl_line   : 550
    <ee3>   DW_AT_decl_column : 17
    <ee4>   DW_AT_type        : <0x2b>
    <ee8>   DW_AT_external    : 1
    <ee9>   DW_AT_declaration : 1
 <1><eea>: Abbrev Number: 12 (DW_TAG_variable)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xa38): max_strlen
    <eef>   DW_AT_decl_file   : 19
    <ef0>   DW_AT_decl_line   : 551
    <ef2>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0x2b>
    <ef7>   DW_AT_external    : 1
    <ef8>   DW_AT_declaration : 1
 <1><ef9>: Abbrev Number: 12 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0xa66): os_release
    <efe>   DW_AT_decl_file   : 19
    <eff>   DW_AT_decl_line   : 552
    <f01>   DW_AT_decl_column : 17
    <f02>   DW_AT_type        : <0x2b>
    <f06>   DW_AT_external    : 1
    <f07>   DW_AT_declaration : 1
 <1><f08>: Abbrev Number: 12 (DW_TAG_variable)
    <f09>   DW_AT_name        : (indirect string, offset: 0x72e): xlat_verbosity
    <f0d>   DW_AT_decl_file   : 19
    <f0e>   DW_AT_decl_line   : 914
    <f10>   DW_AT_decl_column : 24
    <f11>   DW_AT_type        : <0xa46>
    <f15>   DW_AT_external    : 1
    <f16>   DW_AT_declaration : 1
 <1><f17>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f18>   DW_AT_name        : (indirect string, offset: 0x57c): xlat_style_private_flag_bits
    <f1c>   DW_AT_encoding    : 7	(unsigned)
    <f1d>   DW_AT_byte_size   : 4
    <f1e>   DW_AT_type        : <0x2b>
    <f22>   DW_AT_decl_file   : 19
    <f23>   DW_AT_decl_line   : 934
    <f25>   DW_AT_decl_column : 6
    <f26>   DW_AT_sibling     : <0xf43>
 <2><f2a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x2b4): PAF_PRINT_INDICES_BIT
    <f2f>   DW_AT_const_value : 5
 <2><f30>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0xb26): PAF_ARRAY_TRUNCATED_BIT
    <f35>   DW_AT_const_value : 6
 <2><f36>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x3ed): PXF_DEFAULT_STR_BIT
    <f3b>   DW_AT_const_value : 7
 <2><f3c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0xc86): SPFF_AUXSTR_MODE_BIT
    <f41>   DW_AT_const_value : 8
 <2><f42>: Abbrev Number: 0
 <1><f43>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f44>   DW_AT_name        : (indirect string, offset: 0xd3d): find_xlat_flag_bits
    <f48>   DW_AT_encoding    : 7	(unsigned)
    <f49>   DW_AT_byte_size   : 4
    <f4a>   DW_AT_type        : <0x2b>
    <f4e>   DW_AT_decl_file   : 19
    <f4f>   DW_AT_decl_line   : 1438
    <f51>   DW_AT_decl_column : 6
    <f52>   DW_AT_sibling     : <0xf5d>
 <2><f56>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0x987): FXL_CASE_SENSITIVE_BIT
    <f5b>   DW_AT_const_value : 0
 <2><f5c>: Abbrev Number: 0
 <1><f5d>: Abbrev Number: 12 (DW_TAG_variable)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xa14): printing_tcp
    <f62>   DW_AT_decl_file   : 19
    <f63>   DW_AT_decl_line   : 1684
    <f65>   DW_AT_decl_column : 20
    <f66>   DW_AT_type        : <0x60d>
    <f6a>   DW_AT_external    : 1
    <f6b>   DW_AT_declaration : 1
 <1><f6c>: Abbrev Number: 12 (DW_TAG_variable)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x544): errnoent
    <f71>   DW_AT_decl_file   : 19
    <f72>   DW_AT_decl_line   : 1882
    <f74>   DW_AT_decl_column : 26
    <f75>   DW_AT_type        : <0x459>
    <f79>   DW_AT_external    : 1
    <f7a>   DW_AT_declaration : 1
 <1><f7b>: Abbrev Number: 12 (DW_TAG_variable)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x885): signalent
    <f80>   DW_AT_decl_file   : 19
    <f81>   DW_AT_decl_line   : 1883
    <f83>   DW_AT_decl_column : 26
    <f84>   DW_AT_type        : <0x459>
    <f88>   DW_AT_external    : 1
    <f89>   DW_AT_declaration : 1
 <1><f8a>: Abbrev Number: 12 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xe75): nerrnos
    <f8f>   DW_AT_decl_file   : 19
    <f90>   DW_AT_decl_line   : 1884
    <f92>   DW_AT_decl_column : 27
    <f93>   DW_AT_type        : <0x32>
    <f97>   DW_AT_external    : 1
    <f98>   DW_AT_declaration : 1
 <1><f99>: Abbrev Number: 12 (DW_TAG_variable)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x103b): nsignals
    <f9e>   DW_AT_decl_file   : 19
    <f9f>   DW_AT_decl_line   : 1885
    <fa1>   DW_AT_decl_column : 27
    <fa2>   DW_AT_type        : <0x32>
    <fa6>   DW_AT_external    : 1
    <fa7>   DW_AT_declaration : 1
 <1><fa8>: Abbrev Number: 10 (DW_TAG_array_type)
    <fa9>   DW_AT_type        : <0x865>
    <fad>   DW_AT_sibling     : <0xfb3>
 <2><fb1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb2>: Abbrev Number: 0
 <1><fb3>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb4>   DW_AT_type        : <0xfa8>
 <1><fb8>: Abbrev Number: 12 (DW_TAG_variable)
    <fb9>   DW_AT_name        : (indirect string, offset: 0xd08): sysent0
    <fbd>   DW_AT_decl_file   : 19
    <fbe>   DW_AT_decl_line   : 1887
    <fc0>   DW_AT_decl_column : 28
    <fc1>   DW_AT_type        : <0xfb3>
    <fc5>   DW_AT_external    : 1
    <fc6>   DW_AT_declaration : 1
 <1><fc7>: Abbrev Number: 10 (DW_TAG_array_type)
    <fc8>   DW_AT_type        : <0x8cc>
    <fcc>   DW_AT_sibling     : <0xfd2>
 <2><fd0>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd1>: Abbrev Number: 0
 <1><fd2>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd3>   DW_AT_type        : <0xfc7>
 <1><fd7>: Abbrev Number: 12 (DW_TAG_variable)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x10a8): ioctlent0
    <fdc>   DW_AT_decl_file   : 19
    <fdd>   DW_AT_decl_line   : 1888
    <fdf>   DW_AT_decl_column : 30
    <fe0>   DW_AT_type        : <0xfd2>
    <fe4>   DW_AT_external    : 1
    <fe5>   DW_AT_declaration : 1
 <1><fe6>: Abbrev Number: 12 (DW_TAG_variable)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x45b): personality_names
    <feb>   DW_AT_decl_file   : 19
    <fec>   DW_AT_decl_line   : 1890
    <fee>   DW_AT_decl_column : 26
    <fef>   DW_AT_type        : <0x459>
    <ff3>   DW_AT_external    : 1
    <ff4>   DW_AT_declaration : 1
 <1><ff5>: Abbrev Number: 12 (DW_TAG_variable)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x8a5): sysent
    <ffa>   DW_AT_decl_file   : 19
    <ffb>   DW_AT_decl_line   : 1893
    <ffd>   DW_AT_decl_column : 29
    <ffe>   DW_AT_type        : <0x9b1>
    <1002>   DW_AT_external    : 1
    <1003>   DW_AT_declaration : 1
 <1><1004>: Abbrev Number: 12 (DW_TAG_variable)
    <1005>   DW_AT_name        : (indirect string, offset: 0xc9b): ioctlent
    <1009>   DW_AT_decl_file   : 19
    <100a>   DW_AT_decl_line   : 1894
    <100c>   DW_AT_decl_column : 31
    <100d>   DW_AT_type        : <0x1013>
    <1011>   DW_AT_external    : 1
    <1012>   DW_AT_declaration : 1
 <1><1013>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1014>   DW_AT_byte_size   : 4
    <1015>   DW_AT_type        : <0x8cc>
 <1><1019>: Abbrev Number: 12 (DW_TAG_variable)
    <101a>   DW_AT_name        : (indirect string, offset: 0x88f): nsyscalls
    <101e>   DW_AT_decl_file   : 19
    <101f>   DW_AT_decl_line   : 1900
    <1021>   DW_AT_decl_column : 17
    <1022>   DW_AT_type        : <0x2b>
    <1026>   DW_AT_external    : 1
    <1027>   DW_AT_declaration : 1
 <1><1028>: Abbrev Number: 12 (DW_TAG_variable)
    <1029>   DW_AT_name        : (indirect string, offset: 0xe99): nioctlents
    <102d>   DW_AT_decl_file   : 19
    <102e>   DW_AT_decl_line   : 1901
    <1030>   DW_AT_decl_column : 17
    <1031>   DW_AT_type        : <0x2b>
    <1035>   DW_AT_external    : 1
    <1036>   DW_AT_declaration : 1
 <1><1037>: Abbrev Number: 10 (DW_TAG_array_type)
    <1038>   DW_AT_type        : <0x32>
    <103c>   DW_AT_sibling     : <0x1047>
 <2><1040>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1041>   DW_AT_type        : <0x2b>
    <1045>   DW_AT_upper_bound : 2
 <2><1046>: Abbrev Number: 0
 <1><1047>: Abbrev Number: 3 (DW_TAG_const_type)
    <1048>   DW_AT_type        : <0x1037>
 <1><104c>: Abbrev Number: 12 (DW_TAG_variable)
    <104d>   DW_AT_name        : (indirect string, offset: 0xf0e): nsyscall_vec
    <1051>   DW_AT_decl_file   : 19
    <1052>   DW_AT_decl_line   : 1903
    <1054>   DW_AT_decl_column : 27
    <1055>   DW_AT_type        : <0x1047>
    <1059>   DW_AT_external    : 1
    <105a>   DW_AT_declaration : 1
 <1><105b>: Abbrev Number: 10 (DW_TAG_array_type)
    <105c>   DW_AT_type        : <0x9b7>
    <1060>   DW_AT_sibling     : <0x106b>
 <2><1064>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1065>   DW_AT_type        : <0x2b>
    <1069>   DW_AT_upper_bound : 2
 <2><106a>: Abbrev Number: 0
 <1><106b>: Abbrev Number: 3 (DW_TAG_const_type)
    <106c>   DW_AT_type        : <0x105b>
 <1><1070>: Abbrev Number: 12 (DW_TAG_variable)
    <1071>   DW_AT_name        : (indirect string, offset: 0x7d4): sysent_vec
    <1075>   DW_AT_decl_file   : 19
    <1076>   DW_AT_decl_line   : 1904
    <1078>   DW_AT_decl_column : 35
    <1079>   DW_AT_type        : <0x106b>
    <107d>   DW_AT_external    : 1
    <107e>   DW_AT_declaration : 1
 <1><107f>: Abbrev Number: 12 (DW_TAG_variable)
    <1080>   DW_AT_name        : (indirect string, offset: 0x38e): inject_vec
    <1084>   DW_AT_decl_file   : 19
    <1085>   DW_AT_decl_line   : 1905
    <1087>   DW_AT_decl_column : 28
    <1088>   DW_AT_type        : <0x9bc>
    <108c>   DW_AT_external    : 1
    <108d>   DW_AT_declaration : 1
 <1><108e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <108f>   DW_AT_name        : (indirect string, offset: 0xd91): audit_arch_t
    <1093>   DW_AT_byte_size   : 8
    <1094>   DW_AT_decl_file   : 19
    <1095>   DW_AT_decl_line   : 1907
    <1097>   DW_AT_decl_column : 8
    <1098>   DW_AT_sibling     : <0x10bd>
 <2><109c>: Abbrev Number: 22 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0x56e): arch
    <10a1>   DW_AT_decl_file   : 19
    <10a2>   DW_AT_decl_line   : 1908
    <10a4>   DW_AT_decl_column : 15
    <10a5>   DW_AT_type        : <0x2b>
    <10a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ac>: Abbrev Number: 22 (DW_TAG_member)
    <10ad>   DW_AT_name        : (indirect string, offset: 0x9fa): flag
    <10b1>   DW_AT_decl_file   : 19
    <10b2>   DW_AT_decl_line   : 1909
    <10b4>   DW_AT_decl_column : 15
    <10b5>   DW_AT_type        : <0x2b>
    <10b9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10bc>: Abbrev Number: 0
 <1><10bd>: Abbrev Number: 3 (DW_TAG_const_type)
    <10be>   DW_AT_type        : <0x108e>
 <1><10c2>: Abbrev Number: 10 (DW_TAG_array_type)
    <10c3>   DW_AT_type        : <0x10bd>
    <10c7>   DW_AT_sibling     : <0x10d2>
 <2><10cb>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10cc>   DW_AT_type        : <0x2b>
    <10d0>   DW_AT_upper_bound : 2
 <2><10d1>: Abbrev Number: 0
 <1><10d2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d3>   DW_AT_type        : <0x10c2>
 <1><10d7>: Abbrev Number: 12 (DW_TAG_variable)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x978): audit_arch_vec
    <10dc>   DW_AT_decl_file   : 19
    <10dd>   DW_AT_decl_line   : 1912
    <10df>   DW_AT_decl_column : 34
    <10e0>   DW_AT_type        : <0x10d2>
    <10e4>   DW_AT_external    : 1
    <10e5>   DW_AT_declaration : 1
 <1><10e6>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e7>   DW_AT_byte_size   : 180
    <10e8>   DW_AT_decl_file   : 21
    <10e9>   DW_AT_decl_line   : 2
    <10ea>   DW_AT_decl_column : 9
    <10eb>   DW_AT_sibling     : <0x13a0>
 <2><10ef>: Abbrev Number: 9 (DW_TAG_member)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x1dd): block_ioctl
    <10f4>   DW_AT_decl_file   : 21
    <10f5>   DW_AT_decl_line   : 3
    <10f6>   DW_AT_decl_column : 8
    <10f7>   DW_AT_type        : <0x13ba>
    <10fb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10fe>: Abbrev Number: 9 (DW_TAG_member)
    <10ff>   DW_AT_name        : (indirect string, offset: 0xac5): btrfs_ioctl
    <1103>   DW_AT_decl_file   : 21
    <1104>   DW_AT_decl_line   : 6
    <1105>   DW_AT_decl_column : 8
    <1106>   DW_AT_type        : <0x13ba>
    <110a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><110d>: Abbrev Number: 9 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x767): evdev_write_ioctl_mpers
    <1112>   DW_AT_decl_file   : 21
    <1113>   DW_AT_decl_line   : 9
    <1114>   DW_AT_decl_column : 8
    <1115>   DW_AT_type        : <0x13ba>
    <1119>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><111c>: Abbrev Number: 9 (DW_TAG_member)
    <111d>   DW_AT_name        : (indirect string, offset: 0x73d): get_sock_fprog_size
    <1121>   DW_AT_decl_file   : 21
    <1122>   DW_AT_decl_line   : 12
    <1123>   DW_AT_decl_column : 17
    <1124>   DW_AT_type        : <0x13c6>
    <1128>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><112b>: Abbrev Number: 9 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x1ac): fetch_bpf_fprog
    <1130>   DW_AT_decl_file   : 21
    <1131>   DW_AT_decl_line   : 15
    <1132>   DW_AT_decl_column : 10
    <1133>   DW_AT_type        : <0x13e6>
    <1137>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><113a>: Abbrev Number: 9 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x965): fetch_struct_flock
    <113f>   DW_AT_decl_file   : 21
    <1140>   DW_AT_decl_line   : 18
    <1141>   DW_AT_decl_column : 10
    <1142>   DW_AT_type        : <0x13e6>
    <1146>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1149>: Abbrev Number: 9 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0xcaf): fetch_struct_flock64
