Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1669 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5a1): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x106e): mpers-m32/struct_hd_geometry.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe1e): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x39b): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xf8e): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x941): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x33e): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x254): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xd81): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x46a): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x847): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe6f): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x877): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x752): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb0a): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb40): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2ba): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xc94): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc09): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3e7): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x433): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x34a): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb2b): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf17): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xd91): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xaa9): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x1067): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xdb7): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xa6b): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0xf52): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x271): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x393): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0xf78): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x725): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xbf0): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xae6): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x352): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x9bd): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4b9): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xec4): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x78e): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x12a): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0xfd3): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x8b9): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x92a): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xd2c): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1ce): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xc5b): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xb2): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x54d): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x211): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xf3d): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x77a): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x7f3): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x23f): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xddd): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xc6b): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x16b): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x6bd): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x9fd): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xf5c): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3b7): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xbc6): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x97f): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x9e1): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x7a8): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xa8b): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x45f): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x2fc): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x75): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x366): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x518): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0xfa1): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xd7a): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x24b): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x527): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x25e): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xdec): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x696): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xb6b): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1bb): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xe56): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x35b): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x978): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x101d): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4a4): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xeeb): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x98b): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x3f9): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0xa41): __kernel_long_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 15
    <528>   DW_AT_decl_column : 15
    <529>   DW_AT_type        : <0xae>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0x507): __kernel_ulong_t
    <532>   DW_AT_decl_file   : 14
    <533>   DW_AT_decl_line   : 16
    <534>   DW_AT_decl_column : 23
    <535>   DW_AT_type        : <0x37>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x3c5): kernel_long_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 25
    <541>   DW_AT_type        : <0x521>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x868): kernel_ulong_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 17
    <54c>   DW_AT_decl_column : 26
    <54d>   DW_AT_type        : <0x52d>
 <1><551>: Abbrev Number: 3 (DW_TAG_const_type)
    <552>   DW_AT_type        : <0x545>
 <1><556>: Abbrev Number: 8 (DW_TAG_structure_type)
    <557>   DW_AT_name        : (indirect string, offset: 0xb89): list_item
    <55b>   DW_AT_byte_size   : 8
    <55c>   DW_AT_decl_file   : 16
    <55d>   DW_AT_decl_line   : 92
    <55e>   DW_AT_decl_column : 8
    <55f>   DW_AT_sibling     : <0x582>
 <2><563>: Abbrev Number: 9 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x1062): prev
    <568>   DW_AT_decl_file   : 16
    <569>   DW_AT_decl_line   : 93
    <56a>   DW_AT_decl_column : 20
    <56b>   DW_AT_type        : <0x582>
    <56f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><572>: Abbrev Number: 9 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x1058): next
    <577>   DW_AT_decl_file   : 16
    <578>   DW_AT_decl_line   : 94
    <579>   DW_AT_decl_column : 20
    <57a>   DW_AT_type        : <0x582>
    <57e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><581>: Abbrev Number: 0
 <1><582>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <583>   DW_AT_byte_size   : 4
    <584>   DW_AT_type        : <0x556>
 <1><588>: Abbrev Number: 8 (DW_TAG_structure_type)
    <589>   DW_AT_name        : (indirect string, offset: 0x840): sysent
    <58d>   DW_AT_byte_size   : 20
    <58e>   DW_AT_decl_file   : 17
    <58f>   DW_AT_decl_line   : 13
    <590>   DW_AT_decl_column : 16
    <591>   DW_AT_sibling     : <0x5e1>
 <2><595>: Abbrev Number: 9 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0xfb8): nargs
    <59a>   DW_AT_decl_file   : 17
    <59b>   DW_AT_decl_line   : 14
    <59c>   DW_AT_decl_column : 11
    <59d>   DW_AT_type        : <0x2b>
    <5a1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x937): sys_flags
    <5a9>   DW_AT_decl_file   : 17
    <5aa>   DW_AT_decl_line   : 15
    <5ab>   DW_AT_decl_column : 6
    <5ac>   DW_AT_type        : <0x64>
    <5b0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b3>: Abbrev Number: 18 (DW_TAG_member)
    <5b4>   DW_AT_name        : sen
    <5b8>   DW_AT_decl_file   : 17
    <5b9>   DW_AT_decl_line   : 16
    <5ba>   DW_AT_decl_column : 6
    <5bb>   DW_AT_type        : <0x64>
    <5bf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5c2>: Abbrev Number: 9 (DW_TAG_member)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x2f3): sys_func
    <5c7>   DW_AT_decl_file   : 17
    <5c8>   DW_AT_decl_line   : 17
    <5c9>   DW_AT_decl_column : 8
    <5ca>   DW_AT_type        : <0x848>
    <5ce>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5d1>: Abbrev Number: 9 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x268): sys_name
    <5d6>   DW_AT_decl_file   : 17
    <5d7>   DW_AT_decl_line   : 18
    <5d8>   DW_AT_decl_column : 14
    <5d9>   DW_AT_type        : <0x1c9>
    <5dd>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e0>: Abbrev Number: 0
 <1><5e1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5e2>   DW_AT_prototyped  : 1
    <5e3>   DW_AT_type        : <0x64>
    <5e7>   DW_AT_sibling     : <0x5f1>
 <2><5eb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5ec>   DW_AT_type        : <0x5f1>
 <2><5f0>: Abbrev Number: 0
 <1><5f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5f2>   DW_AT_byte_size   : 4
    <5f3>   DW_AT_type        : <0x5fc>
 <1><5f7>: Abbrev Number: 3 (DW_TAG_const_type)
    <5f8>   DW_AT_type        : <0x5f1>
 <1><5fc>: Abbrev Number: 21 (DW_TAG_structure_type)
    <5fd>   DW_AT_name        : tcb
    <601>   DW_AT_byte_size   : 204
    <602>   DW_AT_decl_file   : 18
    <603>   DW_AT_decl_line   : 262
    <605>   DW_AT_decl_column : 8
    <606>   DW_AT_sibling     : <0x848>
 <2><60a>: Abbrev Number: 22 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x4b3): flags
    <60f>   DW_AT_decl_file   : 18
    <610>   DW_AT_decl_line   : 263
    <612>   DW_AT_decl_column : 6
    <613>   DW_AT_type        : <0x64>
    <617>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><61a>: Abbrev Number: 23 (DW_TAG_member)
    <61b>   DW_AT_name        : pid
    <61f>   DW_AT_decl_file   : 18
    <620>   DW_AT_decl_line   : 264
    <622>   DW_AT_decl_column : 6
    <623>   DW_AT_type        : <0x64>
    <627>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><62a>: Abbrev Number: 22 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x54): qual_flg
    <62f>   DW_AT_decl_file   : 18
    <630>   DW_AT_decl_line   : 265
    <632>   DW_AT_decl_column : 6
    <633>   DW_AT_type        : <0x64>
    <637>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><63a>: Abbrev Number: 22 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x37f): currpers
    <63f>   DW_AT_decl_file   : 18
    <640>   DW_AT_decl_line   : 267
    <642>   DW_AT_decl_column : 15
    <643>   DW_AT_type        : <0x2b>
    <647>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><64a>: Abbrev Number: 22 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0xade): u_error
    <64f>   DW_AT_decl_file   : 18
    <650>   DW_AT_decl_line   : 269
    <652>   DW_AT_decl_column : 16
    <653>   DW_AT_type        : <0x37>
    <657>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><65a>: Abbrev Number: 22 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <65f>   DW_AT_decl_file   : 18
    <660>   DW_AT_decl_line   : 270
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x545>
    <667>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><66a>: Abbrev Number: 22 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0xb21): true_scno
    <66f>   DW_AT_decl_file   : 18
    <670>   DW_AT_decl_line   : 271
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x545>
    <677>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67a>: Abbrev Number: 22 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x1a5): u_arg
    <67f>   DW_AT_decl_file   : 18
    <680>   DW_AT_decl_line   : 272
    <682>   DW_AT_decl_column : 17
    <683>   DW_AT_type        : <0x978>
    <687>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><68a>: Abbrev Number: 22 (DW_TAG_member)
    <68b>   DW_AT_name        : (indirect string, offset: 0x94e): u_rval
    <68f>   DW_AT_decl_file   : 18
    <690>   DW_AT_decl_line   : 273
    <692>   DW_AT_decl_column : 16
    <693>   DW_AT_type        : <0x539>
    <697>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><69a>: Abbrev Number: 22 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0xa5d): sys_func_rval
    <69f>   DW_AT_decl_file   : 18
    <6a0>   DW_AT_decl_line   : 274
    <6a2>   DW_AT_decl_column : 6
    <6a3>   DW_AT_type        : <0x64>
    <6a7>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6aa>: Abbrev Number: 22 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0xc85): curcol
    <6af>   DW_AT_decl_file   : 18
    <6b0>   DW_AT_decl_line   : 275
    <6b2>   DW_AT_decl_column : 6
    <6b3>   DW_AT_type        : <0x64>
    <6b7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ba>: Abbrev Number: 22 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x960): outf
    <6bf>   DW_AT_decl_file   : 18
    <6c0>   DW_AT_decl_line   : 276
    <6c2>   DW_AT_decl_column : 8
    <6c3>   DW_AT_type        : <0x40e>
    <6c7>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ca>: Abbrev Number: 22 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0xe95): staged_output_data
    <6cf>   DW_AT_decl_file   : 18
    <6d0>   DW_AT_decl_line   : 277
    <6d2>   DW_AT_decl_column : 29
    <6d3>   DW_AT_type        : <0x98e>
    <6d7>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6da>: Abbrev Number: 22 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xa28): auxstr
    <6df>   DW_AT_decl_file   : 18
    <6e0>   DW_AT_decl_line   : 279
    <6e2>   DW_AT_decl_column : 14
    <6e3>   DW_AT_type        : <0x1c9>
    <6e7>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><6ea>: Abbrev Number: 22 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x171): _priv_data
    <6ef>   DW_AT_decl_file   : 18
    <6f0>   DW_AT_decl_line   : 280
    <6f2>   DW_AT_decl_column : 8
    <6f3>   DW_AT_type        : <0xcd>
    <6f7>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><6fa>: Abbrev Number: 22 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0xbb6): _free_priv_data
    <6ff>   DW_AT_decl_file   : 18
    <700>   DW_AT_decl_line   : 281
    <702>   DW_AT_decl_column : 9
    <703>   DW_AT_type        : <0x9a0>
    <707>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><70a>: Abbrev Number: 22 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0x182): s_ent
    <70f>   DW_AT_decl_file   : 18
    <710>   DW_AT_decl_line   : 282
    <712>   DW_AT_decl_column : 23
    <713>   DW_AT_type        : <0x9a6>
    <717>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><71a>: Abbrev Number: 22 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <71f>   DW_AT_decl_file   : 18
    <720>   DW_AT_decl_line   : 285
    <722>   DW_AT_decl_column : 23
    <723>   DW_AT_type        : <0x9a6>
    <727>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><72a>: Abbrev Number: 22 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x374): inject_vec
    <72f>   DW_AT_decl_file   : 18
    <730>   DW_AT_decl_line   : 286
    <732>   DW_AT_decl_column : 22
    <733>   DW_AT_type        : <0x9b1>
    <737>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><73a>: Abbrev Number: 22 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x7b1): stime
    <73f>   DW_AT_decl_file   : 18
    <740>   DW_AT_decl_line   : 287
    <742>   DW_AT_decl_column : 18
    <743>   DW_AT_type        : <0x133>
    <747>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><74a>: Abbrev Number: 22 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x388): ltime
    <74f>   DW_AT_decl_file   : 18
    <750>   DW_AT_decl_line   : 288
    <752>   DW_AT_decl_column : 18
    <753>   DW_AT_type        : <0x133>
    <757>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0xf7f): atime
    <75f>   DW_AT_decl_file   : 18
    <760>   DW_AT_decl_line   : 289
    <762>   DW_AT_decl_column : 18
    <763>   DW_AT_type        : <0x133>
    <767>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><76a>: Abbrev Number: 22 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x4ad): etime
    <76f>   DW_AT_decl_file   : 18
    <770>   DW_AT_decl_line   : 290
    <772>   DW_AT_decl_column : 18
    <773>   DW_AT_type        : <0x133>
    <777>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><77b>: Abbrev Number: 22 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0xce9): delay_expiration_time
    <780>   DW_AT_decl_file   : 18
    <781>   DW_AT_decl_line   : 291
    <783>   DW_AT_decl_column : 18
    <784>   DW_AT_type        : <0x133>
    <788>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><78c>: Abbrev Number: 22 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <791>   DW_AT_decl_file   : 18
    <792>   DW_AT_decl_line   : 298
    <794>   DW_AT_decl_column : 15
    <795>   DW_AT_type        : <0x2b>
    <799>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><79d>: Abbrev Number: 22 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0xed1): last_dirfd
    <7a2>   DW_AT_decl_file   : 18
    <7a3>   DW_AT_decl_line   : 301
    <7a5>   DW_AT_decl_column : 6
    <7a6>   DW_AT_type        : <0x64>
    <7aa>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ae>: Abbrev Number: 22 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0xef7): mmap_cache
    <7b3>   DW_AT_decl_file   : 18
    <7b4>   DW_AT_decl_line   : 304
    <7b6>   DW_AT_decl_column : 23
    <7b7>   DW_AT_type        : <0x9cd>
    <7bb>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7bf>: Abbrev Number: 22 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0xaf7): wait_data_idx
    <7c4>   DW_AT_decl_file   : 18
    <7c5>   DW_AT_decl_line   : 311
    <7c7>   DW_AT_decl_column : 9
    <7c8>   DW_AT_type        : <0x122>
    <7cc>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7d0>: Abbrev Number: 22 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xa2f): delayed_wait_data
    <7d5>   DW_AT_decl_file   : 18
    <7d6>   DW_AT_decl_line   : 313
    <7d8>   DW_AT_decl_column : 24
    <7d9>   DW_AT_type        : <0x9d9>
    <7dd>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7e1>: Abbrev Number: 22 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0xa9f): wait_list
    <7e6>   DW_AT_decl_file   : 18
    <7e7>   DW_AT_decl_line   : 314
    <7e9>   DW_AT_decl_column : 19
    <7ea>   DW_AT_type        : <0x556>
    <7ee>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><7f2>: Abbrev Number: 22 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x6ae): vcpu_info_list
    <7f7>   DW_AT_decl_file   : 18
    <7f8>   DW_AT_decl_line   : 318
    <7fa>   DW_AT_decl_column : 20
    <7fb>   DW_AT_type        : <0x9e5>
    <7ff>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><803>: Abbrev Number: 22 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0xc50): unwind_ctx
    <808>   DW_AT_decl_file   : 18
    <809>   DW_AT_decl_line   : 322
    <80b>   DW_AT_decl_column : 8
    <80c>   DW_AT_type        : <0xcd>
    <810>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><814>: Abbrev Number: 22 (DW_TAG_member)
    <815>   DW_AT_name        : (indirect string, offset: 0x497): unwind_queue
    <819>   DW_AT_decl_file   : 18
    <81a>   DW_AT_decl_line   : 323
    <81c>   DW_AT_decl_column : 25
    <81d>   DW_AT_type        : <0x9f1>
    <821>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><825>: Abbrev Number: 22 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0x166): comm
    <82a>   DW_AT_decl_file   : 18
    <82b>   DW_AT_decl_line   : 327
    <82d>   DW_AT_decl_column : 7
    <82e>   DW_AT_type        : <0x9f7>
    <832>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><836>: Abbrev Number: 22 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x221): start_prc
    <83b>   DW_AT_decl_file   : 18
    <83c>   DW_AT_decl_line   : 329
    <83e>   DW_AT_decl_column : 16
    <83f>   DW_AT_type        : <0x37>
    <843>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><847>: Abbrev Number: 0
 <1><848>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <849>   DW_AT_byte_size   : 4
    <84a>   DW_AT_type        : <0x5e1>
 <1><84e>: Abbrev Number: 4 (DW_TAG_typedef)
    <84f>   DW_AT_name        : (indirect string, offset: 0x4f9): struct_sysent
    <853>   DW_AT_decl_file   : 17
    <854>   DW_AT_decl_line   : 19
    <855>   DW_AT_decl_column : 3
    <856>   DW_AT_type        : <0x588>
 <1><85a>: Abbrev Number: 3 (DW_TAG_const_type)
    <85b>   DW_AT_type        : <0x84e>
 <1><85f>: Abbrev Number: 11 (DW_TAG_variable)
    <860>   DW_AT_name        : (indirect string, offset: 0xcd5): current_personality
    <864>   DW_AT_decl_file   : 18
    <865>   DW_AT_decl_line   : 158
    <866>   DW_AT_decl_column : 17
    <867>   DW_AT_type        : <0x2b>
    <86b>   DW_AT_external    : 1
    <86c>   DW_AT_declaration : 1
 <1><86d>: Abbrev Number: 11 (DW_TAG_variable)
    <86e>   DW_AT_name        : (indirect string, offset: 0x7e2): current_wordsize
    <872>   DW_AT_decl_file   : 18
    <873>   DW_AT_decl_line   : 171
    <874>   DW_AT_decl_column : 17
    <875>   DW_AT_type        : <0x2b>
    <879>   DW_AT_external    : 1
    <87a>   DW_AT_declaration : 1
 <1><87b>: Abbrev Number: 11 (DW_TAG_variable)
    <87c>   DW_AT_name        : (indirect string, offset: 0xa06): current_klongsize
    <880>   DW_AT_decl_file   : 18
    <881>   DW_AT_decl_line   : 176
    <882>   DW_AT_decl_column : 17
    <883>   DW_AT_type        : <0x2b>
    <887>   DW_AT_external    : 1
    <888>   DW_AT_declaration : 1
 <1><889>: Abbrev Number: 8 (DW_TAG_structure_type)
    <88a>   DW_AT_name        : (indirect string, offset: 0xc27): ioctlent
    <88e>   DW_AT_byte_size   : 8
    <88f>   DW_AT_decl_file   : 18
    <890>   DW_AT_decl_line   : 217
    <891>   DW_AT_decl_column : 16
    <892>   DW_AT_sibling     : <0x8b5>
 <2><896>: Abbrev Number: 9 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0xebd): symbol
    <89b>   DW_AT_decl_file   : 18
    <89c>   DW_AT_decl_line   : 218
    <89d>   DW_AT_decl_column : 14
    <89e>   DW_AT_type        : <0x1c9>
    <8a2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8a5>: Abbrev Number: 9 (DW_TAG_member)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xc9e): code
    <8aa>   DW_AT_decl_file   : 18
    <8ab>   DW_AT_decl_line   : 219
    <8ac>   DW_AT_decl_column : 15
    <8ad>   DW_AT_type        : <0x2b>
    <8b1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8b4>: Abbrev Number: 0
 <1><8b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b6>   DW_AT_name        : (indirect string, offset: 0xbe0): struct_ioctlent
    <8ba>   DW_AT_decl_file   : 18
    <8bb>   DW_AT_decl_line   : 220
    <8bc>   DW_AT_decl_column : 3
    <8bd>   DW_AT_type        : <0x889>
 <1><8c1>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c2>   DW_AT_type        : <0x8b5>
 <1><8c6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x7d6): inject_data
    <8cb>   DW_AT_byte_size   : 10
    <8cc>   DW_AT_decl_file   : 18
    <8cd>   DW_AT_decl_line   : 241
    <8ce>   DW_AT_decl_column : 8
    <8cf>   DW_AT_sibling     : <0x92e>
 <2><8d3>: Abbrev Number: 9 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x4b3): flags
    <8d8>   DW_AT_decl_file   : 18
    <8d9>   DW_AT_decl_line   : 242
    <8da>   DW_AT_decl_column : 10
    <8db>   DW_AT_type        : <0xf2>
    <8df>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e2>: Abbrev Number: 9 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x8eb): signo
    <8e7>   DW_AT_decl_file   : 18
    <8e8>   DW_AT_decl_line   : 243
    <8e9>   DW_AT_decl_column : 10
    <8ea>   DW_AT_type        : <0xf2>
    <8ee>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8f1>: Abbrev Number: 9 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0xf8): rval_idx
    <8f6>   DW_AT_decl_file   : 18
    <8f7>   DW_AT_decl_line   : 244
    <8f8>   DW_AT_decl_column : 11
    <8f9>   DW_AT_type        : <0xfe>
    <8fd>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><900>: Abbrev Number: 9 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0xc7b): delay_idx
    <905>   DW_AT_decl_file   : 18
    <906>   DW_AT_decl_line   : 245
    <907>   DW_AT_decl_column : 11
    <908>   DW_AT_type        : <0xfe>
    <90c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><90f>: Abbrev Number: 9 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0x53f): poke_idx
    <914>   DW_AT_decl_file   : 18
    <915>   DW_AT_decl_line   : 246
    <916>   DW_AT_decl_column : 11
    <917>   DW_AT_type        : <0xfe>
    <91b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><91e>: Abbrev Number: 9 (DW_TAG_member)
    <91f>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <923>   DW_AT_decl_file   : 18
    <924>   DW_AT_decl_line   : 247
    <925>   DW_AT_decl_column : 11
    <926>   DW_AT_type        : <0xfe>
    <92a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><92d>: Abbrev Number: 0
 <1><92e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <92f>   DW_AT_name        : (indirect string, offset: 0xd9): inject_opts
    <933>   DW_AT_byte_size   : 16
    <934>   DW_AT_decl_file   : 18
    <935>   DW_AT_decl_line   : 250
    <936>   DW_AT_decl_column : 8
    <937>   DW_AT_sibling     : <0x978>
 <2><93b>: Abbrev Number: 9 (DW_TAG_member)
    <93c>   DW_AT_name        : (indirect string, offset: 0x9db): first
    <940>   DW_AT_decl_file   : 18
    <941>   DW_AT_decl_line   : 251
    <942>   DW_AT_decl_column : 11
    <943>   DW_AT_type        : <0xfe>
    <947>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><94a>: Abbrev Number: 9 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0x10aa): last
    <94f>   DW_AT_decl_file   : 18
    <950>   DW_AT_decl_line   : 252
    <951>   DW_AT_decl_column : 11
    <952>   DW_AT_type        : <0xfe>
    <956>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><959>: Abbrev Number: 9 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0x38e): step
    <95e>   DW_AT_decl_file   : 18
    <95f>   DW_AT_decl_line   : 253
    <960>   DW_AT_decl_column : 11
    <961>   DW_AT_type        : <0xfe>
    <965>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><968>: Abbrev Number: 9 (DW_TAG_member)
    <969>   DW_AT_name        : (indirect string, offset: 0x105d): data
    <96d>   DW_AT_decl_file   : 18
    <96e>   DW_AT_decl_line   : 254
    <96f>   DW_AT_decl_column : 21
    <970>   DW_AT_type        : <0x8c6>
    <974>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><977>: Abbrev Number: 0
 <1><978>: Abbrev Number: 15 (DW_TAG_array_type)
    <979>   DW_AT_type        : <0x545>
    <97d>   DW_AT_sibling     : <0x988>
 <2><981>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <982>   DW_AT_type        : <0x2b>
    <986>   DW_AT_upper_bound : 5
 <2><987>: Abbrev Number: 0
 <1><988>: Abbrev Number: 14 (DW_TAG_structure_type)
    <989>   DW_AT_name        : (indirect string, offset: 0xe95): staged_output_data
    <98d>   DW_AT_declaration : 1
 <1><98e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <98f>   DW_AT_byte_size   : 4
    <990>   DW_AT_type        : <0x988>
 <1><994>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <995>   DW_AT_prototyped  : 1
    <996>   DW_AT_sibling     : <0x9a0>
 <2><99a>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <99b>   DW_AT_type        : <0xcd>
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a1>   DW_AT_byte_size   : 4
    <9a2>   DW_AT_type        : <0x994>
 <1><9a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x85a>
 <1><9ac>: Abbrev Number: 3 (DW_TAG_const_type)
    <9ad>   DW_AT_type        : <0x9a6>
 <1><9b1>: Abbrev Number: 15 (DW_TAG_array_type)
    <9b2>   DW_AT_type        : <0x9c1>
    <9b6>   DW_AT_sibling     : <0x9c1>
 <2><9ba>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9bb>   DW_AT_type        : <0x2b>
    <9bf>   DW_AT_upper_bound : 2
 <2><9c0>: Abbrev Number: 0
 <1><9c1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c2>   DW_AT_byte_size   : 4
    <9c3>   DW_AT_type        : <0x92e>
 <1><9c7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9c8>   DW_AT_name        : (indirect string, offset: 0xa5): mmap_cache_t
    <9cc>   DW_AT_declaration : 1
 <1><9cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ce>   DW_AT_byte_size   : 4
    <9cf>   DW_AT_type        : <0x9c7>
 <1><9d3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d4>   DW_AT_name        : (indirect string, offset: 0x3a9): tcb_wait_data
    <9d8>   DW_AT_declaration : 1
 <1><9d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9da>   DW_AT_byte_size   : 4
    <9db>   DW_AT_type        : <0x9d3>
 <1><9df>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x15c): vcpu_info
    <9e4>   DW_AT_declaration : 1
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x9df>
 <1><9eb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xe79): unwind_queue_t
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 15 (DW_TAG_array_type)
    <9f8>   DW_AT_type        : <0xe6>
    <9fc>   DW_AT_sibling     : <0xa07>
 <2><a00>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a01>   DW_AT_type        : <0x2b>
    <a05>   DW_AT_upper_bound : 15
 <2><a06>: Abbrev Number: 0
 <1><a07>: Abbrev Number: 10 (DW_TAG_variable)
    <a08>   DW_AT_name        : (indirect string, offset: 0xb34): stub_sysent
    <a0c>   DW_AT_decl_file   : 18
    <a0d>   DW_AT_decl_line   : 403
    <a0f>   DW_AT_decl_column : 28
    <a10>   DW_AT_type        : <0x85a>
    <a14>   DW_AT_external    : 1
    <a15>   DW_AT_declaration : 1
 <1><a16>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a17>   DW_AT_name        : (indirect string, offset: 0x1040): xlat_type
    <a1b>   DW_AT_encoding    : 7	(unsigned)
    <a1c>   DW_AT_byte_size   : 4
    <a1d>   DW_AT_type        : <0x2b>
    <a21>   DW_AT_decl_file   : 19
    <a22>   DW_AT_decl_line   : 13
    <a23>   DW_AT_decl_column : 6
    <a24>   DW_AT_sibling     : <0xa3b>
 <2><a28>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a29>   DW_AT_name        : (indirect string, offset: 0x2c3): XT_NORMAL
    <a2d>   DW_AT_const_value : 0
 <2><a2e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a2f>   DW_AT_name        : (indirect string, offset: 0xbff): XT_SORTED
    <a33>   DW_AT_const_value : 1
 <2><a34>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a35>   DW_AT_name        : (indirect string, offset: 0xd61): XT_INDEXED
    <a39>   DW_AT_const_value : 2
 <2><a3a>: Abbrev Number: 0
 <1><a3b>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xb60): xlat_style
    <a40>   DW_AT_encoding    : 7	(unsigned)
    <a41>   DW_AT_byte_size   : 4
    <a42>   DW_AT_type        : <0x2b>
    <a46>   DW_AT_decl_file   : 19
    <a47>   DW_AT_decl_line   : 19
    <a48>   DW_AT_decl_column : 6
    <a49>   DW_AT_sibling     : <0xa78>
 <2><a4d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xe5): XLAT_STYLE_DEFAULT
    <a52>   DW_AT_const_value : 0
 <2><a53>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0xb93): XLAT_STYLE_RAW
    <a58>   DW_AT_const_value : 1
 <2><a59>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x100b): XLAT_STYLE_ABBREV
    <a5e>   DW_AT_const_value : 2
 <2><a5f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0x2e0): XLAT_STYLE_VERBOSE
    <a64>   DW_AT_const_value : 3
 <2><a65>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a6a>   DW_AT_const_value : 0
 <2><a6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a70>   DW_AT_const_value : 4
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x1099): XLAT_STYLE_FMT_D
    <a76>   DW_AT_const_value : 8
 <2><a77>: Abbrev Number: 0
 <1><a78>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a79>   DW_AT_name        : (indirect string, offset: 0x311): xlat_data
    <a7d>   DW_AT_byte_size   : 12
    <a7e>   DW_AT_decl_file   : 19
    <a7f>   DW_AT_decl_line   : 51
    <a80>   DW_AT_decl_column : 8
    <a81>   DW_AT_sibling     : <0xaa4>
 <2><a85>: Abbrev Number: 18 (DW_TAG_member)
    <a86>   DW_AT_name        : val
    <a8a>   DW_AT_decl_file   : 19
    <a8b>   DW_AT_decl_line   : 52
    <a8c>   DW_AT_decl_column : 11
    <a8d>   DW_AT_type        : <0x116>
    <a91>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a94>: Abbrev Number: 18 (DW_TAG_member)
    <a95>   DW_AT_name        : str
    <a99>   DW_AT_decl_file   : 19
    <a9a>   DW_AT_decl_line   : 53
    <a9b>   DW_AT_decl_column : 14
    <a9c>   DW_AT_type        : <0x1c9>
    <aa0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aa3>: Abbrev Number: 0
 <1><aa4>: Abbrev Number: 3 (DW_TAG_const_type)
    <aa5>   DW_AT_type        : <0xa78>
 <1><aa9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aae>   DW_AT_byte_size   : 24
    <aaf>   DW_AT_decl_file   : 19
    <ab0>   DW_AT_decl_line   : 56
    <ab1>   DW_AT_decl_column : 8
    <ab2>   DW_AT_sibling     : <0xb02>
 <2><ab6>: Abbrev Number: 9 (DW_TAG_member)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x105d): data
    <abb>   DW_AT_decl_file   : 19
    <abc>   DW_AT_decl_line   : 57
    <abd>   DW_AT_decl_column : 26
    <abe>   DW_AT_type        : <0xb07>
    <ac2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac5>: Abbrev Number: 9 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x834): flags_strsz
    <aca>   DW_AT_decl_file   : 19
    <acb>   DW_AT_decl_line   : 58
    <acc>   DW_AT_decl_column : 9
    <acd>   DW_AT_type        : <0x122>
    <ad1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ad4>: Abbrev Number: 9 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xb05): size
    <ad9>   DW_AT_decl_file   : 19
    <ada>   DW_AT_decl_line   : 59
    <adb>   DW_AT_decl_column : 11
    <adc>   DW_AT_type        : <0x10a>
    <ae0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ae3>: Abbrev Number: 9 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x1a0): type
    <ae8>   DW_AT_decl_file   : 19
    <ae9>   DW_AT_decl_line   : 60
    <aea>   DW_AT_decl_column : 17
    <aeb>   DW_AT_type        : <0xa16>
    <aef>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><af2>: Abbrev Number: 9 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x702): flags_mask
    <af7>   DW_AT_decl_file   : 19
    <af8>   DW_AT_decl_line   : 61
    <af9>   DW_AT_decl_column : 11
    <afa>   DW_AT_type        : <0x116>
    <afe>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b01>: Abbrev Number: 0
 <1><b02>: Abbrev Number: 3 (DW_TAG_const_type)
    <b03>   DW_AT_type        : <0xaa9>
 <1><b07>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b08>   DW_AT_byte_size   : 4
    <b09>   DW_AT_type        : <0xaa4>
 <1><b0d>: Abbrev Number: 15 (DW_TAG_array_type)
    <b0e>   DW_AT_type        : <0xb02>
    <b12>   DW_AT_sibling     : <0xb18>
 <2><b16>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b17>: Abbrev Number: 0
 <1><b18>: Abbrev Number: 3 (DW_TAG_const_type)
    <b19>   DW_AT_type        : <0xb0d>
 <1><b1d>: Abbrev Number: 10 (DW_TAG_variable)
    <b1e>   DW_AT_name        : (indirect string, offset: 0xdca): addrfams
    <b22>   DW_AT_decl_file   : 18
    <b23>   DW_AT_decl_line   : 409
    <b25>   DW_AT_decl_column : 26
    <b26>   DW_AT_type        : <0xb18>
    <b2a>   DW_AT_external    : 1
    <b2b>   DW_AT_declaration : 1
 <1><b2c>: Abbrev Number: 10 (DW_TAG_variable)
    <b2d>   DW_AT_name        : (indirect string, offset: 0xcae): arp_hardware_types
    <b31>   DW_AT_decl_file   : 18
    <b32>   DW_AT_decl_line   : 410
    <b34>   DW_AT_decl_column : 26
    <b35>   DW_AT_type        : <0xb18>
    <b39>   DW_AT_external    : 1
    <b3a>   DW_AT_declaration : 1
 <1><b3b>: Abbrev Number: 10 (DW_TAG_variable)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xf85): at_flags
    <b40>   DW_AT_decl_file   : 18
    <b41>   DW_AT_decl_line   : 411
    <b43>   DW_AT_decl_column : 26
    <b44>   DW_AT_type        : <0xb18>
    <b48>   DW_AT_external    : 1
    <b49>   DW_AT_declaration : 1
 <1><b4a>: Abbrev Number: 10 (DW_TAG_variable)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x475): clocknames
    <b4f>   DW_AT_decl_file   : 18
    <b50>   DW_AT_decl_line   : 412
    <b52>   DW_AT_decl_column : 26
    <b53>   DW_AT_type        : <0xb18>
    <b57>   DW_AT_external    : 1
    <b58>   DW_AT_declaration : 1
 <1><b59>: Abbrev Number: 10 (DW_TAG_variable)
    <b5a>   DW_AT_name        : (indirect string, offset: 0xf45): dirent_types
    <b5e>   DW_AT_decl_file   : 18
    <b5f>   DW_AT_decl_line   : 413
    <b61>   DW_AT_decl_column : 26
    <b62>   DW_AT_type        : <0xb18>
    <b66>   DW_AT_external    : 1
    <b67>   DW_AT_declaration : 1
 <1><b68>: Abbrev Number: 10 (DW_TAG_variable)
    <b69>   DW_AT_name        : (indirect string, offset: 0x885): ethernet_protocols
    <b6d>   DW_AT_decl_file   : 18
    <b6e>   DW_AT_decl_line   : 414
    <b70>   DW_AT_decl_column : 26
    <b71>   DW_AT_type        : <0xb18>
    <b75>   DW_AT_external    : 1
    <b76>   DW_AT_declaration : 1
 <1><b77>: Abbrev Number: 10 (DW_TAG_variable)
    <b78>   DW_AT_name        : (indirect string, offset: 0x592): inet_protocols
    <b7c>   DW_AT_decl_file   : 18
    <b7d>   DW_AT_decl_line   : 415
    <b7f>   DW_AT_decl_column : 26
    <b80>   DW_AT_type        : <0xb18>
    <b84>   DW_AT_external    : 1
    <b85>   DW_AT_declaration : 1
 <1><b86>: Abbrev Number: 10 (DW_TAG_variable)
    <b87>   DW_AT_name        : (indirect string, offset: 0x2b0): evdev_abs
    <b8b>   DW_AT_decl_file   : 18
    <b8c>   DW_AT_decl_line   : 416
    <b8e>   DW_AT_decl_column : 26
    <b8f>   DW_AT_type        : <0xb18>
    <b93>   DW_AT_external    : 1
    <b94>   DW_AT_declaration : 1
 <1><b95>: Abbrev Number: 10 (DW_TAG_variable)
    <b96>   DW_AT_name        : (indirect string, offset: 0x6f7): audit_arch
    <b9a>   DW_AT_decl_file   : 18
    <b9b>   DW_AT_decl_line   : 417
    <b9d>   DW_AT_decl_column : 26
    <b9e>   DW_AT_type        : <0xb18>
    <ba2>   DW_AT_external    : 1
    <ba3>   DW_AT_declaration : 1
 <1><ba4>: Abbrev Number: 10 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x91): evdev_ev
    <ba9>   DW_AT_decl_file   : 18
    <baa>   DW_AT_decl_line   : 418
    <bac>   DW_AT_decl_column : 26
    <bad>   DW_AT_type        : <0xb18>
    <bb1>   DW_AT_external    : 1
    <bb2>   DW_AT_declaration : 1
 <1><bb3>: Abbrev Number: 10 (DW_TAG_variable)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x456): iffflags
    <bb8>   DW_AT_decl_file   : 18
    <bb9>   DW_AT_decl_line   : 419
    <bbb>   DW_AT_decl_column : 26
    <bbc>   DW_AT_type        : <0xb18>
    <bc0>   DW_AT_external    : 1
    <bc1>   DW_AT_declaration : 1
 <1><bc2>: Abbrev Number: 10 (DW_TAG_variable)
    <bc3>   DW_AT_name        : (indirect string, offset: 0xba2): ip_type_of_services
    <bc7>   DW_AT_decl_file   : 18
    <bc8>   DW_AT_decl_line   : 420
    <bca>   DW_AT_decl_column : 26
    <bcb>   DW_AT_type        : <0xb18>
    <bcf>   DW_AT_external    : 1
    <bd0>   DW_AT_declaration : 1
 <1><bd1>: Abbrev Number: 10 (DW_TAG_variable)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x68a): ipc_private
    <bd6>   DW_AT_decl_file   : 18
    <bd7>   DW_AT_decl_line   : 421
    <bd9>   DW_AT_decl_column : 26
    <bda>   DW_AT_type        : <0xb18>
    <bde>   DW_AT_external    : 1
    <bdf>   DW_AT_declaration : 1
 <1><be0>: Abbrev Number: 10 (DW_TAG_variable)
    <be1>   DW_AT_name        : (indirect string, offset: 0x307): msg_flags
    <be5>   DW_AT_decl_file   : 18
    <be6>   DW_AT_decl_line   : 422
    <be8>   DW_AT_decl_column : 26
    <be9>   DW_AT_type        : <0xb18>
    <bed>   DW_AT_external    : 1
    <bee>   DW_AT_declaration : 1
 <1><bef>: Abbrev Number: 10 (DW_TAG_variable)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x101): netlink_protocols
    <bf4>   DW_AT_decl_file   : 18
    <bf5>   DW_AT_decl_line   : 423
    <bf7>   DW_AT_decl_column : 26
    <bf8>   DW_AT_type        : <0xb18>
    <bfc>   DW_AT_external    : 1
    <bfd>   DW_AT_declaration : 1
 <1><bfe>: Abbrev Number: 10 (DW_TAG_variable)
    <bff>   DW_AT_name        : (indirect string, offset: 0xea8): nl_bridge_vlan_flags
    <c03>   DW_AT_decl_file   : 18
    <c04>   DW_AT_decl_line   : 424
    <c06>   DW_AT_decl_column : 26
    <c07>   DW_AT_type        : <0xb18>
    <c0b>   DW_AT_external    : 1
    <c0c>   DW_AT_declaration : 1
 <1><c0d>: Abbrev Number: 10 (DW_TAG_variable)
    <c0e>   DW_AT_name        : (indirect string, offset: 0xd4a): nl_netfilter_msg_types
    <c12>   DW_AT_decl_file   : 18
    <c13>   DW_AT_decl_line   : 425
    <c15>   DW_AT_decl_column : 26
    <c16>   DW_AT_type        : <0xb18>
    <c1a>   DW_AT_external    : 1
    <c1b>   DW_AT_declaration : 1
 <1><c1c>: Abbrev Number: 10 (DW_TAG_variable)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x438): nl_route_types
    <c21>   DW_AT_decl_file   : 18
    <c22>   DW_AT_decl_line   : 426
    <c24>   DW_AT_decl_column : 26
    <c25>   DW_AT_type        : <0xb18>
    <c29>   DW_AT_external    : 1
    <c2a>   DW_AT_declaration : 1
 <1><c2b>: Abbrev Number: 10 (DW_TAG_variable)
    <c2c>   DW_AT_name        : (indirect string, offset: 0xe01): open_access_modes
    <c30>   DW_AT_decl_file   : 18
    <c31>   DW_AT_decl_line   : 427
    <c33>   DW_AT_decl_column : 26
    <c34>   DW_AT_type        : <0xb18>
    <c38>   DW_AT_external    : 1
    <c39>   DW_AT_declaration : 1
 <1><c3a>: Abbrev Number: 10 (DW_TAG_variable)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x81): open_mode_flags
    <c3f>   DW_AT_decl_file   : 18
    <c40>   DW_AT_decl_line   : 428
    <c42>   DW_AT_decl_column : 26
    <c43>   DW_AT_type        : <0xb18>
    <c47>   DW_AT_external    : 1
    <c48>   DW_AT_declaration : 1
 <1><c49>: Abbrev Number: 10 (DW_TAG_variable)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xbd3): perf_type_id
    <c4e>   DW_AT_decl_file   : 18
    <c4f>   DW_AT_decl_line   : 429
    <c51>   DW_AT_decl_column : 26
    <c52>   DW_AT_type        : <0xb18>
    <c56>   DW_AT_external    : 1
    <c57>   DW_AT_declaration : 1
 <1><c58>: Abbrev Number: 10 (DW_TAG_variable)
    <c59>   DW_AT_name        : (indirect string, offset: 0xdd3): pollflags
    <c5d>   DW_AT_decl_file   : 18
    <c5e>   DW_AT_decl_line   : 430
    <c60>   DW_AT_decl_column : 26
    <c61>   DW_AT_type        : <0xb18>
    <c65>   DW_AT_external    : 1
    <c66>   DW_AT_declaration : 1
 <1><c67>: Abbrev Number: 10 (DW_TAG_variable)
    <c68>   DW_AT_name        : (indirect string, offset: 0x533): ptrace_cmds
    <c6c>   DW_AT_decl_file   : 18
    <c6d>   DW_AT_decl_line   : 431
    <c6f>   DW_AT_decl_column : 26
    <c70>   DW_AT_type        : <0xb18>
    <c74>   DW_AT_external    : 1
    <c75>   DW_AT_declaration : 1
 <1><c76>: Abbrev Number: 10 (DW_TAG_variable)
    <c77>   DW_AT_name        : (indirect string, offset: 0x7c7): resource_flags
    <c7b>   DW_AT_decl_file   : 18
    <c7c>   DW_AT_decl_line   : 432
    <c7e>   DW_AT_decl_column : 26
    <c7f>   DW_AT_type        : <0xb18>
    <c83>   DW_AT_external    : 1
    <c84>   DW_AT_declaration : 1
 <1><c85>: Abbrev Number: 10 (DW_TAG_variable)
    <c86>   DW_AT_name        : (indirect string, offset: 0x286): route_nexthop_flags
    <c8a>   DW_AT_decl_file   : 18
    <c8b>   DW_AT_decl_line   : 433
    <c8d>   DW_AT_decl_column : 26
    <c8e>   DW_AT_type        : <0xb18>
    <c92>   DW_AT_external    : 1
    <c93>   DW_AT_declaration : 1
 <1><c94>: Abbrev Number: 10 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0xe33): routing_protocols
    <c99>   DW_AT_decl_file   : 18
    <c9a>   DW_AT_decl_line   : 434
    <c9c>   DW_AT_decl_column : 26
    <c9d>   DW_AT_type        : <0xb18>
    <ca1>   DW_AT_external    : 1
    <ca2>   DW_AT_declaration : 1
 <1><ca3>: Abbrev Number: 10 (DW_TAG_variable)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x447): routing_scopes
    <ca8>   DW_AT_decl_file   : 18
    <ca9>   DW_AT_decl_line   : 435
    <cab>   DW_AT_decl_column : 26
    <cac>   DW_AT_type        : <0xb18>
    <cb0>   DW_AT_external    : 1
    <cb1>   DW_AT_declaration : 1
 <1><cb2>: Abbrev Number: 10 (DW_TAG_variable)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xd38): routing_table_ids
    <cb7>   DW_AT_decl_file   : 18
    <cb8>   DW_AT_decl_line   : 436
    <cba>   DW_AT_decl_column : 26
    <cbb>   DW_AT_type        : <0xb18>
    <cbf>   DW_AT_external    : 1
    <cc0>   DW_AT_declaration : 1
 <1><cc1>: Abbrev Number: 10 (DW_TAG_variable)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x667): routing_types
    <cc6>   DW_AT_decl_file   : 18
    <cc7>   DW_AT_decl_line   : 437
    <cc9>   DW_AT_decl_column : 26
    <cca>   DW_AT_type        : <0xb18>
    <cce>   DW_AT_external    : 1
    <ccf>   DW_AT_declaration : 1
 <1><cd0>: Abbrev Number: 10 (DW_TAG_variable)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x1c4): rwf_flags
    <cd5>   DW_AT_decl_file   : 18
    <cd6>   DW_AT_decl_line   : 438
    <cd8>   DW_AT_decl_column : 26
    <cd9>   DW_AT_type        : <0xb18>
    <cdd>   DW_AT_external    : 1
    <cde>   DW_AT_declaration : 1
 <1><cdf>: Abbrev Number: 10 (DW_TAG_variable)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x7ff): seccomp_filter_flags
    <ce4>   DW_AT_decl_file   : 18
    <ce5>   DW_AT_decl_line   : 439
    <ce7>   DW_AT_decl_column : 26
    <ce8>   DW_AT_type        : <0xb18>
    <cec>   DW_AT_external    : 1
    <ced>   DW_AT_declaration : 1
 <1><cee>: Abbrev Number: 10 (DW_TAG_variable)
    <cef>   DW_AT_name        : (indirect string, offset: 0x2cd): seccomp_ret_action
    <cf3>   DW_AT_decl_file   : 18
    <cf4>   DW_AT_decl_line   : 440
    <cf6>   DW_AT_decl_column : 26
    <cf7>   DW_AT_type        : <0xb18>
    <cfb>   DW_AT_external    : 1
    <cfc>   DW_AT_declaration : 1
 <1><cfd>: Abbrev Number: 10 (DW_TAG_variable)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x413): setns_types
    <d02>   DW_AT_decl_file   : 18
    <d03>   DW_AT_decl_line   : 441
    <d05>   DW_AT_decl_column : 26
    <d06>   DW_AT_type        : <0xb18>
    <d0a>   DW_AT_external    : 1
    <d0b>   DW_AT_declaration : 1
 <1><d0c>: Abbrev Number: 10 (DW_TAG_variable)
    <d0d>   DW_AT_name        : (indirect string, offset: 0xdbf): sg_io_info
    <d11>   DW_AT_decl_file   : 18
    <d12>   DW_AT_decl_line   : 442
    <d14>   DW_AT_decl_column : 26
    <d15>   DW_AT_type        : <0xb18>
    <d19>   DW_AT_external    : 1
    <d1a>   DW_AT_declaration : 1
 <1><d1b>: Abbrev Number: 10 (DW_TAG_variable)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xb48): socketlayers
    <d20>   DW_AT_decl_file   : 18
    <d21>   DW_AT_decl_line   : 443
    <d23>   DW_AT_decl_column : 26
    <d24>   DW_AT_type        : <0xb18>
    <d28>   DW_AT_external    : 1
    <d29>   DW_AT_declaration : 1
 <1><d2a>: Abbrev Number: 10 (DW_TAG_variable)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xd22): socktypes
    <d2f>   DW_AT_decl_file   : 18
    <d30>   DW_AT_decl_line   : 444
    <d32>   DW_AT_decl_column : 26
    <d33>   DW_AT_type        : <0xb18>
    <d37>   DW_AT_external    : 1
    <d38>   DW_AT_declaration : 1
 <1><d39>: Abbrev Number: 10 (DW_TAG_variable)
    <d3a>   DW_AT_name        : (indirect string, offset: 0xa18): tcp_state_flags
    <d3e>   DW_AT_decl_file   : 18
    <d3f>   DW_AT_decl_line   : 445
    <d41>   DW_AT_decl_column : 26
    <d42>   DW_AT_type        : <0xb18>
    <d46>   DW_AT_external    : 1
    <d47>   DW_AT_declaration : 1
 <1><d48>: Abbrev Number: 10 (DW_TAG_variable)
    <d49>   DW_AT_name        : (indirect string, offset: 0x72c): tcp_states
    <d4d>   DW_AT_decl_file   : 18
    <d4e>   DW_AT_decl_line   : 446
    <d50>   DW_AT_decl_column : 26
    <d51>   DW_AT_type        : <0xb18>
    <d55>   DW_AT_external    : 1
    <d56>   DW_AT_declaration : 1
 <1><d57>: Abbrev Number: 10 (DW_TAG_variable)
    <d58>   DW_AT_name        : (indirect string, offset: 0xfee): whence_codes
    <d5c>   DW_AT_decl_file   : 18
    <d5d>   DW_AT_decl_line   : 447
    <d5f>   DW_AT_decl_column : 26
    <d60>   DW_AT_type        : <0xb18>
    <d64>   DW_AT_external    : 1
    <d65>   DW_AT_declaration : 1
 <1><d66>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d67>   DW_AT_encoding    : 7	(unsigned)
    <d68>   DW_AT_byte_size   : 4
    <d69>   DW_AT_type        : <0x2b>
    <d6d>   DW_AT_decl_file   : 18
    <d6e>   DW_AT_decl_line   : 508
    <d70>   DW_AT_decl_column : 14
    <d71>   DW_AT_sibling     : <0xd88>
 <2><d75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d76>   DW_AT_name        : (indirect string, offset: 0x955): CFLAG_NONE
    <d7a>   DW_AT_const_value : 0
 <2><d7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x898): CFLAG_ONLY_STATS
    <d80>   DW_AT_const_value : 1
 <2><d81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d82>   DW_AT_name        : (indirect string, offset: 0xb55): CFLAG_BOTH
    <d86>   DW_AT_const_value : 2
 <2><d87>: Abbrev Number: 0
 <1><d88>: Abbrev Number: 28 (DW_TAG_typedef)
    <d89>   DW_AT_name        : (indirect string, offset: 0x10af): cflag_t
    <d8d>   DW_AT_decl_file   : 18
    <d8e>   DW_AT_decl_line   : 512
    <d90>   DW_AT_decl_column : 3
    <d91>   DW_AT_type        : <0xd66>
 <1><d95>: Abbrev Number: 10 (DW_TAG_variable)
    <d96>   DW_AT_name        : (indirect string, offset: 0xc75): cflag
    <d9a>   DW_AT_decl_file   : 18
    <d9b>   DW_AT_decl_line   : 513
    <d9d>   DW_AT_decl_column : 16
    <d9e>   DW_AT_type        : <0xd88>
    <da2>   DW_AT_external    : 1
    <da3>   DW_AT_declaration : 1
 <1><da4>: Abbrev Number: 10 (DW_TAG_variable)
    <da5>   DW_AT_name        : (indirect string, offset: 0x17c): Tflag
    <da9>   DW_AT_decl_file   : 18
    <daa>   DW_AT_decl_line   : 514
    <dac>   DW_AT_decl_column : 13
    <dad>   DW_AT_type        : <0x515>
    <db1>   DW_AT_external    : 1
    <db2>   DW_AT_declaration : 1
 <1><db3>: Abbrev Number: 10 (DW_TAG_variable)
    <db4>   DW_AT_name        : (indirect string, offset: 0x782): Tflag_scale
    <db8>   DW_AT_decl_file   : 18
    <db9>   DW_AT_decl_line   : 515
    <dbb>   DW_AT_decl_column : 12
    <dbc>   DW_AT_type        : <0x64>
    <dc0>   DW_AT_external    : 1
    <dc1>   DW_AT_declaration : 1
 <1><dc2>: Abbrev Number: 10 (DW_TAG_variable)
    <dc3>   DW_AT_name        : (indirect string, offset: 0x814): Tflag_width
    <dc7>   DW_AT_decl_file   : 18
    <dc8>   DW_AT_decl_line   : 516
    <dca>   DW_AT_decl_column : 12
    <dcb>   DW_AT_type        : <0x64>
    <dcf>   DW_AT_external    : 1
    <dd0>   DW_AT_declaration : 1
 <1><dd1>: Abbrev Number: 10 (DW_TAG_variable)
    <dd2>   DW_AT_name        : (indirect string, offset: 0xdb1): iflag
    <dd6>   DW_AT_decl_file   : 18
    <dd7>   DW_AT_decl_line   : 517
    <dd9>   DW_AT_decl_column : 13
    <dda>   DW_AT_type        : <0x515>
    <dde>   DW_AT_external    : 1
    <ddf>   DW_AT_declaration : 1
 <1><de0>: Abbrev Number: 10 (DW_TAG_variable)
    <de1>   DW_AT_name        : (indirect string, offset: 0x573): count_wallclock
    <de5>   DW_AT_decl_file   : 18
    <de6>   DW_AT_decl_line   : 518
    <de8>   DW_AT_decl_column : 13
    <de9>   DW_AT_type        : <0x515>
    <ded>   DW_AT_external    : 1
    <dee>   DW_AT_declaration : 1
 <1><def>: Abbrev Number: 29 (DW_TAG_structure_type)
    <df0>   DW_AT_name        : (indirect string, offset: 0x46): path_set_item
    <df4>   DW_AT_byte_size   : 4
    <df5>   DW_AT_decl_file   : 18
    <df6>   DW_AT_decl_line   : 520
    <df8>   DW_AT_decl_column : 8
    <df9>   DW_AT_sibling     : <0xe0e>
 <2><dfd>: Abbrev Number: 22 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xbf): path
    <e02>   DW_AT_decl_file   : 18
    <e03>   DW_AT_decl_line   : 521
    <e05>   DW_AT_decl_column : 14
    <e06>   DW_AT_type        : <0x1c9>
    <e0a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e0d>: Abbrev Number: 0
 <1><e0e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x737): path_set
    <e13>   DW_AT_byte_size   : 12
    <e14>   DW_AT_decl_file   : 18
    <e15>   DW_AT_decl_line   : 525
    <e17>   DW_AT_decl_column : 15
    <e18>   DW_AT_sibling     : <0xe4d>
 <2><e1c>: Abbrev Number: 22 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x6c5): paths_selected
    <e21>   DW_AT_decl_file   : 18
    <e22>   DW_AT_decl_line   : 526
    <e24>   DW_AT_decl_column : 24
    <e25>   DW_AT_type        : <0xe4d>
    <e29>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e2c>: Abbrev Number: 22 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xfe1): num_selected
    <e31>   DW_AT_decl_file   : 18
    <e32>   DW_AT_decl_line   : 527
    <e34>   DW_AT_decl_column : 9
    <e35>   DW_AT_type        : <0x122>
    <e39>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e3c>: Abbrev Number: 22 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0xb05): size
    <e41>   DW_AT_decl_file   : 18
    <e42>   DW_AT_decl_line   : 528
    <e44>   DW_AT_decl_column : 9
    <e45>   DW_AT_type        : <0x122>
    <e49>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e4c>: Abbrev Number: 0
 <1><e4d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4e>   DW_AT_byte_size   : 4
    <e4f>   DW_AT_type        : <0xdef>
 <1><e53>: Abbrev Number: 10 (DW_TAG_variable)
    <e54>   DW_AT_name        : (indirect string, offset: 0x1030): global_path_set
    <e58>   DW_AT_decl_file   : 18
    <e59>   DW_AT_decl_line   : 529
    <e5b>   DW_AT_decl_column : 3
    <e5c>   DW_AT_type        : <0xe0e>
    <e60>   DW_AT_external    : 1
    <e61>   DW_AT_declaration : 1
 <1><e62>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e63>   DW_AT_name        : (indirect string, offset: 0xf20): xflag_opts
    <e67>   DW_AT_encoding    : 7	(unsigned)
    <e68>   DW_AT_byte_size   : 4
    <e69>   DW_AT_type        : <0x2b>
    <e6d>   DW_AT_decl_file   : 18
    <e6e>   DW_AT_decl_line   : 531
    <e70>   DW_AT_decl_column : 6
    <e71>   DW_AT_sibling     : <0xe94>
 <2><e75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e76>   DW_AT_name        : (indirect string, offset: 0x9cf): HEXSTR_NONE
    <e7a>   DW_AT_const_value : 0
 <2><e7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xf67): HEXSTR_NON_ASCII
    <e80>   DW_AT_const_value : 1
 <2><e81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e82>   DW_AT_name        : (indirect string, offset: 0x8d6): HEXSTR_ALL
    <e86>   DW_AT_const_value : 2
 <2><e87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e88>   DW_AT_name        : (indirect string, offset: 0x650): HEXSTR_NON_ASCII_CHARS
    <e8c>   DW_AT_const_value : 3
 <2><e8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xffb): NUM_HEXSTR_OPTS
    <e92>   DW_AT_const_value : 4
 <2><e93>: Abbrev Number: 0
 <1><e94>: Abbrev Number: 10 (DW_TAG_variable)
    <e95>   DW_AT_name        : (indirect string, offset: 0xd8b): xflag
    <e99>   DW_AT_decl_file   : 18
    <e9a>   DW_AT_decl_line   : 544
    <e9c>   DW_AT_decl_column : 17
    <e9d>   DW_AT_type        : <0x2b>
    <ea1>   DW_AT_external    : 1
    <ea2>   DW_AT_declaration : 1
 <1><ea3>: Abbrev Number: 10 (DW_TAG_variable)
    <ea4>   DW_AT_name        : (indirect string, offset: 0xc30): followfork
    <ea8>   DW_AT_decl_file   : 18
    <ea9>   DW_AT_decl_line   : 545
    <eab>   DW_AT_decl_column : 13
    <eac>   DW_AT_type        : <0x515>
    <eb0>   DW_AT_external    : 1
    <eb1>   DW_AT_declaration : 1
 <1><eb2>: Abbrev Number: 10 (DW_TAG_variable)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x31b): output_separately
    <eb7>   DW_AT_decl_file   : 18
    <eb8>   DW_AT_decl_line   : 546
    <eba>   DW_AT_decl_column : 13
    <ebb>   DW_AT_type        : <0x515>
    <ebf>   DW_AT_external    : 1
    <ec0>   DW_AT_declaration : 1
 <1><ec1>: Abbrev Number: 10 (DW_TAG_variable)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x22b): stack_trace_enabled
    <ec6>   DW_AT_decl_file   : 18
    <ec7>   DW_AT_decl_line   : 549
    <ec9>   DW_AT_decl_column : 13
    <eca>   DW_AT_type        : <0x515>
    <ece>   DW_AT_external    : 1
    <ecf>   DW_AT_declaration : 1
 <1><ed0>: Abbrev Number: 10 (DW_TAG_variable)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x638): ptrace_setoptions
    <ed5>   DW_AT_decl_file   : 18
    <ed6>   DW_AT_decl_line   : 553
    <ed8>   DW_AT_decl_column : 17
    <ed9>   DW_AT_type        : <0x2b>
    <edd>   DW_AT_external    : 1
    <ede>   DW_AT_declaration : 1
 <1><edf>: Abbrev Number: 10 (DW_TAG_variable)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x9c4): max_strlen
    <ee4>   DW_AT_decl_file   : 18
    <ee5>   DW_AT_decl_line   : 554
    <ee7>   DW_AT_decl_column : 17
    <ee8>   DW_AT_type        : <0x2b>
    <eec>   DW_AT_external    : 1
    <eed>   DW_AT_declaration : 1
 <1><eee>: Abbrev Number: 10 (DW_TAG_variable)
    <eef>   DW_AT_name        : (indirect string, offset: 0x9f2): os_release
    <ef3>   DW_AT_decl_file   : 18
    <ef4>   DW_AT_decl_line   : 555
    <ef6>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0x2b>
    <efb>   DW_AT_external    : 1
    <efc>   DW_AT_declaration : 1
 <1><efd>: Abbrev Number: 10 (DW_TAG_variable)
    <efe>   DW_AT_name        : (indirect string, offset: 0x6d4): xlat_verbosity
    <f02>   DW_AT_decl_file   : 18
    <f03>   DW_AT_decl_line   : 917
    <f05>   DW_AT_decl_column : 24
    <f06>   DW_AT_type        : <0xa3b>
    <f0a>   DW_AT_external    : 1
    <f0b>   DW_AT_declaration : 1
 <1><f0c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x556): xlat_style_private_flag_bits
    <f11>   DW_AT_encoding    : 7	(unsigned)
    <f12>   DW_AT_byte_size   : 4
    <f13>   DW_AT_type        : <0x2b>
    <f17>   DW_AT_decl_file   : 18
    <f18>   DW_AT_decl_line   : 937
    <f1a>   DW_AT_decl_column : 6
    <f1b>   DW_AT_sibling     : <0xf38>
 <2><f1f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f20>   DW_AT_name        : (indirect string, offset: 0x29a): PAF_PRINT_INDICES_BIT
    <f24>   DW_AT_const_value : 5
 <2><f25>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f26>   DW_AT_name        : (indirect string, offset: 0xab2): PAF_ARRAY_TRUNCATED_BIT
    <f2a>   DW_AT_const_value : 6
 <2><f2b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x3d3): PXF_DEFAULT_STR_BIT
    <f30>   DW_AT_const_value : 7
 <2><f31>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f32>   DW_AT_name        : (indirect string, offset: 0xc12): SPFF_AUXSTR_MODE_BIT
    <f36>   DW_AT_const_value : 8
 <2><f37>: Abbrev Number: 0
 <1><f38>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f39>   DW_AT_name        : (indirect string, offset: 0xcc1): find_xlat_flag_bits
    <f3d>   DW_AT_encoding    : 7	(unsigned)
    <f3e>   DW_AT_byte_size   : 4
    <f3f>   DW_AT_type        : <0x2b>
    <f43>   DW_AT_decl_file   : 18
    <f44>   DW_AT_decl_line   : 1441
    <f46>   DW_AT_decl_column : 6
    <f47>   DW_AT_sibling     : <0xf52>
 <2><f4b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x913): FXL_CASE_SENSITIVE_BIT
    <f50>   DW_AT_const_value : 0
 <2><f51>: Abbrev Number: 0
 <1><f52>: Abbrev Number: 10 (DW_TAG_variable)
    <f53>   DW_AT_name        : (indirect string, offset: 0x9a0): printing_tcp
    <f57>   DW_AT_decl_file   : 18
    <f58>   DW_AT_decl_line   : 1687
    <f5a>   DW_AT_decl_column : 20
    <f5b>   DW_AT_type        : <0x5f1>
    <f5f>   DW_AT_external    : 1
    <f60>   DW_AT_declaration : 1
 <1><f61>: Abbrev Number: 10 (DW_TAG_variable)
    <f62>   DW_AT_name        : (indirect string, offset: 0x51e): errnoent
    <f66>   DW_AT_decl_file   : 18
    <f67>   DW_AT_decl_line   : 1885
    <f69>   DW_AT_decl_column : 26
    <f6a>   DW_AT_type        : <0x449>
    <f6e>   DW_AT_external    : 1
    <f6f>   DW_AT_declaration : 1
 <1><f70>: Abbrev Number: 10 (DW_TAG_variable)
    <f71>   DW_AT_name        : (indirect string, offset: 0x820): signalent
    <f75>   DW_AT_decl_file   : 18
    <f76>   DW_AT_decl_line   : 1886
    <f78>   DW_AT_decl_column : 26
    <f79>   DW_AT_type        : <0x449>
    <f7d>   DW_AT_external    : 1
    <f7e>   DW_AT_declaration : 1
 <1><f7f>: Abbrev Number: 10 (DW_TAG_variable)
    <f80>   DW_AT_name        : (indirect string, offset: 0xdf9): nerrnos
    <f84>   DW_AT_decl_file   : 18
    <f85>   DW_AT_decl_line   : 1887
    <f87>   DW_AT_decl_column : 27
    <f88>   DW_AT_type        : <0x32>
    <f8c>   DW_AT_external    : 1
    <f8d>   DW_AT_declaration : 1
 <1><f8e>: Abbrev Number: 10 (DW_TAG_variable)
    <f8f>   DW_AT_name        : (indirect string, offset: 0xfca): nsignals
    <f93>   DW_AT_decl_file   : 18
    <f94>   DW_AT_decl_line   : 1888
    <f96>   DW_AT_decl_column : 27
    <f97>   DW_AT_type        : <0x32>
    <f9b>   DW_AT_external    : 1
    <f9c>   DW_AT_declaration : 1
 <1><f9d>: Abbrev Number: 15 (DW_TAG_array_type)
    <f9e>   DW_AT_type        : <0x85a>
    <fa2>   DW_AT_sibling     : <0xfa8>
 <2><fa6>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fa7>: Abbrev Number: 0
 <1><fa8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fa9>   DW_AT_type        : <0xf9d>
 <1><fad>: Abbrev Number: 10 (DW_TAG_variable)
    <fae>   DW_AT_name        : (indirect string, offset: 0xc8c): sysent0
    <fb2>   DW_AT_decl_file   : 18
    <fb3>   DW_AT_decl_line   : 1890
    <fb5>   DW_AT_decl_column : 28
    <fb6>   DW_AT_type        : <0xfa8>
    <fba>   DW_AT_external    : 1
    <fbb>   DW_AT_declaration : 1
 <1><fbc>: Abbrev Number: 15 (DW_TAG_array_type)
    <fbd>   DW_AT_type        : <0x8c1>
    <fc1>   DW_AT_sibling     : <0xfc7>
 <2><fc5>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc6>: Abbrev Number: 0
 <1><fc7>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc8>   DW_AT_type        : <0xfbc>
 <1><fcc>: Abbrev Number: 10 (DW_TAG_variable)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x1026): ioctlent0
    <fd1>   DW_AT_decl_file   : 18
    <fd2>   DW_AT_decl_line   : 1891
    <fd4>   DW_AT_decl_column : 30
    <fd5>   DW_AT_type        : <0xfc7>
    <fd9>   DW_AT_external    : 1
    <fda>   DW_AT_declaration : 1
 <1><fdb>: Abbrev Number: 10 (DW_TAG_variable)
    <fdc>   DW_AT_name        : (indirect string, offset: 0xf2b): personality_names
    <fe0>   DW_AT_decl_file   : 18
    <fe1>   DW_AT_decl_line   : 1893
    <fe3>   DW_AT_decl_column : 26
    <fe4>   DW_AT_type        : <0x449>
    <fe8>   DW_AT_external    : 1
    <fe9>   DW_AT_declaration : 1
 <1><fea>: Abbrev Number: 10 (DW_TAG_variable)
    <feb>   DW_AT_name        : (indirect string, offset: 0x840): sysent
    <fef>   DW_AT_decl_file   : 18
    <ff0>   DW_AT_decl_line   : 1896
    <ff2>   DW_AT_decl_column : 29
    <ff3>   DW_AT_type        : <0x9a6>
    <ff7>   DW_AT_external    : 1
    <ff8>   DW_AT_declaration : 1
 <1><ff9>: Abbrev Number: 10 (DW_TAG_variable)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xc27): ioctlent
    <ffe>   DW_AT_decl_file   : 18
    <fff>   DW_AT_decl_line   : 1897
    <1001>   DW_AT_decl_column : 31
    <1002>   DW_AT_type        : <0x1008>
    <1006>   DW_AT_external    : 1
    <1007>   DW_AT_declaration : 1
 <1><1008>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1009>   DW_AT_byte_size   : 4
    <100a>   DW_AT_type        : <0x8c1>
 <1><100e>: Abbrev Number: 10 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0x82a): nsyscalls
    <1013>   DW_AT_decl_file   : 18
    <1014>   DW_AT_decl_line   : 1903
    <1016>   DW_AT_decl_column : 17
    <1017>   DW_AT_type        : <0x2b>
    <101b>   DW_AT_external    : 1
    <101c>   DW_AT_declaration : 1
 <1><101d>: Abbrev Number: 10 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0xe13): nioctlents
    <1022>   DW_AT_decl_file   : 18
    <1023>   DW_AT_decl_line   : 1904
    <1025>   DW_AT_decl_column : 17
    <1026>   DW_AT_type        : <0x2b>
    <102a>   DW_AT_external    : 1
    <102b>   DW_AT_declaration : 1
 <1><102c>: Abbrev Number: 15 (DW_TAG_array_type)
    <102d>   DW_AT_type        : <0x32>
    <1031>   DW_AT_sibling     : <0x103c>
 <2><1035>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1036>   DW_AT_type        : <0x2b>
    <103a>   DW_AT_upper_bound : 2
 <2><103b>: Abbrev Number: 0
 <1><103c>: Abbrev Number: 3 (DW_TAG_const_type)
    <103d>   DW_AT_type        : <0x102c>
 <1><1041>: Abbrev Number: 10 (DW_TAG_variable)
    <1042>   DW_AT_name        : (indirect string, offset: 0xe88): nsyscall_vec
    <1046>   DW_AT_decl_file   : 18
    <1047>   DW_AT_decl_line   : 1906
    <1049>   DW_AT_decl_column : 27
    <104a>   DW_AT_type        : <0x103c>
    <104e>   DW_AT_external    : 1
    <104f>   DW_AT_declaration : 1
 <1><1050>: Abbrev Number: 15 (DW_TAG_array_type)
    <1051>   DW_AT_type        : <0x9ac>
    <1055>   DW_AT_sibling     : <0x1060>
 <2><1059>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <105a>   DW_AT_type        : <0x2b>
    <105e>   DW_AT_upper_bound : 2
 <2><105f>: Abbrev Number: 0
 <1><1060>: Abbrev Number: 3 (DW_TAG_const_type)
    <1061>   DW_AT_type        : <0x1050>
 <1><1065>: Abbrev Number: 10 (DW_TAG_variable)
    <1066>   DW_AT_name        : (indirect string, offset: 0x76f): sysent_vec
    <106a>   DW_AT_decl_file   : 18
    <106b>   DW_AT_decl_line   : 1907
    <106d>   DW_AT_decl_column : 35
    <106e>   DW_AT_type        : <0x1060>
    <1072>   DW_AT_external    : 1
    <1073>   DW_AT_declaration : 1
 <1><1074>: Abbrev Number: 10 (DW_TAG_variable)
    <1075>   DW_AT_name        : (indirect string, offset: 0x374): inject_vec
    <1079>   DW_AT_decl_file   : 18
    <107a>   DW_AT_decl_line   : 1908
    <107c>   DW_AT_decl_column : 28
    <107d>   DW_AT_type        : <0x9b1>
    <1081>   DW_AT_external    : 1
    <1082>   DW_AT_declaration : 1
 <1><1083>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1084>   DW_AT_name        : (indirect string, offset: 0xd15): audit_arch_t
    <1088>   DW_AT_byte_size   : 8
    <1089>   DW_AT_decl_file   : 18
    <108a>   DW_AT_decl_line   : 1910
    <108c>   DW_AT_decl_column : 8
    <108d>   DW_AT_sibling     : <0x10b2>
 <2><1091>: Abbrev Number: 22 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0x548): arch
    <1096>   DW_AT_decl_file   : 18
    <1097>   DW_AT_decl_line   : 1911
    <1099>   DW_AT_decl_column : 15
    <109a>   DW_AT_type        : <0x2b>
    <109e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10a1>: Abbrev Number: 22 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x986): flag
    <10a6>   DW_AT_decl_file   : 18
    <10a7>   DW_AT_decl_line   : 1912
    <10a9>   DW_AT_decl_column : 15
    <10aa>   DW_AT_type        : <0x2b>
    <10ae>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10b1>: Abbrev Number: 0
 <1><10b2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b3>   DW_AT_type        : <0x1083>
 <1><10b7>: Abbrev Number: 15 (DW_TAG_array_type)
    <10b8>   DW_AT_type        : <0x10b2>
    <10bc>   DW_AT_sibling     : <0x10c7>
 <2><10c0>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10c1>   DW_AT_type        : <0x2b>
    <10c5>   DW_AT_upper_bound : 2
 <2><10c6>: Abbrev Number: 0
 <1><10c7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c8>   DW_AT_type        : <0x10b7>
 <1><10cc>: Abbrev Number: 10 (DW_TAG_variable)
    <10cd>   DW_AT_name        : (indirect string, offset: 0x904): audit_arch_vec
    <10d1>   DW_AT_decl_file   : 18
    <10d2>   DW_AT_decl_line   : 1915
    <10d4>   DW_AT_decl_column : 34
    <10d5>   DW_AT_type        : <0x10c7>
    <10d9>   DW_AT_external    : 1
    <10da>   DW_AT_declaration : 1
 <1><10db>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10dc>   DW_AT_byte_size   : 180
    <10dd>   DW_AT_decl_file   : 20
    <10de>   DW_AT_decl_line   : 2
    <10df>   DW_AT_decl_column : 9
    <10e0>   DW_AT_sibling     : <0x1395>
 <2><10e4>: Abbrev Number: 9 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x1dc): block_ioctl
    <10e9>   DW_AT_decl_file   : 20
    <10ea>   DW_AT_decl_line   : 3
    <10eb>   DW_AT_decl_column : 8
    <10ec>   DW_AT_type        : <0x13af>
    <10f0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10f3>: Abbrev Number: 9 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0xa51): btrfs_ioctl
    <10f8>   DW_AT_decl_file   : 20
    <10f9>   DW_AT_decl_line   : 6
    <10fa>   DW_AT_decl_column : 8
    <10fb>   DW_AT_type        : <0x13af>
    <10ff>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1102>: Abbrev Number: 9 (DW_TAG_member)
    <1103>   DW_AT_name        : (indirect string, offset: 0x70d): evdev_write_ioctl_mpers
    <1107>   DW_AT_decl_file   : 20
    <1108>   DW_AT_decl_line   : 9
    <1109>   DW_AT_decl_column : 8
    <110a>   DW_AT_type        : <0x13af>
    <110e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1111>: Abbrev Number: 9 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0x6e3): get_sock_fprog_size
    <1116>   DW_AT_decl_file   : 20
    <1117>   DW_AT_decl_line   : 12
    <1118>   DW_AT_decl_column : 17
    <1119>   DW_AT_type        : <0x13bb>
    <111d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1120>: Abbrev Number: 9 (DW_TAG_member)
    <1121>   DW_AT_name        : (indirect string, offset: 0x1ab): fetch_bpf_fprog
    <1125>   DW_AT_decl_file   : 20
    <1126>   DW_AT_decl_line   : 15
    <1127>   DW_AT_decl_column : 10
    <1128>   DW_AT_type        : <0x13db>
    <112c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><112f>: Abbrev Number: 9 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0x8f1): fetch_struct_flock
    <1134>   DW_AT_decl_file   : 20
    <1135>   DW_AT_decl_line   : 18
    <1136>   DW_AT_decl_column : 10
    <1137>   DW_AT_type        : <0x13db>
    <113b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><113e>: Abbrev Number: 9 (DW_TAG_member)
    <113f>   DW_AT_name        : (indirect string, offset: 0xc3b): fetch_struct_flock64
    <1143>   DW_AT_decl_file   : 20
    <1144>   DW_AT_decl_line   : 21
    <1145>   DW_AT_decl_column : 10
    <1146>   DW_AT_type        : <0x13db>
