Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x168b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x59e): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8b0): mpers-m32/struct_flock64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe4d): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x398): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfd2): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x963): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x33b): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x24a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdb0): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x467): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x84e): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe9e): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x87e): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x759): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb39): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb6f): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2b0): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcc3): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc30): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3e4): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x430): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x347): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb5a): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf55): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xdc0): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xad3): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x109f): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xde6): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xa95): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0xf90): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x267): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x390): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0xfb6): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x72c): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc1f): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xb1f): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x34f): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x9e7): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4b6): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xefc): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x795): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x100b): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x8db): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x94c): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xd5b): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1b5): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xc8a): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x54a): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x1f8): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xf7b): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x781): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x7fa): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x226): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe0c): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xc9a): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x6b4): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xa27): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xf9a): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3b4): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xbf5): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x9a1): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xa0b): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x7af): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xab5): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x45c): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x2f9): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x363): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x515): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0xfe5): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xda9): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x232): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x524): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x254): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xe1b): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x68d): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xb9a): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1a2): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xe85): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x358): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x99a): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x1055): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4a1): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xf29): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x9b5): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x3f6): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0xa6b): __kernel_long_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 15
    <528>   DW_AT_decl_column : 15
    <529>   DW_AT_type        : <0xae>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0x504): __kernel_ulong_t
    <532>   DW_AT_decl_file   : 14
    <533>   DW_AT_decl_line   : 16
    <534>   DW_AT_decl_column : 23
    <535>   DW_AT_type        : <0x37>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x23b): __kernel_pid_t
    <53e>   DW_AT_decl_file   : 14
    <53f>   DW_AT_decl_line   : 28
    <540>   DW_AT_decl_column : 14
    <541>   DW_AT_type        : <0x64>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x71c): __kernel_loff_t
    <54a>   DW_AT_decl_file   : 14
    <54b>   DW_AT_decl_line   : 88
    <54c>   DW_AT_decl_column : 19
    <54d>   DW_AT_type        : <0x88>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x3c2): kernel_long_t
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 25
    <559>   DW_AT_type        : <0x521>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x86f): kernel_ulong_t
    <562>   DW_AT_decl_file   : 15
    <563>   DW_AT_decl_line   : 17
    <564>   DW_AT_decl_column : 26
    <565>   DW_AT_type        : <0x52d>
 <1><569>: Abbrev Number: 3 (DW_TAG_const_type)
    <56a>   DW_AT_type        : <0x55d>
 <1><56e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56f>   DW_AT_name        : (indirect string, offset: 0xbb8): list_item
    <573>   DW_AT_byte_size   : 8
    <574>   DW_AT_decl_file   : 16
    <575>   DW_AT_decl_line   : 92
    <576>   DW_AT_decl_column : 8
    <577>   DW_AT_sibling     : <0x59a>
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x109a): prev
    <580>   DW_AT_decl_file   : 16
    <581>   DW_AT_decl_line   : 93
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x59a>
    <587>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58a>: Abbrev Number: 9 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x1090): next
    <58f>   DW_AT_decl_file   : 16
    <590>   DW_AT_decl_line   : 94
    <591>   DW_AT_decl_column : 20
    <592>   DW_AT_type        : <0x59a>
    <596>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59b>   DW_AT_byte_size   : 4
    <59c>   DW_AT_type        : <0x56e>
 <1><5a0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x847): sysent
    <5a5>   DW_AT_byte_size   : 20
    <5a6>   DW_AT_decl_file   : 17
    <5a7>   DW_AT_decl_line   : 13
    <5a8>   DW_AT_decl_column : 16
    <5a9>   DW_AT_sibling     : <0x5f9>
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xffc): nargs
    <5b2>   DW_AT_decl_file   : 17
    <5b3>   DW_AT_decl_line   : 14
    <5b4>   DW_AT_decl_column : 11
    <5b5>   DW_AT_type        : <0x2b>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x959): sys_flags
    <5c1>   DW_AT_decl_file   : 17
    <5c2>   DW_AT_decl_line   : 15
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x64>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cb>: Abbrev Number: 18 (DW_TAG_member)
    <5cc>   DW_AT_name        : sen
    <5d0>   DW_AT_decl_file   : 17
    <5d1>   DW_AT_decl_line   : 16
    <5d2>   DW_AT_decl_column : 6
    <5d3>   DW_AT_type        : <0x64>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x2f0): sys_func
    <5df>   DW_AT_decl_file   : 17
    <5e0>   DW_AT_decl_line   : 17
    <5e1>   DW_AT_decl_column : 8
    <5e2>   DW_AT_type        : <0x860>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e9>: Abbrev Number: 9 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x25e): sys_name
    <5ee>   DW_AT_decl_file   : 17
    <5ef>   DW_AT_decl_line   : 18
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x1c9>
    <5f5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f8>: Abbrev Number: 0
 <1><5f9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fa>   DW_AT_prototyped  : 1
    <5fb>   DW_AT_type        : <0x64>
    <5ff>   DW_AT_sibling     : <0x609>
 <2><603>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x609>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 4
    <60b>   DW_AT_type        : <0x614>
 <1><60f>: Abbrev Number: 3 (DW_TAG_const_type)
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 21 (DW_TAG_structure_type)
    <615>   DW_AT_name        : tcb
    <619>   DW_AT_byte_size   : 204
    <61a>   DW_AT_decl_file   : 18
    <61b>   DW_AT_decl_line   : 262
    <61d>   DW_AT_decl_column : 8
    <61e>   DW_AT_sibling     : <0x860>
 <2><622>: Abbrev Number: 22 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x4b0): flags
    <627>   DW_AT_decl_file   : 18
    <628>   DW_AT_decl_line   : 263
    <62a>   DW_AT_decl_column : 6
    <62b>   DW_AT_type        : <0x64>
    <62f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><632>: Abbrev Number: 23 (DW_TAG_member)
    <633>   DW_AT_name        : pid
    <637>   DW_AT_decl_file   : 18
    <638>   DW_AT_decl_line   : 264
    <63a>   DW_AT_decl_column : 6
    <63b>   DW_AT_type        : <0x64>
    <63f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><642>: Abbrev Number: 22 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <647>   DW_AT_decl_file   : 18
    <648>   DW_AT_decl_line   : 265
    <64a>   DW_AT_decl_column : 6
    <64b>   DW_AT_type        : <0x64>
    <64f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><652>: Abbrev Number: 22 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x37c): currpers
    <657>   DW_AT_decl_file   : 18
    <658>   DW_AT_decl_line   : 267
    <65a>   DW_AT_decl_column : 15
    <65b>   DW_AT_type        : <0x2b>
    <65f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><662>: Abbrev Number: 22 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0xb17): u_error
    <667>   DW_AT_decl_file   : 18
    <668>   DW_AT_decl_line   : 269
    <66a>   DW_AT_decl_column : 16
    <66b>   DW_AT_type        : <0x37>
    <66f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><672>: Abbrev Number: 22 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <677>   DW_AT_decl_file   : 18
    <678>   DW_AT_decl_line   : 270
    <67a>   DW_AT_decl_column : 17
    <67b>   DW_AT_type        : <0x55d>
    <67f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><682>: Abbrev Number: 22 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0xb50): true_scno
    <687>   DW_AT_decl_file   : 18
    <688>   DW_AT_decl_line   : 271
    <68a>   DW_AT_decl_column : 17
    <68b>   DW_AT_type        : <0x55d>
    <68f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><692>: Abbrev Number: 22 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x18c): u_arg
    <697>   DW_AT_decl_file   : 18
    <698>   DW_AT_decl_line   : 272
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x990>
    <69f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a2>: Abbrev Number: 22 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x970): u_rval
    <6a7>   DW_AT_decl_file   : 18
    <6a8>   DW_AT_decl_line   : 273
    <6aa>   DW_AT_decl_column : 16
    <6ab>   DW_AT_type        : <0x551>
    <6af>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b2>: Abbrev Number: 22 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0xa87): sys_func_rval
    <6b7>   DW_AT_decl_file   : 18
    <6b8>   DW_AT_decl_line   : 274
    <6ba>   DW_AT_decl_column : 6
    <6bb>   DW_AT_type        : <0x64>
    <6bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c2>: Abbrev Number: 22 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0xcb4): curcol
    <6c7>   DW_AT_decl_file   : 18
    <6c8>   DW_AT_decl_line   : 275
    <6ca>   DW_AT_decl_column : 6
    <6cb>   DW_AT_type        : <0x64>
    <6cf>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d2>: Abbrev Number: 22 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0x982): outf
    <6d7>   DW_AT_decl_file   : 18
    <6d8>   DW_AT_decl_line   : 276
    <6da>   DW_AT_decl_column : 8
    <6db>   DW_AT_type        : <0x40e>
    <6df>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e2>: Abbrev Number: 22 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0xec4): staged_output_data
    <6e7>   DW_AT_decl_file   : 18
    <6e8>   DW_AT_decl_line   : 277
    <6ea>   DW_AT_decl_column : 29
    <6eb>   DW_AT_type        : <0x9a6>
    <6ef>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f2>: Abbrev Number: 22 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xa52): auxstr
    <6f7>   DW_AT_decl_file   : 18
    <6f8>   DW_AT_decl_line   : 279
    <6fa>   DW_AT_decl_column : 14
    <6fb>   DW_AT_type        : <0x1c9>
    <6ff>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><702>: Abbrev Number: 22 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <707>   DW_AT_decl_file   : 18
    <708>   DW_AT_decl_line   : 280
    <70a>   DW_AT_decl_column : 8
    <70b>   DW_AT_type        : <0xcd>
    <70f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><712>: Abbrev Number: 22 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xbe5): _free_priv_data
    <717>   DW_AT_decl_file   : 18
    <718>   DW_AT_decl_line   : 281
    <71a>   DW_AT_decl_column : 9
    <71b>   DW_AT_type        : <0x9b8>
    <71f>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><722>: Abbrev Number: 22 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x17c): s_ent
    <727>   DW_AT_decl_file   : 18
    <728>   DW_AT_decl_line   : 282
    <72a>   DW_AT_decl_column : 23
    <72b>   DW_AT_type        : <0x9be>
    <72f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><732>: Abbrev Number: 22 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <737>   DW_AT_decl_file   : 18
    <738>   DW_AT_decl_line   : 285
    <73a>   DW_AT_decl_column : 23
    <73b>   DW_AT_type        : <0x9be>
    <73f>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x371): inject_vec
    <747>   DW_AT_decl_file   : 18
    <748>   DW_AT_decl_line   : 286
    <74a>   DW_AT_decl_column : 22
    <74b>   DW_AT_type        : <0x9c9>
    <74f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x7b8): stime
    <757>   DW_AT_decl_file   : 18
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x133>
    <75f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><762>: Abbrev Number: 22 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x385): ltime
    <767>   DW_AT_decl_file   : 18
    <768>   DW_AT_decl_line   : 288
    <76a>   DW_AT_decl_column : 18
    <76b>   DW_AT_type        : <0x133>
    <76f>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xfbd): atime
    <777>   DW_AT_decl_file   : 18
    <778>   DW_AT_decl_line   : 289
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x133>
    <77f>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><782>: Abbrev Number: 22 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4aa): etime
    <787>   DW_AT_decl_file   : 18
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x133>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><793>: Abbrev Number: 22 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd18): delay_expiration_time
    <798>   DW_AT_decl_file   : 18
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x133>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a4>: Abbrev Number: 22 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a9>   DW_AT_decl_file   : 18
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b5>: Abbrev Number: 22 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xf0f): last_dirfd
    <7ba>   DW_AT_decl_file   : 18
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c6>: Abbrev Number: 22 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf35): mmap_cache
    <7cb>   DW_AT_decl_file   : 18
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9e5>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d7>: Abbrev Number: 22 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb26): wait_data_idx
    <7dc>   DW_AT_decl_file   : 18
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x122>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e8>: Abbrev Number: 22 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa59): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 18
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0x9f1>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7f9>: Abbrev Number: 22 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xac9): wait_list
    <7fe>   DW_AT_decl_file   : 18
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x56e>
    <806>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80a>: Abbrev Number: 22 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6a5): vcpu_info_list
    <80f>   DW_AT_decl_file   : 18
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0x9fd>
    <817>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81b>: Abbrev Number: 22 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xc7f): unwind_ctx
    <820>   DW_AT_decl_file   : 18
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xcd>
    <828>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82c>: Abbrev Number: 22 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x494): unwind_queue
    <831>   DW_AT_decl_file   : 18
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0xa09>
    <839>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83d>: Abbrev Number: 22 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <842>   DW_AT_decl_file   : 18
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0xa0f>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84e>: Abbrev Number: 22 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x208): start_prc
    <853>   DW_AT_decl_file   : 18
    <854>   DW_AT_decl_line   : 329
    <856>   DW_AT_decl_column : 16
    <857>   DW_AT_type        : <0x37>
    <85b>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><85f>: Abbrev Number: 0
 <1><860>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <861>   DW_AT_byte_size   : 4
    <862>   DW_AT_type        : <0x5f9>
 <1><866>: Abbrev Number: 4 (DW_TAG_typedef)
    <867>   DW_AT_name        : (indirect string, offset: 0x4f6): struct_sysent
    <86b>   DW_AT_decl_file   : 17
    <86c>   DW_AT_decl_line   : 19
    <86d>   DW_AT_decl_column : 3
    <86e>   DW_AT_type        : <0x5a0>
 <1><872>: Abbrev Number: 3 (DW_TAG_const_type)
    <873>   DW_AT_type        : <0x866>
 <1><877>: Abbrev Number: 11 (DW_TAG_variable)
    <878>   DW_AT_name        : (indirect string, offset: 0xd04): current_personality
    <87c>   DW_AT_decl_file   : 18
    <87d>   DW_AT_decl_line   : 158
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x2b>
    <883>   DW_AT_external    : 1
    <884>   DW_AT_declaration : 1
 <1><885>: Abbrev Number: 11 (DW_TAG_variable)
    <886>   DW_AT_name        : (indirect string, offset: 0x7e9): current_wordsize
    <88a>   DW_AT_decl_file   : 18
    <88b>   DW_AT_decl_line   : 171
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x2b>
    <891>   DW_AT_external    : 1
    <892>   DW_AT_declaration : 1
 <1><893>: Abbrev Number: 11 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0xa30): current_klongsize
    <898>   DW_AT_decl_file   : 18
    <899>   DW_AT_decl_line   : 176
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x2b>
    <89f>   DW_AT_external    : 1
    <8a0>   DW_AT_declaration : 1
 <1><8a1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xc56): ioctlent
    <8a6>   DW_AT_byte_size   : 8
    <8a7>   DW_AT_decl_file   : 18
    <8a8>   DW_AT_decl_line   : 217
    <8a9>   DW_AT_decl_column : 16
    <8aa>   DW_AT_sibling     : <0x8cd>
 <2><8ae>: Abbrev Number: 9 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0xef5): symbol
    <8b3>   DW_AT_decl_file   : 18
    <8b4>   DW_AT_decl_line   : 218
    <8b5>   DW_AT_decl_column : 14
    <8b6>   DW_AT_type        : <0x1c9>
    <8ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8bd>: Abbrev Number: 9 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0xccd): code
    <8c2>   DW_AT_decl_file   : 18
    <8c3>   DW_AT_decl_line   : 219
    <8c4>   DW_AT_decl_column : 15
    <8c5>   DW_AT_type        : <0x2b>
    <8c9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8cc>: Abbrev Number: 0
 <1><8cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ce>   DW_AT_name        : (indirect string, offset: 0xc0f): struct_ioctlent
    <8d2>   DW_AT_decl_file   : 18
    <8d3>   DW_AT_decl_line   : 220
    <8d4>   DW_AT_decl_column : 3
    <8d5>   DW_AT_type        : <0x8a1>
 <1><8d9>: Abbrev Number: 3 (DW_TAG_const_type)
    <8da>   DW_AT_type        : <0x8cd>
 <1><8de>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8df>   DW_AT_name        : (indirect string, offset: 0x7dd): inject_data
    <8e3>   DW_AT_byte_size   : 10
    <8e4>   DW_AT_decl_file   : 18
    <8e5>   DW_AT_decl_line   : 241
    <8e6>   DW_AT_decl_column : 8
    <8e7>   DW_AT_sibling     : <0x946>
 <2><8eb>: Abbrev Number: 9 (DW_TAG_member)
    <8ec>   DW_AT_name        : (indirect string, offset: 0x4b0): flags
    <8f0>   DW_AT_decl_file   : 18
    <8f1>   DW_AT_decl_line   : 242
    <8f2>   DW_AT_decl_column : 10
    <8f3>   DW_AT_type        : <0xf2>
    <8f7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8fa>: Abbrev Number: 9 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x90d): signo
    <8ff>   DW_AT_decl_file   : 18
    <900>   DW_AT_decl_line   : 243
    <901>   DW_AT_decl_column : 10
    <902>   DW_AT_type        : <0xf2>
    <906>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><909>: Abbrev Number: 9 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <90e>   DW_AT_decl_file   : 18
    <90f>   DW_AT_decl_line   : 244
    <910>   DW_AT_decl_column : 11
    <911>   DW_AT_type        : <0xfe>
    <915>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><918>: Abbrev Number: 9 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0xcaa): delay_idx
    <91d>   DW_AT_decl_file   : 18
    <91e>   DW_AT_decl_line   : 245
    <91f>   DW_AT_decl_column : 11
    <920>   DW_AT_type        : <0xfe>
    <924>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><927>: Abbrev Number: 9 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x53c): poke_idx
    <92c>   DW_AT_decl_file   : 18
    <92d>   DW_AT_decl_line   : 246
    <92e>   DW_AT_decl_column : 11
    <92f>   DW_AT_type        : <0xfe>
    <933>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><936>: Abbrev Number: 9 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <93b>   DW_AT_decl_file   : 18
    <93c>   DW_AT_decl_line   : 247
    <93d>   DW_AT_decl_column : 11
    <93e>   DW_AT_type        : <0xfe>
    <942>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><945>: Abbrev Number: 0
 <1><946>: Abbrev Number: 8 (DW_TAG_structure_type)
    <947>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <94b>   DW_AT_byte_size   : 16
    <94c>   DW_AT_decl_file   : 18
    <94d>   DW_AT_decl_line   : 250
    <94e>   DW_AT_decl_column : 8
    <94f>   DW_AT_sibling     : <0x990>
 <2><953>: Abbrev Number: 9 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0xa05): first
    <958>   DW_AT_decl_file   : 18
    <959>   DW_AT_decl_line   : 251
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0xfe>
    <95f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><962>: Abbrev Number: 9 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0x10c3): last
    <967>   DW_AT_decl_file   : 18
    <968>   DW_AT_decl_line   : 252
    <969>   DW_AT_decl_column : 11
    <96a>   DW_AT_type        : <0xfe>
    <96e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><971>: Abbrev Number: 9 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x38b): step
    <976>   DW_AT_decl_file   : 18
    <977>   DW_AT_decl_line   : 253
    <978>   DW_AT_decl_column : 11
    <979>   DW_AT_type        : <0xfe>
    <97d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><980>: Abbrev Number: 9 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x1095): data
    <985>   DW_AT_decl_file   : 18
    <986>   DW_AT_decl_line   : 254
    <987>   DW_AT_decl_column : 21
    <988>   DW_AT_type        : <0x8de>
    <98c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><98f>: Abbrev Number: 0
 <1><990>: Abbrev Number: 15 (DW_TAG_array_type)
    <991>   DW_AT_type        : <0x55d>
    <995>   DW_AT_sibling     : <0x9a0>
 <2><999>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <99a>   DW_AT_type        : <0x2b>
    <99e>   DW_AT_upper_bound : 5
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9a1>   DW_AT_name        : (indirect string, offset: 0xec4): staged_output_data
    <9a5>   DW_AT_declaration : 1
 <1><9a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x9a0>
 <1><9ac>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9ad>   DW_AT_prototyped  : 1
    <9ae>   DW_AT_sibling     : <0x9b8>
 <2><9b2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9b3>   DW_AT_type        : <0xcd>
 <2><9b7>: Abbrev Number: 0
 <1><9b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x9ac>
 <1><9be>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bf>   DW_AT_byte_size   : 4
    <9c0>   DW_AT_type        : <0x872>
 <1><9c4>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c5>   DW_AT_type        : <0x9be>
 <1><9c9>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ca>   DW_AT_type        : <0x9d9>
    <9ce>   DW_AT_sibling     : <0x9d9>
 <2><9d2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9d3>   DW_AT_type        : <0x2b>
    <9d7>   DW_AT_upper_bound : 2
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9da>   DW_AT_byte_size   : 4
    <9db>   DW_AT_type        : <0x946>
 <1><9df>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9e4>   DW_AT_declaration : 1
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x9df>
 <1><9eb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x3a6): tcb_wait_data
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0xea8): unwind_queue_t
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 15 (DW_TAG_array_type)
    <a10>   DW_AT_type        : <0xe6>
    <a14>   DW_AT_sibling     : <0xa1f>
 <2><a18>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a19>   DW_AT_type        : <0x2b>
    <a1d>   DW_AT_upper_bound : 15
 <2><a1e>: Abbrev Number: 0
 <1><a1f>: Abbrev Number: 10 (DW_TAG_variable)
    <a20>   DW_AT_name        : (indirect string, offset: 0xb63): stub_sysent
    <a24>   DW_AT_decl_file   : 18
    <a25>   DW_AT_decl_line   : 403
    <a27>   DW_AT_decl_column : 28
    <a28>   DW_AT_type        : <0x872>
    <a2c>   DW_AT_external    : 1
    <a2d>   DW_AT_declaration : 1
 <1><a2e>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x1078): xlat_type
    <a33>   DW_AT_encoding    : 7	(unsigned)
    <a34>   DW_AT_byte_size   : 4
    <a35>   DW_AT_type        : <0x2b>
    <a39>   DW_AT_decl_file   : 19
    <a3a>   DW_AT_decl_line   : 13
    <a3b>   DW_AT_decl_column : 6
    <a3c>   DW_AT_sibling     : <0xa53>
 <2><a40>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0x2b9): XT_NORMAL
    <a45>   DW_AT_const_value : 0
 <2><a46>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0xc26): XT_SORTED
    <a4b>   DW_AT_const_value : 1
 <2><a4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0xd90): XT_INDEXED
    <a51>   DW_AT_const_value : 2
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a54>   DW_AT_name        : (indirect string, offset: 0xb8f): xlat_style
    <a58>   DW_AT_encoding    : 7	(unsigned)
    <a59>   DW_AT_byte_size   : 4
    <a5a>   DW_AT_type        : <0x2b>
    <a5e>   DW_AT_decl_file   : 19
    <a5f>   DW_AT_decl_line   : 19
    <a60>   DW_AT_decl_column : 6
    <a61>   DW_AT_sibling     : <0xa90>
 <2><a65>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a6a>   DW_AT_const_value : 0
 <2><a6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xbc2): XLAT_STYLE_RAW
    <a70>   DW_AT_const_value : 1
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x1043): XLAT_STYLE_ABBREV
    <a76>   DW_AT_const_value : 2
 <2><a77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x2dd): XLAT_STYLE_VERBOSE
    <a7c>   DW_AT_const_value : 3
 <2><a7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a82>   DW_AT_const_value : 0
 <2><a83>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a88>   DW_AT_const_value : 4
 <2><a89>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x10b2): XLAT_STYLE_FMT_D
    <a8e>   DW_AT_const_value : 8
 <2><a8f>: Abbrev Number: 0
 <1><a90>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a91>   DW_AT_name        : (indirect string, offset: 0x30e): xlat_data
    <a95>   DW_AT_byte_size   : 12
    <a96>   DW_AT_decl_file   : 19
    <a97>   DW_AT_decl_line   : 51
    <a98>   DW_AT_decl_column : 8
    <a99>   DW_AT_sibling     : <0xabc>
 <2><a9d>: Abbrev Number: 18 (DW_TAG_member)
    <a9e>   DW_AT_name        : val
    <aa2>   DW_AT_decl_file   : 19
    <aa3>   DW_AT_decl_line   : 52
    <aa4>   DW_AT_decl_column : 11
    <aa5>   DW_AT_type        : <0x116>
    <aa9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aac>: Abbrev Number: 18 (DW_TAG_member)
    <aad>   DW_AT_name        : str
    <ab1>   DW_AT_decl_file   : 19
    <ab2>   DW_AT_decl_line   : 53
    <ab3>   DW_AT_decl_column : 14
    <ab4>   DW_AT_type        : <0x1c9>
    <ab8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><abb>: Abbrev Number: 0
 <1><abc>: Abbrev Number: 3 (DW_TAG_const_type)
    <abd>   DW_AT_type        : <0xa90>
 <1><ac1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ac6>   DW_AT_byte_size   : 24
    <ac7>   DW_AT_decl_file   : 19
    <ac8>   DW_AT_decl_line   : 56
    <ac9>   DW_AT_decl_column : 8
    <aca>   DW_AT_sibling     : <0xb1a>
 <2><ace>: Abbrev Number: 9 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0x1095): data
    <ad3>   DW_AT_decl_file   : 19
    <ad4>   DW_AT_decl_line   : 57
    <ad5>   DW_AT_decl_column : 26
    <ad6>   DW_AT_type        : <0xb1f>
    <ada>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><add>: Abbrev Number: 9 (DW_TAG_member)
    <ade>   DW_AT_name        : (indirect string, offset: 0x83b): flags_strsz
    <ae2>   DW_AT_decl_file   : 19
    <ae3>   DW_AT_decl_line   : 58
    <ae4>   DW_AT_decl_column : 9
    <ae5>   DW_AT_type        : <0x122>
    <ae9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><aec>: Abbrev Number: 9 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0xb34): size
    <af1>   DW_AT_decl_file   : 19
    <af2>   DW_AT_decl_line   : 59
    <af3>   DW_AT_decl_column : 11
    <af4>   DW_AT_type        : <0x10a>
    <af8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><afb>: Abbrev Number: 9 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x187): type
    <b00>   DW_AT_decl_file   : 19
    <b01>   DW_AT_decl_line   : 60
    <b02>   DW_AT_decl_column : 17
    <b03>   DW_AT_type        : <0xa2e>
    <b07>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b0a>: Abbrev Number: 9 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x6f9): flags_mask
    <b0f>   DW_AT_decl_file   : 19
    <b10>   DW_AT_decl_line   : 61
    <b11>   DW_AT_decl_column : 11
    <b12>   DW_AT_type        : <0x116>
    <b16>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b19>: Abbrev Number: 0
 <1><b1a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1b>   DW_AT_type        : <0xac1>
 <1><b1f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b20>   DW_AT_byte_size   : 4
    <b21>   DW_AT_type        : <0xabc>
 <1><b25>: Abbrev Number: 15 (DW_TAG_array_type)
    <b26>   DW_AT_type        : <0xb1a>
    <b2a>   DW_AT_sibling     : <0xb30>
 <2><b2e>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b2f>: Abbrev Number: 0
 <1><b30>: Abbrev Number: 3 (DW_TAG_const_type)
    <b31>   DW_AT_type        : <0xb25>
 <1><b35>: Abbrev Number: 10 (DW_TAG_variable)
    <b36>   DW_AT_name        : (indirect string, offset: 0xdf9): addrfams
    <b3a>   DW_AT_decl_file   : 18
    <b3b>   DW_AT_decl_line   : 409
    <b3d>   DW_AT_decl_column : 26
    <b3e>   DW_AT_type        : <0xb30>
    <b42>   DW_AT_external    : 1
    <b43>   DW_AT_declaration : 1
 <1><b44>: Abbrev Number: 10 (DW_TAG_variable)
    <b45>   DW_AT_name        : (indirect string, offset: 0xcdd): arp_hardware_types
    <b49>   DW_AT_decl_file   : 18
    <b4a>   DW_AT_decl_line   : 410
    <b4c>   DW_AT_decl_column : 26
    <b4d>   DW_AT_type        : <0xb30>
    <b51>   DW_AT_external    : 1
    <b52>   DW_AT_declaration : 1
 <1><b53>: Abbrev Number: 10 (DW_TAG_variable)
    <b54>   DW_AT_name        : (indirect string, offset: 0xfc3): at_flags
    <b58>   DW_AT_decl_file   : 18
    <b59>   DW_AT_decl_line   : 411
    <b5b>   DW_AT_decl_column : 26
    <b5c>   DW_AT_type        : <0xb30>
    <b60>   DW_AT_external    : 1
    <b61>   DW_AT_declaration : 1
 <1><b62>: Abbrev Number: 10 (DW_TAG_variable)
    <b63>   DW_AT_name        : (indirect string, offset: 0x472): clocknames
    <b67>   DW_AT_decl_file   : 18
    <b68>   DW_AT_decl_line   : 412
    <b6a>   DW_AT_decl_column : 26
    <b6b>   DW_AT_type        : <0xb30>
    <b6f>   DW_AT_external    : 1
    <b70>   DW_AT_declaration : 1
 <1><b71>: Abbrev Number: 10 (DW_TAG_variable)
    <b72>   DW_AT_name        : (indirect string, offset: 0xf83): dirent_types
    <b76>   DW_AT_decl_file   : 18
    <b77>   DW_AT_decl_line   : 413
    <b79>   DW_AT_decl_column : 26
    <b7a>   DW_AT_type        : <0xb30>
    <b7e>   DW_AT_external    : 1
    <b7f>   DW_AT_declaration : 1
 <1><b80>: Abbrev Number: 10 (DW_TAG_variable)
    <b81>   DW_AT_name        : (indirect string, offset: 0x88c): ethernet_protocols
    <b85>   DW_AT_decl_file   : 18
    <b86>   DW_AT_decl_line   : 414
    <b88>   DW_AT_decl_column : 26
    <b89>   DW_AT_type        : <0xb30>
    <b8d>   DW_AT_external    : 1
    <b8e>   DW_AT_declaration : 1
 <1><b8f>: Abbrev Number: 10 (DW_TAG_variable)
    <b90>   DW_AT_name        : (indirect string, offset: 0x58f): inet_protocols
    <b94>   DW_AT_decl_file   : 18
    <b95>   DW_AT_decl_line   : 415
    <b97>   DW_AT_decl_column : 26
    <b98>   DW_AT_type        : <0xb30>
    <b9c>   DW_AT_external    : 1
    <b9d>   DW_AT_declaration : 1
 <1><b9e>: Abbrev Number: 10 (DW_TAG_variable)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x2a6): evdev_abs
    <ba3>   DW_AT_decl_file   : 18
    <ba4>   DW_AT_decl_line   : 416
    <ba6>   DW_AT_decl_column : 26
    <ba7>   DW_AT_type        : <0xb30>
    <bab>   DW_AT_external    : 1
    <bac>   DW_AT_declaration : 1
 <1><bad>: Abbrev Number: 10 (DW_TAG_variable)
    <bae>   DW_AT_name        : (indirect string, offset: 0x6ee): audit_arch
    <bb2>   DW_AT_decl_file   : 18
    <bb3>   DW_AT_decl_line   : 417
    <bb5>   DW_AT_decl_column : 26
    <bb6>   DW_AT_type        : <0xb30>
    <bba>   DW_AT_external    : 1
    <bbb>   DW_AT_declaration : 1
 <1><bbc>: Abbrev Number: 10 (DW_TAG_variable)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bc1>   DW_AT_decl_file   : 18
    <bc2>   DW_AT_decl_line   : 418
    <bc4>   DW_AT_decl_column : 26
    <bc5>   DW_AT_type        : <0xb30>
    <bc9>   DW_AT_external    : 1
    <bca>   DW_AT_declaration : 1
 <1><bcb>: Abbrev Number: 10 (DW_TAG_variable)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x453): iffflags
    <bd0>   DW_AT_decl_file   : 18
    <bd1>   DW_AT_decl_line   : 419
    <bd3>   DW_AT_decl_column : 26
    <bd4>   DW_AT_type        : <0xb30>
    <bd8>   DW_AT_external    : 1
    <bd9>   DW_AT_declaration : 1
 <1><bda>: Abbrev Number: 10 (DW_TAG_variable)
    <bdb>   DW_AT_name        : (indirect string, offset: 0xbd1): ip_type_of_services
    <bdf>   DW_AT_decl_file   : 18
    <be0>   DW_AT_decl_line   : 420
    <be2>   DW_AT_decl_column : 26
    <be3>   DW_AT_type        : <0xb30>
    <be7>   DW_AT_external    : 1
    <be8>   DW_AT_declaration : 1
 <1><be9>: Abbrev Number: 10 (DW_TAG_variable)
    <bea>   DW_AT_name        : (indirect string, offset: 0x681): ipc_private
    <bee>   DW_AT_decl_file   : 18
    <bef>   DW_AT_decl_line   : 421
    <bf1>   DW_AT_decl_column : 26
    <bf2>   DW_AT_type        : <0xb30>
    <bf6>   DW_AT_external    : 1
    <bf7>   DW_AT_declaration : 1
 <1><bf8>: Abbrev Number: 10 (DW_TAG_variable)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x304): msg_flags
    <bfd>   DW_AT_decl_file   : 18
    <bfe>   DW_AT_decl_line   : 422
    <c00>   DW_AT_decl_column : 26
    <c01>   DW_AT_type        : <0xb30>
    <c05>   DW_AT_external    : 1
    <c06>   DW_AT_declaration : 1
 <1><c07>: Abbrev Number: 10 (DW_TAG_variable)
    <c08>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c0c>   DW_AT_decl_file   : 18
    <c0d>   DW_AT_decl_line   : 423
    <c0f>   DW_AT_decl_column : 26
    <c10>   DW_AT_type        : <0xb30>
    <c14>   DW_AT_external    : 1
    <c15>   DW_AT_declaration : 1
 <1><c16>: Abbrev Number: 10 (DW_TAG_variable)
    <c17>   DW_AT_name        : (indirect string, offset: 0xed7): nl_bridge_vlan_flags
    <c1b>   DW_AT_decl_file   : 18
    <c1c>   DW_AT_decl_line   : 424
    <c1e>   DW_AT_decl_column : 26
    <c1f>   DW_AT_type        : <0xb30>
    <c23>   DW_AT_external    : 1
    <c24>   DW_AT_declaration : 1
 <1><c25>: Abbrev Number: 10 (DW_TAG_variable)
    <c26>   DW_AT_name        : (indirect string, offset: 0xd79): nl_netfilter_msg_types
    <c2a>   DW_AT_decl_file   : 18
    <c2b>   DW_AT_decl_line   : 425
    <c2d>   DW_AT_decl_column : 26
    <c2e>   DW_AT_type        : <0xb30>
    <c32>   DW_AT_external    : 1
    <c33>   DW_AT_declaration : 1
 <1><c34>: Abbrev Number: 10 (DW_TAG_variable)
    <c35>   DW_AT_name        : (indirect string, offset: 0x435): nl_route_types
    <c39>   DW_AT_decl_file   : 18
    <c3a>   DW_AT_decl_line   : 426
    <c3c>   DW_AT_decl_column : 26
    <c3d>   DW_AT_type        : <0xb30>
    <c41>   DW_AT_external    : 1
    <c42>   DW_AT_declaration : 1
 <1><c43>: Abbrev Number: 10 (DW_TAG_variable)
    <c44>   DW_AT_name        : (indirect string, offset: 0xe30): open_access_modes
    <c48>   DW_AT_decl_file   : 18
    <c49>   DW_AT_decl_line   : 427
    <c4b>   DW_AT_decl_column : 26
    <c4c>   DW_AT_type        : <0xb30>
    <c50>   DW_AT_external    : 1
    <c51>   DW_AT_declaration : 1
 <1><c52>: Abbrev Number: 10 (DW_TAG_variable)
    <c53>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c57>   DW_AT_decl_file   : 18
    <c58>   DW_AT_decl_line   : 428
    <c5a>   DW_AT_decl_column : 26
    <c5b>   DW_AT_type        : <0xb30>
    <c5f>   DW_AT_external    : 1
    <c60>   DW_AT_declaration : 1
 <1><c61>: Abbrev Number: 10 (DW_TAG_variable)
    <c62>   DW_AT_name        : (indirect string, offset: 0xc02): perf_type_id
    <c66>   DW_AT_decl_file   : 18
    <c67>   DW_AT_decl_line   : 429
    <c69>   DW_AT_decl_column : 26
    <c6a>   DW_AT_type        : <0xb30>
    <c6e>   DW_AT_external    : 1
    <c6f>   DW_AT_declaration : 1
 <1><c70>: Abbrev Number: 10 (DW_TAG_variable)
    <c71>   DW_AT_name        : (indirect string, offset: 0xe02): pollflags
    <c75>   DW_AT_decl_file   : 18
    <c76>   DW_AT_decl_line   : 430
    <c78>   DW_AT_decl_column : 26
    <c79>   DW_AT_type        : <0xb30>
    <c7d>   DW_AT_external    : 1
    <c7e>   DW_AT_declaration : 1
 <1><c7f>: Abbrev Number: 10 (DW_TAG_variable)
    <c80>   DW_AT_name        : (indirect string, offset: 0x530): ptrace_cmds
    <c84>   DW_AT_decl_file   : 18
    <c85>   DW_AT_decl_line   : 431
    <c87>   DW_AT_decl_column : 26
    <c88>   DW_AT_type        : <0xb30>
    <c8c>   DW_AT_external    : 1
    <c8d>   DW_AT_declaration : 1
 <1><c8e>: Abbrev Number: 10 (DW_TAG_variable)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x7ce): resource_flags
    <c93>   DW_AT_decl_file   : 18
    <c94>   DW_AT_decl_line   : 432
    <c96>   DW_AT_decl_column : 26
    <c97>   DW_AT_type        : <0xb30>
    <c9b>   DW_AT_external    : 1
    <c9c>   DW_AT_declaration : 1
 <1><c9d>: Abbrev Number: 10 (DW_TAG_variable)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x27c): route_nexthop_flags
    <ca2>   DW_AT_decl_file   : 18
    <ca3>   DW_AT_decl_line   : 433
    <ca5>   DW_AT_decl_column : 26
    <ca6>   DW_AT_type        : <0xb30>
    <caa>   DW_AT_external    : 1
    <cab>   DW_AT_declaration : 1
 <1><cac>: Abbrev Number: 10 (DW_TAG_variable)
    <cad>   DW_AT_name        : (indirect string, offset: 0xe62): routing_protocols
    <cb1>   DW_AT_decl_file   : 18
    <cb2>   DW_AT_decl_line   : 434
    <cb4>   DW_AT_decl_column : 26
    <cb5>   DW_AT_type        : <0xb30>
    <cb9>   DW_AT_external    : 1
    <cba>   DW_AT_declaration : 1
 <1><cbb>: Abbrev Number: 10 (DW_TAG_variable)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x444): routing_scopes
    <cc0>   DW_AT_decl_file   : 18
    <cc1>   DW_AT_decl_line   : 435
    <cc3>   DW_AT_decl_column : 26
    <cc4>   DW_AT_type        : <0xb30>
    <cc8>   DW_AT_external    : 1
    <cc9>   DW_AT_declaration : 1
 <1><cca>: Abbrev Number: 10 (DW_TAG_variable)
    <ccb>   DW_AT_name        : (indirect string, offset: 0xd67): routing_table_ids
    <ccf>   DW_AT_decl_file   : 18
    <cd0>   DW_AT_decl_line   : 436
    <cd2>   DW_AT_decl_column : 26
    <cd3>   DW_AT_type        : <0xb30>
    <cd7>   DW_AT_external    : 1
    <cd8>   DW_AT_declaration : 1
 <1><cd9>: Abbrev Number: 10 (DW_TAG_variable)
    <cda>   DW_AT_name        : (indirect string, offset: 0x65e): routing_types
    <cde>   DW_AT_decl_file   : 18
    <cdf>   DW_AT_decl_line   : 437
    <ce1>   DW_AT_decl_column : 26
    <ce2>   DW_AT_type        : <0xb30>
    <ce6>   DW_AT_external    : 1
    <ce7>   DW_AT_declaration : 1
 <1><ce8>: Abbrev Number: 10 (DW_TAG_variable)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x1ab): rwf_flags
    <ced>   DW_AT_decl_file   : 18
    <cee>   DW_AT_decl_line   : 438
    <cf0>   DW_AT_decl_column : 26
    <cf1>   DW_AT_type        : <0xb30>
    <cf5>   DW_AT_external    : 1
    <cf6>   DW_AT_declaration : 1
 <1><cf7>: Abbrev Number: 10 (DW_TAG_variable)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x806): seccomp_filter_flags
    <cfc>   DW_AT_decl_file   : 18
    <cfd>   DW_AT_decl_line   : 439
    <cff>   DW_AT_decl_column : 26
    <d00>   DW_AT_type        : <0xb30>
    <d04>   DW_AT_external    : 1
    <d05>   DW_AT_declaration : 1
 <1><d06>: Abbrev Number: 10 (DW_TAG_variable)
    <d07>   DW_AT_name        : (indirect string, offset: 0x2c3): seccomp_ret_action
    <d0b>   DW_AT_decl_file   : 18
    <d0c>   DW_AT_decl_line   : 440
    <d0e>   DW_AT_decl_column : 26
    <d0f>   DW_AT_type        : <0xb30>
    <d13>   DW_AT_external    : 1
    <d14>   DW_AT_declaration : 1
 <1><d15>: Abbrev Number: 10 (DW_TAG_variable)
    <d16>   DW_AT_name        : (indirect string, offset: 0x410): setns_types
    <d1a>   DW_AT_decl_file   : 18
    <d1b>   DW_AT_decl_line   : 441
    <d1d>   DW_AT_decl_column : 26
    <d1e>   DW_AT_type        : <0xb30>
    <d22>   DW_AT_external    : 1
    <d23>   DW_AT_declaration : 1
 <1><d24>: Abbrev Number: 10 (DW_TAG_variable)
    <d25>   DW_AT_name        : (indirect string, offset: 0xdee): sg_io_info
    <d29>   DW_AT_decl_file   : 18
    <d2a>   DW_AT_decl_line   : 442
    <d2c>   DW_AT_decl_column : 26
    <d2d>   DW_AT_type        : <0xb30>
    <d31>   DW_AT_external    : 1
    <d32>   DW_AT_declaration : 1
 <1><d33>: Abbrev Number: 10 (DW_TAG_variable)
    <d34>   DW_AT_name        : (indirect string, offset: 0xb77): socketlayers
    <d38>   DW_AT_decl_file   : 18
    <d39>   DW_AT_decl_line   : 443
    <d3b>   DW_AT_decl_column : 26
    <d3c>   DW_AT_type        : <0xb30>
    <d40>   DW_AT_external    : 1
    <d41>   DW_AT_declaration : 1
 <1><d42>: Abbrev Number: 10 (DW_TAG_variable)
    <d43>   DW_AT_name        : (indirect string, offset: 0xd51): socktypes
    <d47>   DW_AT_decl_file   : 18
    <d48>   DW_AT_decl_line   : 444
    <d4a>   DW_AT_decl_column : 26
    <d4b>   DW_AT_type        : <0xb30>
    <d4f>   DW_AT_external    : 1
    <d50>   DW_AT_declaration : 1
 <1><d51>: Abbrev Number: 10 (DW_TAG_variable)
    <d52>   DW_AT_name        : (indirect string, offset: 0xa42): tcp_state_flags
    <d56>   DW_AT_decl_file   : 18
    <d57>   DW_AT_decl_line   : 445
    <d59>   DW_AT_decl_column : 26
    <d5a>   DW_AT_type        : <0xb30>
    <d5e>   DW_AT_external    : 1
    <d5f>   DW_AT_declaration : 1
 <1><d60>: Abbrev Number: 10 (DW_TAG_variable)
    <d61>   DW_AT_name        : (indirect string, offset: 0x733): tcp_states
    <d65>   DW_AT_decl_file   : 18
    <d66>   DW_AT_decl_line   : 446
    <d68>   DW_AT_decl_column : 26
    <d69>   DW_AT_type        : <0xb30>
    <d6d>   DW_AT_external    : 1
    <d6e>   DW_AT_declaration : 1
 <1><d6f>: Abbrev Number: 10 (DW_TAG_variable)
    <d70>   DW_AT_name        : (indirect string, offset: 0x1026): whence_codes
    <d74>   DW_AT_decl_file   : 18
    <d75>   DW_AT_decl_line   : 447
    <d77>   DW_AT_decl_column : 26
    <d78>   DW_AT_type        : <0xb30>
    <d7c>   DW_AT_external    : 1
    <d7d>   DW_AT_declaration : 1
 <1><d7e>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d7f>   DW_AT_encoding    : 7	(unsigned)
    <d80>   DW_AT_byte_size   : 4
    <d81>   DW_AT_type        : <0x2b>
    <d85>   DW_AT_decl_file   : 18
    <d86>   DW_AT_decl_line   : 508
    <d88>   DW_AT_decl_column : 14
    <d89>   DW_AT_sibling     : <0xda0>
 <2><d8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x977): CFLAG_NONE
    <d92>   DW_AT_const_value : 0
 <2><d93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0x89f): CFLAG_ONLY_STATS
    <d98>   DW_AT_const_value : 1
 <2><d99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xb84): CFLAG_BOTH
    <d9e>   DW_AT_const_value : 2
 <2><d9f>: Abbrev Number: 0
 <1><da0>: Abbrev Number: 28 (DW_TAG_typedef)
    <da1>   DW_AT_name        : (indirect string, offset: 0x10c8): cflag_t
    <da5>   DW_AT_decl_file   : 18
    <da6>   DW_AT_decl_line   : 512
    <da8>   DW_AT_decl_column : 3
    <da9>   DW_AT_type        : <0xd7e>
 <1><dad>: Abbrev Number: 10 (DW_TAG_variable)
    <dae>   DW_AT_name        : (indirect string, offset: 0xca4): cflag
    <db2>   DW_AT_decl_file   : 18
    <db3>   DW_AT_decl_line   : 513
    <db5>   DW_AT_decl_column : 16
    <db6>   DW_AT_type        : <0xda0>
    <dba>   DW_AT_external    : 1
    <dbb>   DW_AT_declaration : 1
 <1><dbc>: Abbrev Number: 10 (DW_TAG_variable)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <dc1>   DW_AT_decl_file   : 18
    <dc2>   DW_AT_decl_line   : 514
    <dc4>   DW_AT_decl_column : 13
    <dc5>   DW_AT_type        : <0x515>
    <dc9>   DW_AT_external    : 1
    <dca>   DW_AT_declaration : 1
 <1><dcb>: Abbrev Number: 10 (DW_TAG_variable)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x789): Tflag_scale
    <dd0>   DW_AT_decl_file   : 18
    <dd1>   DW_AT_decl_line   : 515
    <dd3>   DW_AT_decl_column : 12
    <dd4>   DW_AT_type        : <0x64>
    <dd8>   DW_AT_external    : 1
    <dd9>   DW_AT_declaration : 1
 <1><dda>: Abbrev Number: 10 (DW_TAG_variable)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x81b): Tflag_width
    <ddf>   DW_AT_decl_file   : 18
    <de0>   DW_AT_decl_line   : 516
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0x64>
    <de7>   DW_AT_external    : 1
    <de8>   DW_AT_declaration : 1
 <1><de9>: Abbrev Number: 10 (DW_TAG_variable)
    <dea>   DW_AT_name        : (indirect string, offset: 0xde0): iflag
    <dee>   DW_AT_decl_file   : 18
    <def>   DW_AT_decl_line   : 517
    <df1>   DW_AT_decl_column : 13
    <df2>   DW_AT_type        : <0x515>
    <df6>   DW_AT_external    : 1
    <df7>   DW_AT_declaration : 1
 <1><df8>: Abbrev Number: 10 (DW_TAG_variable)
    <df9>   DW_AT_name        : (indirect string, offset: 0x570): count_wallclock
    <dfd>   DW_AT_decl_file   : 18
    <dfe>   DW_AT_decl_line   : 518
    <e00>   DW_AT_decl_column : 13
    <e01>   DW_AT_type        : <0x515>
    <e05>   DW_AT_external    : 1
    <e06>   DW_AT_declaration : 1
 <1><e07>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e08>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e0c>   DW_AT_byte_size   : 4
    <e0d>   DW_AT_decl_file   : 18
    <e0e>   DW_AT_decl_line   : 520
    <e10>   DW_AT_decl_column : 8
    <e11>   DW_AT_sibling     : <0xe26>
 <2><e15>: Abbrev Number: 22 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e1a>   DW_AT_decl_file   : 18
    <e1b>   DW_AT_decl_line   : 521
    <e1d>   DW_AT_decl_column : 14
    <e1e>   DW_AT_type        : <0x1c9>
    <e22>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e25>: Abbrev Number: 0
 <1><e26>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e27>   DW_AT_name        : (indirect string, offset: 0x73e): path_set
    <e2b>   DW_AT_byte_size   : 12
    <e2c>   DW_AT_decl_file   : 18
    <e2d>   DW_AT_decl_line   : 525
    <e2f>   DW_AT_decl_column : 15
    <e30>   DW_AT_sibling     : <0xe65>
 <2><e34>: Abbrev Number: 22 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x6bc): paths_selected
    <e39>   DW_AT_decl_file   : 18
    <e3a>   DW_AT_decl_line   : 526
    <e3c>   DW_AT_decl_column : 24
    <e3d>   DW_AT_type        : <0xe65>
    <e41>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e44>: Abbrev Number: 22 (DW_TAG_member)
    <e45>   DW_AT_name        : (indirect string, offset: 0x1019): num_selected
    <e49>   DW_AT_decl_file   : 18
    <e4a>   DW_AT_decl_line   : 527
    <e4c>   DW_AT_decl_column : 9
    <e4d>   DW_AT_type        : <0x122>
    <e51>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e54>: Abbrev Number: 22 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0xb34): size
    <e59>   DW_AT_decl_file   : 18
    <e5a>   DW_AT_decl_line   : 528
    <e5c>   DW_AT_decl_column : 9
    <e5d>   DW_AT_type        : <0x122>
    <e61>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e64>: Abbrev Number: 0
 <1><e65>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e66>   DW_AT_byte_size   : 4
    <e67>   DW_AT_type        : <0xe07>
 <1><e6b>: Abbrev Number: 10 (DW_TAG_variable)
    <e6c>   DW_AT_name        : (indirect string, offset: 0x1068): global_path_set
    <e70>   DW_AT_decl_file   : 18
    <e71>   DW_AT_decl_line   : 529
    <e73>   DW_AT_decl_column : 3
    <e74>   DW_AT_type        : <0xe26>
    <e78>   DW_AT_external    : 1
    <e79>   DW_AT_declaration : 1
 <1><e7a>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7b>   DW_AT_name        : (indirect string, offset: 0xf5e): xflag_opts
    <e7f>   DW_AT_encoding    : 7	(unsigned)
    <e80>   DW_AT_byte_size   : 4
    <e81>   DW_AT_type        : <0x2b>
    <e85>   DW_AT_decl_file   : 18
    <e86>   DW_AT_decl_line   : 531
    <e88>   DW_AT_decl_column : 6
    <e89>   DW_AT_sibling     : <0xeac>
 <2><e8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x9f9): HEXSTR_NONE
    <e92>   DW_AT_const_value : 0
 <2><e93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0xfa5): HEXSTR_NON_ASCII
    <e98>   DW_AT_const_value : 1
 <2><e99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x8f8): HEXSTR_ALL
    <e9e>   DW_AT_const_value : 2
 <2><e9f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x647): HEXSTR_NON_ASCII_CHARS
    <ea4>   DW_AT_const_value : 3
 <2><ea5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x1033): NUM_HEXSTR_OPTS
    <eaa>   DW_AT_const_value : 4
 <2><eab>: Abbrev Number: 0
 <1><eac>: Abbrev Number: 10 (DW_TAG_variable)
    <ead>   DW_AT_name        : (indirect string, offset: 0xdba): xflag
    <eb1>   DW_AT_decl_file   : 18
    <eb2>   DW_AT_decl_line   : 544
    <eb4>   DW_AT_decl_column : 17
    <eb5>   DW_AT_type        : <0x2b>
    <eb9>   DW_AT_external    : 1
    <eba>   DW_AT_declaration : 1
 <1><ebb>: Abbrev Number: 10 (DW_TAG_variable)
    <ebc>   DW_AT_name        : (indirect string, offset: 0xc5f): followfork
    <ec0>   DW_AT_decl_file   : 18
    <ec1>   DW_AT_decl_line   : 545
    <ec3>   DW_AT_decl_column : 13
    <ec4>   DW_AT_type        : <0x515>
    <ec8>   DW_AT_external    : 1
    <ec9>   DW_AT_declaration : 1
 <1><eca>: Abbrev Number: 10 (DW_TAG_variable)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x318): output_separately
    <ecf>   DW_AT_decl_file   : 18
    <ed0>   DW_AT_decl_line   : 546
    <ed2>   DW_AT_decl_column : 13
    <ed3>   DW_AT_type        : <0x515>
    <ed7>   DW_AT_external    : 1
    <ed8>   DW_AT_declaration : 1
 <1><ed9>: Abbrev Number: 10 (DW_TAG_variable)
    <eda>   DW_AT_name        : (indirect string, offset: 0x212): stack_trace_enabled
    <ede>   DW_AT_decl_file   : 18
    <edf>   DW_AT_decl_line   : 549
    <ee1>   DW_AT_decl_column : 13
    <ee2>   DW_AT_type        : <0x515>
    <ee6>   DW_AT_external    : 1
    <ee7>   DW_AT_declaration : 1
 <1><ee8>: Abbrev Number: 10 (DW_TAG_variable)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x635): ptrace_setoptions
    <eed>   DW_AT_decl_file   : 18
    <eee>   DW_AT_decl_line   : 553
    <ef0>   DW_AT_decl_column : 17
    <ef1>   DW_AT_type        : <0x2b>
    <ef5>   DW_AT_external    : 1
    <ef6>   DW_AT_declaration : 1
 <1><ef7>: Abbrev Number: 10 (DW_TAG_variable)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x9ee): max_strlen
    <efc>   DW_AT_decl_file   : 18
    <efd>   DW_AT_decl_line   : 554
    <eff>   DW_AT_decl_column : 17
    <f00>   DW_AT_type        : <0x2b>
    <f04>   DW_AT_external    : 1
    <f05>   DW_AT_declaration : 1
 <1><f06>: Abbrev Number: 10 (DW_TAG_variable)
    <f07>   DW_AT_name        : (indirect string, offset: 0xa1c): os_release
    <f0b>   DW_AT_decl_file   : 18
    <f0c>   DW_AT_decl_line   : 555
    <f0e>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0x2b>
    <f13>   DW_AT_external    : 1
    <f14>   DW_AT_declaration : 1
 <1><f15>: Abbrev Number: 10 (DW_TAG_variable)
    <f16>   DW_AT_name        : (indirect string, offset: 0x6cb): xlat_verbosity
    <f1a>   DW_AT_decl_file   : 18
    <f1b>   DW_AT_decl_line   : 917
    <f1d>   DW_AT_decl_column : 24
    <f1e>   DW_AT_type        : <0xa53>
    <f22>   DW_AT_external    : 1
    <f23>   DW_AT_declaration : 1
 <1><f24>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f25>   DW_AT_name        : (indirect string, offset: 0x553): xlat_style_private_flag_bits
    <f29>   DW_AT_encoding    : 7	(unsigned)
    <f2a>   DW_AT_byte_size   : 4
    <f2b>   DW_AT_type        : <0x2b>
    <f2f>   DW_AT_decl_file   : 18
    <f30>   DW_AT_decl_line   : 937
    <f32>   DW_AT_decl_column : 6
    <f33>   DW_AT_sibling     : <0xf50>
 <2><f37>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0x290): PAF_PRINT_INDICES_BIT
    <f3c>   DW_AT_const_value : 5
 <2><f3d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0xaeb): PAF_ARRAY_TRUNCATED_BIT
    <f42>   DW_AT_const_value : 6
 <2><f43>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x3d0): PXF_DEFAULT_STR_BIT
    <f48>   DW_AT_const_value : 7
 <2><f49>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xc39): SPFF_AUXSTR_MODE_BIT
    <f4e>   DW_AT_const_value : 8
 <2><f4f>: Abbrev Number: 0
 <1><f50>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f51>   DW_AT_name        : (indirect string, offset: 0xcf0): find_xlat_flag_bits
    <f55>   DW_AT_encoding    : 7	(unsigned)
    <f56>   DW_AT_byte_size   : 4
    <f57>   DW_AT_type        : <0x2b>
    <f5b>   DW_AT_decl_file   : 18
    <f5c>   DW_AT_decl_line   : 1441
    <f5e>   DW_AT_decl_column : 6
    <f5f>   DW_AT_sibling     : <0xf6a>
 <2><f63>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f64>   DW_AT_name        : (indirect string, offset: 0x935): FXL_CASE_SENSITIVE_BIT
    <f68>   DW_AT_const_value : 0
 <2><f69>: Abbrev Number: 0
 <1><f6a>: Abbrev Number: 10 (DW_TAG_variable)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x9ca): printing_tcp
    <f6f>   DW_AT_decl_file   : 18
    <f70>   DW_AT_decl_line   : 1687
    <f72>   DW_AT_decl_column : 20
    <f73>   DW_AT_type        : <0x609>
    <f77>   DW_AT_external    : 1
    <f78>   DW_AT_declaration : 1
 <1><f79>: Abbrev Number: 10 (DW_TAG_variable)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x51b): errnoent
    <f7e>   DW_AT_decl_file   : 18
    <f7f>   DW_AT_decl_line   : 1885
    <f81>   DW_AT_decl_column : 26
    <f82>   DW_AT_type        : <0x449>
    <f86>   DW_AT_external    : 1
    <f87>   DW_AT_declaration : 1
 <1><f88>: Abbrev Number: 10 (DW_TAG_variable)
    <f89>   DW_AT_name        : (indirect string, offset: 0x827): signalent
    <f8d>   DW_AT_decl_file   : 18
    <f8e>   DW_AT_decl_line   : 1886
    <f90>   DW_AT_decl_column : 26
    <f91>   DW_AT_type        : <0x449>
    <f95>   DW_AT_external    : 1
    <f96>   DW_AT_declaration : 1
 <1><f97>: Abbrev Number: 10 (DW_TAG_variable)
    <f98>   DW_AT_name        : (indirect string, offset: 0xe28): nerrnos
    <f9c>   DW_AT_decl_file   : 18
    <f9d>   DW_AT_decl_line   : 1887
    <f9f>   DW_AT_decl_column : 27
    <fa0>   DW_AT_type        : <0x32>
    <fa4>   DW_AT_external    : 1
    <fa5>   DW_AT_declaration : 1
 <1><fa6>: Abbrev Number: 10 (DW_TAG_variable)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x1002): nsignals
    <fab>   DW_AT_decl_file   : 18
    <fac>   DW_AT_decl_line   : 1888
    <fae>   DW_AT_decl_column : 27
    <faf>   DW_AT_type        : <0x32>
    <fb3>   DW_AT_external    : 1
    <fb4>   DW_AT_declaration : 1
 <1><fb5>: Abbrev Number: 15 (DW_TAG_array_type)
    <fb6>   DW_AT_type        : <0x872>
    <fba>   DW_AT_sibling     : <0xfc0>
 <2><fbe>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fbf>: Abbrev Number: 0
 <1><fc0>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc1>   DW_AT_type        : <0xfb5>
 <1><fc5>: Abbrev Number: 10 (DW_TAG_variable)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xcbb): sysent0
    <fca>   DW_AT_decl_file   : 18
    <fcb>   DW_AT_decl_line   : 1890
    <fcd>   DW_AT_decl_column : 28
    <fce>   DW_AT_type        : <0xfc0>
    <fd2>   DW_AT_external    : 1
    <fd3>   DW_AT_declaration : 1
 <1><fd4>: Abbrev Number: 15 (DW_TAG_array_type)
    <fd5>   DW_AT_type        : <0x8d9>
    <fd9>   DW_AT_sibling     : <0xfdf>
 <2><fdd>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fde>: Abbrev Number: 0
 <1><fdf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe0>   DW_AT_type        : <0xfd4>
 <1><fe4>: Abbrev Number: 10 (DW_TAG_variable)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x105e): ioctlent0
    <fe9>   DW_AT_decl_file   : 18
    <fea>   DW_AT_decl_line   : 1891
    <fec>   DW_AT_decl_column : 30
    <fed>   DW_AT_type        : <0xfdf>
    <ff1>   DW_AT_external    : 1
    <ff2>   DW_AT_declaration : 1
 <1><ff3>: Abbrev Number: 10 (DW_TAG_variable)
    <ff4>   DW_AT_name        : (indirect string, offset: 0xf69): personality_names
    <ff8>   DW_AT_decl_file   : 18
    <ff9>   DW_AT_decl_line   : 1893
    <ffb>   DW_AT_decl_column : 26
    <ffc>   DW_AT_type        : <0x449>
    <1000>   DW_AT_external    : 1
    <1001>   DW_AT_declaration : 1
 <1><1002>: Abbrev Number: 10 (DW_TAG_variable)
    <1003>   DW_AT_name        : (indirect string, offset: 0x847): sysent
    <1007>   DW_AT_decl_file   : 18
    <1008>   DW_AT_decl_line   : 1896
    <100a>   DW_AT_decl_column : 29
    <100b>   DW_AT_type        : <0x9be>
    <100f>   DW_AT_external    : 1
    <1010>   DW_AT_declaration : 1
 <1><1011>: Abbrev Number: 10 (DW_TAG_variable)
    <1012>   DW_AT_name        : (indirect string, offset: 0xc56): ioctlent
    <1016>   DW_AT_decl_file   : 18
    <1017>   DW_AT_decl_line   : 1897
    <1019>   DW_AT_decl_column : 31
    <101a>   DW_AT_type        : <0x1020>
    <101e>   DW_AT_external    : 1
    <101f>   DW_AT_declaration : 1
 <1><1020>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1021>   DW_AT_byte_size   : 4
    <1022>   DW_AT_type        : <0x8d9>
 <1><1026>: Abbrev Number: 10 (DW_TAG_variable)
    <1027>   DW_AT_name        : (indirect string, offset: 0x831): nsyscalls
    <102b>   DW_AT_decl_file   : 18
    <102c>   DW_AT_decl_line   : 1903
    <102e>   DW_AT_decl_column : 17
    <102f>   DW_AT_type        : <0x2b>
    <1033>   DW_AT_external    : 1
    <1034>   DW_AT_declaration : 1
 <1><1035>: Abbrev Number: 10 (DW_TAG_variable)
    <1036>   DW_AT_name        : (indirect string, offset: 0xe42): nioctlents
    <103a>   DW_AT_decl_file   : 18
    <103b>   DW_AT_decl_line   : 1904
    <103d>   DW_AT_decl_column : 17
    <103e>   DW_AT_type        : <0x2b>
    <1042>   DW_AT_external    : 1
    <1043>   DW_AT_declaration : 1
 <1><1044>: Abbrev Number: 15 (DW_TAG_array_type)
    <1045>   DW_AT_type        : <0x32>
    <1049>   DW_AT_sibling     : <0x1054>
 <2><104d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <104e>   DW_AT_type        : <0x2b>
    <1052>   DW_AT_upper_bound : 2
 <2><1053>: Abbrev Number: 0
 <1><1054>: Abbrev Number: 3 (DW_TAG_const_type)
    <1055>   DW_AT_type        : <0x1044>
 <1><1059>: Abbrev Number: 10 (DW_TAG_variable)
    <105a>   DW_AT_name        : (indirect string, offset: 0xeb7): nsyscall_vec
    <105e>   DW_AT_decl_file   : 18
    <105f>   DW_AT_decl_line   : 1906
    <1061>   DW_AT_decl_column : 27
    <1062>   DW_AT_type        : <0x1054>
    <1066>   DW_AT_external    : 1
    <1067>   DW_AT_declaration : 1
 <1><1068>: Abbrev Number: 15 (DW_TAG_array_type)
    <1069>   DW_AT_type        : <0x9c4>
    <106d>   DW_AT_sibling     : <0x1078>
 <2><1071>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1072>   DW_AT_type        : <0x2b>
    <1076>   DW_AT_upper_bound : 2
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 3 (DW_TAG_const_type)
    <1079>   DW_AT_type        : <0x1068>
 <1><107d>: Abbrev Number: 10 (DW_TAG_variable)
    <107e>   DW_AT_name        : (indirect string, offset: 0x776): sysent_vec
    <1082>   DW_AT_decl_file   : 18
    <1083>   DW_AT_decl_line   : 1907
    <1085>   DW_AT_decl_column : 35
    <1086>   DW_AT_type        : <0x1078>
    <108a>   DW_AT_external    : 1
    <108b>   DW_AT_declaration : 1
 <1><108c>: Abbrev Number: 10 (DW_TAG_variable)
    <108d>   DW_AT_name        : (indirect string, offset: 0x371): inject_vec
    <1091>   DW_AT_decl_file   : 18
    <1092>   DW_AT_decl_line   : 1908
    <1094>   DW_AT_decl_column : 28
    <1095>   DW_AT_type        : <0x9c9>
    <1099>   DW_AT_external    : 1
    <109a>   DW_AT_declaration : 1
 <1><109b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <109c>   DW_AT_name        : (indirect string, offset: 0xd44): audit_arch_t
    <10a0>   DW_AT_byte_size   : 8
    <10a1>   DW_AT_decl_file   : 18
    <10a2>   DW_AT_decl_line   : 1910
    <10a4>   DW_AT_decl_column : 8
    <10a5>   DW_AT_sibling     : <0x10ca>
 <2><10a9>: Abbrev Number: 22 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x545): arch
    <10ae>   DW_AT_decl_file   : 18
    <10af>   DW_AT_decl_line   : 1911
    <10b1>   DW_AT_decl_column : 15
    <10b2>   DW_AT_type        : <0x2b>
    <10b6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b9>: Abbrev Number: 22 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x9b0): flag
    <10be>   DW_AT_decl_file   : 18
    <10bf>   DW_AT_decl_line   : 1912
    <10c1>   DW_AT_decl_column : 15
    <10c2>   DW_AT_type        : <0x2b>
    <10c6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c9>: Abbrev Number: 0
 <1><10ca>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cb>   DW_AT_type        : <0x109b>
 <1><10cf>: Abbrev Number: 15 (DW_TAG_array_type)
    <10d0>   DW_AT_type        : <0x10ca>
    <10d4>   DW_AT_sibling     : <0x10df>
 <2><10d8>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d9>   DW_AT_type        : <0x2b>
    <10dd>   DW_AT_upper_bound : 2
 <2><10de>: Abbrev Number: 0
 <1><10df>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e0>   DW_AT_type        : <0x10cf>
 <1><10e4>: Abbrev Number: 10 (DW_TAG_variable)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x926): audit_arch_vec
    <10e9>   DW_AT_decl_file   : 18
    <10ea>   DW_AT_decl_line   : 1915
    <10ec>   DW_AT_decl_column : 34
    <10ed>   DW_AT_type        : <0x10df>
    <10f1>   DW_AT_external    : 1
    <10f2>   DW_AT_declaration : 1
 <1><10f3>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f4>   DW_AT_byte_size   : 180
    <10f5>   DW_AT_decl_file   : 20
    <10f6>   DW_AT_decl_line   : 2
    <10f7>   DW_AT_decl_column : 9
    <10f8>   DW_AT_sibling     : <0x13ad>
 <2><10fc>: Abbrev Number: 9 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0x1c3): block_ioctl
    <1101>   DW_AT_decl_file   : 20
    <1102>   DW_AT_decl_line   : 3
    <1103>   DW_AT_decl_column : 8
    <1104>   DW_AT_type        : <0x13c7>
    <1108>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110b>: Abbrev Number: 9 (DW_TAG_member)
    <110c>   DW_AT_name        : (indirect string, offset: 0xa7b): btrfs_ioctl
    <1110>   DW_AT_decl_file   : 20
    <1111>   DW_AT_decl_line   : 6
    <1112>   DW_AT_decl_column : 8
    <1113>   DW_AT_type        : <0x13c7>
    <1117>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111a>: Abbrev Number: 9 (DW_TAG_member)
    <111b>   DW_AT_name        : (indirect string, offset: 0x704): evdev_write_ioctl_mpers
    <111f>   DW_AT_decl_file   : 20
    <1120>   DW_AT_decl_line   : 9
    <1121>   DW_AT_decl_column : 8
    <1122>   DW_AT_type        : <0x13c7>
    <1126>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1129>: Abbrev Number: 9 (DW_TAG_member)
    <112a>   DW_AT_name        : (indirect string, offset: 0x6da): get_sock_fprog_size
    <112e>   DW_AT_decl_file   : 20
    <112f>   DW_AT_decl_line   : 12
    <1130>   DW_AT_decl_column : 17
    <1131>   DW_AT_type        : <0x13d3>
    <1135>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1138>: Abbrev Number: 9 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0x192): fetch_bpf_fprog
    <113d>   DW_AT_decl_file   : 20
    <113e>   DW_AT_decl_line   : 15
    <113f>   DW_AT_decl_column : 10
    <1140>   DW_AT_type        : <0x13f3>
    <1144>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1147>: Abbrev Number: 9 (DW_TAG_member)
    <1148>   DW_AT_name        : (indirect string, offset: 0x913): fetch_struct_flock
    <114c>   DW_AT_decl_file   : 20
