Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x172a (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5bf): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x6e3): mpers-m32/struct_loop_info.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe9c): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b0): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1015): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9ad): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x353): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x255): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdf5): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x488): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8a4): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xeed): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8d4): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7a4): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb76): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbac): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2cf): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd08): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc75): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3fc): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x451): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x35f): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb97): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf95): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe05): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb15): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10f3): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe2b): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xe6>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 3
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xad7): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfd0): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x272): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xe0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3a8): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xff6): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xe0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x777): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc64): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xb52): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xed>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x367): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 9 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xa29): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 9 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4d7): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xe0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 9 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf42): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xe0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 9 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7eb): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xe0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 9 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xe0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 9 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x104e): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xe0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 9 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x925): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xe0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 9 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x996): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xe0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 9 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xda0): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xe0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 9 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xe0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 9 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xcc7): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xe0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 9 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xe0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 9 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x56b): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 9 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x212): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 9 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xfbb): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 9 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x7d7): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 9 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x850): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 9 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x240): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 9 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe51): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 9 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xcd7): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 9 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 9 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x70f): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 9 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa69): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 9 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfda): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 9 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3cc): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 9 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc3a): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xcd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 9 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x9eb): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x122>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 9 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0xa4d): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 9 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x805): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xaf7): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x47d): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x311): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 10 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xe6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x37b): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 10 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xe6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x536): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x1028): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xdee): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x24c): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 10 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x545): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x25f): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe60): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6cb): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xe0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbd7): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xe0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 10 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xe0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1bc): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xed4): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x370): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x9e4): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x10a9): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4c2): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf69): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9f7): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x40e): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0x697): __kernel_old_dev_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 21
    <538>   DW_AT_decl_column : 24
    <539>   DW_AT_type        : <0x24>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0xaad): __kernel_long_t
    <542>   DW_AT_decl_file   : 15
    <543>   DW_AT_decl_line   : 15
    <544>   DW_AT_decl_column : 15
    <545>   DW_AT_type        : <0xae>
 <1><549>: Abbrev Number: 4 (DW_TAG_typedef)
    <54a>   DW_AT_name        : (indirect string, offset: 0x525): __kernel_ulong_t
    <54e>   DW_AT_decl_file   : 15
    <54f>   DW_AT_decl_line   : 16
    <550>   DW_AT_decl_column : 23
    <551>   DW_AT_type        : <0x37>
 <1><555>: Abbrev Number: 4 (DW_TAG_typedef)
    <556>   DW_AT_name        : (indirect string, offset: 0x3da): kernel_long_t
    <55a>   DW_AT_decl_file   : 16
    <55b>   DW_AT_decl_line   : 16
    <55c>   DW_AT_decl_column : 25
    <55d>   DW_AT_type        : <0x53d>
 <1><561>: Abbrev Number: 4 (DW_TAG_typedef)
    <562>   DW_AT_name        : (indirect string, offset: 0x8c5): kernel_ulong_t
    <566>   DW_AT_decl_file   : 16
    <567>   DW_AT_decl_line   : 17
    <568>   DW_AT_decl_column : 26
    <569>   DW_AT_type        : <0x549>
 <1><56d>: Abbrev Number: 3 (DW_TAG_const_type)
    <56e>   DW_AT_type        : <0x561>
 <1><572>: Abbrev Number: 8 (DW_TAG_structure_type)
    <573>   DW_AT_name        : (indirect string, offset: 0xbf5): list_item
    <577>   DW_AT_byte_size   : 8
    <578>   DW_AT_decl_file   : 17
    <579>   DW_AT_decl_line   : 92
    <57a>   DW_AT_decl_column : 8
    <57b>   DW_AT_sibling     : <0x59e>
 <2><57f>: Abbrev Number: 9 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0x10ee): prev
    <584>   DW_AT_decl_file   : 17
    <585>   DW_AT_decl_line   : 93
    <586>   DW_AT_decl_column : 20
    <587>   DW_AT_type        : <0x59e>
    <58b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58e>: Abbrev Number: 9 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x10e4): next
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 94
    <595>   DW_AT_decl_column : 20
    <596>   DW_AT_type        : <0x59e>
    <59a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59d>: Abbrev Number: 0
 <1><59e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59f>   DW_AT_byte_size   : 4
    <5a0>   DW_AT_type        : <0x572>
 <1><5a4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x89d): sysent
    <5a9>   DW_AT_byte_size   : 20
    <5aa>   DW_AT_decl_file   : 18
    <5ab>   DW_AT_decl_line   : 13
    <5ac>   DW_AT_decl_column : 16
    <5ad>   DW_AT_sibling     : <0x5fd>
 <2><5b1>: Abbrev Number: 9 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x103f): nargs
    <5b6>   DW_AT_decl_file   : 18
    <5b7>   DW_AT_decl_line   : 14
    <5b8>   DW_AT_decl_column : 11
    <5b9>   DW_AT_type        : <0x2b>
    <5bd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c0>: Abbrev Number: 9 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x9a3): sys_flags
    <5c5>   DW_AT_decl_file   : 18
    <5c6>   DW_AT_decl_line   : 15
    <5c7>   DW_AT_decl_column : 6
    <5c8>   DW_AT_type        : <0x64>
    <5cc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cf>: Abbrev Number: 18 (DW_TAG_member)
    <5d0>   DW_AT_name        : sen
    <5d4>   DW_AT_decl_file   : 18
    <5d5>   DW_AT_decl_line   : 16
    <5d6>   DW_AT_decl_column : 6
    <5d7>   DW_AT_type        : <0x64>
    <5db>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5de>: Abbrev Number: 9 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x308): sys_func
    <5e3>   DW_AT_decl_file   : 18
    <5e4>   DW_AT_decl_line   : 17
    <5e5>   DW_AT_decl_column : 8
    <5e6>   DW_AT_type        : <0x864>
    <5ea>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ed>: Abbrev Number: 9 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x269): sys_name
    <5f2>   DW_AT_decl_file   : 18
    <5f3>   DW_AT_decl_line   : 18
    <5f4>   DW_AT_decl_column : 14
    <5f5>   DW_AT_type        : <0x1d9>
    <5f9>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5fc>: Abbrev Number: 0
 <1><5fd>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fe>   DW_AT_prototyped  : 1
    <5ff>   DW_AT_type        : <0x64>
    <603>   DW_AT_sibling     : <0x60d>
 <2><607>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <608>   DW_AT_type        : <0x60d>
 <2><60c>: Abbrev Number: 0
 <1><60d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60e>   DW_AT_byte_size   : 4
    <60f>   DW_AT_type        : <0x618>
 <1><613>: Abbrev Number: 3 (DW_TAG_const_type)
    <614>   DW_AT_type        : <0x60d>
 <1><618>: Abbrev Number: 21 (DW_TAG_structure_type)
    <619>   DW_AT_name        : tcb
    <61d>   DW_AT_byte_size   : 204
    <61e>   DW_AT_decl_file   : 19
    <61f>   DW_AT_decl_line   : 262
    <621>   DW_AT_decl_column : 8
    <622>   DW_AT_sibling     : <0x864>
 <2><626>: Abbrev Number: 22 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x4d1): flags
    <62b>   DW_AT_decl_file   : 19
    <62c>   DW_AT_decl_line   : 263
    <62e>   DW_AT_decl_column : 6
    <62f>   DW_AT_type        : <0x64>
    <633>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><636>: Abbrev Number: 23 (DW_TAG_member)
    <637>   DW_AT_name        : pid
    <63b>   DW_AT_decl_file   : 19
    <63c>   DW_AT_decl_line   : 264
    <63e>   DW_AT_decl_column : 6
    <63f>   DW_AT_type        : <0x64>
    <643>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><646>: Abbrev Number: 22 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <64b>   DW_AT_decl_file   : 19
    <64c>   DW_AT_decl_line   : 265
    <64e>   DW_AT_decl_column : 6
    <64f>   DW_AT_type        : <0x64>
    <653>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><656>: Abbrev Number: 22 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0x394): currpers
    <65b>   DW_AT_decl_file   : 19
    <65c>   DW_AT_decl_line   : 267
    <65e>   DW_AT_decl_column : 15
    <65f>   DW_AT_type        : <0x2b>
    <663>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><666>: Abbrev Number: 22 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xb4a): u_error
    <66b>   DW_AT_decl_file   : 19
    <66c>   DW_AT_decl_line   : 269
    <66e>   DW_AT_decl_column : 16
    <66f>   DW_AT_type        : <0x37>
    <673>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><676>: Abbrev Number: 22 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <67b>   DW_AT_decl_file   : 19
    <67c>   DW_AT_decl_line   : 270
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x561>
    <683>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><686>: Abbrev Number: 22 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0xb8d): true_scno
    <68b>   DW_AT_decl_file   : 19
    <68c>   DW_AT_decl_line   : 271
    <68e>   DW_AT_decl_column : 17
    <68f>   DW_AT_type        : <0x561>
    <693>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><696>: Abbrev Number: 22 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x1a6): u_arg
    <69b>   DW_AT_decl_file   : 19
    <69c>   DW_AT_decl_line   : 272
    <69e>   DW_AT_decl_column : 17
    <69f>   DW_AT_type        : <0x994>
    <6a3>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a6>: Abbrev Number: 22 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x9ba): u_rval
    <6ab>   DW_AT_decl_file   : 19
    <6ac>   DW_AT_decl_line   : 273
    <6ae>   DW_AT_decl_column : 16
    <6af>   DW_AT_type        : <0x555>
    <6b3>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b6>: Abbrev Number: 22 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xac9): sys_func_rval
    <6bb>   DW_AT_decl_file   : 19
    <6bc>   DW_AT_decl_line   : 274
    <6be>   DW_AT_decl_column : 6
    <6bf>   DW_AT_type        : <0x64>
    <6c3>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c6>: Abbrev Number: 22 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xcf9): curcol
    <6cb>   DW_AT_decl_file   : 19
    <6cc>   DW_AT_decl_line   : 275
    <6ce>   DW_AT_decl_column : 6
    <6cf>   DW_AT_type        : <0x64>
    <6d3>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d6>: Abbrev Number: 22 (DW_TAG_member)
    <6d7>   DW_AT_name        : (indirect string, offset: 0x9cc): outf
    <6db>   DW_AT_decl_file   : 19
    <6dc>   DW_AT_decl_line   : 276
    <6de>   DW_AT_decl_column : 8
    <6df>   DW_AT_type        : <0x41e>
    <6e3>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e6>: Abbrev Number: 22 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xf13): staged_output_data
    <6eb>   DW_AT_decl_file   : 19
    <6ec>   DW_AT_decl_line   : 277
    <6ee>   DW_AT_decl_column : 29
    <6ef>   DW_AT_type        : <0x9aa>
    <6f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f6>: Abbrev Number: 22 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xa94): auxstr
    <6fb>   DW_AT_decl_file   : 19
    <6fc>   DW_AT_decl_line   : 279
    <6fe>   DW_AT_decl_column : 14
    <6ff>   DW_AT_type        : <0x1d9>
    <703>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><706>: Abbrev Number: 22 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <70b>   DW_AT_decl_file   : 19
    <70c>   DW_AT_decl_line   : 280
    <70e>   DW_AT_decl_column : 8
    <70f>   DW_AT_type        : <0xcd>
    <713>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><716>: Abbrev Number: 22 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0xc2a): _free_priv_data
    <71b>   DW_AT_decl_file   : 19
    <71c>   DW_AT_decl_line   : 281
    <71e>   DW_AT_decl_column : 9
    <71f>   DW_AT_type        : <0x9bc>
    <723>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><726>: Abbrev Number: 22 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0x18c): s_ent
    <72b>   DW_AT_decl_file   : 19
    <72c>   DW_AT_decl_line   : 282
    <72e>   DW_AT_decl_column : 23
    <72f>   DW_AT_type        : <0x9c2>
    <733>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><736>: Abbrev Number: 22 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <73b>   DW_AT_decl_file   : 19
    <73c>   DW_AT_decl_line   : 285
    <73e>   DW_AT_decl_column : 23
    <73f>   DW_AT_type        : <0x9c2>
    <743>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><746>: Abbrev Number: 22 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x389): inject_vec
    <74b>   DW_AT_decl_file   : 19
    <74c>   DW_AT_decl_line   : 286
    <74e>   DW_AT_decl_column : 22
    <74f>   DW_AT_type        : <0x9cd>
    <753>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><756>: Abbrev Number: 22 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x80e): stime
    <75b>   DW_AT_decl_file   : 19
    <75c>   DW_AT_decl_line   : 287
    <75e>   DW_AT_decl_column : 18
    <75f>   DW_AT_type        : <0x133>
    <763>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><766>: Abbrev Number: 22 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x39d): ltime
    <76b>   DW_AT_decl_file   : 19
    <76c>   DW_AT_decl_line   : 288
    <76e>   DW_AT_decl_column : 18
    <76f>   DW_AT_type        : <0x133>
    <773>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><776>: Abbrev Number: 22 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x1006): atime
    <77b>   DW_AT_decl_file   : 19
    <77c>   DW_AT_decl_line   : 289
    <77e>   DW_AT_decl_column : 18
    <77f>   DW_AT_type        : <0x133>
    <783>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><786>: Abbrev Number: 22 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0x4cb): etime
    <78b>   DW_AT_decl_file   : 19
    <78c>   DW_AT_decl_line   : 290
    <78e>   DW_AT_decl_column : 18
    <78f>   DW_AT_type        : <0x133>
    <793>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><797>: Abbrev Number: 22 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0xd5d): delay_expiration_time
    <79c>   DW_AT_decl_file   : 19
    <79d>   DW_AT_decl_line   : 291
    <79f>   DW_AT_decl_column : 18
    <7a0>   DW_AT_type        : <0x133>
    <7a4>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a8>: Abbrev Number: 22 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7ad>   DW_AT_decl_file   : 19
    <7ae>   DW_AT_decl_line   : 298
    <7b0>   DW_AT_decl_column : 15
    <7b1>   DW_AT_type        : <0x2b>
    <7b5>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b9>: Abbrev Number: 22 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0xf4f): last_dirfd
    <7be>   DW_AT_decl_file   : 19
    <7bf>   DW_AT_decl_line   : 301
    <7c1>   DW_AT_decl_column : 6
    <7c2>   DW_AT_type        : <0x64>
    <7c6>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ca>: Abbrev Number: 22 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xf75): mmap_cache
    <7cf>   DW_AT_decl_file   : 19
    <7d0>   DW_AT_decl_line   : 304
    <7d2>   DW_AT_decl_column : 23
    <7d3>   DW_AT_type        : <0x9e9>
    <7d7>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7db>: Abbrev Number: 22 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xb63): wait_data_idx
    <7e0>   DW_AT_decl_file   : 19
    <7e1>   DW_AT_decl_line   : 311
    <7e3>   DW_AT_decl_column : 9
    <7e4>   DW_AT_type        : <0x122>
    <7e8>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7ec>: Abbrev Number: 22 (DW_TAG_member)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xa9b): delayed_wait_data
    <7f1>   DW_AT_decl_file   : 19
    <7f2>   DW_AT_decl_line   : 313
    <7f4>   DW_AT_decl_column : 24
    <7f5>   DW_AT_type        : <0x9f5>
    <7f9>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7fd>: Abbrev Number: 22 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xb0b): wait_list
    <802>   DW_AT_decl_file   : 19
    <803>   DW_AT_decl_line   : 314
    <805>   DW_AT_decl_column : 19
    <806>   DW_AT_type        : <0x572>
    <80a>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x700): vcpu_info_list
    <813>   DW_AT_decl_file   : 19
    <814>   DW_AT_decl_line   : 318
    <816>   DW_AT_decl_column : 20
    <817>   DW_AT_type        : <0xa01>
    <81b>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81f>: Abbrev Number: 22 (DW_TAG_member)
    <820>   DW_AT_name        : (indirect string, offset: 0xcbc): unwind_ctx
    <824>   DW_AT_decl_file   : 19
    <825>   DW_AT_decl_line   : 322
    <827>   DW_AT_decl_column : 8
    <828>   DW_AT_type        : <0xcd>
    <82c>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><830>: Abbrev Number: 22 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x4b5): unwind_queue
    <835>   DW_AT_decl_file   : 19
    <836>   DW_AT_decl_line   : 323
    <838>   DW_AT_decl_column : 25
    <839>   DW_AT_type        : <0xa0d>
    <83d>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><841>: Abbrev Number: 22 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <846>   DW_AT_decl_file   : 19
    <847>   DW_AT_decl_line   : 327
    <849>   DW_AT_decl_column : 7
    <84a>   DW_AT_type        : <0xa13>
    <84e>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><852>: Abbrev Number: 22 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0x222): start_prc
    <857>   DW_AT_decl_file   : 19
    <858>   DW_AT_decl_line   : 329
    <85a>   DW_AT_decl_column : 16
    <85b>   DW_AT_type        : <0x37>
    <85f>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><863>: Abbrev Number: 0
 <1><864>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <865>   DW_AT_byte_size   : 4
    <866>   DW_AT_type        : <0x5fd>
 <1><86a>: Abbrev Number: 4 (DW_TAG_typedef)
    <86b>   DW_AT_name        : (indirect string, offset: 0x517): struct_sysent
    <86f>   DW_AT_decl_file   : 18
    <870>   DW_AT_decl_line   : 19
    <871>   DW_AT_decl_column : 3
    <872>   DW_AT_type        : <0x5a4>
 <1><876>: Abbrev Number: 3 (DW_TAG_const_type)
    <877>   DW_AT_type        : <0x86a>
 <1><87b>: Abbrev Number: 13 (DW_TAG_variable)
    <87c>   DW_AT_name        : (indirect string, offset: 0xd49): current_personality
    <880>   DW_AT_decl_file   : 19
    <881>   DW_AT_decl_line   : 158
    <882>   DW_AT_decl_column : 17
    <883>   DW_AT_type        : <0x2b>
    <887>   DW_AT_external    : 1
    <888>   DW_AT_declaration : 1
 <1><889>: Abbrev Number: 13 (DW_TAG_variable)
    <88a>   DW_AT_name        : (indirect string, offset: 0x83f): current_wordsize
    <88e>   DW_AT_decl_file   : 19
    <88f>   DW_AT_decl_line   : 171
    <890>   DW_AT_decl_column : 17
    <891>   DW_AT_type        : <0x2b>
    <895>   DW_AT_external    : 1
    <896>   DW_AT_declaration : 1
 <1><897>: Abbrev Number: 13 (DW_TAG_variable)
    <898>   DW_AT_name        : (indirect string, offset: 0xa72): current_klongsize
    <89c>   DW_AT_decl_file   : 19
    <89d>   DW_AT_decl_line   : 176
    <89e>   DW_AT_decl_column : 17
    <89f>   DW_AT_type        : <0x2b>
    <8a3>   DW_AT_external    : 1
    <8a4>   DW_AT_declaration : 1
 <1><8a5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xc93): ioctlent
    <8aa>   DW_AT_byte_size   : 8
    <8ab>   DW_AT_decl_file   : 19
    <8ac>   DW_AT_decl_line   : 217
    <8ad>   DW_AT_decl_column : 16
    <8ae>   DW_AT_sibling     : <0x8d1>
 <2><8b2>: Abbrev Number: 9 (DW_TAG_member)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xf3b): symbol
    <8b7>   DW_AT_decl_file   : 19
    <8b8>   DW_AT_decl_line   : 218
    <8b9>   DW_AT_decl_column : 14
    <8ba>   DW_AT_type        : <0x1d9>
    <8be>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c1>: Abbrev Number: 9 (DW_TAG_member)
    <8c2>   DW_AT_name        : (indirect string, offset: 0xd12): code
    <8c6>   DW_AT_decl_file   : 19
    <8c7>   DW_AT_decl_line   : 219
    <8c8>   DW_AT_decl_column : 15
    <8c9>   DW_AT_type        : <0x2b>
    <8cd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d0>: Abbrev Number: 0
 <1><8d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d2>   DW_AT_name        : (indirect string, offset: 0xc54): struct_ioctlent
    <8d6>   DW_AT_decl_file   : 19
    <8d7>   DW_AT_decl_line   : 220
    <8d8>   DW_AT_decl_column : 3
    <8d9>   DW_AT_type        : <0x8a5>
 <1><8dd>: Abbrev Number: 3 (DW_TAG_const_type)
    <8de>   DW_AT_type        : <0x8d1>
 <1><8e2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x833): inject_data
    <8e7>   DW_AT_byte_size   : 10
    <8e8>   DW_AT_decl_file   : 19
    <8e9>   DW_AT_decl_line   : 241
    <8ea>   DW_AT_decl_column : 8
    <8eb>   DW_AT_sibling     : <0x94a>
 <2><8ef>: Abbrev Number: 9 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x4d1): flags
    <8f4>   DW_AT_decl_file   : 19
    <8f5>   DW_AT_decl_line   : 242
    <8f6>   DW_AT_decl_column : 10
    <8f7>   DW_AT_type        : <0xf2>
    <8fb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8fe>: Abbrev Number: 9 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x957): signo
    <903>   DW_AT_decl_file   : 19
    <904>   DW_AT_decl_line   : 243
    <905>   DW_AT_decl_column : 10
    <906>   DW_AT_type        : <0xf2>
    <90a>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><90d>: Abbrev Number: 9 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <912>   DW_AT_decl_file   : 19
    <913>   DW_AT_decl_line   : 244
    <914>   DW_AT_decl_column : 11
    <915>   DW_AT_type        : <0xfe>
    <919>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><91c>: Abbrev Number: 9 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0xce7): delay_idx
    <921>   DW_AT_decl_file   : 19
    <922>   DW_AT_decl_line   : 245
    <923>   DW_AT_decl_column : 11
    <924>   DW_AT_type        : <0xfe>
    <928>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><92b>: Abbrev Number: 9 (DW_TAG_member)
    <92c>   DW_AT_name        : (indirect string, offset: 0x55d): poke_idx
    <930>   DW_AT_decl_file   : 19
    <931>   DW_AT_decl_line   : 246
    <932>   DW_AT_decl_column : 11
    <933>   DW_AT_type        : <0xfe>
    <937>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><93a>: Abbrev Number: 9 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <93f>   DW_AT_decl_file   : 19
    <940>   DW_AT_decl_line   : 247
    <941>   DW_AT_decl_column : 11
    <942>   DW_AT_type        : <0xfe>
    <946>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><949>: Abbrev Number: 0
 <1><94a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <94b>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <94f>   DW_AT_byte_size   : 16
    <950>   DW_AT_decl_file   : 19
    <951>   DW_AT_decl_line   : 250
    <952>   DW_AT_decl_column : 8
    <953>   DW_AT_sibling     : <0x994>
 <2><957>: Abbrev Number: 9 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0xa47): first
    <95c>   DW_AT_decl_file   : 19
    <95d>   DW_AT_decl_line   : 251
    <95e>   DW_AT_decl_column : 11
    <95f>   DW_AT_type        : <0xfe>
    <963>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><966>: Abbrev Number: 9 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x1117): last
    <96b>   DW_AT_decl_file   : 19
    <96c>   DW_AT_decl_line   : 252
    <96d>   DW_AT_decl_column : 11
    <96e>   DW_AT_type        : <0xfe>
    <972>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><975>: Abbrev Number: 9 (DW_TAG_member)
    <976>   DW_AT_name        : (indirect string, offset: 0x3a3): step
    <97a>   DW_AT_decl_file   : 19
    <97b>   DW_AT_decl_line   : 253
    <97c>   DW_AT_decl_column : 11
    <97d>   DW_AT_type        : <0xfe>
    <981>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><984>: Abbrev Number: 9 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x10e9): data
    <989>   DW_AT_decl_file   : 19
    <98a>   DW_AT_decl_line   : 254
    <98b>   DW_AT_decl_column : 21
    <98c>   DW_AT_type        : <0x8e2>
    <990>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><993>: Abbrev Number: 0
 <1><994>: Abbrev Number: 10 (DW_TAG_array_type)
    <995>   DW_AT_type        : <0x561>
    <999>   DW_AT_sibling     : <0x9a4>
 <2><99d>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <99e>   DW_AT_type        : <0x2b>
    <9a2>   DW_AT_upper_bound : 5
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9a5>   DW_AT_name        : (indirect string, offset: 0xf13): staged_output_data
    <9a9>   DW_AT_declaration : 1
 <1><9aa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ab>   DW_AT_byte_size   : 4
    <9ac>   DW_AT_type        : <0x9a4>
 <1><9b0>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b1>   DW_AT_prototyped  : 1
    <9b2>   DW_AT_sibling     : <0x9bc>
 <2><9b6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9b7>   DW_AT_type        : <0xcd>
 <2><9bb>: Abbrev Number: 0
 <1><9bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bd>   DW_AT_byte_size   : 4
    <9be>   DW_AT_type        : <0x9b0>
 <1><9c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c3>   DW_AT_byte_size   : 4
    <9c4>   DW_AT_type        : <0x876>
 <1><9c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <9c9>   DW_AT_type        : <0x9c2>
 <1><9cd>: Abbrev Number: 10 (DW_TAG_array_type)
    <9ce>   DW_AT_type        : <0x9dd>
    <9d2>   DW_AT_sibling     : <0x9dd>
 <2><9d6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9d7>   DW_AT_type        : <0x2b>
    <9db>   DW_AT_upper_bound : 2
 <2><9dc>: Abbrev Number: 0
 <1><9dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9de>   DW_AT_byte_size   : 4
    <9df>   DW_AT_type        : <0x94a>
 <1><9e3>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9e8>   DW_AT_declaration : 1
 <1><9e9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ea>   DW_AT_byte_size   : 4
    <9eb>   DW_AT_type        : <0x9e3>
 <1><9ef>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x3be): tcb_wait_data
    <9f4>   DW_AT_declaration : 1
 <1><9f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f6>   DW_AT_byte_size   : 4
    <9f7>   DW_AT_type        : <0x9ef>
 <1><9fb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <a00>   DW_AT_declaration : 1
 <1><a01>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_type        : <0x9fb>
 <1><a07>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a08>   DW_AT_name        : (indirect string, offset: 0xef7): unwind_queue_t
    <a0c>   DW_AT_declaration : 1
 <1><a0d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0e>   DW_AT_byte_size   : 4
    <a0f>   DW_AT_type        : <0xa07>
 <1><a13>: Abbrev Number: 10 (DW_TAG_array_type)
    <a14>   DW_AT_type        : <0xe6>
    <a18>   DW_AT_sibling     : <0xa23>
 <2><a1c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a1d>   DW_AT_type        : <0x2b>
    <a21>   DW_AT_upper_bound : 15
 <2><a22>: Abbrev Number: 0
 <1><a23>: Abbrev Number: 12 (DW_TAG_variable)
    <a24>   DW_AT_name        : (indirect string, offset: 0xba0): stub_sysent
    <a28>   DW_AT_decl_file   : 19
    <a29>   DW_AT_decl_line   : 403
    <a2b>   DW_AT_decl_column : 28
    <a2c>   DW_AT_type        : <0x876>
    <a30>   DW_AT_external    : 1
    <a31>   DW_AT_declaration : 1
 <1><a32>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a33>   DW_AT_name        : (indirect string, offset: 0x10cc): xlat_type
    <a37>   DW_AT_encoding    : 7	(unsigned)
    <a38>   DW_AT_byte_size   : 4
    <a39>   DW_AT_type        : <0x2b>
    <a3d>   DW_AT_decl_file   : 20
    <a3e>   DW_AT_decl_line   : 13
    <a3f>   DW_AT_decl_column : 6
    <a40>   DW_AT_sibling     : <0xa57>
 <2><a44>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a45>   DW_AT_name        : (indirect string, offset: 0x2d8): XT_NORMAL
    <a49>   DW_AT_const_value : 0
 <2><a4a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4b>   DW_AT_name        : (indirect string, offset: 0xc6b): XT_SORTED
    <a4f>   DW_AT_const_value : 1
 <2><a50>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a51>   DW_AT_name        : (indirect string, offset: 0xdd5): XT_INDEXED
    <a55>   DW_AT_const_value : 2
 <2><a56>: Abbrev Number: 0
 <1><a57>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a58>   DW_AT_name        : (indirect string, offset: 0xbcc): xlat_style
    <a5c>   DW_AT_encoding    : 7	(unsigned)
    <a5d>   DW_AT_byte_size   : 4
    <a5e>   DW_AT_type        : <0x2b>
    <a62>   DW_AT_decl_file   : 20
    <a63>   DW_AT_decl_line   : 19
    <a64>   DW_AT_decl_column : 6
    <a65>   DW_AT_sibling     : <0xa94>
 <2><a69>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a6e>   DW_AT_const_value : 0
 <2><a6f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0xc07): XLAT_STYLE_RAW
    <a74>   DW_AT_const_value : 1
 <2><a75>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x1097): XLAT_STYLE_ABBREV
    <a7a>   DW_AT_const_value : 2
 <2><a7b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x2f5): XLAT_STYLE_VERBOSE
    <a80>   DW_AT_const_value : 3
 <2><a81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a86>   DW_AT_const_value : 0
 <2><a87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a8c>   DW_AT_const_value : 4
 <2><a8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x1106): XLAT_STYLE_FMT_D
    <a92>   DW_AT_const_value : 8
 <2><a93>: Abbrev Number: 0
 <1><a94>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a95>   DW_AT_name        : (indirect string, offset: 0x326): xlat_data
    <a99>   DW_AT_byte_size   : 12
    <a9a>   DW_AT_decl_file   : 20
    <a9b>   DW_AT_decl_line   : 51
    <a9c>   DW_AT_decl_column : 8
    <a9d>   DW_AT_sibling     : <0xac0>
 <2><aa1>: Abbrev Number: 18 (DW_TAG_member)
    <aa2>   DW_AT_name        : val
    <aa6>   DW_AT_decl_file   : 20
    <aa7>   DW_AT_decl_line   : 52
    <aa8>   DW_AT_decl_column : 11
    <aa9>   DW_AT_type        : <0x116>
    <aad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab0>: Abbrev Number: 18 (DW_TAG_member)
    <ab1>   DW_AT_name        : str
    <ab5>   DW_AT_decl_file   : 20
    <ab6>   DW_AT_decl_line   : 53
    <ab7>   DW_AT_decl_column : 14
    <ab8>   DW_AT_type        : <0x1d9>
    <abc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><abf>: Abbrev Number: 0
 <1><ac0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac1>   DW_AT_type        : <0xa94>
 <1><ac5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aca>   DW_AT_byte_size   : 24
    <acb>   DW_AT_decl_file   : 20
    <acc>   DW_AT_decl_line   : 56
    <acd>   DW_AT_decl_column : 8
    <ace>   DW_AT_sibling     : <0xb1e>
 <2><ad2>: Abbrev Number: 9 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x10e9): data
    <ad7>   DW_AT_decl_file   : 20
    <ad8>   DW_AT_decl_line   : 57
    <ad9>   DW_AT_decl_column : 26
    <ada>   DW_AT_type        : <0xb23>
    <ade>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae1>: Abbrev Number: 9 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x891): flags_strsz
    <ae6>   DW_AT_decl_file   : 20
    <ae7>   DW_AT_decl_line   : 58
    <ae8>   DW_AT_decl_column : 9
    <ae9>   DW_AT_type        : <0x122>
    <aed>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af0>: Abbrev Number: 9 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0xb71): size
    <af5>   DW_AT_decl_file   : 20
    <af6>   DW_AT_decl_line   : 59
    <af7>   DW_AT_decl_column : 11
    <af8>   DW_AT_type        : <0x10a>
    <afc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aff>: Abbrev Number: 9 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0x1a1): type
    <b04>   DW_AT_decl_file   : 20
    <b05>   DW_AT_decl_line   : 60
    <b06>   DW_AT_decl_column : 17
    <b07>   DW_AT_type        : <0xa32>
    <b0b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b0e>: Abbrev Number: 9 (DW_TAG_member)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x754): flags_mask
    <b13>   DW_AT_decl_file   : 20
    <b14>   DW_AT_decl_line   : 61
    <b15>   DW_AT_decl_column : 11
    <b16>   DW_AT_type        : <0x116>
    <b1a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b1d>: Abbrev Number: 0
 <1><b1e>: Abbrev Number: 3 (DW_TAG_const_type)
    <b1f>   DW_AT_type        : <0xac5>
 <1><b23>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b24>   DW_AT_byte_size   : 4
    <b25>   DW_AT_type        : <0xac0>
 <1><b29>: Abbrev Number: 10 (DW_TAG_array_type)
    <b2a>   DW_AT_type        : <0xb1e>
    <b2e>   DW_AT_sibling     : <0xb34>
 <2><b32>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b33>: Abbrev Number: 0
 <1><b34>: Abbrev Number: 3 (DW_TAG_const_type)
    <b35>   DW_AT_type        : <0xb29>
 <1><b39>: Abbrev Number: 12 (DW_TAG_variable)
    <b3a>   DW_AT_name        : (indirect string, offset: 0xe3e): addrfams
    <b3e>   DW_AT_decl_file   : 19
    <b3f>   DW_AT_decl_line   : 409
    <b41>   DW_AT_decl_column : 26
    <b42>   DW_AT_type        : <0xb34>
    <b46>   DW_AT_external    : 1
    <b47>   DW_AT_declaration : 1
 <1><b48>: Abbrev Number: 12 (DW_TAG_variable)
    <b49>   DW_AT_name        : (indirect string, offset: 0xd22): arp_hardware_types
    <b4d>   DW_AT_decl_file   : 19
    <b4e>   DW_AT_decl_line   : 410
    <b50>   DW_AT_decl_column : 26
    <b51>   DW_AT_type        : <0xb34>
    <b55>   DW_AT_external    : 1
    <b56>   DW_AT_declaration : 1
 <1><b57>: Abbrev Number: 12 (DW_TAG_variable)
    <b58>   DW_AT_name        : (indirect string, offset: 0x100c): at_flags
    <b5c>   DW_AT_decl_file   : 19
    <b5d>   DW_AT_decl_line   : 411
    <b5f>   DW_AT_decl_column : 26
    <b60>   DW_AT_type        : <0xb34>
    <b64>   DW_AT_external    : 1
    <b65>   DW_AT_declaration : 1
 <1><b66>: Abbrev Number: 12 (DW_TAG_variable)
    <b67>   DW_AT_name        : (indirect string, offset: 0x493): clocknames
    <b6b>   DW_AT_decl_file   : 19
    <b6c>   DW_AT_decl_line   : 412
    <b6e>   DW_AT_decl_column : 26
    <b6f>   DW_AT_type        : <0xb34>
    <b73>   DW_AT_external    : 1
    <b74>   DW_AT_declaration : 1
 <1><b75>: Abbrev Number: 12 (DW_TAG_variable)
    <b76>   DW_AT_name        : (indirect string, offset: 0xfc3): dirent_types
    <b7a>   DW_AT_decl_file   : 19
    <b7b>   DW_AT_decl_line   : 413
    <b7d>   DW_AT_decl_column : 26
    <b7e>   DW_AT_type        : <0xb34>
    <b82>   DW_AT_external    : 1
    <b83>   DW_AT_declaration : 1
 <1><b84>: Abbrev Number: 12 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x8e2): ethernet_protocols
    <b89>   DW_AT_decl_file   : 19
    <b8a>   DW_AT_decl_line   : 414
    <b8c>   DW_AT_decl_column : 26
    <b8d>   DW_AT_type        : <0xb34>
    <b91>   DW_AT_external    : 1
    <b92>   DW_AT_declaration : 1
 <1><b93>: Abbrev Number: 12 (DW_TAG_variable)
    <b94>   DW_AT_name        : (indirect string, offset: 0x5b0): inet_protocols
    <b98>   DW_AT_decl_file   : 19
    <b99>   DW_AT_decl_line   : 415
    <b9b>   DW_AT_decl_column : 26
    <b9c>   DW_AT_type        : <0xb34>
    <ba0>   DW_AT_external    : 1
    <ba1>   DW_AT_declaration : 1
 <1><ba2>: Abbrev Number: 12 (DW_TAG_variable)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x2c5): evdev_abs
    <ba7>   DW_AT_decl_file   : 19
    <ba8>   DW_AT_decl_line   : 416
    <baa>   DW_AT_decl_column : 26
    <bab>   DW_AT_type        : <0xb34>
    <baf>   DW_AT_external    : 1
    <bb0>   DW_AT_declaration : 1
 <1><bb1>: Abbrev Number: 12 (DW_TAG_variable)
    <bb2>   DW_AT_name        : (indirect string, offset: 0x749): audit_arch
    <bb6>   DW_AT_decl_file   : 19
    <bb7>   DW_AT_decl_line   : 417
    <bb9>   DW_AT_decl_column : 26
    <bba>   DW_AT_type        : <0xb34>
    <bbe>   DW_AT_external    : 1
    <bbf>   DW_AT_declaration : 1
 <1><bc0>: Abbrev Number: 12 (DW_TAG_variable)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bc5>   DW_AT_decl_file   : 19
    <bc6>   DW_AT_decl_line   : 418
    <bc8>   DW_AT_decl_column : 26
    <bc9>   DW_AT_type        : <0xb34>
    <bcd>   DW_AT_external    : 1
    <bce>   DW_AT_declaration : 1
 <1><bcf>: Abbrev Number: 12 (DW_TAG_variable)
    <bd0>   DW_AT_name        : (indirect string, offset: 0x474): iffflags
    <bd4>   DW_AT_decl_file   : 19
    <bd5>   DW_AT_decl_line   : 419
    <bd7>   DW_AT_decl_column : 26
    <bd8>   DW_AT_type        : <0xb34>
    <bdc>   DW_AT_external    : 1
    <bdd>   DW_AT_declaration : 1
 <1><bde>: Abbrev Number: 12 (DW_TAG_variable)
    <bdf>   DW_AT_name        : (indirect string, offset: 0xc16): ip_type_of_services
    <be3>   DW_AT_decl_file   : 19
    <be4>   DW_AT_decl_line   : 420
    <be6>   DW_AT_decl_column : 26
    <be7>   DW_AT_type        : <0xb34>
    <beb>   DW_AT_external    : 1
    <bec>   DW_AT_declaration : 1
 <1><bed>: Abbrev Number: 12 (DW_TAG_variable)
    <bee>   DW_AT_name        : (indirect string, offset: 0x6bf): ipc_private
    <bf2>   DW_AT_decl_file   : 19
    <bf3>   DW_AT_decl_line   : 421
    <bf5>   DW_AT_decl_column : 26
    <bf6>   DW_AT_type        : <0xb34>
    <bfa>   DW_AT_external    : 1
    <bfb>   DW_AT_declaration : 1
 <1><bfc>: Abbrev Number: 12 (DW_TAG_variable)
    <bfd>   DW_AT_name        : (indirect string, offset: 0x31c): msg_flags
    <c01>   DW_AT_decl_file   : 19
    <c02>   DW_AT_decl_line   : 422
    <c04>   DW_AT_decl_column : 26
    <c05>   DW_AT_type        : <0xb34>
    <c09>   DW_AT_external    : 1
    <c0a>   DW_AT_declaration : 1
 <1><c0b>: Abbrev Number: 12 (DW_TAG_variable)
    <c0c>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c10>   DW_AT_decl_file   : 19
    <c11>   DW_AT_decl_line   : 423
    <c13>   DW_AT_decl_column : 26
    <c14>   DW_AT_type        : <0xb34>
    <c18>   DW_AT_external    : 1
    <c19>   DW_AT_declaration : 1
 <1><c1a>: Abbrev Number: 12 (DW_TAG_variable)
    <c1b>   DW_AT_name        : (indirect string, offset: 0xf26): nl_bridge_vlan_flags
    <c1f>   DW_AT_decl_file   : 19
    <c20>   DW_AT_decl_line   : 424
    <c22>   DW_AT_decl_column : 26
    <c23>   DW_AT_type        : <0xb34>
    <c27>   DW_AT_external    : 1
    <c28>   DW_AT_declaration : 1
 <1><c29>: Abbrev Number: 12 (DW_TAG_variable)
    <c2a>   DW_AT_name        : (indirect string, offset: 0xdbe): nl_netfilter_msg_types
    <c2e>   DW_AT_decl_file   : 19
    <c2f>   DW_AT_decl_line   : 425
    <c31>   DW_AT_decl_column : 26
    <c32>   DW_AT_type        : <0xb34>
    <c36>   DW_AT_external    : 1
    <c37>   DW_AT_declaration : 1
 <1><c38>: Abbrev Number: 12 (DW_TAG_variable)
    <c39>   DW_AT_name        : (indirect string, offset: 0x456): nl_route_types
    <c3d>   DW_AT_decl_file   : 19
    <c3e>   DW_AT_decl_line   : 426
    <c40>   DW_AT_decl_column : 26
    <c41>   DW_AT_type        : <0xb34>
    <c45>   DW_AT_external    : 1
    <c46>   DW_AT_declaration : 1
 <1><c47>: Abbrev Number: 12 (DW_TAG_variable)
    <c48>   DW_AT_name        : (indirect string, offset: 0xe75): open_access_modes
    <c4c>   DW_AT_decl_file   : 19
    <c4d>   DW_AT_decl_line   : 427
    <c4f>   DW_AT_decl_column : 26
    <c50>   DW_AT_type        : <0xb34>
    <c54>   DW_AT_external    : 1
    <c55>   DW_AT_declaration : 1
 <1><c56>: Abbrev Number: 12 (DW_TAG_variable)
    <c57>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c5b>   DW_AT_decl_file   : 19
    <c5c>   DW_AT_decl_line   : 428
    <c5e>   DW_AT_decl_column : 26
    <c5f>   DW_AT_type        : <0xb34>
    <c63>   DW_AT_external    : 1
    <c64>   DW_AT_declaration : 1
 <1><c65>: Abbrev Number: 12 (DW_TAG_variable)
    <c66>   DW_AT_name        : (indirect string, offset: 0xc47): perf_type_id
    <c6a>   DW_AT_decl_file   : 19
    <c6b>   DW_AT_decl_line   : 429
    <c6d>   DW_AT_decl_column : 26
    <c6e>   DW_AT_type        : <0xb34>
    <c72>   DW_AT_external    : 1
    <c73>   DW_AT_declaration : 1
 <1><c74>: Abbrev Number: 12 (DW_TAG_variable)
    <c75>   DW_AT_name        : (indirect string, offset: 0xe47): pollflags
    <c79>   DW_AT_decl_file   : 19
    <c7a>   DW_AT_decl_line   : 430
    <c7c>   DW_AT_decl_column : 26
    <c7d>   DW_AT_type        : <0xb34>
    <c81>   DW_AT_external    : 1
    <c82>   DW_AT_declaration : 1
 <1><c83>: Abbrev Number: 12 (DW_TAG_variable)
    <c84>   DW_AT_name        : (indirect string, offset: 0x551): ptrace_cmds
    <c88>   DW_AT_decl_file   : 19
    <c89>   DW_AT_decl_line   : 431
    <c8b>   DW_AT_decl_column : 26
    <c8c>   DW_AT_type        : <0xb34>
    <c90>   DW_AT_external    : 1
    <c91>   DW_AT_declaration : 1
 <1><c92>: Abbrev Number: 12 (DW_TAG_variable)
    <c93>   DW_AT_name        : (indirect string, offset: 0x824): resource_flags
    <c97>   DW_AT_decl_file   : 19
    <c98>   DW_AT_decl_line   : 432
    <c9a>   DW_AT_decl_column : 26
    <c9b>   DW_AT_type        : <0xb34>
    <c9f>   DW_AT_external    : 1
    <ca0>   DW_AT_declaration : 1
 <1><ca1>: Abbrev Number: 12 (DW_TAG_variable)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x287): route_nexthop_flags
    <ca6>   DW_AT_decl_file   : 19
    <ca7>   DW_AT_decl_line   : 433
    <ca9>   DW_AT_decl_column : 26
    <caa>   DW_AT_type        : <0xb34>
    <cae>   DW_AT_external    : 1
    <caf>   DW_AT_declaration : 1
 <1><cb0>: Abbrev Number: 12 (DW_TAG_variable)
    <cb1>   DW_AT_name        : (indirect string, offset: 0xeb1): routing_protocols
    <cb5>   DW_AT_decl_file   : 19
    <cb6>   DW_AT_decl_line   : 434
    <cb8>   DW_AT_decl_column : 26
    <cb9>   DW_AT_type        : <0xb34>
    <cbd>   DW_AT_external    : 1
    <cbe>   DW_AT_declaration : 1
 <1><cbf>: Abbrev Number: 12 (DW_TAG_variable)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x465): routing_scopes
    <cc4>   DW_AT_decl_file   : 19
    <cc5>   DW_AT_decl_line   : 435
    <cc7>   DW_AT_decl_column : 26
    <cc8>   DW_AT_type        : <0xb34>
    <ccc>   DW_AT_external    : 1
    <ccd>   DW_AT_declaration : 1
 <1><cce>: Abbrev Number: 12 (DW_TAG_variable)
    <ccf>   DW_AT_name        : (indirect string, offset: 0xdac): routing_table_ids
    <cd3>   DW_AT_decl_file   : 19
    <cd4>   DW_AT_decl_line   : 436
    <cd6>   DW_AT_decl_column : 26
    <cd7>   DW_AT_type        : <0xb34>
    <cdb>   DW_AT_external    : 1
    <cdc>   DW_AT_declaration : 1
 <1><cdd>: Abbrev Number: 12 (DW_TAG_variable)
    <cde>   DW_AT_name        : (indirect string, offset: 0x689): routing_types
    <ce2>   DW_AT_decl_file   : 19
    <ce3>   DW_AT_decl_line   : 437
    <ce5>   DW_AT_decl_column : 26
    <ce6>   DW_AT_type        : <0xb34>
    <cea>   DW_AT_external    : 1
    <ceb>   DW_AT_declaration : 1
 <1><cec>: Abbrev Number: 12 (DW_TAG_variable)
    <ced>   DW_AT_name        : (indirect string, offset: 0x1c5): rwf_flags
    <cf1>   DW_AT_decl_file   : 19
    <cf2>   DW_AT_decl_line   : 438
    <cf4>   DW_AT_decl_column : 26
    <cf5>   DW_AT_type        : <0xb34>
    <cf9>   DW_AT_external    : 1
    <cfa>   DW_AT_declaration : 1
 <1><cfb>: Abbrev Number: 12 (DW_TAG_variable)
    <cfc>   DW_AT_name        : (indirect string, offset: 0x85c): seccomp_filter_flags
    <d00>   DW_AT_decl_file   : 19
    <d01>   DW_AT_decl_line   : 439
    <d03>   DW_AT_decl_column : 26
    <d04>   DW_AT_type        : <0xb34>
    <d08>   DW_AT_external    : 1
    <d09>   DW_AT_declaration : 1
 <1><d0a>: Abbrev Number: 12 (DW_TAG_variable)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x2e2): seccomp_ret_action
    <d0f>   DW_AT_decl_file   : 19
    <d10>   DW_AT_decl_line   : 440
    <d12>   DW_AT_decl_column : 26
    <d13>   DW_AT_type        : <0xb34>
    <d17>   DW_AT_external    : 1
    <d18>   DW_AT_declaration : 1
 <1><d19>: Abbrev Number: 12 (DW_TAG_variable)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x428): setns_types
    <d1e>   DW_AT_decl_file   : 19
    <d1f>   DW_AT_decl_line   : 441
    <d21>   DW_AT_decl_column : 26
    <d22>   DW_AT_type        : <0xb34>
    <d26>   DW_AT_external    : 1
    <d27>   DW_AT_declaration : 1
 <1><d28>: Abbrev Number: 12 (DW_TAG_variable)
    <d29>   DW_AT_name        : (indirect string, offset: 0xe33): sg_io_info
    <d2d>   DW_AT_decl_file   : 19
    <d2e>   DW_AT_decl_line   : 442
    <d30>   DW_AT_decl_column : 26
    <d31>   DW_AT_type        : <0xb34>
    <d35>   DW_AT_external    : 1
    <d36>   DW_AT_declaration : 1
 <1><d37>: Abbrev Number: 12 (DW_TAG_variable)
    <d38>   DW_AT_name        : (indirect string, offset: 0xbb4): socketlayers
    <d3c>   DW_AT_decl_file   : 19
    <d3d>   DW_AT_decl_line   : 443
    <d3f>   DW_AT_decl_column : 26
    <d40>   DW_AT_type        : <0xb34>
    <d44>   DW_AT_external    : 1
    <d45>   DW_AT_declaration : 1
 <1><d46>: Abbrev Number: 12 (DW_TAG_variable)
    <d47>   DW_AT_name        : (indirect string, offset: 0xd96): socktypes
    <d4b>   DW_AT_decl_file   : 19
    <d4c>   DW_AT_decl_line   : 444
    <d4e>   DW_AT_decl_column : 26
    <d4f>   DW_AT_type        : <0xb34>
    <d53>   DW_AT_external    : 1
    <d54>   DW_AT_declaration : 1
 <1><d55>: Abbrev Number: 12 (DW_TAG_variable)
    <d56>   DW_AT_name        : (indirect string, offset: 0xa84): tcp_state_flags
    <d5a>   DW_AT_decl_file   : 19
    <d5b>   DW_AT_decl_line   : 445
    <d5d>   DW_AT_decl_column : 26
    <d5e>   DW_AT_type        : <0xb34>
    <d62>   DW_AT_external    : 1
    <d63>   DW_AT_declaration : 1
 <1><d64>: Abbrev Number: 12 (DW_TAG_variable)
    <d65>   DW_AT_name        : (indirect string, offset: 0x77e): tcp_states
    <d69>   DW_AT_decl_file   : 19
    <d6a>   DW_AT_decl_line   : 446
    <d6c>   DW_AT_decl_column : 26
    <d6d>   DW_AT_type        : <0xb34>
    <d71>   DW_AT_external    : 1
    <d72>   DW_AT_declaration : 1
 <1><d73>: Abbrev Number: 12 (DW_TAG_variable)
    <d74>   DW_AT_name        : (indirect string, offset: 0x107a): whence_codes
    <d78>   DW_AT_decl_file   : 19
    <d79>   DW_AT_decl_line   : 447
    <d7b>   DW_AT_decl_column : 26
    <d7c>   DW_AT_type        : <0xb34>
    <d80>   DW_AT_external    : 1
    <d81>   DW_AT_declaration : 1
 <1><d82>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d83>   DW_AT_encoding    : 7	(unsigned)
    <d84>   DW_AT_byte_size   : 4
    <d85>   DW_AT_type        : <0x2b>
    <d89>   DW_AT_decl_file   : 19
    <d8a>   DW_AT_decl_line   : 508
    <d8c>   DW_AT_decl_column : 14
    <d8d>   DW_AT_sibling     : <0xda4>
 <2><d91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0x9c1): CFLAG_NONE
    <d96>   DW_AT_const_value : 0
 <2><d97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d98>   DW_AT_name        : (indirect string, offset: 0x8f5): CFLAG_ONLY_STATS
    <d9c>   DW_AT_const_value : 1
 <2><d9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0xbc1): CFLAG_BOTH
    <da2>   DW_AT_const_value : 2
 <2><da3>: Abbrev Number: 0
 <1><da4>: Abbrev Number: 28 (DW_TAG_typedef)
    <da5>   DW_AT_name        : (indirect string, offset: 0x1125): cflag_t
    <da9>   DW_AT_decl_file   : 19
    <daa>   DW_AT_decl_line   : 512
    <dac>   DW_AT_decl_column : 3
    <dad>   DW_AT_type        : <0xd82>
 <1><db1>: Abbrev Number: 12 (DW_TAG_variable)
    <db2>   DW_AT_name        : (indirect string, offset: 0xce1): cflag
    <db6>   DW_AT_decl_file   : 19
    <db7>   DW_AT_decl_line   : 513
    <db9>   DW_AT_decl_column : 16
    <dba>   DW_AT_type        : <0xda4>
    <dbe>   DW_AT_external    : 1
    <dbf>   DW_AT_declaration : 1
 <1><dc0>: Abbrev Number: 12 (DW_TAG_variable)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <dc5>   DW_AT_decl_file   : 19
    <dc6>   DW_AT_decl_line   : 514
    <dc8>   DW_AT_decl_column : 13
    <dc9>   DW_AT_type        : <0x525>
    <dcd>   DW_AT_external    : 1
    <dce>   DW_AT_declaration : 1
 <1><dcf>: Abbrev Number: 12 (DW_TAG_variable)
    <dd0>   DW_AT_name        : (indirect string, offset: 0x7df): Tflag_scale
    <dd4>   DW_AT_decl_file   : 19
    <dd5>   DW_AT_decl_line   : 515
    <dd7>   DW_AT_decl_column : 12
    <dd8>   DW_AT_type        : <0x64>
    <ddc>   DW_AT_external    : 1
    <ddd>   DW_AT_declaration : 1
 <1><dde>: Abbrev Number: 12 (DW_TAG_variable)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x871): Tflag_width
    <de3>   DW_AT_decl_file   : 19
    <de4>   DW_AT_decl_line   : 516
    <de6>   DW_AT_decl_column : 12
    <de7>   DW_AT_type        : <0x64>
    <deb>   DW_AT_external    : 1
    <dec>   DW_AT_declaration : 1
 <1><ded>: Abbrev Number: 12 (DW_TAG_variable)
    <dee>   DW_AT_name        : (indirect string, offset: 0xe25): iflag
    <df2>   DW_AT_decl_file   : 19
    <df3>   DW_AT_decl_line   : 517
    <df5>   DW_AT_decl_column : 13
    <df6>   DW_AT_type        : <0x525>
    <dfa>   DW_AT_external    : 1
    <dfb>   DW_AT_declaration : 1
 <1><dfc>: Abbrev Number: 12 (DW_TAG_variable)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x591): count_wallclock
    <e01>   DW_AT_decl_file   : 19
    <e02>   DW_AT_decl_line   : 518
    <e04>   DW_AT_decl_column : 13
    <e05>   DW_AT_type        : <0x525>
    <e09>   DW_AT_external    : 1
    <e0a>   DW_AT_declaration : 1
 <1><e0b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e10>   DW_AT_byte_size   : 4
    <e11>   DW_AT_decl_file   : 19
    <e12>   DW_AT_decl_line   : 520
    <e14>   DW_AT_decl_column : 8
    <e15>   DW_AT_sibling     : <0xe2a>
 <2><e19>: Abbrev Number: 22 (DW_TAG_member)
    <e1a>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e1e>   DW_AT_decl_file   : 19
    <e1f>   DW_AT_decl_line   : 521
    <e21>   DW_AT_decl_column : 14
    <e22>   DW_AT_type        : <0x1d9>
    <e26>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e29>: Abbrev Number: 0
 <1><e2a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x789): path_set
    <e2f>   DW_AT_byte_size   : 12
    <e30>   DW_AT_decl_file   : 19
    <e31>   DW_AT_decl_line   : 525
    <e33>   DW_AT_decl_column : 15
    <e34>   DW_AT_sibling     : <0xe69>
 <2><e38>: Abbrev Number: 22 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0x717): paths_selected
    <e3d>   DW_AT_decl_file   : 19
    <e3e>   DW_AT_decl_line   : 526
    <e40>   DW_AT_decl_column : 24
    <e41>   DW_AT_type        : <0xe69>
    <e45>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e48>: Abbrev Number: 22 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x106d): num_selected
    <e4d>   DW_AT_decl_file   : 19
    <e4e>   DW_AT_decl_line   : 527
    <e50>   DW_AT_decl_column : 9
    <e51>   DW_AT_type        : <0x122>
    <e55>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e58>: Abbrev Number: 22 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0xb71): size
    <e5d>   DW_AT_decl_file   : 19
    <e5e>   DW_AT_decl_line   : 528
    <e60>   DW_AT_decl_column : 9
    <e61>   DW_AT_type        : <0x122>
    <e65>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6a>   DW_AT_byte_size   : 4
    <e6b>   DW_AT_type        : <0xe0b>
 <1><e6f>: Abbrev Number: 12 (DW_TAG_variable)
    <e70>   DW_AT_name        : (indirect string, offset: 0x10bc): global_path_set
    <e74>   DW_AT_decl_file   : 19
    <e75>   DW_AT_decl_line   : 529
    <e77>   DW_AT_decl_column : 3
    <e78>   DW_AT_type        : <0xe2a>
    <e7c>   DW_AT_external    : 1
    <e7d>   DW_AT_declaration : 1
 <1><e7e>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e7f>   DW_AT_name        : (indirect string, offset: 0xf9e): xflag_opts
    <e83>   DW_AT_encoding    : 7	(unsigned)
    <e84>   DW_AT_byte_size   : 4
    <e85>   DW_AT_type        : <0x2b>
    <e89>   DW_AT_decl_file   : 19
    <e8a>   DW_AT_decl_line   : 531
    <e8c>   DW_AT_decl_column : 6
    <e8d>   DW_AT_sibling     : <0xeb0>
 <2><e91>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e92>   DW_AT_name        : (indirect string, offset: 0xa3b): HEXSTR_NONE
    <e96>   DW_AT_const_value : 0
 <2><e97>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e98>   DW_AT_name        : (indirect string, offset: 0xfe5): HEXSTR_NON_ASCII
    <e9c>   DW_AT_const_value : 1
 <2><e9d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x942): HEXSTR_ALL
    <ea2>   DW_AT_const_value : 2
 <2><ea3>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x668): HEXSTR_NON_ASCII_CHARS
    <ea8>   DW_AT_const_value : 3
 <2><ea9>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x1087): NUM_HEXSTR_OPTS
    <eae>   DW_AT_const_value : 4
 <2><eaf>: Abbrev Number: 0
 <1><eb0>: Abbrev Number: 12 (DW_TAG_variable)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xdff): xflag
    <eb5>   DW_AT_decl_file   : 19
    <eb6>   DW_AT_decl_line   : 544
    <eb8>   DW_AT_decl_column : 17
    <eb9>   DW_AT_type        : <0x2b>
    <ebd>   DW_AT_external    : 1
    <ebe>   DW_AT_declaration : 1
 <1><ebf>: Abbrev Number: 12 (DW_TAG_variable)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xc9c): followfork
    <ec4>   DW_AT_decl_file   : 19
    <ec5>   DW_AT_decl_line   : 545
    <ec7>   DW_AT_decl_column : 13
    <ec8>   DW_AT_type        : <0x525>
    <ecc>   DW_AT_external    : 1
    <ecd>   DW_AT_declaration : 1
 <1><ece>: Abbrev Number: 12 (DW_TAG_variable)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x330): output_separately
    <ed3>   DW_AT_decl_file   : 19
    <ed4>   DW_AT_decl_line   : 546
    <ed6>   DW_AT_decl_column : 13
    <ed7>   DW_AT_type        : <0x525>
    <edb>   DW_AT_external    : 1
    <edc>   DW_AT_declaration : 1
 <1><edd>: Abbrev Number: 12 (DW_TAG_variable)
    <ede>   DW_AT_name        : (indirect string, offset: 0x22c): stack_trace_enabled
    <ee2>   DW_AT_decl_file   : 19
    <ee3>   DW_AT_decl_line   : 549
    <ee5>   DW_AT_decl_column : 13
    <ee6>   DW_AT_type        : <0x525>
    <eea>   DW_AT_external    : 1
    <eeb>   DW_AT_declaration : 1
 <1><eec>: Abbrev Number: 12 (DW_TAG_variable)
    <eed>   DW_AT_name        : (indirect string, offset: 0x656): ptrace_setoptions
    <ef1>   DW_AT_decl_file   : 19
    <ef2>   DW_AT_decl_line   : 553
    <ef4>   DW_AT_decl_column : 17
    <ef5>   DW_AT_type        : <0x2b>
    <ef9>   DW_AT_external    : 1
    <efa>   DW_AT_declaration : 1
 <1><efb>: Abbrev Number: 12 (DW_TAG_variable)
    <efc>   DW_AT_name        : (indirect string, offset: 0xa30): max_strlen
    <f00>   DW_AT_decl_file   : 19
    <f01>   DW_AT_decl_line   : 554
    <f03>   DW_AT_decl_column : 17
    <f04>   DW_AT_type        : <0x2b>
    <f08>   DW_AT_external    : 1
    <f09>   DW_AT_declaration : 1
 <1><f0a>: Abbrev Number: 12 (DW_TAG_variable)
    <f0b>   DW_AT_name        : (indirect string, offset: 0xa5e): os_release
    <f0f>   DW_AT_decl_file   : 19
    <f10>   DW_AT_decl_line   : 555
    <f12>   DW_AT_decl_column : 17
    <f13>   DW_AT_type        : <0x2b>
    <f17>   DW_AT_external    : 1
    <f18>   DW_AT_declaration : 1
 <1><f19>: Abbrev Number: 12 (DW_TAG_variable)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x726): xlat_verbosity
    <f1e>   DW_AT_decl_file   : 19
    <f1f>   DW_AT_decl_line   : 917
    <f21>   DW_AT_decl_column : 24
    <f22>   DW_AT_type        : <0xa57>
    <f26>   DW_AT_external    : 1
    <f27>   DW_AT_declaration : 1
 <1><f28>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f29>   DW_AT_name        : (indirect string, offset: 0x574): xlat_style_private_flag_bits
    <f2d>   DW_AT_encoding    : 7	(unsigned)
    <f2e>   DW_AT_byte_size   : 4
    <f2f>   DW_AT_type        : <0x2b>
    <f33>   DW_AT_decl_file   : 19
    <f34>   DW_AT_decl_line   : 937
    <f36>   DW_AT_decl_column : 6
    <f37>   DW_AT_sibling     : <0xf54>
 <2><f3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x2af): PAF_PRINT_INDICES_BIT
    <f40>   DW_AT_const_value : 5
 <2><f41>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0xb1e): PAF_ARRAY_TRUNCATED_BIT
    <f46>   DW_AT_const_value : 6
 <2><f47>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0x3e8): PXF_DEFAULT_STR_BIT
    <f4c>   DW_AT_const_value : 7
 <2><f4d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xc7e): SPFF_AUXSTR_MODE_BIT
    <f52>   DW_AT_const_value : 8
 <2><f53>: Abbrev Number: 0
 <1><f54>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f55>   DW_AT_name        : (indirect string, offset: 0xd35): find_xlat_flag_bits
    <f59>   DW_AT_encoding    : 7	(unsigned)
    <f5a>   DW_AT_byte_size   : 4
    <f5b>   DW_AT_type        : <0x2b>
    <f5f>   DW_AT_decl_file   : 19
    <f60>   DW_AT_decl_line   : 1441
    <f62>   DW_AT_decl_column : 6
    <f63>   DW_AT_sibling     : <0xf6e>
 <2><f67>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f68>   DW_AT_name        : (indirect string, offset: 0x97f): FXL_CASE_SENSITIVE_BIT
    <f6c>   DW_AT_const_value : 0
 <2><f6d>: Abbrev Number: 0
 <1><f6e>: Abbrev Number: 12 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xa0c): printing_tcp
    <f73>   DW_AT_decl_file   : 19
    <f74>   DW_AT_decl_line   : 1687
    <f76>   DW_AT_decl_column : 20
    <f77>   DW_AT_type        : <0x60d>
    <f7b>   DW_AT_external    : 1
    <f7c>   DW_AT_declaration : 1
 <1><f7d>: Abbrev Number: 12 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x53c): errnoent
    <f82>   DW_AT_decl_file   : 19
    <f83>   DW_AT_decl_line   : 1885
    <f85>   DW_AT_decl_column : 26
    <f86>   DW_AT_type        : <0x459>
    <f8a>   DW_AT_external    : 1
    <f8b>   DW_AT_declaration : 1
 <1><f8c>: Abbrev Number: 12 (DW_TAG_variable)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x87d): signalent
    <f91>   DW_AT_decl_file   : 19
    <f92>   DW_AT_decl_line   : 1886
    <f94>   DW_AT_decl_column : 26
    <f95>   DW_AT_type        : <0x459>
    <f99>   DW_AT_external    : 1
    <f9a>   DW_AT_declaration : 1
 <1><f9b>: Abbrev Number: 12 (DW_TAG_variable)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xe6d): nerrnos
    <fa0>   DW_AT_decl_file   : 19
    <fa1>   DW_AT_decl_line   : 1887
    <fa3>   DW_AT_decl_column : 27
    <fa4>   DW_AT_type        : <0x32>
    <fa8>   DW_AT_external    : 1
    <fa9>   DW_AT_declaration : 1
 <1><faa>: Abbrev Number: 12 (DW_TAG_variable)
    <fab>   DW_AT_name        : (indirect string, offset: 0x1045): nsignals
    <faf>   DW_AT_decl_file   : 19
    <fb0>   DW_AT_decl_line   : 1888
    <fb2>   DW_AT_decl_column : 27
    <fb3>   DW_AT_type        : <0x32>
    <fb7>   DW_AT_external    : 1
    <fb8>   DW_AT_declaration : 1
 <1><fb9>: Abbrev Number: 10 (DW_TAG_array_type)
    <fba>   DW_AT_type        : <0x876>
    <fbe>   DW_AT_sibling     : <0xfc4>
 <2><fc2>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc3>: Abbrev Number: 0
 <1><fc4>: Abbrev Number: 3 (DW_TAG_const_type)
    <fc5>   DW_AT_type        : <0xfb9>
 <1><fc9>: Abbrev Number: 12 (DW_TAG_variable)
    <fca>   DW_AT_name        : (indirect string, offset: 0xd00): sysent0
    <fce>   DW_AT_decl_file   : 19
    <fcf>   DW_AT_decl_line   : 1890
    <fd1>   DW_AT_decl_column : 28
    <fd2>   DW_AT_type        : <0xfc4>
    <fd6>   DW_AT_external    : 1
    <fd7>   DW_AT_declaration : 1
 <1><fd8>: Abbrev Number: 10 (DW_TAG_array_type)
    <fd9>   DW_AT_type        : <0x8dd>
    <fdd>   DW_AT_sibling     : <0xfe3>
 <2><fe1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fe2>: Abbrev Number: 0
 <1><fe3>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe4>   DW_AT_type        : <0xfd8>
 <1><fe8>: Abbrev Number: 12 (DW_TAG_variable)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x10b2): ioctlent0
    <fed>   DW_AT_decl_file   : 19
    <fee>   DW_AT_decl_line   : 1891
    <ff0>   DW_AT_decl_column : 30
    <ff1>   DW_AT_type        : <0xfe3>
    <ff5>   DW_AT_external    : 1
    <ff6>   DW_AT_declaration : 1
 <1><ff7>: Abbrev Number: 12 (DW_TAG_variable)
    <ff8>   DW_AT_name        : (indirect string, offset: 0xfa9): personality_names
    <ffc>   DW_AT_decl_file   : 19
    <ffd>   DW_AT_decl_line   : 1893
    <fff>   DW_AT_decl_column : 26
    <1000>   DW_AT_type        : <0x459>
    <1004>   DW_AT_external    : 1
    <1005>   DW_AT_declaration : 1
 <1><1006>: Abbrev Number: 12 (DW_TAG_variable)
    <1007>   DW_AT_name        : (indirect string, offset: 0x89d): sysent
    <100b>   DW_AT_decl_file   : 19
    <100c>   DW_AT_decl_line   : 1896
    <100e>   DW_AT_decl_column : 29
    <100f>   DW_AT_type        : <0x9c2>
    <1013>   DW_AT_external    : 1
    <1014>   DW_AT_declaration : 1
 <1><1015>: Abbrev Number: 12 (DW_TAG_variable)
    <1016>   DW_AT_name        : (indirect string, offset: 0xc93): ioctlent
    <101a>   DW_AT_decl_file   : 19
    <101b>   DW_AT_decl_line   : 1897
    <101d>   DW_AT_decl_column : 31
    <101e>   DW_AT_type        : <0x1024>
    <1022>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1024>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1025>   DW_AT_byte_size   : 4
    <1026>   DW_AT_type        : <0x8dd>
 <1><102a>: Abbrev Number: 12 (DW_TAG_variable)
    <102b>   DW_AT_name        : (indirect string, offset: 0x887): nsyscalls
    <102f>   DW_AT_decl_file   : 19
    <1030>   DW_AT_decl_line   : 1903
    <1032>   DW_AT_decl_column : 17
    <1033>   DW_AT_type        : <0x2b>
    <1037>   DW_AT_external    : 1
    <1038>   DW_AT_declaration : 1
 <1><1039>: Abbrev Number: 12 (DW_TAG_variable)
    <103a>   DW_AT_name        : (indirect string, offset: 0xe91): nioctlents
    <103e>   DW_AT_decl_file   : 19
    <103f>   DW_AT_decl_line   : 1904
    <1041>   DW_AT_decl_column : 17
    <1042>   DW_AT_type        : <0x2b>
    <1046>   DW_AT_external    : 1
    <1047>   DW_AT_declaration : 1
 <1><1048>: Abbrev Number: 10 (DW_TAG_array_type)
    <1049>   DW_AT_type        : <0x32>
    <104d>   DW_AT_sibling     : <0x1058>
 <2><1051>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1052>   DW_AT_type        : <0x2b>
    <1056>   DW_AT_upper_bound : 2
 <2><1057>: Abbrev Number: 0
 <1><1058>: Abbrev Number: 3 (DW_TAG_const_type)
    <1059>   DW_AT_type        : <0x1048>
 <1><105d>: Abbrev Number: 12 (DW_TAG_variable)
    <105e>   DW_AT_name        : (indirect string, offset: 0xf06): nsyscall_vec
    <1062>   DW_AT_decl_file   : 19
    <1063>   DW_AT_decl_line   : 1906
    <1065>   DW_AT_decl_column : 27
    <1066>   DW_AT_type        : <0x1058>
    <106a>   DW_AT_external    : 1
    <106b>   DW_AT_declaration : 1
 <1><106c>: Abbrev Number: 10 (DW_TAG_array_type)
    <106d>   DW_AT_type        : <0x9c8>
    <1071>   DW_AT_sibling     : <0x107c>
 <2><1075>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1076>   DW_AT_type        : <0x2b>
    <107a>   DW_AT_upper_bound : 2
 <2><107b>: Abbrev Number: 0
 <1><107c>: Abbrev Number: 3 (DW_TAG_const_type)
    <107d>   DW_AT_type        : <0x106c>
 <1><1081>: Abbrev Number: 12 (DW_TAG_variable)
    <1082>   DW_AT_name        : (indirect string, offset: 0x7cc): sysent_vec
    <1086>   DW_AT_decl_file   : 19
    <1087>   DW_AT_decl_line   : 1907
    <1089>   DW_AT_decl_column : 35
    <108a>   DW_AT_type        : <0x107c>
    <108e>   DW_AT_external    : 1
    <108f>   DW_AT_declaration : 1
 <1><1090>: Abbrev Number: 12 (DW_TAG_variable)
    <1091>   DW_AT_name        : (indirect string, offset: 0x389): inject_vec
    <1095>   DW_AT_decl_file   : 19
    <1096>   DW_AT_decl_line   : 1908
    <1098>   DW_AT_decl_column : 28
    <1099>   DW_AT_type        : <0x9cd>
    <109d>   DW_AT_external    : 1
    <109e>   DW_AT_declaration : 1
 <1><109f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a0>   DW_AT_name        : (indirect string, offset: 0xd89): audit_arch_t
    <10a4>   DW_AT_byte_size   : 8
    <10a5>   DW_AT_decl_file   : 19
    <10a6>   DW_AT_decl_line   : 1910
    <10a8>   DW_AT_decl_column : 8
    <10a9>   DW_AT_sibling     : <0x10ce>
 <2><10ad>: Abbrev Number: 22 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x566): arch
    <10b2>   DW_AT_decl_file   : 19
    <10b3>   DW_AT_decl_line   : 1911
    <10b5>   DW_AT_decl_column : 15
    <10b6>   DW_AT_type        : <0x2b>
    <10ba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10bd>: Abbrev Number: 22 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0x9f2): flag
    <10c2>   DW_AT_decl_file   : 19
    <10c3>   DW_AT_decl_line   : 1912
    <10c5>   DW_AT_decl_column : 15
    <10c6>   DW_AT_type        : <0x2b>
    <10ca>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10cd>: Abbrev Number: 0
 <1><10ce>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cf>   DW_AT_type        : <0x109f>
 <1><10d3>: Abbrev Number: 10 (DW_TAG_array_type)
    <10d4>   DW_AT_type        : <0x10ce>
    <10d8>   DW_AT_sibling     : <0x10e3>
 <2><10dc>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10dd>   DW_AT_type        : <0x2b>
    <10e1>   DW_AT_upper_bound : 2
 <2><10e2>: Abbrev Number: 0
 <1><10e3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e4>   DW_AT_type        : <0x10d3>
 <1><10e8>: Abbrev Number: 12 (DW_TAG_variable)
    <10e9>   DW_AT_name        : (indirect string, offset: 0x970): audit_arch_vec
    <10ed>   DW_AT_decl_file   : 19
    <10ee>   DW_AT_decl_line   : 1915
    <10f0>   DW_AT_decl_column : 34
    <10f1>   DW_AT_type        : <0x10e3>
    <10f5>   DW_AT_external    : 1
    <10f6>   DW_AT_declaration : 1
 <1><10f7>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10f8>   DW_AT_byte_size   : 180
    <10f9>   DW_AT_decl_file   : 21
    <10fa>   DW_AT_decl_line   : 2
    <10fb>   DW_AT_decl_column : 9
    <10fc>   DW_AT_sibling     : <0x13b1>
 <2><1100>: Abbrev Number: 9 (DW_TAG_member)
    <1101>   DW_AT_name        : (indirect string, offset: 0x1dd): block_ioctl
    <1105>   DW_AT_decl_file   : 21
    <1106>   DW_AT_decl_line   : 3
    <1107>   DW_AT_decl_column : 8
    <1108>   DW_AT_type        : <0x13cb>
    <110c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110f>: Abbrev Number: 9 (DW_TAG_member)
    <1110>   DW_AT_name        : (indirect string, offset: 0xabd): btrfs_ioctl
    <1114>   DW_AT_decl_file   : 21
    <1115>   DW_AT_decl_line   : 6
    <1116>   DW_AT_decl_column : 8
    <1117>   DW_AT_type        : <0x13cb>
    <111b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111e>: Abbrev Number: 9 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0x75f): evdev_write_ioctl_mpers
    <1123>   DW_AT_decl_file   : 21
    <1124>   DW_AT_decl_line   : 9
    <1125>   DW_AT_decl_column : 8
    <1126>   DW_AT_type        : <0x13cb>
    <112a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><112d>: Abbrev Number: 9 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0x735): get_sock_fprog_size
    <1132>   DW_AT_decl_file   : 21
    <1133>   DW_AT_decl_line   : 12
    <1134>   DW_AT_decl_column : 17
    <1135>   DW_AT_type        : <0x13d7>
    <1139>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><113c>: Abbrev Number: 9 (DW_TAG_member)
    <113d>   DW_AT_name        : (indirect string, offset: 0x1ac): fetch_bpf_fprog
    <1141>   DW_AT_decl_file   : 21
    <1142>   DW_AT_decl_line   : 15
    <1143>   DW_AT_decl_column : 10
    <1144>   DW_AT_type        : <0x13f7>
    <1148>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><114b>: Abbrev Number: 9 (DW_TAG_member)
    <114c>   DW_AT_name        : (indirect string, offset: 0x95d): fetch_struct_flock
