Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1678 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5ae): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3ab): mpers-m32/struct_sigset_addr_size.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb09): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x381): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xf9c): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x948): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x324): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x23a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xda5): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x477): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x84e): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe8f): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x87e): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x759): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb36): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb6c): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2a0): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcb8): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc2d): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3f1): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x43d): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x330): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb57): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf37): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xdb5): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe42): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x1072): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x124): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xacc): timespec
    <179>   DW_AT_byte_size   : 8
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x1087): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xc1>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xde6): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xd4>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 12
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xa8e): long double
 <1><1a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a8>   DW_AT_byte_size   : 16
    <1a9>   DW_AT_encoding    : 4	(float)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xf60): _Float128
 <1><1ae>: Abbrev Number: 13 (DW_TAG_variable)
    <1af>   DW_AT_name        : (indirect string, offset: 0x257): __environ
    <1b3>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 543
    <1b6>   DW_AT_decl_column : 15
    <1b7>   DW_AT_type        : <0x1bd>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1be>   DW_AT_byte_size   : 4
    <1bf>   DW_AT_type        : <0xe0>
 <1><1c3>: Abbrev Number: 13 (DW_TAG_variable)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x379): environ
    <1c8>   DW_AT_decl_file   : 7
    <1c9>   DW_AT_decl_line   : 545
    <1cb>   DW_AT_decl_column : 15
    <1cc>   DW_AT_type        : <0x1bd>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 14 (DW_TAG_variable)
    <1d3>   DW_AT_name        : (indirect string, offset: 0xf86): optarg
    <1d7>   DW_AT_decl_file   : 8
    <1d8>   DW_AT_decl_line   : 36
    <1d9>   DW_AT_decl_column : 14
    <1da>   DW_AT_type        : <0xe0>
    <1de>   DW_AT_external    : 1
    <1df>   DW_AT_declaration : 1
 <1><1e0>: Abbrev Number: 14 (DW_TAG_variable)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x72c): optind
    <1e5>   DW_AT_decl_file   : 8
    <1e6>   DW_AT_decl_line   : 50
    <1e7>   DW_AT_decl_column : 12
    <1e8>   DW_AT_type        : <0x64>
    <1ec>   DW_AT_external    : 1
    <1ed>   DW_AT_declaration : 1
 <1><1ee>: Abbrev Number: 14 (DW_TAG_variable)
    <1ef>   DW_AT_name        : (indirect string, offset: 0xc1c): opterr
    <1f3>   DW_AT_decl_file   : 8
    <1f4>   DW_AT_decl_line   : 55
    <1f5>   DW_AT_decl_column : 12
    <1f6>   DW_AT_type        : <0x64>
    <1fa>   DW_AT_external    : 1
    <1fb>   DW_AT_declaration : 1
 <1><1fc>: Abbrev Number: 14 (DW_TAG_variable)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x109a): optopt
    <201>   DW_AT_decl_file   : 8
    <202>   DW_AT_decl_line   : 59
    <203>   DW_AT_decl_column : 12
    <204>   DW_AT_type        : <0x64>
    <208>   DW_AT_external    : 1
    <209>   DW_AT_declaration : 1
 <1><20a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <20b>   DW_AT_byte_size   : 4
    <20c>   DW_AT_type        : <0xed>
 <1><210>: Abbrev Number: 3 (DW_TAG_const_type)
    <211>   DW_AT_type        : <0x20a>
 <1><215>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <216>   DW_AT_byte_size   : 4
    <217>   DW_AT_type        : <0x21b>
 <1><21b>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><21c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <21d>   DW_AT_name        : (indirect string, offset: 0x338): _IO_FILE
    <221>   DW_AT_byte_size   : 148
    <222>   DW_AT_decl_file   : 9
    <223>   DW_AT_decl_line   : 49
    <224>   DW_AT_decl_column : 8
    <225>   DW_AT_sibling     : <0x3dd>
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x9db): _flags
    <22e>   DW_AT_decl_file   : 9
    <22f>   DW_AT_decl_line   : 51
    <230>   DW_AT_decl_column : 7
    <231>   DW_AT_type        : <0x64>
    <235>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><238>: Abbrev Number: 9 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x4c6): _IO_read_ptr
    <23d>   DW_AT_decl_file   : 9
    <23e>   DW_AT_decl_line   : 54
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0xe0>
    <244>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><247>: Abbrev Number: 9 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0xee4): _IO_read_end
    <24c>   DW_AT_decl_file   : 9
    <24d>   DW_AT_decl_line   : 55
    <24e>   DW_AT_decl_column : 9
    <24f>   DW_AT_type        : <0xe0>
    <253>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><256>: Abbrev Number: 9 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x795): _IO_read_base
    <25b>   DW_AT_decl_file   : 9
    <25c>   DW_AT_decl_line   : 56
    <25d>   DW_AT_decl_column : 9
    <25e>   DW_AT_type        : <0xe0>
    <262>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><265>: Abbrev Number: 9 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x9bc): _IO_write_base
    <26a>   DW_AT_decl_file   : 9
    <26b>   DW_AT_decl_line   : 57
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0xe0>
    <271>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><274>: Abbrev Number: 9 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0xfd5): _IO_write_ptr
    <279>   DW_AT_decl_file   : 9
    <27a>   DW_AT_decl_line   : 58
    <27b>   DW_AT_decl_column : 9
    <27c>   DW_AT_type        : <0xe0>
    <280>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><283>: Abbrev Number: 9 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0x8c0): _IO_write_end
    <288>   DW_AT_decl_file   : 9
    <289>   DW_AT_decl_line   : 59
    <28a>   DW_AT_decl_column : 9
    <28b>   DW_AT_type        : <0xe0>
    <28f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><292>: Abbrev Number: 9 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x931): _IO_buf_base
    <297>   DW_AT_decl_file   : 9
    <298>   DW_AT_decl_line   : 60
    <299>   DW_AT_decl_column : 9
    <29a>   DW_AT_type        : <0xe0>
    <29e>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><2a1>: Abbrev Number: 9 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0xd50): _IO_buf_end
    <2a6>   DW_AT_decl_file   : 9
    <2a7>   DW_AT_decl_line   : 61
    <2a8>   DW_AT_decl_column : 9
    <2a9>   DW_AT_type        : <0xe0>
    <2ad>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2b0>: Abbrev Number: 9 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x1af): _IO_save_base
    <2b5>   DW_AT_decl_file   : 9
    <2b6>   DW_AT_decl_line   : 64
    <2b7>   DW_AT_decl_column : 9
    <2b8>   DW_AT_type        : <0xe0>
    <2bc>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2bf>: Abbrev Number: 9 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0xc7f): _IO_backup_base
    <2c4>   DW_AT_decl_file   : 9
    <2c5>   DW_AT_decl_line   : 65
    <2c6>   DW_AT_decl_column : 9
    <2c7>   DW_AT_type        : <0xe0>
    <2cb>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2ce>: Abbrev Number: 9 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2d3>   DW_AT_decl_file   : 9
    <2d4>   DW_AT_decl_line   : 66
    <2d5>   DW_AT_decl_column : 9
    <2d6>   DW_AT_type        : <0xe0>
    <2da>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2dd>: Abbrev Number: 9 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x55a): _markers
    <2e2>   DW_AT_decl_file   : 9
    <2e3>   DW_AT_decl_line   : 68
    <2e4>   DW_AT_decl_column : 22
    <2e5>   DW_AT_type        : <0x3f7>
    <2e9>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ec>: Abbrev Number: 9 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1f2): _chain
    <2f1>   DW_AT_decl_file   : 9
    <2f2>   DW_AT_decl_line   : 70
    <2f3>   DW_AT_decl_column : 20
    <2f4>   DW_AT_type        : <0x3fd>
    <2f8>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2fb>: Abbrev Number: 9 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0xf4b): _fileno
    <300>   DW_AT_decl_file   : 9
    <301>   DW_AT_decl_line   : 72
    <302>   DW_AT_decl_column : 7
    <303>   DW_AT_type        : <0x64>
    <307>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><30a>: Abbrev Number: 9 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x781): _flags2
    <30f>   DW_AT_decl_file   : 9
    <310>   DW_AT_decl_line   : 73
    <311>   DW_AT_decl_column : 7
    <312>   DW_AT_type        : <0x64>
    <316>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><319>: Abbrev Number: 9 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x7fa): _old_offset
    <31e>   DW_AT_decl_file   : 9
    <31f>   DW_AT_decl_line   : 74
    <320>   DW_AT_decl_column : 11
    <321>   DW_AT_type        : <0xa2>
    <325>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><328>: Abbrev Number: 9 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x225): _cur_column
    <32d>   DW_AT_decl_file   : 9
    <32e>   DW_AT_decl_line   : 77
    <32f>   DW_AT_decl_column : 18
    <330>   DW_AT_type        : <0x24>
    <334>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><337>: Abbrev Number: 9 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0xe0c): _vtable_offset
    <33c>   DW_AT_decl_file   : 9
    <33d>   DW_AT_decl_line   : 78
    <33e>   DW_AT_decl_column : 15
    <33f>   DW_AT_type        : <0x3e>
    <343>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><346>: Abbrev Number: 9 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0xc8f): _shortbuf
    <34b>   DW_AT_decl_file   : 9
    <34c>   DW_AT_decl_line   : 79
    <34d>   DW_AT_decl_column : 8
    <34e>   DW_AT_type        : <0x403>
    <352>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><355>: Abbrev Number: 9 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x15f): _lock
    <35a>   DW_AT_decl_file   : 9
    <35b>   DW_AT_decl_line   : 81
    <35c>   DW_AT_decl_column : 15
    <35d>   DW_AT_type        : <0x413>
    <361>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><364>: Abbrev Number: 9 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x6c4): _offset
    <369>   DW_AT_decl_file   : 9
    <36a>   DW_AT_decl_line   : 89
    <36b>   DW_AT_decl_column : 13
    <36c>   DW_AT_type        : <0xb5>
    <370>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><373>: Abbrev Number: 9 (DW_TAG_member)
    <374>   DW_AT_name        : (indirect string, offset: 0xa1b): _codecvt
    <378>   DW_AT_decl_file   : 9
    <379>   DW_AT_decl_line   : 91
    <37a>   DW_AT_decl_column : 23
    <37b>   DW_AT_type        : <0x41f>
    <37f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><382>: Abbrev Number: 9 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf6a): _wide_data
    <387>   DW_AT_decl_file   : 9
    <388>   DW_AT_decl_line   : 92
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0x42b>
    <38e>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><391>: Abbrev Number: 9 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x39d): _freeres_list
    <396>   DW_AT_decl_file   : 9
    <397>   DW_AT_decl_line   : 93
    <398>   DW_AT_decl_column : 20
    <399>   DW_AT_type        : <0x3fd>
    <39d>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><3a0>: Abbrev Number: 9 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0xbf2): _freeres_buf
    <3a5>   DW_AT_decl_file   : 9
    <3a6>   DW_AT_decl_line   : 94
    <3a7>   DW_AT_decl_column : 9
    <3a8>   DW_AT_type        : <0xcd>
    <3ac>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><3af>: Abbrev Number: 9 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x98e): __pad5
    <3b4>   DW_AT_decl_file   : 9
    <3b5>   DW_AT_decl_line   : 95
    <3b6>   DW_AT_decl_column : 10
    <3b7>   DW_AT_type        : <0x122>
    <3bb>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3be>: Abbrev Number: 9 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x9ff): _mode
    <3c3>   DW_AT_decl_file   : 9
    <3c4>   DW_AT_decl_line   : 96
    <3c5>   DW_AT_decl_column : 7
    <3c6>   DW_AT_type        : <0x64>
    <3ca>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3cd>: Abbrev Number: 9 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x7af): _unused2
    <3d2>   DW_AT_decl_file   : 9
    <3d3>   DW_AT_decl_line   : 98
    <3d4>   DW_AT_decl_column : 8
    <3d5>   DW_AT_type        : <0x431>
    <3d9>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3dc>: Abbrev Number: 0
 <1><3dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0xaae): FILE
    <3e2>   DW_AT_decl_file   : 10
    <3e3>   DW_AT_decl_line   : 7
    <3e4>   DW_AT_decl_column : 25
    <3e5>   DW_AT_type        : <0x21c>
 <1><3e9>: Abbrev Number: 16 (DW_TAG_typedef)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x46c): _IO_lock_t
    <3ee>   DW_AT_decl_file   : 9
    <3ef>   DW_AT_decl_line   : 43
    <3f0>   DW_AT_decl_column : 14
 <1><3f1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x2e2): _IO_marker
    <3f6>   DW_AT_declaration : 1
 <1><3f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f8>   DW_AT_byte_size   : 4
    <3f9>   DW_AT_type        : <0x3f1>
 <1><3fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fe>   DW_AT_byte_size   : 4
    <3ff>   DW_AT_type        : <0x21c>
 <1><403>: Abbrev Number: 10 (DW_TAG_array_type)
    <404>   DW_AT_type        : <0xe6>
    <408>   DW_AT_sibling     : <0x413>
 <2><40c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40d>   DW_AT_type        : <0x2b>
    <411>   DW_AT_upper_bound : 0
 <2><412>: Abbrev Number: 0
 <1><413>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_type        : <0x3e9>
 <1><419>: Abbrev Number: 17 (DW_TAG_structure_type)
    <41a>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <41e>   DW_AT_declaration : 1
 <1><41f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <420>   DW_AT_byte_size   : 4
    <421>   DW_AT_type        : <0x419>
 <1><425>: Abbrev Number: 17 (DW_TAG_structure_type)
    <426>   DW_AT_name        : (indirect string, offset: 0x34c): _IO_wide_data
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <42c>   DW_AT_byte_size   : 4
    <42d>   DW_AT_type        : <0x425>
 <1><431>: Abbrev Number: 10 (DW_TAG_array_type)
    <432>   DW_AT_type        : <0xe6>
    <436>   DW_AT_sibling     : <0x441>
 <2><43a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <43b>   DW_AT_type        : <0x2b>
    <43f>   DW_AT_upper_bound : 39
 <2><440>: Abbrev Number: 0
 <1><441>: Abbrev Number: 14 (DW_TAG_variable)
    <442>   DW_AT_name        : (indirect string, offset: 0x525): stdin
    <446>   DW_AT_decl_file   : 11
    <447>   DW_AT_decl_line   : 137
    <448>   DW_AT_decl_column : 14
    <449>   DW_AT_type        : <0x44f>
    <44d>   DW_AT_external    : 1
    <44e>   DW_AT_declaration : 1
 <1><44f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <450>   DW_AT_byte_size   : 4
    <451>   DW_AT_type        : <0x3dd>
 <1><455>: Abbrev Number: 14 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0xfaf): stdout
    <45a>   DW_AT_decl_file   : 11
    <45b>   DW_AT_decl_line   : 138
    <45c>   DW_AT_decl_column : 14
    <45d>   DW_AT_type        : <0x44f>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 14 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xd9e): stderr
    <468>   DW_AT_decl_file   : 11
    <469>   DW_AT_decl_line   : 139
    <46a>   DW_AT_decl_column : 14
    <46b>   DW_AT_type        : <0x44f>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 14 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x231): sys_nerr
    <476>   DW_AT_decl_file   : 12
    <477>   DW_AT_decl_line   : 26
    <478>   DW_AT_decl_column : 12
    <479>   DW_AT_type        : <0x64>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 10 (DW_TAG_array_type)
    <480>   DW_AT_type        : <0x210>
    <484>   DW_AT_sibling     : <0x48a>
 <2><488>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><489>: Abbrev Number: 0
 <1><48a>: Abbrev Number: 3 (DW_TAG_const_type)
    <48b>   DW_AT_type        : <0x47f>
 <1><48f>: Abbrev Number: 14 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0x534): sys_errlist
    <494>   DW_AT_decl_file   : 12
    <495>   DW_AT_decl_line   : 27
    <496>   DW_AT_decl_column : 26
    <497>   DW_AT_type        : <0x48a>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 14 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x244): _sys_nerr
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 30
    <4a4>   DW_AT_decl_column : 12
    <4a5>   DW_AT_type        : <0x64>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 14 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xe1b): _sys_errlist
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 31
    <4b2>   DW_AT_decl_column : 26
    <4b3>   DW_AT_type        : <0x48a>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 14 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x69d): program_invocation_name
    <4be>   DW_AT_decl_file   : 13
    <4bf>   DW_AT_decl_line   : 45
    <4c0>   DW_AT_decl_column : 14
    <4c1>   DW_AT_type        : <0xe0>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 14 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xb97): program_invocation_short_name
    <4cc>   DW_AT_decl_file   : 13
    <4cd>   DW_AT_decl_line   : 46
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0xe0>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 10 (DW_TAG_array_type)
    <4d6>   DW_AT_type        : <0xe0>
    <4da>   DW_AT_sibling     : <0x4e5>
 <2><4de>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4df>   DW_AT_type        : <0x2b>
    <4e3>   DW_AT_upper_bound : 1
 <2><4e4>: Abbrev Number: 0
 <1><4e5>: Abbrev Number: 14 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x19c): __tzname
    <4ea>   DW_AT_decl_file   : 14
    <4eb>   DW_AT_decl_line   : 159
    <4ec>   DW_AT_decl_column : 14
    <4ed>   DW_AT_type        : <0x4d5>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 14 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0xe76): __daylight
    <4f8>   DW_AT_decl_file   : 14
    <4f9>   DW_AT_decl_line   : 160
    <4fa>   DW_AT_decl_column : 12
    <4fb>   DW_AT_type        : <0x64>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 14 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0x341): __timezone
    <506>   DW_AT_decl_file   : 14
    <507>   DW_AT_decl_line   : 161
    <508>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xae>
    <50d>   DW_AT_external    : 1
    <50e>   DW_AT_declaration : 1
 <1><50f>: Abbrev Number: 14 (DW_TAG_variable)
    <510>   DW_AT_name        : (indirect string, offset: 0x987): tzname
    <514>   DW_AT_decl_file   : 14
    <515>   DW_AT_decl_line   : 166
    <516>   DW_AT_decl_column : 14
    <517>   DW_AT_type        : <0x4d5>
    <51b>   DW_AT_external    : 1
    <51c>   DW_AT_declaration : 1
 <1><51d>: Abbrev Number: 14 (DW_TAG_variable)
    <51e>   DW_AT_name        : (indirect string, offset: 0x101f): daylight
    <522>   DW_AT_decl_file   : 14
    <523>   DW_AT_decl_line   : 174
    <524>   DW_AT_decl_column : 12
    <525>   DW_AT_type        : <0x64>
    <529>   DW_AT_external    : 1
    <52a>   DW_AT_declaration : 1
 <1><52b>: Abbrev Number: 14 (DW_TAG_variable)
    <52c>   DW_AT_name        : (indirect string, offset: 0x4b1): timezone
    <530>   DW_AT_decl_file   : 14
    <531>   DW_AT_decl_line   : 175
    <532>   DW_AT_decl_column : 17
    <533>   DW_AT_type        : <0xae>
    <537>   DW_AT_external    : 1
    <538>   DW_AT_declaration : 1
 <1><539>: Abbrev Number: 13 (DW_TAG_variable)
    <53a>   DW_AT_name        : (indirect string, offset: 0xf0b): getdate_err
    <53e>   DW_AT_decl_file   : 14
    <53f>   DW_AT_decl_line   : 274
    <541>   DW_AT_decl_column : 12
    <542>   DW_AT_type        : <0x64>
    <546>   DW_AT_external    : 1
    <547>   DW_AT_declaration : 1
 <1><548>: Abbrev Number: 14 (DW_TAG_variable)
    <549>   DW_AT_name        : (indirect string, offset: 0x99a): debug_flag
    <54d>   DW_AT_decl_file   : 15
    <54e>   DW_AT_decl_line   : 20
    <54f>   DW_AT_decl_column : 13
    <550>   DW_AT_type        : <0x556>
    <554>   DW_AT_external    : 1
    <555>   DW_AT_declaration : 1
 <1><556>: Abbrev Number: 2 (DW_TAG_base_type)
    <557>   DW_AT_byte_size   : 1
    <558>   DW_AT_encoding    : 2	(boolean)
    <559>   DW_AT_name        : (indirect string, offset: 0x403): _Bool
 <1><55d>: Abbrev Number: 3 (DW_TAG_const_type)
    <55e>   DW_AT_type        : <0x556>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0xa5f): __kernel_long_t
    <567>   DW_AT_decl_file   : 16
    <568>   DW_AT_decl_line   : 15
    <569>   DW_AT_decl_column : 15
    <56a>   DW_AT_type        : <0xae>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x514): __kernel_ulong_t
    <573>   DW_AT_decl_file   : 16
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 23
    <576>   DW_AT_type        : <0x37>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x3cf): kernel_long_t
    <57f>   DW_AT_decl_file   : 17
    <580>   DW_AT_decl_line   : 16
    <581>   DW_AT_decl_column : 25
    <582>   DW_AT_type        : <0x562>
 <1><586>: Abbrev Number: 4 (DW_TAG_typedef)
    <587>   DW_AT_name        : (indirect string, offset: 0x86f): kernel_ulong_t
    <58b>   DW_AT_decl_file   : 17
    <58c>   DW_AT_decl_line   : 17
    <58d>   DW_AT_decl_column : 26
    <58e>   DW_AT_type        : <0x56e>
 <1><592>: Abbrev Number: 3 (DW_TAG_const_type)
    <593>   DW_AT_type        : <0x586>
 <1><597>: Abbrev Number: 12 (DW_TAG_structure_type)
    <598>   DW_AT_name        : (indirect string, offset: 0xbb5): list_item
    <59c>   DW_AT_byte_size   : 8
    <59d>   DW_AT_decl_file   : 18
    <59e>   DW_AT_decl_line   : 92
    <59f>   DW_AT_decl_column : 8
    <5a0>   DW_AT_sibling     : <0x5c3>
 <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x1082): prev
    <5a9>   DW_AT_decl_file   : 18
    <5aa>   DW_AT_decl_line   : 93
    <5ab>   DW_AT_decl_column : 20
    <5ac>   DW_AT_type        : <0x5c3>
    <5b0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b3>: Abbrev Number: 9 (DW_TAG_member)
    <5b4>   DW_AT_name        : (indirect string, offset: 0xa6f): next
    <5b8>   DW_AT_decl_file   : 18
    <5b9>   DW_AT_decl_line   : 94
    <5ba>   DW_AT_decl_column : 20
    <5bb>   DW_AT_type        : <0x5c3>
    <5bf>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5c4>   DW_AT_byte_size   : 4
    <5c5>   DW_AT_type        : <0x597>
 <1><5c9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x847): sysent
    <5ce>   DW_AT_byte_size   : 20
    <5cf>   DW_AT_decl_file   : 19
    <5d0>   DW_AT_decl_line   : 13
    <5d1>   DW_AT_decl_column : 16
    <5d2>   DW_AT_sibling     : <0x622>
 <2><5d6>: Abbrev Number: 9 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xfc6): nargs
    <5db>   DW_AT_decl_file   : 19
    <5dc>   DW_AT_decl_line   : 14
    <5dd>   DW_AT_decl_column : 11
    <5de>   DW_AT_type        : <0x2b>
    <5e2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5e5>: Abbrev Number: 9 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x93e): sys_flags
    <5ea>   DW_AT_decl_file   : 19
    <5eb>   DW_AT_decl_line   : 15
    <5ec>   DW_AT_decl_column : 6
    <5ed>   DW_AT_type        : <0x64>
    <5f1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5f4>: Abbrev Number: 19 (DW_TAG_member)
    <5f5>   DW_AT_name        : sen
    <5f9>   DW_AT_decl_file   : 19
    <5fa>   DW_AT_decl_line   : 16
    <5fb>   DW_AT_decl_column : 6
    <5fc>   DW_AT_type        : <0x64>
    <600>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><603>: Abbrev Number: 9 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x2d9): sys_func
    <608>   DW_AT_decl_file   : 19
    <609>   DW_AT_decl_line   : 17
    <60a>   DW_AT_decl_column : 8
    <60b>   DW_AT_type        : <0x878>
    <60f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><612>: Abbrev Number: 9 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x24e): sys_name
    <617>   DW_AT_decl_file   : 19
    <618>   DW_AT_decl_line   : 18
    <619>   DW_AT_decl_column : 14
    <61a>   DW_AT_type        : <0x20a>
    <61e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><621>: Abbrev Number: 0
 <1><622>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <623>   DW_AT_prototyped  : 1
    <624>   DW_AT_type        : <0x64>
    <628>   DW_AT_sibling     : <0x632>
 <2><62c>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <62d>   DW_AT_type        : <0x632>
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <633>   DW_AT_byte_size   : 4
    <634>   DW_AT_type        : <0x63d>
 <1><638>: Abbrev Number: 3 (DW_TAG_const_type)
    <639>   DW_AT_type        : <0x632>
 <1><63d>: Abbrev Number: 22 (DW_TAG_structure_type)
    <63e>   DW_AT_name        : tcb
    <642>   DW_AT_byte_size   : 200
    <643>   DW_AT_decl_file   : 20
    <644>   DW_AT_decl_line   : 262
    <646>   DW_AT_decl_column : 8
    <647>   DW_AT_sibling     : <0x878>
 <2><64b>: Abbrev Number: 23 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x4c0): flags
    <650>   DW_AT_decl_file   : 20
    <651>   DW_AT_decl_line   : 263
    <653>   DW_AT_decl_column : 6
    <654>   DW_AT_type        : <0x64>
    <658>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><65b>: Abbrev Number: 24 (DW_TAG_member)
    <65c>   DW_AT_name        : pid
    <660>   DW_AT_decl_file   : 20
    <661>   DW_AT_decl_line   : 264
    <663>   DW_AT_decl_column : 6
    <664>   DW_AT_type        : <0x64>
    <668>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><66b>: Abbrev Number: 23 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <670>   DW_AT_decl_file   : 20
    <671>   DW_AT_decl_line   : 265
    <673>   DW_AT_decl_column : 6
    <674>   DW_AT_type        : <0x64>
    <678>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><67b>: Abbrev Number: 23 (DW_TAG_member)
    <67c>   DW_AT_name        : (indirect string, offset: 0x365): currpers
    <680>   DW_AT_decl_file   : 20
    <681>   DW_AT_decl_line   : 267
    <683>   DW_AT_decl_column : 15
    <684>   DW_AT_type        : <0x2b>
    <688>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><68b>: Abbrev Number: 23 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0xb01): u_error
    <690>   DW_AT_decl_file   : 20
    <691>   DW_AT_decl_line   : 269
    <693>   DW_AT_decl_column : 16
    <694>   DW_AT_type        : <0x37>
    <698>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><69b>: Abbrev Number: 23 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <6a0>   DW_AT_decl_file   : 20
    <6a1>   DW_AT_decl_line   : 270
    <6a3>   DW_AT_decl_column : 17
    <6a4>   DW_AT_type        : <0x586>
    <6a8>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><6ab>: Abbrev Number: 23 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0xb4d): true_scno
    <6b0>   DW_AT_decl_file   : 20
    <6b1>   DW_AT_decl_line   : 271
    <6b3>   DW_AT_decl_column : 17
    <6b4>   DW_AT_type        : <0x586>
    <6b8>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6bb>: Abbrev Number: 23 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x186): u_arg
    <6c0>   DW_AT_decl_file   : 20
    <6c1>   DW_AT_decl_line   : 272
    <6c3>   DW_AT_decl_column : 17
    <6c4>   DW_AT_type        : <0x9a8>
    <6c8>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6cb>: Abbrev Number: 23 (DW_TAG_member)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x955): u_rval
    <6d0>   DW_AT_decl_file   : 20
    <6d1>   DW_AT_decl_line   : 273
    <6d3>   DW_AT_decl_column : 16
    <6d4>   DW_AT_type        : <0x57a>
    <6d8>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6db>: Abbrev Number: 23 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0xa80): sys_func_rval
    <6e0>   DW_AT_decl_file   : 20
    <6e1>   DW_AT_decl_line   : 274
    <6e3>   DW_AT_decl_column : 6
    <6e4>   DW_AT_type        : <0x64>
    <6e8>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6eb>: Abbrev Number: 23 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0xca9): curcol
    <6f0>   DW_AT_decl_file   : 20
    <6f1>   DW_AT_decl_line   : 275
    <6f3>   DW_AT_decl_column : 6
    <6f4>   DW_AT_type        : <0x64>
    <6f8>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6fb>: Abbrev Number: 23 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x967): outf
    <700>   DW_AT_decl_file   : 20
    <701>   DW_AT_decl_line   : 276
    <703>   DW_AT_decl_column : 8
    <704>   DW_AT_type        : <0x44f>
    <708>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><70b>: Abbrev Number: 23 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0xeb5): staged_output_data
    <710>   DW_AT_decl_file   : 20
    <711>   DW_AT_decl_line   : 277
    <713>   DW_AT_decl_column : 29
    <714>   DW_AT_type        : <0x9be>
    <718>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><71b>: Abbrev Number: 23 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0xa46): auxstr
    <720>   DW_AT_decl_file   : 20
    <721>   DW_AT_decl_line   : 279
    <723>   DW_AT_decl_column : 14
    <724>   DW_AT_type        : <0x20a>
    <728>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><72b>: Abbrev Number: 23 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x165): _priv_data
    <730>   DW_AT_decl_file   : 20
    <731>   DW_AT_decl_line   : 280
    <733>   DW_AT_decl_column : 8
    <734>   DW_AT_type        : <0xcd>
    <738>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><73b>: Abbrev Number: 23 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0xbe2): _free_priv_data
    <740>   DW_AT_decl_file   : 20
    <741>   DW_AT_decl_line   : 281
    <743>   DW_AT_decl_column : 9
    <744>   DW_AT_type        : <0x9d0>
    <748>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><74b>: Abbrev Number: 23 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0x176): s_ent
    <750>   DW_AT_decl_file   : 20
    <751>   DW_AT_decl_line   : 282
    <753>   DW_AT_decl_column : 23
    <754>   DW_AT_type        : <0x9d6>
    <758>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><75b>: Abbrev Number: 23 (DW_TAG_member)
    <75c>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <760>   DW_AT_decl_file   : 20
    <761>   DW_AT_decl_line   : 285
    <763>   DW_AT_decl_column : 23
    <764>   DW_AT_type        : <0x9d6>
    <768>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><76b>: Abbrev Number: 23 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x35a): inject_vec
    <770>   DW_AT_decl_file   : 20
    <771>   DW_AT_decl_line   : 286
    <773>   DW_AT_decl_column : 22
    <774>   DW_AT_type        : <0x9e1>
    <778>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><77b>: Abbrev Number: 23 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x7b8): stime
    <780>   DW_AT_decl_file   : 20
    <781>   DW_AT_decl_line   : 287
    <783>   DW_AT_decl_column : 18
    <784>   DW_AT_type        : <0x174>
    <788>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><78b>: Abbrev Number: 23 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x36e): ltime
    <790>   DW_AT_decl_file   : 20
    <791>   DW_AT_decl_line   : 288
    <793>   DW_AT_decl_column : 18
    <794>   DW_AT_type        : <0x174>
    <798>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><79b>: Abbrev Number: 23 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0xf8d): atime
    <7a0>   DW_AT_decl_file   : 20
    <7a1>   DW_AT_decl_line   : 289
    <7a3>   DW_AT_decl_column : 18
    <7a4>   DW_AT_type        : <0x174>
    <7a8>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><7ab>: Abbrev Number: 23 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x4ba): etime
    <7b0>   DW_AT_decl_file   : 20
    <7b1>   DW_AT_decl_line   : 290
    <7b3>   DW_AT_decl_column : 18
    <7b4>   DW_AT_type        : <0x174>
    <7b8>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7bc>: Abbrev Number: 23 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xd0d): delay_expiration_time
    <7c1>   DW_AT_decl_file   : 20
    <7c2>   DW_AT_decl_line   : 291
    <7c4>   DW_AT_decl_column : 18
    <7c5>   DW_AT_type        : <0x174>
    <7c9>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7cd>: Abbrev Number: 23 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7d2>   DW_AT_decl_file   : 20
    <7d3>   DW_AT_decl_line   : 298
    <7d5>   DW_AT_decl_column : 15
    <7d6>   DW_AT_type        : <0x2b>
    <7da>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7de>: Abbrev Number: 23 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0xef1): last_dirfd
    <7e3>   DW_AT_decl_file   : 20
    <7e4>   DW_AT_decl_line   : 301
    <7e6>   DW_AT_decl_column : 6
    <7e7>   DW_AT_type        : <0x64>
    <7eb>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ef>: Abbrev Number: 23 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xf17): mmap_cache
    <7f4>   DW_AT_decl_file   : 20
    <7f5>   DW_AT_decl_line   : 304
    <7f7>   DW_AT_decl_column : 23
    <7f8>   DW_AT_type        : <0x9fd>
    <7fc>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><800>: Abbrev Number: 23 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0xb23): wait_data_idx
    <805>   DW_AT_decl_file   : 20
    <806>   DW_AT_decl_line   : 311
    <808>   DW_AT_decl_column : 9
    <809>   DW_AT_type        : <0x122>
    <80d>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><811>: Abbrev Number: 23 (DW_TAG_member)
    <812>   DW_AT_name        : (indirect string, offset: 0xa4d): delayed_wait_data
    <816>   DW_AT_decl_file   : 20
    <817>   DW_AT_decl_line   : 313
    <819>   DW_AT_decl_column : 24
    <81a>   DW_AT_type        : <0xa09>
    <81e>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><822>: Abbrev Number: 23 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0xac2): wait_list
    <827>   DW_AT_decl_file   : 20
    <828>   DW_AT_decl_line   : 314
    <82a>   DW_AT_decl_column : 19
    <82b>   DW_AT_type        : <0x597>
    <82f>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><833>: Abbrev Number: 23 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0x6b5): vcpu_info_list
    <838>   DW_AT_decl_file   : 20
    <839>   DW_AT_decl_line   : 318
    <83b>   DW_AT_decl_column : 20
    <83c>   DW_AT_type        : <0xa15>
    <840>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><844>: Abbrev Number: 23 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0xc74): unwind_ctx
    <849>   DW_AT_decl_file   : 20
    <84a>   DW_AT_decl_line   : 322
    <84c>   DW_AT_decl_column : 8
    <84d>   DW_AT_type        : <0xcd>
    <851>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><855>: Abbrev Number: 23 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x4a4): unwind_queue
    <85a>   DW_AT_decl_file   : 20
    <85b>   DW_AT_decl_line   : 323
    <85d>   DW_AT_decl_column : 25
    <85e>   DW_AT_type        : <0xa21>
    <862>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><866>: Abbrev Number: 23 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x15a): comm
    <86b>   DW_AT_decl_file   : 20
    <86c>   DW_AT_decl_line   : 327
    <86e>   DW_AT_decl_column : 7
    <86f>   DW_AT_type        : <0xa27>
    <873>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><877>: Abbrev Number: 0
 <1><878>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <879>   DW_AT_byte_size   : 4
    <87a>   DW_AT_type        : <0x622>
 <1><87e>: Abbrev Number: 4 (DW_TAG_typedef)
    <87f>   DW_AT_name        : (indirect string, offset: 0x506): struct_sysent
    <883>   DW_AT_decl_file   : 19
    <884>   DW_AT_decl_line   : 19
    <885>   DW_AT_decl_column : 3
    <886>   DW_AT_type        : <0x5c9>
 <1><88a>: Abbrev Number: 3 (DW_TAG_const_type)
    <88b>   DW_AT_type        : <0x87e>
 <1><88f>: Abbrev Number: 14 (DW_TAG_variable)
    <890>   DW_AT_name        : (indirect string, offset: 0xcf9): current_personality
    <894>   DW_AT_decl_file   : 20
    <895>   DW_AT_decl_line   : 158
    <896>   DW_AT_decl_column : 17
    <897>   DW_AT_type        : <0x2b>
    <89b>   DW_AT_external    : 1
    <89c>   DW_AT_declaration : 1
 <1><89d>: Abbrev Number: 14 (DW_TAG_variable)
    <89e>   DW_AT_name        : (indirect string, offset: 0x7e9): current_wordsize
    <8a2>   DW_AT_decl_file   : 20
    <8a3>   DW_AT_decl_line   : 171
    <8a4>   DW_AT_decl_column : 17
    <8a5>   DW_AT_type        : <0x2b>
    <8a9>   DW_AT_external    : 1
    <8aa>   DW_AT_declaration : 1
 <1><8ab>: Abbrev Number: 14 (DW_TAG_variable)
    <8ac>   DW_AT_name        : (indirect string, offset: 0xa24): current_klongsize
    <8b0>   DW_AT_decl_file   : 20
    <8b1>   DW_AT_decl_line   : 176
    <8b2>   DW_AT_decl_column : 17
    <8b3>   DW_AT_type        : <0x2b>
    <8b7>   DW_AT_external    : 1
    <8b8>   DW_AT_declaration : 1
 <1><8b9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8ba>   DW_AT_name        : (indirect string, offset: 0xc4b): ioctlent
    <8be>   DW_AT_byte_size   : 8
    <8bf>   DW_AT_decl_file   : 20
    <8c0>   DW_AT_decl_line   : 217
    <8c1>   DW_AT_decl_column : 16
    <8c2>   DW_AT_sibling     : <0x8e5>
 <2><8c6>: Abbrev Number: 9 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xedd): symbol
    <8cb>   DW_AT_decl_file   : 20
    <8cc>   DW_AT_decl_line   : 218
    <8cd>   DW_AT_decl_column : 14
    <8ce>   DW_AT_type        : <0x20a>
    <8d2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d5>: Abbrev Number: 9 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xcc2): code
    <8da>   DW_AT_decl_file   : 20
    <8db>   DW_AT_decl_line   : 219
    <8dc>   DW_AT_decl_column : 15
    <8dd>   DW_AT_type        : <0x2b>
    <8e1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e4>: Abbrev Number: 0
 <1><8e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e6>   DW_AT_name        : (indirect string, offset: 0xc0c): struct_ioctlent
    <8ea>   DW_AT_decl_file   : 20
    <8eb>   DW_AT_decl_line   : 220
    <8ec>   DW_AT_decl_column : 3
    <8ed>   DW_AT_type        : <0x8b9>
 <1><8f1>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f2>   DW_AT_type        : <0x8e5>
 <1><8f6>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x7dd): inject_data
    <8fb>   DW_AT_byte_size   : 10
    <8fc>   DW_AT_decl_file   : 20
    <8fd>   DW_AT_decl_line   : 241
    <8fe>   DW_AT_decl_column : 8
    <8ff>   DW_AT_sibling     : <0x95e>
 <2><903>: Abbrev Number: 9 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x4c0): flags
    <908>   DW_AT_decl_file   : 20
    <909>   DW_AT_decl_line   : 242
    <90a>   DW_AT_decl_column : 10
    <90b>   DW_AT_type        : <0xf2>
    <90f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><912>: Abbrev Number: 9 (DW_TAG_member)
    <913>   DW_AT_name        : (indirect string, offset: 0x8f2): signo
    <917>   DW_AT_decl_file   : 20
    <918>   DW_AT_decl_line   : 243
    <919>   DW_AT_decl_column : 10
    <91a>   DW_AT_type        : <0xf2>
    <91e>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><921>: Abbrev Number: 9 (DW_TAG_member)
    <922>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <926>   DW_AT_decl_file   : 20
    <927>   DW_AT_decl_line   : 244
    <928>   DW_AT_decl_column : 11
    <929>   DW_AT_type        : <0xfe>
    <92d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><930>: Abbrev Number: 9 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0xc9f): delay_idx
    <935>   DW_AT_decl_file   : 20
    <936>   DW_AT_decl_line   : 245
    <937>   DW_AT_decl_column : 11
    <938>   DW_AT_type        : <0xfe>
    <93c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><93f>: Abbrev Number: 9 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0x54c): poke_idx
    <944>   DW_AT_decl_file   : 20
    <945>   DW_AT_decl_line   : 246
    <946>   DW_AT_decl_column : 11
    <947>   DW_AT_type        : <0xfe>
    <94b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><94e>: Abbrev Number: 9 (DW_TAG_member)
    <94f>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <953>   DW_AT_decl_file   : 20
    <954>   DW_AT_decl_line   : 247
    <955>   DW_AT_decl_column : 11
    <956>   DW_AT_type        : <0xfe>
    <95a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><95d>: Abbrev Number: 0
 <1><95e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <95f>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <963>   DW_AT_byte_size   : 16
    <964>   DW_AT_decl_file   : 20
    <965>   DW_AT_decl_line   : 250
    <966>   DW_AT_decl_column : 8
    <967>   DW_AT_sibling     : <0x9a8>
 <2><96b>: Abbrev Number: 9 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0x9f9): first
    <970>   DW_AT_decl_file   : 20
    <971>   DW_AT_decl_line   : 251
    <972>   DW_AT_decl_column : 11
    <973>   DW_AT_type        : <0xfe>
    <977>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><97a>: Abbrev Number: 9 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x10b2): last
    <97f>   DW_AT_decl_file   : 20
    <980>   DW_AT_decl_line   : 252
    <981>   DW_AT_decl_column : 11
    <982>   DW_AT_type        : <0xfe>
    <986>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><989>: Abbrev Number: 9 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0x374): step
    <98e>   DW_AT_decl_file   : 20
    <98f>   DW_AT_decl_line   : 253
    <990>   DW_AT_decl_column : 11
    <991>   DW_AT_type        : <0xfe>
    <995>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><998>: Abbrev Number: 9 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0x107d): data
    <99d>   DW_AT_decl_file   : 20
    <99e>   DW_AT_decl_line   : 254
    <99f>   DW_AT_decl_column : 21
    <9a0>   DW_AT_type        : <0x8f6>
    <9a4>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a7>: Abbrev Number: 0
 <1><9a8>: Abbrev Number: 10 (DW_TAG_array_type)
    <9a9>   DW_AT_type        : <0x586>
    <9ad>   DW_AT_sibling     : <0x9b8>
 <2><9b1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9b2>   DW_AT_type        : <0x2b>
    <9b6>   DW_AT_upper_bound : 5
 <2><9b7>: Abbrev Number: 0
 <1><9b8>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9b9>   DW_AT_name        : (indirect string, offset: 0xeb5): staged_output_data
    <9bd>   DW_AT_declaration : 1
 <1><9be>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bf>   DW_AT_byte_size   : 4
    <9c0>   DW_AT_type        : <0x9b8>
 <1><9c4>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9c5>   DW_AT_prototyped  : 1
    <9c6>   DW_AT_sibling     : <0x9d0>
 <2><9ca>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9cb>   DW_AT_type        : <0xcd>
 <2><9cf>: Abbrev Number: 0
 <1><9d0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d1>   DW_AT_byte_size   : 4
    <9d2>   DW_AT_type        : <0x9c4>
 <1><9d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d7>   DW_AT_byte_size   : 4
    <9d8>   DW_AT_type        : <0x88a>
 <1><9dc>: Abbrev Number: 3 (DW_TAG_const_type)
    <9dd>   DW_AT_type        : <0x9d6>
 <1><9e1>: Abbrev Number: 10 (DW_TAG_array_type)
    <9e2>   DW_AT_type        : <0x9f1>
    <9e6>   DW_AT_sibling     : <0x9f1>
 <2><9ea>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9eb>   DW_AT_type        : <0x2b>
    <9ef>   DW_AT_upper_bound : 2
 <2><9f0>: Abbrev Number: 0
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x95e>
 <1><9f7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0x38f): tcb_wait_data
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a10>   DW_AT_name        : (indirect string, offset: 0x150): vcpu_info
    <a14>   DW_AT_declaration : 1
 <1><a15>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a16>   DW_AT_byte_size   : 4
    <a17>   DW_AT_type        : <0xa0f>
 <1><a1b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xe99): unwind_queue_t
    <a20>   DW_AT_declaration : 1
 <1><a21>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a22>   DW_AT_byte_size   : 4
    <a23>   DW_AT_type        : <0xa1b>
 <1><a27>: Abbrev Number: 10 (DW_TAG_array_type)
    <a28>   DW_AT_type        : <0xe6>
    <a2c>   DW_AT_sibling     : <0xa37>
 <2><a30>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a31>   DW_AT_type        : <0x2b>
    <a35>   DW_AT_upper_bound : 15
 <2><a36>: Abbrev Number: 0
 <1><a37>: Abbrev Number: 13 (DW_TAG_variable)
    <a38>   DW_AT_name        : (indirect string, offset: 0xb60): stub_sysent
    <a3c>   DW_AT_decl_file   : 20
    <a3d>   DW_AT_decl_line   : 400
    <a3f>   DW_AT_decl_column : 28
    <a40>   DW_AT_type        : <0x88a>
    <a44>   DW_AT_external    : 1
    <a45>   DW_AT_declaration : 1
 <1><a46>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a47>   DW_AT_name        : (indirect string, offset: 0x105a): xlat_type
    <a4b>   DW_AT_encoding    : 7	(unsigned)
    <a4c>   DW_AT_byte_size   : 4
    <a4d>   DW_AT_type        : <0x2b>
    <a51>   DW_AT_decl_file   : 21
    <a52>   DW_AT_decl_line   : 13
    <a53>   DW_AT_decl_column : 6
    <a54>   DW_AT_sibling     : <0xa6b>
 <2><a58>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0x2a9): XT_NORMAL
    <a5d>   DW_AT_const_value : 0
 <2><a5e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xc23): XT_SORTED
    <a63>   DW_AT_const_value : 1
 <2><a64>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0xd85): XT_INDEXED
    <a69>   DW_AT_const_value : 2
 <2><a6a>: Abbrev Number: 0
 <1><a6b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xb8c): xlat_style
    <a70>   DW_AT_encoding    : 7	(unsigned)
    <a71>   DW_AT_byte_size   : 4
    <a72>   DW_AT_type        : <0x2b>
    <a76>   DW_AT_decl_file   : 21
    <a77>   DW_AT_decl_line   : 19
    <a78>   DW_AT_decl_column : 6
    <a79>   DW_AT_sibling     : <0xaa8>
 <2><a7d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a82>   DW_AT_const_value : 0
 <2><a83>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0xbbf): XLAT_STYLE_RAW
    <a88>   DW_AT_const_value : 1
 <2><a89>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x100d): XLAT_STYLE_ABBREV
    <a8e>   DW_AT_const_value : 2
 <2><a8f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0x2c6): XLAT_STYLE_VERBOSE
    <a94>   DW_AT_const_value : 3
 <2><a95>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a9a>   DW_AT_const_value : 0
 <2><a9b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <aa0>   DW_AT_const_value : 4
 <2><aa1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x10a1): XLAT_STYLE_FMT_D
    <aa6>   DW_AT_const_value : 8
 <2><aa7>: Abbrev Number: 0
 <1><aa8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x2f7): xlat_data
    <aad>   DW_AT_byte_size   : 12
    <aae>   DW_AT_decl_file   : 21
    <aaf>   DW_AT_decl_line   : 51
    <ab0>   DW_AT_decl_column : 8
    <ab1>   DW_AT_sibling     : <0xad4>
 <2><ab5>: Abbrev Number: 19 (DW_TAG_member)
    <ab6>   DW_AT_name        : val
    <aba>   DW_AT_decl_file   : 21
    <abb>   DW_AT_decl_line   : 52
    <abc>   DW_AT_decl_column : 11
    <abd>   DW_AT_type        : <0x116>
    <ac1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac4>: Abbrev Number: 19 (DW_TAG_member)
    <ac5>   DW_AT_name        : str
    <ac9>   DW_AT_decl_file   : 21
    <aca>   DW_AT_decl_line   : 53
    <acb>   DW_AT_decl_column : 14
    <acc>   DW_AT_type        : <0x20a>
    <ad0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad3>: Abbrev Number: 0
 <1><ad4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad5>   DW_AT_type        : <0xaa8>
 <1><ad9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ada>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ade>   DW_AT_byte_size   : 24
    <adf>   DW_AT_decl_file   : 21
    <ae0>   DW_AT_decl_line   : 56
    <ae1>   DW_AT_decl_column : 8
    <ae2>   DW_AT_sibling     : <0xb32>
 <2><ae6>: Abbrev Number: 9 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x107d): data
    <aeb>   DW_AT_decl_file   : 21
    <aec>   DW_AT_decl_line   : 57
    <aed>   DW_AT_decl_column : 26
    <aee>   DW_AT_type        : <0xb37>
    <af2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af5>: Abbrev Number: 9 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0x83b): flags_strsz
    <afa>   DW_AT_decl_file   : 21
    <afb>   DW_AT_decl_line   : 58
    <afc>   DW_AT_decl_column : 9
    <afd>   DW_AT_type        : <0x122>
    <b01>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b04>: Abbrev Number: 9 (DW_TAG_member)
    <b05>   DW_AT_name        : (indirect string, offset: 0xb31): size
    <b09>   DW_AT_decl_file   : 21
    <b0a>   DW_AT_decl_line   : 59
    <b0b>   DW_AT_decl_column : 11
    <b0c>   DW_AT_type        : <0x10a>
    <b10>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b13>: Abbrev Number: 9 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0x181): type
    <b18>   DW_AT_decl_file   : 21
    <b19>   DW_AT_decl_line   : 60
    <b1a>   DW_AT_decl_column : 17
    <b1b>   DW_AT_type        : <0xa46>
    <b1f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b22>: Abbrev Number: 9 (DW_TAG_member)
    <b23>   DW_AT_name        : (indirect string, offset: 0x709): flags_mask
    <b27>   DW_AT_decl_file   : 21
    <b28>   DW_AT_decl_line   : 61
    <b29>   DW_AT_decl_column : 11
    <b2a>   DW_AT_type        : <0x116>
    <b2e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b31>: Abbrev Number: 0
 <1><b32>: Abbrev Number: 3 (DW_TAG_const_type)
    <b33>   DW_AT_type        : <0xad9>
 <1><b37>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b38>   DW_AT_byte_size   : 4
    <b39>   DW_AT_type        : <0xad4>
 <1><b3d>: Abbrev Number: 10 (DW_TAG_array_type)
    <b3e>   DW_AT_type        : <0xb32>
    <b42>   DW_AT_sibling     : <0xb48>
 <2><b46>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b47>: Abbrev Number: 0
 <1><b48>: Abbrev Number: 3 (DW_TAG_const_type)
    <b49>   DW_AT_type        : <0xb3d>
 <1><b4d>: Abbrev Number: 13 (DW_TAG_variable)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xdf9): addrfams
    <b52>   DW_AT_decl_file   : 20
    <b53>   DW_AT_decl_line   : 406
    <b55>   DW_AT_decl_column : 26
    <b56>   DW_AT_type        : <0xb48>
    <b5a>   DW_AT_external    : 1
    <b5b>   DW_AT_declaration : 1
 <1><b5c>: Abbrev Number: 13 (DW_TAG_variable)
    <b5d>   DW_AT_name        : (indirect string, offset: 0xcd2): arp_hardware_types
    <b61>   DW_AT_decl_file   : 20
    <b62>   DW_AT_decl_line   : 407
    <b64>   DW_AT_decl_column : 26
    <b65>   DW_AT_type        : <0xb48>
    <b69>   DW_AT_external    : 1
    <b6a>   DW_AT_declaration : 1
 <1><b6b>: Abbrev Number: 13 (DW_TAG_variable)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xf93): at_flags
    <b70>   DW_AT_decl_file   : 20
    <b71>   DW_AT_decl_line   : 408
    <b73>   DW_AT_decl_column : 26
    <b74>   DW_AT_type        : <0xb48>
    <b78>   DW_AT_external    : 1
    <b79>   DW_AT_declaration : 1
 <1><b7a>: Abbrev Number: 13 (DW_TAG_variable)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x482): clocknames
    <b7f>   DW_AT_decl_file   : 20
    <b80>   DW_AT_decl_line   : 409
    <b82>   DW_AT_decl_column : 26
    <b83>   DW_AT_type        : <0xb48>
    <b87>   DW_AT_external    : 1
    <b88>   DW_AT_declaration : 1
 <1><b89>: Abbrev Number: 13 (DW_TAG_variable)
    <b8a>   DW_AT_name        : (indirect string, offset: 0xf53): dirent_types
    <b8e>   DW_AT_decl_file   : 20
    <b8f>   DW_AT_decl_line   : 410
    <b91>   DW_AT_decl_column : 26
    <b92>   DW_AT_type        : <0xb48>
    <b96>   DW_AT_external    : 1
    <b97>   DW_AT_declaration : 1
 <1><b98>: Abbrev Number: 13 (DW_TAG_variable)
    <b99>   DW_AT_name        : (indirect string, offset: 0x88c): ethernet_protocols
    <b9d>   DW_AT_decl_file   : 20
    <b9e>   DW_AT_decl_line   : 411
    <ba0>   DW_AT_decl_column : 26
    <ba1>   DW_AT_type        : <0xb48>
    <ba5>   DW_AT_external    : 1
    <ba6>   DW_AT_declaration : 1
 <1><ba7>: Abbrev Number: 13 (DW_TAG_variable)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x59f): inet_protocols
    <bac>   DW_AT_decl_file   : 20
    <bad>   DW_AT_decl_line   : 412
    <baf>   DW_AT_decl_column : 26
    <bb0>   DW_AT_type        : <0xb48>
    <bb4>   DW_AT_external    : 1
    <bb5>   DW_AT_declaration : 1
 <1><bb6>: Abbrev Number: 13 (DW_TAG_variable)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x296): evdev_abs
    <bbb>   DW_AT_decl_file   : 20
    <bbc>   DW_AT_decl_line   : 413
    <bbe>   DW_AT_decl_column : 26
    <bbf>   DW_AT_type        : <0xb48>
    <bc3>   DW_AT_external    : 1
    <bc4>   DW_AT_declaration : 1
 <1><bc5>: Abbrev Number: 13 (DW_TAG_variable)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x6fe): audit_arch
    <bca>   DW_AT_decl_file   : 20
    <bcb>   DW_AT_decl_line   : 414
    <bcd>   DW_AT_decl_column : 26
    <bce>   DW_AT_type        : <0xb48>
    <bd2>   DW_AT_external    : 1
    <bd3>   DW_AT_declaration : 1
 <1><bd4>: Abbrev Number: 13 (DW_TAG_variable)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bd9>   DW_AT_decl_file   : 20
    <bda>   DW_AT_decl_line   : 415
    <bdc>   DW_AT_decl_column : 26
    <bdd>   DW_AT_type        : <0xb48>
    <be1>   DW_AT_external    : 1
    <be2>   DW_AT_declaration : 1
 <1><be3>: Abbrev Number: 13 (DW_TAG_variable)
    <be4>   DW_AT_name        : (indirect string, offset: 0x463): iffflags
    <be8>   DW_AT_decl_file   : 20
    <be9>   DW_AT_decl_line   : 416
    <beb>   DW_AT_decl_column : 26
    <bec>   DW_AT_type        : <0xb48>
    <bf0>   DW_AT_external    : 1
    <bf1>   DW_AT_declaration : 1
 <1><bf2>: Abbrev Number: 13 (DW_TAG_variable)
    <bf3>   DW_AT_name        : (indirect string, offset: 0xbce): ip_type_of_services
    <bf7>   DW_AT_decl_file   : 20
    <bf8>   DW_AT_decl_line   : 417
    <bfa>   DW_AT_decl_column : 26
    <bfb>   DW_AT_type        : <0xb48>
    <bff>   DW_AT_external    : 1
    <c00>   DW_AT_declaration : 1
 <1><c01>: Abbrev Number: 13 (DW_TAG_variable)
    <c02>   DW_AT_name        : (indirect string, offset: 0x691): ipc_private
    <c06>   DW_AT_decl_file   : 20
    <c07>   DW_AT_decl_line   : 418
    <c09>   DW_AT_decl_column : 26
    <c0a>   DW_AT_type        : <0xb48>
    <c0e>   DW_AT_external    : 1
    <c0f>   DW_AT_declaration : 1
 <1><c10>: Abbrev Number: 13 (DW_TAG_variable)
    <c11>   DW_AT_name        : (indirect string, offset: 0x2ed): msg_flags
    <c15>   DW_AT_decl_file   : 20
    <c16>   DW_AT_decl_line   : 419
    <c18>   DW_AT_decl_column : 26
    <c19>   DW_AT_type        : <0xb48>
    <c1d>   DW_AT_external    : 1
    <c1e>   DW_AT_declaration : 1
 <1><c1f>: Abbrev Number: 13 (DW_TAG_variable)
    <c20>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c24>   DW_AT_decl_file   : 20
    <c25>   DW_AT_decl_line   : 420
    <c27>   DW_AT_decl_column : 26
    <c28>   DW_AT_type        : <0xb48>
    <c2c>   DW_AT_external    : 1
    <c2d>   DW_AT_declaration : 1
 <1><c2e>: Abbrev Number: 13 (DW_TAG_variable)
    <c2f>   DW_AT_name        : (indirect string, offset: 0xec8): nl_bridge_vlan_flags
    <c33>   DW_AT_decl_file   : 20
    <c34>   DW_AT_decl_line   : 421
    <c36>   DW_AT_decl_column : 26
    <c37>   DW_AT_type        : <0xb48>
    <c3b>   DW_AT_external    : 1
    <c3c>   DW_AT_declaration : 1
 <1><c3d>: Abbrev Number: 13 (DW_TAG_variable)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xd6e): nl_netfilter_msg_types
    <c42>   DW_AT_decl_file   : 20
    <c43>   DW_AT_decl_line   : 422
    <c45>   DW_AT_decl_column : 26
    <c46>   DW_AT_type        : <0xb48>
    <c4a>   DW_AT_external    : 1
    <c4b>   DW_AT_declaration : 1
 <1><c4c>: Abbrev Number: 13 (DW_TAG_variable)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x202): nl_route_types
    <c51>   DW_AT_decl_file   : 20
    <c52>   DW_AT_decl_line   : 423
    <c54>   DW_AT_decl_column : 26
    <c55>   DW_AT_type        : <0xb48>
    <c59>   DW_AT_external    : 1
    <c5a>   DW_AT_declaration : 1
 <1><c5b>: Abbrev Number: 13 (DW_TAG_variable)
    <c5c>   DW_AT_name        : (indirect string, offset: 0xe30): open_access_modes
    <c60>   DW_AT_decl_file   : 20
    <c61>   DW_AT_decl_line   : 424
    <c63>   DW_AT_decl_column : 26
    <c64>   DW_AT_type        : <0xb48>
    <c68>   DW_AT_external    : 1
    <c69>   DW_AT_declaration : 1
 <1><c6a>: Abbrev Number: 13 (DW_TAG_variable)
    <c6b>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c6f>   DW_AT_decl_file   : 20
    <c70>   DW_AT_decl_line   : 425
    <c72>   DW_AT_decl_column : 26
    <c73>   DW_AT_type        : <0xb48>
    <c77>   DW_AT_external    : 1
    <c78>   DW_AT_declaration : 1
 <1><c79>: Abbrev Number: 13 (DW_TAG_variable)
    <c7a>   DW_AT_name        : (indirect string, offset: 0xbff): perf_type_id
    <c7e>   DW_AT_decl_file   : 20
    <c7f>   DW_AT_decl_line   : 426
    <c81>   DW_AT_decl_column : 26
    <c82>   DW_AT_type        : <0xb48>
    <c86>   DW_AT_external    : 1
    <c87>   DW_AT_declaration : 1
 <1><c88>: Abbrev Number: 13 (DW_TAG_variable)
    <c89>   DW_AT_name        : (indirect string, offset: 0xe02): pollflags
    <c8d>   DW_AT_decl_file   : 20
    <c8e>   DW_AT_decl_line   : 427
    <c90>   DW_AT_decl_column : 26
    <c91>   DW_AT_type        : <0xb48>
    <c95>   DW_AT_external    : 1
    <c96>   DW_AT_declaration : 1
 <1><c97>: Abbrev Number: 13 (DW_TAG_variable)
    <c98>   DW_AT_name        : (indirect string, offset: 0x540): ptrace_cmds
    <c9c>   DW_AT_decl_file   : 20
    <c9d>   DW_AT_decl_line   : 428
    <c9f>   DW_AT_decl_column : 26
    <ca0>   DW_AT_type        : <0xb48>
    <ca4>   DW_AT_external    : 1
    <ca5>   DW_AT_declaration : 1
 <1><ca6>: Abbrev Number: 13 (DW_TAG_variable)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x7ce): resource_flags
    <cab>   DW_AT_decl_file   : 20
    <cac>   DW_AT_decl_line   : 429
    <cae>   DW_AT_decl_column : 26
    <caf>   DW_AT_type        : <0xb48>
    <cb3>   DW_AT_external    : 1
    <cb4>   DW_AT_declaration : 1
 <1><cb5>: Abbrev Number: 13 (DW_TAG_variable)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x26c): route_nexthop_flags
    <cba>   DW_AT_decl_file   : 20
    <cbb>   DW_AT_decl_line   : 430
    <cbd>   DW_AT_decl_column : 26
    <cbe>   DW_AT_type        : <0xb48>
    <cc2>   DW_AT_external    : 1
    <cc3>   DW_AT_declaration : 1
 <1><cc4>: Abbrev Number: 13 (DW_TAG_variable)
    <cc5>   DW_AT_name        : (indirect string, offset: 0xe53): routing_protocols
    <cc9>   DW_AT_decl_file   : 20
    <cca>   DW_AT_decl_line   : 431
    <ccc>   DW_AT_decl_column : 26
    <ccd>   DW_AT_type        : <0xb48>
    <cd1>   DW_AT_external    : 1
    <cd2>   DW_AT_declaration : 1
 <1><cd3>: Abbrev Number: 13 (DW_TAG_variable)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x454): routing_scopes
    <cd8>   DW_AT_decl_file   : 20
    <cd9>   DW_AT_decl_line   : 432
    <cdb>   DW_AT_decl_column : 26
    <cdc>   DW_AT_type        : <0xb48>
    <ce0>   DW_AT_external    : 1
    <ce1>   DW_AT_declaration : 1
 <1><ce2>: Abbrev Number: 13 (DW_TAG_variable)
    <ce3>   DW_AT_name        : (indirect string, offset: 0xd5c): routing_table_ids
    <ce7>   DW_AT_decl_file   : 20
    <ce8>   DW_AT_decl_line   : 433
    <cea>   DW_AT_decl_column : 26
    <ceb>   DW_AT_type        : <0xb48>
    <cef>   DW_AT_external    : 1
    <cf0>   DW_AT_declaration : 1
 <1><cf1>: Abbrev Number: 13 (DW_TAG_variable)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x66e): routing_types
    <cf6>   DW_AT_decl_file   : 20
    <cf7>   DW_AT_decl_line   : 434
    <cf9>   DW_AT_decl_column : 26
    <cfa>   DW_AT_type        : <0xb48>
    <cfe>   DW_AT_external    : 1
    <cff>   DW_AT_declaration : 1
 <1><d00>: Abbrev Number: 13 (DW_TAG_variable)
    <d01>   DW_AT_name        : (indirect string, offset: 0x1a5): rwf_flags
    <d05>   DW_AT_decl_file   : 20
    <d06>   DW_AT_decl_line   : 435
    <d08>   DW_AT_decl_column : 26
    <d09>   DW_AT_type        : <0xb48>
    <d0d>   DW_AT_external    : 1
    <d0e>   DW_AT_declaration : 1
 <1><d0f>: Abbrev Number: 13 (DW_TAG_variable)
    <d10>   DW_AT_name        : (indirect string, offset: 0x806): seccomp_filter_flags
    <d14>   DW_AT_decl_file   : 20
    <d15>   DW_AT_decl_line   : 436
    <d17>   DW_AT_decl_column : 26
    <d18>   DW_AT_type        : <0xb48>
    <d1c>   DW_AT_external    : 1
    <d1d>   DW_AT_declaration : 1
 <1><d1e>: Abbrev Number: 13 (DW_TAG_variable)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x2b3): seccomp_ret_action
    <d23>   DW_AT_decl_file   : 20
    <d24>   DW_AT_decl_line   : 437
    <d26>   DW_AT_decl_column : 26
    <d27>   DW_AT_type        : <0xb48>
    <d2b>   DW_AT_external    : 1
    <d2c>   DW_AT_declaration : 1
 <1><d2d>: Abbrev Number: 13 (DW_TAG_variable)
    <d2e>   DW_AT_name        : (indirect string, offset: 0x41d): setns_types
    <d32>   DW_AT_decl_file   : 20
    <d33>   DW_AT_decl_line   : 438
    <d35>   DW_AT_decl_column : 26
    <d36>   DW_AT_type        : <0xb48>
    <d3a>   DW_AT_external    : 1
    <d3b>   DW_AT_declaration : 1
 <1><d3c>: Abbrev Number: 13 (DW_TAG_variable)
    <d3d>   DW_AT_name        : (indirect string, offset: 0xdee): sg_io_info
    <d41>   DW_AT_decl_file   : 20
    <d42>   DW_AT_decl_line   : 439
    <d44>   DW_AT_decl_column : 26
    <d45>   DW_AT_type        : <0xb48>
    <d49>   DW_AT_external    : 1
    <d4a>   DW_AT_declaration : 1
 <1><d4b>: Abbrev Number: 13 (DW_TAG_variable)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xb74): socketlayers
    <d50>   DW_AT_decl_file   : 20
    <d51>   DW_AT_decl_line   : 440
    <d53>   DW_AT_decl_column : 26
    <d54>   DW_AT_type        : <0xb48>
    <d58>   DW_AT_external    : 1
    <d59>   DW_AT_declaration : 1
 <1><d5a>: Abbrev Number: 13 (DW_TAG_variable)
    <d5b>   DW_AT_name        : (indirect string, offset: 0xd46): socktypes
    <d5f>   DW_AT_decl_file   : 20
    <d60>   DW_AT_decl_line   : 441
    <d62>   DW_AT_decl_column : 26
    <d63>   DW_AT_type        : <0xb48>
    <d67>   DW_AT_external    : 1
    <d68>   DW_AT_declaration : 1
 <1><d69>: Abbrev Number: 13 (DW_TAG_variable)
    <d6a>   DW_AT_name        : (indirect string, offset: 0xa36): tcp_state_flags
    <d6e>   DW_AT_decl_file   : 20
    <d6f>   DW_AT_decl_line   : 442
    <d71>   DW_AT_decl_column : 26
    <d72>   DW_AT_type        : <0xb48>
    <d76>   DW_AT_external    : 1
    <d77>   DW_AT_declaration : 1
 <1><d78>: Abbrev Number: 13 (DW_TAG_variable)
    <d79>   DW_AT_name        : (indirect string, offset: 0x733): tcp_states
    <d7d>   DW_AT_decl_file   : 20
    <d7e>   DW_AT_decl_line   : 443
    <d80>   DW_AT_decl_column : 26
    <d81>   DW_AT_type        : <0xb48>
    <d85>   DW_AT_external    : 1
    <d86>   DW_AT_declaration : 1
 <1><d87>: Abbrev Number: 13 (DW_TAG_variable)
    <d88>   DW_AT_name        : (indirect string, offset: 0xff0): whence_codes
    <d8c>   DW_AT_decl_file   : 20
    <d8d>   DW_AT_decl_line   : 444
    <d8f>   DW_AT_decl_column : 26
    <d90>   DW_AT_type        : <0xb48>
    <d94>   DW_AT_external    : 1
    <d95>   DW_AT_declaration : 1
 <1><d96>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d97>   DW_AT_encoding    : 7	(unsigned)
    <d98>   DW_AT_byte_size   : 4
    <d99>   DW_AT_type        : <0x2b>
    <d9d>   DW_AT_decl_file   : 20
    <d9e>   DW_AT_decl_line   : 505
    <da0>   DW_AT_decl_column : 14
    <da1>   DW_AT_sibling     : <0xdb8>
 <2><da5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x95c): CFLAG_NONE
    <daa>   DW_AT_const_value : 0
 <2><dab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dac>   DW_AT_name        : (indirect string, offset: 0x89f): CFLAG_ONLY_STATS
    <db0>   DW_AT_const_value : 1
 <2><db1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db2>   DW_AT_name        : (indirect string, offset: 0xb81): CFLAG_BOTH
    <db6>   DW_AT_const_value : 2
 <2><db7>: Abbrev Number: 0
 <1><db8>: Abbrev Number: 29 (DW_TAG_typedef)
    <db9>   DW_AT_name        : (indirect string, offset: 0x10b7): cflag_t
    <dbd>   DW_AT_decl_file   : 20
    <dbe>   DW_AT_decl_line   : 509
    <dc0>   DW_AT_decl_column : 3
    <dc1>   DW_AT_type        : <0xd96>
 <1><dc5>: Abbrev Number: 13 (DW_TAG_variable)
    <dc6>   DW_AT_name        : (indirect string, offset: 0xc99): cflag
    <dca>   DW_AT_decl_file   : 20
    <dcb>   DW_AT_decl_line   : 510
    <dcd>   DW_AT_decl_column : 16
    <dce>   DW_AT_type        : <0xdb8>
    <dd2>   DW_AT_external    : 1
    <dd3>   DW_AT_declaration : 1
 <1><dd4>: Abbrev Number: 13 (DW_TAG_variable)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x170): Tflag
    <dd9>   DW_AT_decl_file   : 20
    <dda>   DW_AT_decl_line   : 511
    <ddc>   DW_AT_decl_column : 13
    <ddd>   DW_AT_type        : <0x556>
    <de1>   DW_AT_external    : 1
    <de2>   DW_AT_declaration : 1
 <1><de3>: Abbrev Number: 13 (DW_TAG_variable)
    <de4>   DW_AT_name        : (indirect string, offset: 0x789): Tflag_scale
    <de8>   DW_AT_decl_file   : 20
    <de9>   DW_AT_decl_line   : 512
    <deb>   DW_AT_decl_column : 12
    <dec>   DW_AT_type        : <0x64>
    <df0>   DW_AT_external    : 1
    <df1>   DW_AT_declaration : 1
 <1><df2>: Abbrev Number: 13 (DW_TAG_variable)
    <df3>   DW_AT_name        : (indirect string, offset: 0x81b): Tflag_width
    <df7>   DW_AT_decl_file   : 20
    <df8>   DW_AT_decl_line   : 513
    <dfa>   DW_AT_decl_column : 12
    <dfb>   DW_AT_type        : <0x64>
    <dff>   DW_AT_external    : 1
    <e00>   DW_AT_declaration : 1
 <1><e01>: Abbrev Number: 13 (DW_TAG_variable)
    <e02>   DW_AT_name        : (indirect string, offset: 0xde0): iflag
    <e06>   DW_AT_decl_file   : 20
    <e07>   DW_AT_decl_line   : 514
    <e09>   DW_AT_decl_column : 13
    <e0a>   DW_AT_type        : <0x556>
    <e0e>   DW_AT_external    : 1
    <e0f>   DW_AT_declaration : 1
 <1><e10>: Abbrev Number: 13 (DW_TAG_variable)
    <e11>   DW_AT_name        : (indirect string, offset: 0x580): count_wallclock
    <e15>   DW_AT_decl_file   : 20
    <e16>   DW_AT_decl_line   : 515
    <e18>   DW_AT_decl_column : 13
    <e19>   DW_AT_type        : <0x556>
    <e1d>   DW_AT_external    : 1
    <e1e>   DW_AT_declaration : 1
 <1><e1f>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e20>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e24>   DW_AT_byte_size   : 4
    <e25>   DW_AT_decl_file   : 20
    <e26>   DW_AT_decl_line   : 517
    <e28>   DW_AT_decl_column : 8
    <e29>   DW_AT_sibling     : <0xe3e>
 <2><e2d>: Abbrev Number: 23 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e32>   DW_AT_decl_file   : 20
    <e33>   DW_AT_decl_line   : 518
    <e35>   DW_AT_decl_column : 14
    <e36>   DW_AT_type        : <0x20a>
    <e3a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3d>: Abbrev Number: 0
 <1><e3e>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x73e): path_set
    <e43>   DW_AT_byte_size   : 12
    <e44>   DW_AT_decl_file   : 20
    <e45>   DW_AT_decl_line   : 522
    <e47>   DW_AT_decl_column : 15
    <e48>   DW_AT_sibling     : <0xe7d>
 <2><e4c>: Abbrev Number: 23 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x6cc): paths_selected
    <e51>   DW_AT_decl_file   : 20
    <e52>   DW_AT_decl_line   : 523
    <e54>   DW_AT_decl_column : 24
    <e55>   DW_AT_type        : <0xe7d>
    <e59>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e5c>: Abbrev Number: 23 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0xfe3): num_selected
    <e61>   DW_AT_decl_file   : 20
    <e62>   DW_AT_decl_line   : 524
    <e64>   DW_AT_decl_column : 9
    <e65>   DW_AT_type        : <0x122>
    <e69>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e6c>: Abbrev Number: 23 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0xb31): size
    <e71>   DW_AT_decl_file   : 20
    <e72>   DW_AT_decl_line   : 525
    <e74>   DW_AT_decl_column : 9
    <e75>   DW_AT_type        : <0x122>
    <e79>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7e>   DW_AT_byte_size   : 4
    <e7f>   DW_AT_type        : <0xe1f>
 <1><e83>: Abbrev Number: 13 (DW_TAG_variable)
    <e84>   DW_AT_name        : (indirect string, offset: 0x1032): global_path_set
    <e88>   DW_AT_decl_file   : 20
    <e89>   DW_AT_decl_line   : 526
    <e8b>   DW_AT_decl_column : 3
    <e8c>   DW_AT_type        : <0xe3e>
    <e90>   DW_AT_external    : 1
    <e91>   DW_AT_declaration : 1
 <1><e92>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e93>   DW_AT_name        : (indirect string, offset: 0xf40): xflag_opts
    <e97>   DW_AT_encoding    : 7	(unsigned)
    <e98>   DW_AT_byte_size   : 4
    <e99>   DW_AT_type        : <0x2b>
    <e9d>   DW_AT_decl_file   : 20
    <e9e>   DW_AT_decl_line   : 528
    <ea0>   DW_AT_decl_column : 6
    <ea1>   DW_AT_sibling     : <0xec4>
 <2><ea5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x9ed): HEXSTR_NONE
    <eaa>   DW_AT_const_value : 0
 <2><eab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0xf75): HEXSTR_NON_ASCII
    <eb0>   DW_AT_const_value : 1
 <2><eb1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x8dd): HEXSTR_ALL
    <eb6>   DW_AT_const_value : 2
 <2><eb7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x657): HEXSTR_NON_ASCII_CHARS
    <ebc>   DW_AT_const_value : 3
 <2><ebd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xffd): NUM_HEXSTR_OPTS
    <ec2>   DW_AT_const_value : 4
 <2><ec3>: Abbrev Number: 0
 <1><ec4>: Abbrev Number: 13 (DW_TAG_variable)
    <ec5>   DW_AT_name        : (indirect string, offset: 0xdaf): xflag
    <ec9>   DW_AT_decl_file   : 20
    <eca>   DW_AT_decl_line   : 541
    <ecc>   DW_AT_decl_column : 17
    <ecd>   DW_AT_type        : <0x2b>
    <ed1>   DW_AT_external    : 1
    <ed2>   DW_AT_declaration : 1
 <1><ed3>: Abbrev Number: 13 (DW_TAG_variable)
    <ed4>   DW_AT_name        : (indirect string, offset: 0xc54): followfork
    <ed8>   DW_AT_decl_file   : 20
    <ed9>   DW_AT_decl_line   : 542
    <edb>   DW_AT_decl_column : 13
    <edc>   DW_AT_type        : <0x556>
    <ee0>   DW_AT_external    : 1
    <ee1>   DW_AT_declaration : 1
 <1><ee2>: Abbrev Number: 13 (DW_TAG_variable)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x301): output_separately
    <ee7>   DW_AT_decl_file   : 20
    <ee8>   DW_AT_decl_line   : 543
    <eea>   DW_AT_decl_column : 13
    <eeb>   DW_AT_type        : <0x556>
    <eef>   DW_AT_external    : 1
    <ef0>   DW_AT_declaration : 1
 <1><ef1>: Abbrev Number: 13 (DW_TAG_variable)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x211): stack_trace_enabled
    <ef6>   DW_AT_decl_file   : 20
    <ef7>   DW_AT_decl_line   : 546
    <ef9>   DW_AT_decl_column : 13
    <efa>   DW_AT_type        : <0x556>
    <efe>   DW_AT_external    : 1
    <eff>   DW_AT_declaration : 1
 <1><f00>: Abbrev Number: 13 (DW_TAG_variable)
    <f01>   DW_AT_name        : (indirect string, offset: 0x645): ptrace_setoptions
    <f05>   DW_AT_decl_file   : 20
    <f06>   DW_AT_decl_line   : 550
    <f08>   DW_AT_decl_column : 17
    <f09>   DW_AT_type        : <0x2b>
    <f0d>   DW_AT_external    : 1
    <f0e>   DW_AT_declaration : 1
 <1><f0f>: Abbrev Number: 13 (DW_TAG_variable)
    <f10>   DW_AT_name        : (indirect string, offset: 0x9e2): max_strlen
    <f14>   DW_AT_decl_file   : 20
    <f15>   DW_AT_decl_line   : 551
    <f17>   DW_AT_decl_column : 17
    <f18>   DW_AT_type        : <0x2b>
    <f1c>   DW_AT_external    : 1
    <f1d>   DW_AT_declaration : 1
 <1><f1e>: Abbrev Number: 13 (DW_TAG_variable)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xa10): os_release
    <f23>   DW_AT_decl_file   : 20
    <f24>   DW_AT_decl_line   : 552
    <f26>   DW_AT_decl_column : 17
    <f27>   DW_AT_type        : <0x2b>
    <f2b>   DW_AT_external    : 1
    <f2c>   DW_AT_declaration : 1
 <1><f2d>: Abbrev Number: 13 (DW_TAG_variable)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x6db): xlat_verbosity
    <f32>   DW_AT_decl_file   : 20
    <f33>   DW_AT_decl_line   : 914
    <f35>   DW_AT_decl_column : 24
    <f36>   DW_AT_type        : <0xa6b>
    <f3a>   DW_AT_external    : 1
    <f3b>   DW_AT_declaration : 1
 <1><f3c>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x563): xlat_style_private_flag_bits
    <f41>   DW_AT_encoding    : 7	(unsigned)
    <f42>   DW_AT_byte_size   : 4
    <f43>   DW_AT_type        : <0x2b>
    <f47>   DW_AT_decl_file   : 20
    <f48>   DW_AT_decl_line   : 934
    <f4a>   DW_AT_decl_column : 6
    <f4b>   DW_AT_sibling     : <0xf68>
 <2><f4f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x280): PAF_PRINT_INDICES_BIT
    <f54>   DW_AT_const_value : 5
 <2><f55>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0xad5): PAF_ARRAY_TRUNCATED_BIT
    <f5a>   DW_AT_const_value : 6
 <2><f5b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x3dd): PXF_DEFAULT_STR_BIT
    <f60>   DW_AT_const_value : 7
 <2><f61>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f62>   DW_AT_name        : (indirect string, offset: 0xc36): SPFF_AUXSTR_MODE_BIT
    <f66>   DW_AT_const_value : 8
 <2><f67>: Abbrev Number: 0
 <1><f68>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f69>   DW_AT_name        : (indirect string, offset: 0xce5): find_xlat_flag_bits
    <f6d>   DW_AT_encoding    : 7	(unsigned)
    <f6e>   DW_AT_byte_size   : 4
    <f6f>   DW_AT_type        : <0x2b>
    <f73>   DW_AT_decl_file   : 20
    <f74>   DW_AT_decl_line   : 1438
    <f76>   DW_AT_decl_column : 6
    <f77>   DW_AT_sibling     : <0xf82>
 <2><f7b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x91a): FXL_CASE_SENSITIVE_BIT
    <f80>   DW_AT_const_value : 0
 <2><f81>: Abbrev Number: 0
 <1><f82>: Abbrev Number: 13 (DW_TAG_variable)
    <f83>   DW_AT_name        : (indirect string, offset: 0x9af): printing_tcp
    <f87>   DW_AT_decl_file   : 20
    <f88>   DW_AT_decl_line   : 1684
    <f8a>   DW_AT_decl_column : 20
    <f8b>   DW_AT_type        : <0x632>
    <f8f>   DW_AT_external    : 1
    <f90>   DW_AT_declaration : 1
 <1><f91>: Abbrev Number: 13 (DW_TAG_variable)
    <f92>   DW_AT_name        : (indirect string, offset: 0x52b): errnoent
    <f96>   DW_AT_decl_file   : 20
    <f97>   DW_AT_decl_line   : 1882
    <f99>   DW_AT_decl_column : 26
    <f9a>   DW_AT_type        : <0x48a>
    <f9e>   DW_AT_external    : 1
    <f9f>   DW_AT_declaration : 1
 <1><fa0>: Abbrev Number: 13 (DW_TAG_variable)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x827): signalent
    <fa5>   DW_AT_decl_file   : 20
    <fa6>   DW_AT_decl_line   : 1883
    <fa8>   DW_AT_decl_column : 26
    <fa9>   DW_AT_type        : <0x48a>
    <fad>   DW_AT_external    : 1
    <fae>   DW_AT_declaration : 1
 <1><faf>: Abbrev Number: 13 (DW_TAG_variable)
    <fb0>   DW_AT_name        : (indirect string, offset: 0xe28): nerrnos
    <fb4>   DW_AT_decl_file   : 20
    <fb5>   DW_AT_decl_line   : 1884
    <fb7>   DW_AT_decl_column : 27
    <fb8>   DW_AT_type        : <0x32>
    <fbc>   DW_AT_external    : 1
    <fbd>   DW_AT_declaration : 1
 <1><fbe>: Abbrev Number: 13 (DW_TAG_variable)
    <fbf>   DW_AT_name        : (indirect string, offset: 0xfcc): nsignals
    <fc3>   DW_AT_decl_file   : 20
    <fc4>   DW_AT_decl_line   : 1885
    <fc6>   DW_AT_decl_column : 27
    <fc7>   DW_AT_type        : <0x32>
    <fcb>   DW_AT_external    : 1
    <fcc>   DW_AT_declaration : 1
 <1><fcd>: Abbrev Number: 10 (DW_TAG_array_type)
    <fce>   DW_AT_type        : <0x88a>
    <fd2>   DW_AT_sibling     : <0xfd8>
 <2><fd6>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fd7>: Abbrev Number: 0
 <1><fd8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd9>   DW_AT_type        : <0xfcd>
 <1><fdd>: Abbrev Number: 13 (DW_TAG_variable)
    <fde>   DW_AT_name        : (indirect string, offset: 0xcb0): sysent0
    <fe2>   DW_AT_decl_file   : 20
    <fe3>   DW_AT_decl_line   : 1887
    <fe5>   DW_AT_decl_column : 28
    <fe6>   DW_AT_type        : <0xfd8>
    <fea>   DW_AT_external    : 1
    <feb>   DW_AT_declaration : 1
 <1><fec>: Abbrev Number: 10 (DW_TAG_array_type)
    <fed>   DW_AT_type        : <0x8f1>
    <ff1>   DW_AT_sibling     : <0xff7>
 <2><ff5>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><ff6>: Abbrev Number: 0
 <1><ff7>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff8>   DW_AT_type        : <0xfec>
 <1><ffc>: Abbrev Number: 13 (DW_TAG_variable)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x1028): ioctlent0
    <1001>   DW_AT_decl_file   : 20
    <1002>   DW_AT_decl_line   : 1888
    <1004>   DW_AT_decl_column : 30
    <1005>   DW_AT_type        : <0xff7>
    <1009>   DW_AT_external    : 1
    <100a>   DW_AT_declaration : 1
 <1><100b>: Abbrev Number: 13 (DW_TAG_variable)
    <100c>   DW_AT_name        : (indirect string, offset: 0x442): personality_names
    <1010>   DW_AT_decl_file   : 20
    <1011>   DW_AT_decl_line   : 1890
    <1013>   DW_AT_decl_column : 26
    <1014>   DW_AT_type        : <0x48a>
    <1018>   DW_AT_external    : 1
    <1019>   DW_AT_declaration : 1
 <1><101a>: Abbrev Number: 13 (DW_TAG_variable)
    <101b>   DW_AT_name        : (indirect string, offset: 0x847): sysent
    <101f>   DW_AT_decl_file   : 20
    <1020>   DW_AT_decl_line   : 1893
    <1022>   DW_AT_decl_column : 29
    <1023>   DW_AT_type        : <0x9d6>
    <1027>   DW_AT_external    : 1
    <1028>   DW_AT_declaration : 1
 <1><1029>: Abbrev Number: 13 (DW_TAG_variable)
    <102a>   DW_AT_name        : (indirect string, offset: 0xc4b): ioctlent
    <102e>   DW_AT_decl_file   : 20
    <102f>   DW_AT_decl_line   : 1894
    <1031>   DW_AT_decl_column : 31
    <1032>   DW_AT_type        : <0x1038>
    <1036>   DW_AT_external    : 1
    <1037>   DW_AT_declaration : 1
 <1><1038>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1039>   DW_AT_byte_size   : 4
    <103a>   DW_AT_type        : <0x8f1>
 <1><103e>: Abbrev Number: 13 (DW_TAG_variable)
    <103f>   DW_AT_name        : (indirect string, offset: 0x831): nsyscalls
    <1043>   DW_AT_decl_file   : 20
    <1044>   DW_AT_decl_line   : 1900
    <1046>   DW_AT_decl_column : 17
    <1047>   DW_AT_type        : <0x2b>
    <104b>   DW_AT_external    : 1
    <104c>   DW_AT_declaration : 1
 <1><104d>: Abbrev Number: 13 (DW_TAG_variable)
    <104e>   DW_AT_name        : (indirect string, offset: 0xe48): nioctlents
    <1052>   DW_AT_decl_file   : 20
    <1053>   DW_AT_decl_line   : 1901
    <1055>   DW_AT_decl_column : 17
    <1056>   DW_AT_type        : <0x2b>
    <105a>   DW_AT_external    : 1
    <105b>   DW_AT_declaration : 1
 <1><105c>: Abbrev Number: 10 (DW_TAG_array_type)
    <105d>   DW_AT_type        : <0x32>
    <1061>   DW_AT_sibling     : <0x106c>
 <2><1065>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1066>   DW_AT_type        : <0x2b>
    <106a>   DW_AT_upper_bound : 2
 <2><106b>: Abbrev Number: 0
 <1><106c>: Abbrev Number: 3 (DW_TAG_const_type)
    <106d>   DW_AT_type        : <0x105c>
 <1><1071>: Abbrev Number: 13 (DW_TAG_variable)
    <1072>   DW_AT_name        : (indirect string, offset: 0xea8): nsyscall_vec
    <1076>   DW_AT_decl_file   : 20
    <1077>   DW_AT_decl_line   : 1903
    <1079>   DW_AT_decl_column : 27
    <107a>   DW_AT_type        : <0x106c>
    <107e>   DW_AT_external    : 1
    <107f>   DW_AT_declaration : 1
 <1><1080>: Abbrev Number: 10 (DW_TAG_array_type)
    <1081>   DW_AT_type        : <0x9dc>
    <1085>   DW_AT_sibling     : <0x1090>
 <2><1089>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <108a>   DW_AT_type        : <0x2b>
    <108e>   DW_AT_upper_bound : 2
 <2><108f>: Abbrev Number: 0
 <1><1090>: Abbrev Number: 3 (DW_TAG_const_type)
    <1091>   DW_AT_type        : <0x1080>
 <1><1095>: Abbrev Number: 13 (DW_TAG_variable)
    <1096>   DW_AT_name        : (indirect string, offset: 0x776): sysent_vec
    <109a>   DW_AT_decl_file   : 20
    <109b>   DW_AT_decl_line   : 1904
    <109d>   DW_AT_decl_column : 35
    <109e>   DW_AT_type        : <0x1090>
    <10a2>   DW_AT_external    : 1
    <10a3>   DW_AT_declaration : 1
 <1><10a4>: Abbrev Number: 13 (DW_TAG_variable)
    <10a5>   DW_AT_name        : (indirect string, offset: 0x35a): inject_vec
    <10a9>   DW_AT_decl_file   : 20
    <10aa>   DW_AT_decl_line   : 1905
    <10ac>   DW_AT_decl_column : 28
    <10ad>   DW_AT_type        : <0x9e1>
    <10b1>   DW_AT_external    : 1
    <10b2>   DW_AT_declaration : 1
 <1><10b3>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10b4>   DW_AT_name        : (indirect string, offset: 0xd39): audit_arch_t
    <10b8>   DW_AT_byte_size   : 8
    <10b9>   DW_AT_decl_file   : 20
    <10ba>   DW_AT_decl_line   : 1907
    <10bc>   DW_AT_decl_column : 8
    <10bd>   DW_AT_sibling     : <0x10e2>
 <2><10c1>: Abbrev Number: 23 (DW_TAG_member)
    <10c2>   DW_AT_name        : (indirect string, offset: 0x555): arch
    <10c6>   DW_AT_decl_file   : 20
    <10c7>   DW_AT_decl_line   : 1908
    <10c9>   DW_AT_decl_column : 15
    <10ca>   DW_AT_type        : <0x2b>
    <10ce>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d1>: Abbrev Number: 23 (DW_TAG_member)
    <10d2>   DW_AT_name        : (indirect string, offset: 0x995): flag
    <10d6>   DW_AT_decl_file   : 20
    <10d7>   DW_AT_decl_line   : 1909
    <10d9>   DW_AT_decl_column : 15
    <10da>   DW_AT_type        : <0x2b>
    <10de>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e1>: Abbrev Number: 0
 <1><10e2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e3>   DW_AT_type        : <0x10b3>
 <1><10e7>: Abbrev Number: 10 (DW_TAG_array_type)
    <10e8>   DW_AT_type        : <0x10e2>
    <10ec>   DW_AT_sibling     : <0x10f7>
 <2><10f0>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10f1>   DW_AT_type        : <0x2b>
    <10f5>   DW_AT_upper_bound : 2
 <2><10f6>: Abbrev Number: 0
 <1><10f7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f8>   DW_AT_type        : <0x10e7>
 <1><10fc>: Abbrev Number: 13 (DW_TAG_variable)
    <10fd>   DW_AT_name        : (indirect string, offset: 0x90b): audit_arch_vec
    <1101>   DW_AT_decl_file   : 20
    <1102>   DW_AT_decl_line   : 1912
    <1104>   DW_AT_decl_column : 34
    <1105>   DW_AT_type        : <0x10f7>
    <1109>   DW_AT_external    : 1
    <110a>   DW_AT_declaration : 1
 <1><110b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <110c>   DW_AT_byte_size   : 180
    <110d>   DW_AT_decl_file   : 22
    <110e>   DW_AT_decl_line   : 2
    <110f>   DW_AT_decl_column : 9
    <1110>   DW_AT_sibling     : <0x13c5>
 <2><1114>: Abbrev Number: 9 (DW_TAG_member)
    <1115>   DW_AT_name        : (indirect string, offset: 0x1bd): block_ioctl
    <1119>   DW_AT_decl_file   : 22
    <111a>   DW_AT_decl_line   : 3
    <111b>   DW_AT_decl_column : 8
    <111c>   DW_AT_type        : <0x13df>
    <1120>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1123>: Abbrev Number: 9 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0xa74): btrfs_ioctl
    <1128>   DW_AT_decl_file   : 22
    <1129>   DW_AT_decl_line   : 6
    <112a>   DW_AT_decl_column : 8
    <112b>   DW_AT_type        : <0x13df>
    <112f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1132>: Abbrev Number: 9 (DW_TAG_member)
    <1133>   DW_AT_name        : (indirect string, offset: 0x714): evdev_write_ioctl_mpers
    <1137>   DW_AT_decl_file   : 22
    <1138>   DW_AT_decl_line   : 9
    <1139>   DW_AT_decl_column : 8
    <113a>   DW_AT_type        : <0x13df>
    <113e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1141>: Abbrev Number: 9 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0x6ea): get_sock_fprog_size
    <1146>   DW_AT_decl_file   : 22
    <1147>   DW_AT_decl_line   : 12
    <1148>   DW_AT_decl_column : 17
