Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x169a (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5ac): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3ac): mpers-m32/struct_sigset_addr_size.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x9fd): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x382): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfb8): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x946): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x325): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x235): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xda6): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x475): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x84c): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe90): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x87c): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x757): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb37): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb6d): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2a1): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcb9): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc2e): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3f2): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x43e): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x331): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb58): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf38): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xdb6): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe43): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x108e): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x124): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xae0): timespec
    <179>   DW_AT_byte_size   : 8
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x10a3): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xc1>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xde7): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xd4>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 12
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xaa2): long double
 <1><1a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a8>   DW_AT_byte_size   : 16
    <1a9>   DW_AT_encoding    : 4	(float)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xf73): _Float128
 <1><1ae>: Abbrev Number: 13 (DW_TAG_variable)
    <1af>   DW_AT_name        : (indirect string, offset: 0x258): __environ
    <1b3>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 543
    <1b6>   DW_AT_decl_column : 15
    <1b7>   DW_AT_type        : <0x1bd>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1be>   DW_AT_byte_size   : 4
    <1bf>   DW_AT_type        : <0xe0>
 <1><1c3>: Abbrev Number: 13 (DW_TAG_variable)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x37a): environ
    <1c8>   DW_AT_decl_file   : 7
    <1c9>   DW_AT_decl_line   : 545
    <1cb>   DW_AT_decl_column : 15
    <1cc>   DW_AT_type        : <0x1bd>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 14 (DW_TAG_variable)
    <1d3>   DW_AT_name        : (indirect string, offset: 0xfa2): optarg
    <1d7>   DW_AT_decl_file   : 8
    <1d8>   DW_AT_decl_line   : 36
    <1d9>   DW_AT_decl_column : 14
    <1da>   DW_AT_type        : <0xe0>
    <1de>   DW_AT_external    : 1
    <1df>   DW_AT_declaration : 1
 <1><1e0>: Abbrev Number: 14 (DW_TAG_variable)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x72a): optind
    <1e5>   DW_AT_decl_file   : 8
    <1e6>   DW_AT_decl_line   : 50
    <1e7>   DW_AT_decl_column : 12
    <1e8>   DW_AT_type        : <0x64>
    <1ec>   DW_AT_external    : 1
    <1ed>   DW_AT_declaration : 1
 <1><1ee>: Abbrev Number: 14 (DW_TAG_variable)
    <1ef>   DW_AT_name        : (indirect string, offset: 0xc1d): opterr
    <1f3>   DW_AT_decl_file   : 8
    <1f4>   DW_AT_decl_line   : 55
    <1f5>   DW_AT_decl_column : 12
    <1f6>   DW_AT_type        : <0x64>
    <1fa>   DW_AT_external    : 1
    <1fb>   DW_AT_declaration : 1
 <1><1fc>: Abbrev Number: 14 (DW_TAG_variable)
    <1fd>   DW_AT_name        : (indirect string, offset: 0xb1d): optopt
    <201>   DW_AT_decl_file   : 8
    <202>   DW_AT_decl_line   : 59
    <203>   DW_AT_decl_column : 12
    <204>   DW_AT_type        : <0x64>
    <208>   DW_AT_external    : 1
    <209>   DW_AT_declaration : 1
 <1><20a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <20b>   DW_AT_byte_size   : 4
    <20c>   DW_AT_type        : <0xed>
 <1><210>: Abbrev Number: 3 (DW_TAG_const_type)
    <211>   DW_AT_type        : <0x20a>
 <1><215>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <216>   DW_AT_byte_size   : 4
    <217>   DW_AT_type        : <0x21b>
 <1><21b>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><21c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <21d>   DW_AT_name        : (indirect string, offset: 0x339): _IO_FILE
    <221>   DW_AT_byte_size   : 148
    <222>   DW_AT_decl_file   : 9
    <223>   DW_AT_decl_line   : 49
    <224>   DW_AT_decl_column : 8
    <225>   DW_AT_sibling     : <0x3dd>
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x9d9): _flags
    <22e>   DW_AT_decl_file   : 9
    <22f>   DW_AT_decl_line   : 51
    <230>   DW_AT_decl_column : 7
    <231>   DW_AT_type        : <0x64>
    <235>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><238>: Abbrev Number: 9 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x4c4): _IO_read_ptr
    <23d>   DW_AT_decl_file   : 9
    <23e>   DW_AT_decl_line   : 54
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0xe0>
    <244>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><247>: Abbrev Number: 9 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0xee5): _IO_read_end
    <24c>   DW_AT_decl_file   : 9
    <24d>   DW_AT_decl_line   : 55
    <24e>   DW_AT_decl_column : 9
    <24f>   DW_AT_type        : <0xe0>
    <253>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><256>: Abbrev Number: 9 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x793): _IO_read_base
    <25b>   DW_AT_decl_file   : 9
    <25c>   DW_AT_decl_line   : 56
    <25d>   DW_AT_decl_column : 9
    <25e>   DW_AT_type        : <0xe0>
    <262>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><265>: Abbrev Number: 9 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x9ba): _IO_write_base
    <26a>   DW_AT_decl_file   : 9
    <26b>   DW_AT_decl_line   : 57
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0xe0>
    <271>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><274>: Abbrev Number: 9 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0xff1): _IO_write_ptr
    <279>   DW_AT_decl_file   : 9
    <27a>   DW_AT_decl_line   : 58
    <27b>   DW_AT_decl_column : 9
    <27c>   DW_AT_type        : <0xe0>
    <280>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><283>: Abbrev Number: 9 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0x8be): _IO_write_end
    <288>   DW_AT_decl_file   : 9
    <289>   DW_AT_decl_line   : 59
    <28a>   DW_AT_decl_column : 9
    <28b>   DW_AT_type        : <0xe0>
    <28f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><292>: Abbrev Number: 9 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x92f): _IO_buf_base
    <297>   DW_AT_decl_file   : 9
    <298>   DW_AT_decl_line   : 60
    <299>   DW_AT_decl_column : 9
    <29a>   DW_AT_type        : <0xe0>
    <29e>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><2a1>: Abbrev Number: 9 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0xd51): _IO_buf_end
    <2a6>   DW_AT_decl_file   : 9
    <2a7>   DW_AT_decl_line   : 61
    <2a8>   DW_AT_decl_column : 9
    <2a9>   DW_AT_type        : <0xe0>
    <2ad>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2b0>: Abbrev Number: 9 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x1af): _IO_save_base
    <2b5>   DW_AT_decl_file   : 9
    <2b6>   DW_AT_decl_line   : 64
    <2b7>   DW_AT_decl_column : 9
    <2b8>   DW_AT_type        : <0xe0>
    <2bc>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2bf>: Abbrev Number: 9 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0xc80): _IO_backup_base
    <2c4>   DW_AT_decl_file   : 9
    <2c5>   DW_AT_decl_line   : 65
    <2c6>   DW_AT_decl_column : 9
    <2c7>   DW_AT_type        : <0xe0>
    <2cb>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2ce>: Abbrev Number: 9 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2d3>   DW_AT_decl_file   : 9
    <2d4>   DW_AT_decl_line   : 66
    <2d5>   DW_AT_decl_column : 9
    <2d6>   DW_AT_type        : <0xe0>
    <2da>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2dd>: Abbrev Number: 9 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x558): _markers
    <2e2>   DW_AT_decl_file   : 9
    <2e3>   DW_AT_decl_line   : 68
    <2e4>   DW_AT_decl_column : 22
    <2e5>   DW_AT_type        : <0x3f7>
    <2e9>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ec>: Abbrev Number: 9 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1f2): _chain
    <2f1>   DW_AT_decl_file   : 9
    <2f2>   DW_AT_decl_line   : 70
    <2f3>   DW_AT_decl_column : 20
    <2f4>   DW_AT_type        : <0x3fd>
    <2f8>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2fb>: Abbrev Number: 9 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0xf5e): _fileno
    <300>   DW_AT_decl_file   : 9
    <301>   DW_AT_decl_line   : 72
    <302>   DW_AT_decl_column : 7
    <303>   DW_AT_type        : <0x64>
    <307>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><30a>: Abbrev Number: 9 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x77f): _flags2
    <30f>   DW_AT_decl_file   : 9
    <310>   DW_AT_decl_line   : 73
    <311>   DW_AT_decl_column : 7
    <312>   DW_AT_type        : <0x64>
    <316>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><319>: Abbrev Number: 9 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x7f8): _old_offset
    <31e>   DW_AT_decl_file   : 9
    <31f>   DW_AT_decl_line   : 74
    <320>   DW_AT_decl_column : 11
    <321>   DW_AT_type        : <0xa2>
    <325>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><328>: Abbrev Number: 9 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x220): _cur_column
    <32d>   DW_AT_decl_file   : 9
    <32e>   DW_AT_decl_line   : 77
    <32f>   DW_AT_decl_column : 18
    <330>   DW_AT_type        : <0x24>
    <334>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><337>: Abbrev Number: 9 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0xe0d): _vtable_offset
    <33c>   DW_AT_decl_file   : 9
    <33d>   DW_AT_decl_line   : 78
    <33e>   DW_AT_decl_column : 15
    <33f>   DW_AT_type        : <0x3e>
    <343>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><346>: Abbrev Number: 9 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0xc90): _shortbuf
    <34b>   DW_AT_decl_file   : 9
    <34c>   DW_AT_decl_line   : 79
    <34d>   DW_AT_decl_column : 8
    <34e>   DW_AT_type        : <0x403>
    <352>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><355>: Abbrev Number: 9 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x15f): _lock
    <35a>   DW_AT_decl_file   : 9
    <35b>   DW_AT_decl_line   : 81
    <35c>   DW_AT_decl_column : 15
    <35d>   DW_AT_type        : <0x413>
    <361>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><364>: Abbrev Number: 9 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x6c2): _offset
    <369>   DW_AT_decl_file   : 9
    <36a>   DW_AT_decl_line   : 89
    <36b>   DW_AT_decl_column : 13
    <36c>   DW_AT_type        : <0xb5>
    <370>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><373>: Abbrev Number: 9 (DW_TAG_member)
    <374>   DW_AT_name        : (indirect string, offset: 0xa2f): _codecvt
    <378>   DW_AT_decl_file   : 9
    <379>   DW_AT_decl_line   : 91
    <37a>   DW_AT_decl_column : 23
    <37b>   DW_AT_type        : <0x41f>
    <37f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><382>: Abbrev Number: 9 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf86): _wide_data
    <387>   DW_AT_decl_file   : 9
    <388>   DW_AT_decl_line   : 92
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0x42b>
    <38e>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><391>: Abbrev Number: 9 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x39e): _freeres_list
    <396>   DW_AT_decl_file   : 9
    <397>   DW_AT_decl_line   : 93
    <398>   DW_AT_decl_column : 20
    <399>   DW_AT_type        : <0x3fd>
    <39d>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><3a0>: Abbrev Number: 9 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0xbf3): _freeres_buf
    <3a5>   DW_AT_decl_file   : 9
    <3a6>   DW_AT_decl_line   : 94
    <3a7>   DW_AT_decl_column : 9
    <3a8>   DW_AT_type        : <0xcd>
    <3ac>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><3af>: Abbrev Number: 9 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x98c): __pad5
    <3b4>   DW_AT_decl_file   : 9
    <3b5>   DW_AT_decl_line   : 95
    <3b6>   DW_AT_decl_column : 10
    <3b7>   DW_AT_type        : <0x122>
    <3bb>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3be>: Abbrev Number: 9 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x23f): _mode
    <3c3>   DW_AT_decl_file   : 9
    <3c4>   DW_AT_decl_line   : 96
    <3c5>   DW_AT_decl_column : 7
    <3c6>   DW_AT_type        : <0x64>
    <3ca>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3cd>: Abbrev Number: 9 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x7ad): _unused2
    <3d2>   DW_AT_decl_file   : 9
    <3d3>   DW_AT_decl_line   : 98
    <3d4>   DW_AT_decl_column : 8
    <3d5>   DW_AT_type        : <0x431>
    <3d9>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3dc>: Abbrev Number: 0
 <1><3dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0xac2): FILE
    <3e2>   DW_AT_decl_file   : 10
    <3e3>   DW_AT_decl_line   : 7
    <3e4>   DW_AT_decl_column : 25
    <3e5>   DW_AT_type        : <0x21c>
 <1><3e9>: Abbrev Number: 16 (DW_TAG_typedef)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x46a): _IO_lock_t
    <3ee>   DW_AT_decl_file   : 9
    <3ef>   DW_AT_decl_line   : 43
    <3f0>   DW_AT_decl_column : 14
 <1><3f1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x2e3): _IO_marker
    <3f6>   DW_AT_declaration : 1
 <1><3f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f8>   DW_AT_byte_size   : 4
    <3f9>   DW_AT_type        : <0x3f1>
 <1><3fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fe>   DW_AT_byte_size   : 4
    <3ff>   DW_AT_type        : <0x21c>
 <1><403>: Abbrev Number: 10 (DW_TAG_array_type)
    <404>   DW_AT_type        : <0xe6>
    <408>   DW_AT_sibling     : <0x413>
 <2><40c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40d>   DW_AT_type        : <0x2b>
    <411>   DW_AT_upper_bound : 0
 <2><412>: Abbrev Number: 0
 <1><413>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_type        : <0x3e9>
 <1><419>: Abbrev Number: 17 (DW_TAG_structure_type)
    <41a>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <41e>   DW_AT_declaration : 1
 <1><41f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <420>   DW_AT_byte_size   : 4
    <421>   DW_AT_type        : <0x419>
 <1><425>: Abbrev Number: 17 (DW_TAG_structure_type)
    <426>   DW_AT_name        : (indirect string, offset: 0x34d): _IO_wide_data
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <42c>   DW_AT_byte_size   : 4
    <42d>   DW_AT_type        : <0x425>
 <1><431>: Abbrev Number: 10 (DW_TAG_array_type)
    <432>   DW_AT_type        : <0xe6>
    <436>   DW_AT_sibling     : <0x441>
 <2><43a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <43b>   DW_AT_type        : <0x2b>
    <43f>   DW_AT_upper_bound : 39
 <2><440>: Abbrev Number: 0
 <1><441>: Abbrev Number: 14 (DW_TAG_variable)
    <442>   DW_AT_name        : (indirect string, offset: 0x523): stdin
    <446>   DW_AT_decl_file   : 11
    <447>   DW_AT_decl_line   : 137
    <448>   DW_AT_decl_column : 14
    <449>   DW_AT_type        : <0x44f>
    <44d>   DW_AT_external    : 1
    <44e>   DW_AT_declaration : 1
 <1><44f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <450>   DW_AT_byte_size   : 4
    <451>   DW_AT_type        : <0x3dd>
 <1><455>: Abbrev Number: 14 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0xfcb): stdout
    <45a>   DW_AT_decl_file   : 11
    <45b>   DW_AT_decl_line   : 138
    <45c>   DW_AT_decl_column : 14
    <45d>   DW_AT_type        : <0x44f>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 14 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xd9f): stderr
    <468>   DW_AT_decl_file   : 11
    <469>   DW_AT_decl_line   : 139
    <46a>   DW_AT_decl_column : 14
    <46b>   DW_AT_type        : <0x44f>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 14 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x22c): sys_nerr
    <476>   DW_AT_decl_file   : 12
    <477>   DW_AT_decl_line   : 26
    <478>   DW_AT_decl_column : 12
    <479>   DW_AT_type        : <0x64>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 10 (DW_TAG_array_type)
    <480>   DW_AT_type        : <0x210>
    <484>   DW_AT_sibling     : <0x48a>
 <2><488>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><489>: Abbrev Number: 0
 <1><48a>: Abbrev Number: 3 (DW_TAG_const_type)
    <48b>   DW_AT_type        : <0x47f>
 <1><48f>: Abbrev Number: 14 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0x532): sys_errlist
    <494>   DW_AT_decl_file   : 12
    <495>   DW_AT_decl_line   : 27
    <496>   DW_AT_decl_column : 26
    <497>   DW_AT_type        : <0x48a>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 14 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x245): _sys_nerr
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 30
    <4a4>   DW_AT_decl_column : 12
    <4a5>   DW_AT_type        : <0x64>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 14 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xe1c): _sys_errlist
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 31
    <4b2>   DW_AT_decl_column : 26
    <4b3>   DW_AT_type        : <0x48a>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 14 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x69b): program_invocation_name
    <4be>   DW_AT_decl_file   : 13
    <4bf>   DW_AT_decl_line   : 45
    <4c0>   DW_AT_decl_column : 14
    <4c1>   DW_AT_type        : <0xe0>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 14 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xb98): program_invocation_short_name
    <4cc>   DW_AT_decl_file   : 13
    <4cd>   DW_AT_decl_line   : 46
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0xe0>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 10 (DW_TAG_array_type)
    <4d6>   DW_AT_type        : <0xe0>
    <4da>   DW_AT_sibling     : <0x4e5>
 <2><4de>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4df>   DW_AT_type        : <0x2b>
    <4e3>   DW_AT_upper_bound : 1
 <2><4e4>: Abbrev Number: 0
 <1><4e5>: Abbrev Number: 14 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x19c): __tzname
    <4ea>   DW_AT_decl_file   : 14
    <4eb>   DW_AT_decl_line   : 159
    <4ec>   DW_AT_decl_column : 14
    <4ed>   DW_AT_type        : <0x4d5>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 14 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0xe77): __daylight
    <4f8>   DW_AT_decl_file   : 14
    <4f9>   DW_AT_decl_line   : 160
    <4fa>   DW_AT_decl_column : 12
    <4fb>   DW_AT_type        : <0x64>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 14 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0x342): __timezone
    <506>   DW_AT_decl_file   : 14
    <507>   DW_AT_decl_line   : 161
    <508>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xae>
    <50d>   DW_AT_external    : 1
    <50e>   DW_AT_declaration : 1
 <1><50f>: Abbrev Number: 14 (DW_TAG_variable)
    <510>   DW_AT_name        : (indirect string, offset: 0x985): tzname
    <514>   DW_AT_decl_file   : 14
    <515>   DW_AT_decl_line   : 166
    <516>   DW_AT_decl_column : 14
    <517>   DW_AT_type        : <0x4d5>
    <51b>   DW_AT_external    : 1
    <51c>   DW_AT_declaration : 1
 <1><51d>: Abbrev Number: 14 (DW_TAG_variable)
    <51e>   DW_AT_name        : (indirect string, offset: 0x103b): daylight
    <522>   DW_AT_decl_file   : 14
    <523>   DW_AT_decl_line   : 174
    <524>   DW_AT_decl_column : 12
    <525>   DW_AT_type        : <0x64>
    <529>   DW_AT_external    : 1
    <52a>   DW_AT_declaration : 1
 <1><52b>: Abbrev Number: 14 (DW_TAG_variable)
    <52c>   DW_AT_name        : (indirect string, offset: 0x4af): timezone
    <530>   DW_AT_decl_file   : 14
    <531>   DW_AT_decl_line   : 175
    <532>   DW_AT_decl_column : 17
    <533>   DW_AT_type        : <0xae>
    <537>   DW_AT_external    : 1
    <538>   DW_AT_declaration : 1
 <1><539>: Abbrev Number: 13 (DW_TAG_variable)
    <53a>   DW_AT_name        : (indirect string, offset: 0xf0c): getdate_err
    <53e>   DW_AT_decl_file   : 14
    <53f>   DW_AT_decl_line   : 274
    <541>   DW_AT_decl_column : 12
    <542>   DW_AT_type        : <0x64>
    <546>   DW_AT_external    : 1
    <547>   DW_AT_declaration : 1
 <1><548>: Abbrev Number: 14 (DW_TAG_variable)
    <549>   DW_AT_name        : (indirect string, offset: 0x998): debug_flag
    <54d>   DW_AT_decl_file   : 15
    <54e>   DW_AT_decl_line   : 20
    <54f>   DW_AT_decl_column : 13
    <550>   DW_AT_type        : <0x556>
    <554>   DW_AT_external    : 1
    <555>   DW_AT_declaration : 1
 <1><556>: Abbrev Number: 2 (DW_TAG_base_type)
    <557>   DW_AT_byte_size   : 1
    <558>   DW_AT_encoding    : 2	(boolean)
    <559>   DW_AT_name        : (indirect string, offset: 0x404): _Bool
 <1><55d>: Abbrev Number: 3 (DW_TAG_const_type)
    <55e>   DW_AT_type        : <0x556>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0xa73): __kernel_long_t
    <567>   DW_AT_decl_file   : 16
    <568>   DW_AT_decl_line   : 15
    <569>   DW_AT_decl_column : 15
    <56a>   DW_AT_type        : <0xae>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x512): __kernel_ulong_t
    <573>   DW_AT_decl_file   : 16
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 23
    <576>   DW_AT_type        : <0x37>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x3d0): kernel_long_t
    <57f>   DW_AT_decl_file   : 17
    <580>   DW_AT_decl_line   : 16
    <581>   DW_AT_decl_column : 25
    <582>   DW_AT_type        : <0x562>
 <1><586>: Abbrev Number: 4 (DW_TAG_typedef)
    <587>   DW_AT_name        : (indirect string, offset: 0x86d): kernel_ulong_t
    <58b>   DW_AT_decl_file   : 17
    <58c>   DW_AT_decl_line   : 17
    <58d>   DW_AT_decl_column : 26
    <58e>   DW_AT_type        : <0x56e>
 <1><592>: Abbrev Number: 3 (DW_TAG_const_type)
    <593>   DW_AT_type        : <0x586>
 <1><597>: Abbrev Number: 12 (DW_TAG_structure_type)
    <598>   DW_AT_name        : (indirect string, offset: 0xbb6): list_item
    <59c>   DW_AT_byte_size   : 8
    <59d>   DW_AT_decl_file   : 18
    <59e>   DW_AT_decl_line   : 92
    <59f>   DW_AT_decl_column : 8
    <5a0>   DW_AT_sibling     : <0x5c3>
 <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x109e): prev
    <5a9>   DW_AT_decl_file   : 18
    <5aa>   DW_AT_decl_line   : 93
    <5ab>   DW_AT_decl_column : 20
    <5ac>   DW_AT_type        : <0x5c3>
    <5b0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b3>: Abbrev Number: 9 (DW_TAG_member)
    <5b4>   DW_AT_name        : (indirect string, offset: 0xa83): next
    <5b8>   DW_AT_decl_file   : 18
    <5b9>   DW_AT_decl_line   : 94
    <5ba>   DW_AT_decl_column : 20
    <5bb>   DW_AT_type        : <0x5c3>
    <5bf>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5c4>   DW_AT_byte_size   : 4
    <5c5>   DW_AT_type        : <0x597>
 <1><5c9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x845): sysent
    <5ce>   DW_AT_byte_size   : 20
    <5cf>   DW_AT_decl_file   : 19
    <5d0>   DW_AT_decl_line   : 13
    <5d1>   DW_AT_decl_column : 16
    <5d2>   DW_AT_sibling     : <0x622>
 <2><5d6>: Abbrev Number: 9 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xfe2): nargs
    <5db>   DW_AT_decl_file   : 19
    <5dc>   DW_AT_decl_line   : 14
    <5dd>   DW_AT_decl_column : 11
    <5de>   DW_AT_type        : <0x2b>
    <5e2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5e5>: Abbrev Number: 9 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x93c): sys_flags
    <5ea>   DW_AT_decl_file   : 19
    <5eb>   DW_AT_decl_line   : 15
    <5ec>   DW_AT_decl_column : 6
    <5ed>   DW_AT_type        : <0x64>
    <5f1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5f4>: Abbrev Number: 19 (DW_TAG_member)
    <5f5>   DW_AT_name        : sen
    <5f9>   DW_AT_decl_file   : 19
    <5fa>   DW_AT_decl_line   : 16
    <5fb>   DW_AT_decl_column : 6
    <5fc>   DW_AT_type        : <0x64>
    <600>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><603>: Abbrev Number: 9 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x2da): sys_func
    <608>   DW_AT_decl_file   : 19
    <609>   DW_AT_decl_line   : 17
    <60a>   DW_AT_decl_column : 8
    <60b>   DW_AT_type        : <0x89a>
    <60f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><612>: Abbrev Number: 9 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x24f): sys_name
    <617>   DW_AT_decl_file   : 19
    <618>   DW_AT_decl_line   : 18
    <619>   DW_AT_decl_column : 14
    <61a>   DW_AT_type        : <0x20a>
    <61e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><621>: Abbrev Number: 0
 <1><622>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <623>   DW_AT_prototyped  : 1
    <624>   DW_AT_type        : <0x64>
    <628>   DW_AT_sibling     : <0x632>
 <2><62c>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <62d>   DW_AT_type        : <0x632>
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <633>   DW_AT_byte_size   : 4
    <634>   DW_AT_type        : <0x63d>
 <1><638>: Abbrev Number: 3 (DW_TAG_const_type)
    <639>   DW_AT_type        : <0x632>
 <1><63d>: Abbrev Number: 22 (DW_TAG_structure_type)
    <63e>   DW_AT_name        : tcb
    <642>   DW_AT_byte_size   : 220
    <643>   DW_AT_decl_file   : 20
    <644>   DW_AT_decl_line   : 262
    <646>   DW_AT_decl_column : 8
    <647>   DW_AT_sibling     : <0x89a>
 <2><64b>: Abbrev Number: 23 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x4be): flags
    <650>   DW_AT_decl_file   : 20
    <651>   DW_AT_decl_line   : 263
    <653>   DW_AT_decl_column : 6
    <654>   DW_AT_type        : <0x64>
    <658>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><65b>: Abbrev Number: 24 (DW_TAG_member)
    <65c>   DW_AT_name        : pid
    <660>   DW_AT_decl_file   : 20
    <661>   DW_AT_decl_line   : 264
    <663>   DW_AT_decl_column : 6
    <664>   DW_AT_type        : <0x64>
    <668>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><66b>: Abbrev Number: 23 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <670>   DW_AT_decl_file   : 20
    <671>   DW_AT_decl_line   : 265
    <673>   DW_AT_decl_column : 6
    <674>   DW_AT_type        : <0x64>
    <678>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><67b>: Abbrev Number: 23 (DW_TAG_member)
    <67c>   DW_AT_name        : (indirect string, offset: 0x366): currpers
    <680>   DW_AT_decl_file   : 20
    <681>   DW_AT_decl_line   : 267
    <683>   DW_AT_decl_column : 15
    <684>   DW_AT_type        : <0x2b>
    <688>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><68b>: Abbrev Number: 23 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0xb15): u_error
    <690>   DW_AT_decl_file   : 20
    <691>   DW_AT_decl_line   : 269
    <693>   DW_AT_decl_column : 16
    <694>   DW_AT_type        : <0x37>
    <698>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><69b>: Abbrev Number: 23 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <6a0>   DW_AT_decl_file   : 20
    <6a1>   DW_AT_decl_line   : 270
    <6a3>   DW_AT_decl_column : 17
    <6a4>   DW_AT_type        : <0x586>
    <6a8>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><6ab>: Abbrev Number: 23 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0xb4e): true_scno
    <6b0>   DW_AT_decl_file   : 20
    <6b1>   DW_AT_decl_line   : 271
    <6b3>   DW_AT_decl_column : 17
    <6b4>   DW_AT_type        : <0x586>
    <6b8>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6bb>: Abbrev Number: 23 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x186): u_arg
    <6c0>   DW_AT_decl_file   : 20
    <6c1>   DW_AT_decl_line   : 272
    <6c3>   DW_AT_decl_column : 17
    <6c4>   DW_AT_type        : <0x9ca>
    <6c8>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6cb>: Abbrev Number: 23 (DW_TAG_member)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x953): u_rval
    <6d0>   DW_AT_decl_file   : 20
    <6d1>   DW_AT_decl_line   : 273
    <6d3>   DW_AT_decl_column : 16
    <6d4>   DW_AT_type        : <0x57a>
    <6d8>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6db>: Abbrev Number: 23 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0xa94): sys_func_rval
    <6e0>   DW_AT_decl_file   : 20
    <6e1>   DW_AT_decl_line   : 274
    <6e3>   DW_AT_decl_column : 6
    <6e4>   DW_AT_type        : <0x64>
    <6e8>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6eb>: Abbrev Number: 23 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0xcaa): curcol
    <6f0>   DW_AT_decl_file   : 20
    <6f1>   DW_AT_decl_line   : 275
    <6f3>   DW_AT_decl_column : 6
    <6f4>   DW_AT_type        : <0x64>
    <6f8>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6fb>: Abbrev Number: 23 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x965): outf
    <700>   DW_AT_decl_file   : 20
    <701>   DW_AT_decl_line   : 276
    <703>   DW_AT_decl_column : 8
    <704>   DW_AT_type        : <0x44f>
    <708>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><70b>: Abbrev Number: 23 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0xeb6): staged_output_data
    <710>   DW_AT_decl_file   : 20
    <711>   DW_AT_decl_line   : 277
    <713>   DW_AT_decl_column : 29
    <714>   DW_AT_type        : <0x9e0>
    <718>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><71b>: Abbrev Number: 23 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0xa5a): auxstr
    <720>   DW_AT_decl_file   : 20
    <721>   DW_AT_decl_line   : 279
    <723>   DW_AT_decl_column : 14
    <724>   DW_AT_type        : <0x20a>
    <728>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><72b>: Abbrev Number: 23 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x165): _priv_data
    <730>   DW_AT_decl_file   : 20
    <731>   DW_AT_decl_line   : 280
    <733>   DW_AT_decl_column : 8
    <734>   DW_AT_type        : <0xcd>
    <738>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><73b>: Abbrev Number: 23 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0xbe3): _free_priv_data
    <740>   DW_AT_decl_file   : 20
    <741>   DW_AT_decl_line   : 281
    <743>   DW_AT_decl_column : 9
    <744>   DW_AT_type        : <0x9f2>
    <748>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><74b>: Abbrev Number: 23 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0x176): s_ent
    <750>   DW_AT_decl_file   : 20
    <751>   DW_AT_decl_line   : 282
    <753>   DW_AT_decl_column : 23
    <754>   DW_AT_type        : <0x9f8>
    <758>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><75b>: Abbrev Number: 23 (DW_TAG_member)
    <75c>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <760>   DW_AT_decl_file   : 20
    <761>   DW_AT_decl_line   : 285
    <763>   DW_AT_decl_column : 23
    <764>   DW_AT_type        : <0x9f8>
    <768>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><76b>: Abbrev Number: 23 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x35b): inject_vec
    <770>   DW_AT_decl_file   : 20
    <771>   DW_AT_decl_line   : 286
    <773>   DW_AT_decl_column : 22
    <774>   DW_AT_type        : <0xa03>
    <778>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><77b>: Abbrev Number: 23 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x7b6): stime
    <780>   DW_AT_decl_file   : 20
    <781>   DW_AT_decl_line   : 287
    <783>   DW_AT_decl_column : 18
    <784>   DW_AT_type        : <0x174>
    <788>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><78b>: Abbrev Number: 23 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x36f): ltime
    <790>   DW_AT_decl_file   : 20
    <791>   DW_AT_decl_line   : 288
    <793>   DW_AT_decl_column : 18
    <794>   DW_AT_type        : <0x174>
    <798>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><79b>: Abbrev Number: 23 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0xfa9): atime
    <7a0>   DW_AT_decl_file   : 20
    <7a1>   DW_AT_decl_line   : 289
    <7a3>   DW_AT_decl_column : 18
    <7a4>   DW_AT_type        : <0x174>
    <7a8>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><7ab>: Abbrev Number: 23 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x4b8): etime
    <7b0>   DW_AT_decl_file   : 20
    <7b1>   DW_AT_decl_line   : 290
    <7b3>   DW_AT_decl_column : 18
    <7b4>   DW_AT_type        : <0x174>
    <7b8>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7bc>: Abbrev Number: 23 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xd0e): delay_expiration_time
    <7c1>   DW_AT_decl_file   : 20
    <7c2>   DW_AT_decl_line   : 291
    <7c4>   DW_AT_decl_column : 18
    <7c5>   DW_AT_type        : <0x174>
    <7c9>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7cd>: Abbrev Number: 23 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7d2>   DW_AT_decl_file   : 20
    <7d3>   DW_AT_decl_line   : 298
    <7d5>   DW_AT_decl_column : 15
    <7d6>   DW_AT_type        : <0x2b>
    <7da>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7de>: Abbrev Number: 23 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0xef2): last_dirfd
    <7e3>   DW_AT_decl_file   : 20
    <7e4>   DW_AT_decl_line   : 301
    <7e6>   DW_AT_decl_column : 6
    <7e7>   DW_AT_type        : <0x64>
    <7eb>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ef>: Abbrev Number: 23 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xf18): mmap_cache
    <7f4>   DW_AT_decl_file   : 20
    <7f5>   DW_AT_decl_line   : 304
    <7f7>   DW_AT_decl_column : 23
    <7f8>   DW_AT_type        : <0xa1f>
    <7fc>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><800>: Abbrev Number: 23 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0xb24): wait_data_idx
    <805>   DW_AT_decl_file   : 20
    <806>   DW_AT_decl_line   : 311
    <808>   DW_AT_decl_column : 9
    <809>   DW_AT_type        : <0x122>
    <80d>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><811>: Abbrev Number: 23 (DW_TAG_member)
    <812>   DW_AT_name        : (indirect string, offset: 0xa61): delayed_wait_data
    <816>   DW_AT_decl_file   : 20
    <817>   DW_AT_decl_line   : 313
    <819>   DW_AT_decl_column : 24
    <81a>   DW_AT_type        : <0xa2b>
    <81e>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><822>: Abbrev Number: 23 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0xad6): wait_list
    <827>   DW_AT_decl_file   : 20
    <828>   DW_AT_decl_line   : 314
    <82a>   DW_AT_decl_column : 19
    <82b>   DW_AT_type        : <0x597>
    <82f>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><833>: Abbrev Number: 23 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0x6b3): vcpu_info_list
    <838>   DW_AT_decl_file   : 20
    <839>   DW_AT_decl_line   : 318
    <83b>   DW_AT_decl_column : 20
    <83c>   DW_AT_type        : <0xa37>
    <840>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><844>: Abbrev Number: 23 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0xc75): unwind_ctx
    <849>   DW_AT_decl_file   : 20
    <84a>   DW_AT_decl_line   : 322
    <84c>   DW_AT_decl_column : 8
    <84d>   DW_AT_type        : <0xcd>
    <851>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><855>: Abbrev Number: 23 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x4a2): unwind_queue
    <85a>   DW_AT_decl_file   : 20
    <85b>   DW_AT_decl_line   : 323
    <85d>   DW_AT_decl_column : 25
    <85e>   DW_AT_type        : <0xa43>
    <862>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><866>: Abbrev Number: 23 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x15a): comm
    <86b>   DW_AT_decl_file   : 20
    <86c>   DW_AT_decl_line   : 327
    <86e>   DW_AT_decl_column : 7
    <86f>   DW_AT_type        : <0xa49>
    <873>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><877>: Abbrev Number: 23 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0x202): start_prc
    <87c>   DW_AT_decl_file   : 20
    <87d>   DW_AT_decl_line   : 329
    <87f>   DW_AT_decl_column : 16
    <880>   DW_AT_type        : <0x37>
    <884>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><888>: Abbrev Number: 23 (DW_TAG_member)
    <889>   DW_AT_name        : (indirect string, offset: 0xf7d): pre_comm
    <88d>   DW_AT_decl_file   : 20
    <88e>   DW_AT_decl_line   : 330
    <890>   DW_AT_decl_column : 7
    <891>   DW_AT_type        : <0xa49>
    <895>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><899>: Abbrev Number: 0
 <1><89a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <89b>   DW_AT_byte_size   : 4
    <89c>   DW_AT_type        : <0x622>
 <1><8a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <8a1>   DW_AT_name        : (indirect string, offset: 0x504): struct_sysent
    <8a5>   DW_AT_decl_file   : 19
    <8a6>   DW_AT_decl_line   : 19
    <8a7>   DW_AT_decl_column : 3
    <8a8>   DW_AT_type        : <0x5c9>
 <1><8ac>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ad>   DW_AT_type        : <0x8a0>
 <1><8b1>: Abbrev Number: 14 (DW_TAG_variable)
    <8b2>   DW_AT_name        : (indirect string, offset: 0xcfa): current_personality
    <8b6>   DW_AT_decl_file   : 20
    <8b7>   DW_AT_decl_line   : 158
    <8b8>   DW_AT_decl_column : 17
    <8b9>   DW_AT_type        : <0x2b>
    <8bd>   DW_AT_external    : 1
    <8be>   DW_AT_declaration : 1
 <1><8bf>: Abbrev Number: 14 (DW_TAG_variable)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x7e7): current_wordsize
    <8c4>   DW_AT_decl_file   : 20
    <8c5>   DW_AT_decl_line   : 171
    <8c6>   DW_AT_decl_column : 17
    <8c7>   DW_AT_type        : <0x2b>
    <8cb>   DW_AT_external    : 1
    <8cc>   DW_AT_declaration : 1
 <1><8cd>: Abbrev Number: 14 (DW_TAG_variable)
    <8ce>   DW_AT_name        : (indirect string, offset: 0xa38): current_klongsize
    <8d2>   DW_AT_decl_file   : 20
    <8d3>   DW_AT_decl_line   : 176
    <8d4>   DW_AT_decl_column : 17
    <8d5>   DW_AT_type        : <0x2b>
    <8d9>   DW_AT_external    : 1
    <8da>   DW_AT_declaration : 1
 <1><8db>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8dc>   DW_AT_name        : (indirect string, offset: 0xc4c): ioctlent
    <8e0>   DW_AT_byte_size   : 8
    <8e1>   DW_AT_decl_file   : 20
    <8e2>   DW_AT_decl_line   : 217
    <8e3>   DW_AT_decl_column : 16
    <8e4>   DW_AT_sibling     : <0x907>
 <2><8e8>: Abbrev Number: 9 (DW_TAG_member)
    <8e9>   DW_AT_name        : (indirect string, offset: 0xede): symbol
    <8ed>   DW_AT_decl_file   : 20
    <8ee>   DW_AT_decl_line   : 218
    <8ef>   DW_AT_decl_column : 14
    <8f0>   DW_AT_type        : <0x20a>
    <8f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f7>: Abbrev Number: 9 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0xcc3): code
    <8fc>   DW_AT_decl_file   : 20
    <8fd>   DW_AT_decl_line   : 219
    <8fe>   DW_AT_decl_column : 15
    <8ff>   DW_AT_type        : <0x2b>
    <903>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><906>: Abbrev Number: 0
 <1><907>: Abbrev Number: 4 (DW_TAG_typedef)
    <908>   DW_AT_name        : (indirect string, offset: 0xc0d): struct_ioctlent
    <90c>   DW_AT_decl_file   : 20
    <90d>   DW_AT_decl_line   : 220
    <90e>   DW_AT_decl_column : 3
    <90f>   DW_AT_type        : <0x8db>
 <1><913>: Abbrev Number: 3 (DW_TAG_const_type)
    <914>   DW_AT_type        : <0x907>
 <1><918>: Abbrev Number: 12 (DW_TAG_structure_type)
    <919>   DW_AT_name        : (indirect string, offset: 0x7db): inject_data
    <91d>   DW_AT_byte_size   : 10
    <91e>   DW_AT_decl_file   : 20
    <91f>   DW_AT_decl_line   : 241
    <920>   DW_AT_decl_column : 8
    <921>   DW_AT_sibling     : <0x980>
 <2><925>: Abbrev Number: 9 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x4be): flags
    <92a>   DW_AT_decl_file   : 20
    <92b>   DW_AT_decl_line   : 242
    <92c>   DW_AT_decl_column : 10
    <92d>   DW_AT_type        : <0xf2>
    <931>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><934>: Abbrev Number: 9 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0x8f0): signo
    <939>   DW_AT_decl_file   : 20
    <93a>   DW_AT_decl_line   : 243
    <93b>   DW_AT_decl_column : 10
    <93c>   DW_AT_type        : <0xf2>
    <940>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><943>: Abbrev Number: 9 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <948>   DW_AT_decl_file   : 20
    <949>   DW_AT_decl_line   : 244
    <94a>   DW_AT_decl_column : 11
    <94b>   DW_AT_type        : <0xfe>
    <94f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><952>: Abbrev Number: 9 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0xca0): delay_idx
    <957>   DW_AT_decl_file   : 20
    <958>   DW_AT_decl_line   : 245
    <959>   DW_AT_decl_column : 11
    <95a>   DW_AT_type        : <0xfe>
    <95e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><961>: Abbrev Number: 9 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x54a): poke_idx
    <966>   DW_AT_decl_file   : 20
    <967>   DW_AT_decl_line   : 246
    <968>   DW_AT_decl_column : 11
    <969>   DW_AT_type        : <0xfe>
    <96d>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><970>: Abbrev Number: 9 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <975>   DW_AT_decl_file   : 20
    <976>   DW_AT_decl_line   : 247
    <977>   DW_AT_decl_column : 11
    <978>   DW_AT_type        : <0xfe>
    <97c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><97f>: Abbrev Number: 0
 <1><980>: Abbrev Number: 12 (DW_TAG_structure_type)
    <981>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <985>   DW_AT_byte_size   : 16
    <986>   DW_AT_decl_file   : 20
    <987>   DW_AT_decl_line   : 250
    <988>   DW_AT_decl_column : 8
    <989>   DW_AT_sibling     : <0x9ca>
 <2><98d>: Abbrev Number: 9 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0x9f7): first
    <992>   DW_AT_decl_file   : 20
    <993>   DW_AT_decl_line   : 251
    <994>   DW_AT_decl_column : 11
    <995>   DW_AT_type        : <0xfe>
    <999>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><99c>: Abbrev Number: 9 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0x10c7): last
    <9a1>   DW_AT_decl_file   : 20
    <9a2>   DW_AT_decl_line   : 252
    <9a3>   DW_AT_decl_column : 11
    <9a4>   DW_AT_type        : <0xfe>
    <9a8>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><9ab>: Abbrev Number: 9 (DW_TAG_member)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x375): step
    <9b0>   DW_AT_decl_file   : 20
    <9b1>   DW_AT_decl_line   : 253
    <9b2>   DW_AT_decl_column : 11
    <9b3>   DW_AT_type        : <0xfe>
    <9b7>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9ba>: Abbrev Number: 9 (DW_TAG_member)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x1099): data
    <9bf>   DW_AT_decl_file   : 20
    <9c0>   DW_AT_decl_line   : 254
    <9c1>   DW_AT_decl_column : 21
    <9c2>   DW_AT_type        : <0x918>
    <9c6>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9c9>: Abbrev Number: 0
 <1><9ca>: Abbrev Number: 10 (DW_TAG_array_type)
    <9cb>   DW_AT_type        : <0x586>
    <9cf>   DW_AT_sibling     : <0x9da>
 <2><9d3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9d4>   DW_AT_type        : <0x2b>
    <9d8>   DW_AT_upper_bound : 5
 <2><9d9>: Abbrev Number: 0
 <1><9da>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0xeb6): staged_output_data
    <9df>   DW_AT_declaration : 1
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9da>
 <1><9e6>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9e7>   DW_AT_prototyped  : 1
    <9e8>   DW_AT_sibling     : <0x9f2>
 <2><9ec>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9ed>   DW_AT_type        : <0xcd>
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f3>   DW_AT_byte_size   : 4
    <9f4>   DW_AT_type        : <0x9e6>
 <1><9f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
    <9fa>   DW_AT_type        : <0x8ac>
 <1><9fe>: Abbrev Number: 3 (DW_TAG_const_type)
    <9ff>   DW_AT_type        : <0x9f8>
 <1><a03>: Abbrev Number: 10 (DW_TAG_array_type)
    <a04>   DW_AT_type        : <0xa13>
    <a08>   DW_AT_sibling     : <0xa13>
 <2><a0c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a0d>   DW_AT_type        : <0x2b>
    <a11>   DW_AT_upper_bound : 2
 <2><a12>: Abbrev Number: 0
 <1><a13>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a14>   DW_AT_byte_size   : 4
    <a15>   DW_AT_type        : <0x980>
 <1><a19>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <a1e>   DW_AT_declaration : 1
 <1><a1f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a20>   DW_AT_byte_size   : 4
    <a21>   DW_AT_type        : <0xa19>
 <1><a25>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a26>   DW_AT_name        : (indirect string, offset: 0x390): tcb_wait_data
    <a2a>   DW_AT_declaration : 1
 <1><a2b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a2c>   DW_AT_byte_size   : 4
    <a2d>   DW_AT_type        : <0xa25>
 <1><a31>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a32>   DW_AT_name        : (indirect string, offset: 0x150): vcpu_info
    <a36>   DW_AT_declaration : 1
 <1><a37>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a38>   DW_AT_byte_size   : 4
    <a39>   DW_AT_type        : <0xa31>
 <1><a3d>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a3e>   DW_AT_name        : (indirect string, offset: 0xe9a): unwind_queue_t
    <a42>   DW_AT_declaration : 1
 <1><a43>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a44>   DW_AT_byte_size   : 4
    <a45>   DW_AT_type        : <0xa3d>
 <1><a49>: Abbrev Number: 10 (DW_TAG_array_type)
    <a4a>   DW_AT_type        : <0xe6>
    <a4e>   DW_AT_sibling     : <0xa59>
 <2><a52>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a53>   DW_AT_type        : <0x2b>
    <a57>   DW_AT_upper_bound : 15
 <2><a58>: Abbrev Number: 0
 <1><a59>: Abbrev Number: 13 (DW_TAG_variable)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xb61): stub_sysent
    <a5e>   DW_AT_decl_file   : 20
    <a5f>   DW_AT_decl_line   : 405
    <a61>   DW_AT_decl_column : 28
    <a62>   DW_AT_type        : <0x8ac>
    <a66>   DW_AT_external    : 1
    <a67>   DW_AT_declaration : 1
 <1><a68>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a69>   DW_AT_name        : (indirect string, offset: 0x1076): xlat_type
    <a6d>   DW_AT_encoding    : 7	(unsigned)
    <a6e>   DW_AT_byte_size   : 4
    <a6f>   DW_AT_type        : <0x2b>
    <a73>   DW_AT_decl_file   : 21
    <a74>   DW_AT_decl_line   : 13
    <a75>   DW_AT_decl_column : 6
    <a76>   DW_AT_sibling     : <0xa8d>
 <2><a7a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x2aa): XT_NORMAL
    <a7f>   DW_AT_const_value : 0
 <2><a80>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0xc24): XT_SORTED
    <a85>   DW_AT_const_value : 1
 <2><a86>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a87>   DW_AT_name        : (indirect string, offset: 0xd86): XT_INDEXED
    <a8b>   DW_AT_const_value : 2
 <2><a8c>: Abbrev Number: 0
 <1><a8d>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xb8d): xlat_style
    <a92>   DW_AT_encoding    : 7	(unsigned)
    <a93>   DW_AT_byte_size   : 4
    <a94>   DW_AT_type        : <0x2b>
    <a98>   DW_AT_decl_file   : 21
    <a99>   DW_AT_decl_line   : 19
    <a9a>   DW_AT_decl_column : 6
    <a9b>   DW_AT_sibling     : <0xaca>
 <2><a9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <aa4>   DW_AT_const_value : 0
 <2><aa5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0xbc0): XLAT_STYLE_RAW
    <aaa>   DW_AT_const_value : 1
 <2><aab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x1029): XLAT_STYLE_ABBREV
    <ab0>   DW_AT_const_value : 2
 <2><ab1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x2c7): XLAT_STYLE_VERBOSE
    <ab6>   DW_AT_const_value : 3
 <2><ab7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <abc>   DW_AT_const_value : 0
 <2><abd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ac2>   DW_AT_const_value : 4
 <2><ac3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x10b6): XLAT_STYLE_FMT_D
    <ac8>   DW_AT_const_value : 8
 <2><ac9>: Abbrev Number: 0
 <1><aca>: Abbrev Number: 12 (DW_TAG_structure_type)
    <acb>   DW_AT_name        : (indirect string, offset: 0x2f8): xlat_data
    <acf>   DW_AT_byte_size   : 12
    <ad0>   DW_AT_decl_file   : 21
    <ad1>   DW_AT_decl_line   : 51
    <ad2>   DW_AT_decl_column : 8
    <ad3>   DW_AT_sibling     : <0xaf6>
 <2><ad7>: Abbrev Number: 19 (DW_TAG_member)
    <ad8>   DW_AT_name        : val
    <adc>   DW_AT_decl_file   : 21
    <add>   DW_AT_decl_line   : 52
    <ade>   DW_AT_decl_column : 11
    <adf>   DW_AT_type        : <0x116>
    <ae3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae6>: Abbrev Number: 19 (DW_TAG_member)
    <ae7>   DW_AT_name        : str
    <aeb>   DW_AT_decl_file   : 21
    <aec>   DW_AT_decl_line   : 53
    <aed>   DW_AT_decl_column : 14
    <aee>   DW_AT_type        : <0x20a>
    <af2>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af5>: Abbrev Number: 0
 <1><af6>: Abbrev Number: 3 (DW_TAG_const_type)
    <af7>   DW_AT_type        : <0xaca>
 <1><afb>: Abbrev Number: 12 (DW_TAG_structure_type)
    <afc>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <b00>   DW_AT_byte_size   : 24
    <b01>   DW_AT_decl_file   : 21
    <b02>   DW_AT_decl_line   : 56
    <b03>   DW_AT_decl_column : 8
    <b04>   DW_AT_sibling     : <0xb54>
 <2><b08>: Abbrev Number: 9 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0x1099): data
    <b0d>   DW_AT_decl_file   : 21
    <b0e>   DW_AT_decl_line   : 57
    <b0f>   DW_AT_decl_column : 26
    <b10>   DW_AT_type        : <0xb59>
    <b14>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b17>: Abbrev Number: 9 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x839): flags_strsz
    <b1c>   DW_AT_decl_file   : 21
    <b1d>   DW_AT_decl_line   : 58
    <b1e>   DW_AT_decl_column : 9
    <b1f>   DW_AT_type        : <0x122>
    <b23>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b26>: Abbrev Number: 9 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0xb32): size
    <b2b>   DW_AT_decl_file   : 21
    <b2c>   DW_AT_decl_line   : 59
    <b2d>   DW_AT_decl_column : 11
    <b2e>   DW_AT_type        : <0x10a>
    <b32>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b35>: Abbrev Number: 9 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0x181): type
    <b3a>   DW_AT_decl_file   : 21
    <b3b>   DW_AT_decl_line   : 60
    <b3c>   DW_AT_decl_column : 17
    <b3d>   DW_AT_type        : <0xa68>
    <b41>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b44>: Abbrev Number: 9 (DW_TAG_member)
    <b45>   DW_AT_name        : (indirect string, offset: 0x707): flags_mask
    <b49>   DW_AT_decl_file   : 21
    <b4a>   DW_AT_decl_line   : 61
    <b4b>   DW_AT_decl_column : 11
    <b4c>   DW_AT_type        : <0x116>
    <b50>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b53>: Abbrev Number: 0
 <1><b54>: Abbrev Number: 3 (DW_TAG_const_type)
    <b55>   DW_AT_type        : <0xafb>
 <1><b59>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b5a>   DW_AT_byte_size   : 4
    <b5b>   DW_AT_type        : <0xaf6>
 <1><b5f>: Abbrev Number: 10 (DW_TAG_array_type)
    <b60>   DW_AT_type        : <0xb54>
    <b64>   DW_AT_sibling     : <0xb6a>
 <2><b68>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b69>: Abbrev Number: 0
 <1><b6a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b6b>   DW_AT_type        : <0xb5f>
 <1><b6f>: Abbrev Number: 13 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0xdfa): addrfams
    <b74>   DW_AT_decl_file   : 20
    <b75>   DW_AT_decl_line   : 411
    <b77>   DW_AT_decl_column : 26
    <b78>   DW_AT_type        : <0xb6a>
    <b7c>   DW_AT_external    : 1
    <b7d>   DW_AT_declaration : 1
 <1><b7e>: Abbrev Number: 13 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0xcd3): arp_hardware_types
    <b83>   DW_AT_decl_file   : 20
    <b84>   DW_AT_decl_line   : 412
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb6a>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 13 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0xfaf): at_flags
    <b92>   DW_AT_decl_file   : 20
    <b93>   DW_AT_decl_line   : 413
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb6a>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 13 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x480): clocknames
    <ba1>   DW_AT_decl_file   : 20
    <ba2>   DW_AT_decl_line   : 414
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb6a>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 13 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0xf66): dirent_types
    <bb0>   DW_AT_decl_file   : 20
    <bb1>   DW_AT_decl_line   : 415
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb6a>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 13 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x88a): ethernet_protocols
    <bbf>   DW_AT_decl_file   : 20
    <bc0>   DW_AT_decl_line   : 416
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb6a>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 13 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0x59d): inet_protocols
    <bce>   DW_AT_decl_file   : 20
    <bcf>   DW_AT_decl_line   : 417
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb6a>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 13 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x297): evdev_abs
    <bdd>   DW_AT_decl_file   : 20
    <bde>   DW_AT_decl_line   : 418
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb6a>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 13 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x6fc): audit_arch
    <bec>   DW_AT_decl_file   : 20
    <bed>   DW_AT_decl_line   : 419
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb6a>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 13 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bfb>   DW_AT_decl_file   : 20
    <bfc>   DW_AT_decl_line   : 420
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb6a>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 13 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0x461): iffflags
    <c0a>   DW_AT_decl_file   : 20
    <c0b>   DW_AT_decl_line   : 421
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb6a>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 13 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0xbcf): ip_type_of_services
    <c19>   DW_AT_decl_file   : 20
    <c1a>   DW_AT_decl_line   : 422
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb6a>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 13 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0x68f): ipc_private
    <c28>   DW_AT_decl_file   : 20
    <c29>   DW_AT_decl_line   : 423
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb6a>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 13 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0x2ee): msg_flags
    <c37>   DW_AT_decl_file   : 20
    <c38>   DW_AT_decl_line   : 424
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb6a>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 13 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c46>   DW_AT_decl_file   : 20
    <c47>   DW_AT_decl_line   : 425
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb6a>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 13 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0xec9): nl_bridge_vlan_flags
    <c55>   DW_AT_decl_file   : 20
    <c56>   DW_AT_decl_line   : 426
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb6a>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 13 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xd6f): nl_netfilter_msg_types
    <c64>   DW_AT_decl_file   : 20
    <c65>   DW_AT_decl_line   : 427
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb6a>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 13 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x443): nl_route_types
    <c73>   DW_AT_decl_file   : 20
    <c74>   DW_AT_decl_line   : 428
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb6a>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 13 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0xe31): open_access_modes
    <c82>   DW_AT_decl_file   : 20
    <c83>   DW_AT_decl_line   : 429
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb6a>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 13 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c91>   DW_AT_decl_file   : 20
    <c92>   DW_AT_decl_line   : 430
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb6a>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 13 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xc00): perf_type_id
    <ca0>   DW_AT_decl_file   : 20
    <ca1>   DW_AT_decl_line   : 431
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb6a>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 13 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0xe03): pollflags
    <caf>   DW_AT_decl_file   : 20
    <cb0>   DW_AT_decl_line   : 432
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb6a>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 13 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0x53e): ptrace_cmds
    <cbe>   DW_AT_decl_file   : 20
    <cbf>   DW_AT_decl_line   : 433
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb6a>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 13 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x7cc): resource_flags
    <ccd>   DW_AT_decl_file   : 20
    <cce>   DW_AT_decl_line   : 434
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb6a>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 13 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x26d): route_nexthop_flags
    <cdc>   DW_AT_decl_file   : 20
    <cdd>   DW_AT_decl_line   : 435
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb6a>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 13 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0xe54): routing_protocols
    <ceb>   DW_AT_decl_file   : 20
    <cec>   DW_AT_decl_line   : 436
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb6a>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 13 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x452): routing_scopes
    <cfa>   DW_AT_decl_file   : 20
    <cfb>   DW_AT_decl_line   : 437
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb6a>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 13 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0xd5d): routing_table_ids
    <d09>   DW_AT_decl_file   : 20
    <d0a>   DW_AT_decl_line   : 438
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb6a>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 13 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0x66c): routing_types
    <d18>   DW_AT_decl_file   : 20
    <d19>   DW_AT_decl_line   : 439
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb6a>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 13 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0x1a5): rwf_flags
    <d27>   DW_AT_decl_file   : 20
    <d28>   DW_AT_decl_line   : 440
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb6a>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 13 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0x804): seccomp_filter_flags
    <d36>   DW_AT_decl_file   : 20
    <d37>   DW_AT_decl_line   : 441
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb6a>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 13 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0x2b4): seccomp_ret_action
    <d45>   DW_AT_decl_file   : 20
    <d46>   DW_AT_decl_line   : 442
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb6a>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 13 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0x41e): setns_types
    <d54>   DW_AT_decl_file   : 20
    <d55>   DW_AT_decl_line   : 443
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb6a>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 13 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0xdef): sg_io_info
    <d63>   DW_AT_decl_file   : 20
    <d64>   DW_AT_decl_line   : 444
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb6a>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 13 (DW_TAG_variable)
    <d6e>   DW_AT_name        : (indirect string, offset: 0xb75): socketlayers
    <d72>   DW_AT_decl_file   : 20
    <d73>   DW_AT_decl_line   : 445
    <d75>   DW_AT_decl_column : 26
    <d76>   DW_AT_type        : <0xb6a>
    <d7a>   DW_AT_external    : 1
    <d7b>   DW_AT_declaration : 1
 <1><d7c>: Abbrev Number: 13 (DW_TAG_variable)
    <d7d>   DW_AT_name        : (indirect string, offset: 0xd47): socktypes
    <d81>   DW_AT_decl_file   : 20
    <d82>   DW_AT_decl_line   : 446
    <d84>   DW_AT_decl_column : 26
    <d85>   DW_AT_type        : <0xb6a>
    <d89>   DW_AT_external    : 1
    <d8a>   DW_AT_declaration : 1
 <1><d8b>: Abbrev Number: 13 (DW_TAG_variable)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xa4a): tcp_state_flags
    <d90>   DW_AT_decl_file   : 20
    <d91>   DW_AT_decl_line   : 447
    <d93>   DW_AT_decl_column : 26
    <d94>   DW_AT_type        : <0xb6a>
    <d98>   DW_AT_external    : 1
    <d99>   DW_AT_declaration : 1
 <1><d9a>: Abbrev Number: 13 (DW_TAG_variable)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x731): tcp_states
    <d9f>   DW_AT_decl_file   : 20
    <da0>   DW_AT_decl_line   : 448
    <da2>   DW_AT_decl_column : 26
    <da3>   DW_AT_type        : <0xb6a>
    <da7>   DW_AT_external    : 1
    <da8>   DW_AT_declaration : 1
 <1><da9>: Abbrev Number: 13 (DW_TAG_variable)
    <daa>   DW_AT_name        : (indirect string, offset: 0x100c): whence_codes
    <dae>   DW_AT_decl_file   : 20
    <daf>   DW_AT_decl_line   : 449
    <db1>   DW_AT_decl_column : 26
    <db2>   DW_AT_type        : <0xb6a>
    <db6>   DW_AT_external    : 1
    <db7>   DW_AT_declaration : 1
 <1><db8>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <db9>   DW_AT_encoding    : 7	(unsigned)
    <dba>   DW_AT_byte_size   : 4
    <dbb>   DW_AT_type        : <0x2b>
    <dbf>   DW_AT_decl_file   : 20
    <dc0>   DW_AT_decl_line   : 510
    <dc2>   DW_AT_decl_column : 14
    <dc3>   DW_AT_sibling     : <0xdda>
 <2><dc7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x95a): CFLAG_NONE
    <dcc>   DW_AT_const_value : 0
 <2><dcd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dce>   DW_AT_name        : (indirect string, offset: 0x89d): CFLAG_ONLY_STATS
    <dd2>   DW_AT_const_value : 1
 <2><dd3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dd4>   DW_AT_name        : (indirect string, offset: 0xb82): CFLAG_BOTH
    <dd8>   DW_AT_const_value : 2
 <2><dd9>: Abbrev Number: 0
 <1><dda>: Abbrev Number: 29 (DW_TAG_typedef)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x10cc): cflag_t
    <ddf>   DW_AT_decl_file   : 20
    <de0>   DW_AT_decl_line   : 514
    <de2>   DW_AT_decl_column : 3
    <de3>   DW_AT_type        : <0xdb8>
 <1><de7>: Abbrev Number: 13 (DW_TAG_variable)
    <de8>   DW_AT_name        : (indirect string, offset: 0xc9a): cflag
    <dec>   DW_AT_decl_file   : 20
    <ded>   DW_AT_decl_line   : 515
    <def>   DW_AT_decl_column : 16
    <df0>   DW_AT_type        : <0xdda>
    <df4>   DW_AT_external    : 1
    <df5>   DW_AT_declaration : 1
 <1><df6>: Abbrev Number: 13 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0x170): Tflag
    <dfb>   DW_AT_decl_file   : 20
    <dfc>   DW_AT_decl_line   : 516
    <dfe>   DW_AT_decl_column : 13
    <dff>   DW_AT_type        : <0x556>
    <e03>   DW_AT_external    : 1
    <e04>   DW_AT_declaration : 1
 <1><e05>: Abbrev Number: 13 (DW_TAG_variable)
    <e06>   DW_AT_name        : (indirect string, offset: 0x787): Tflag_scale
    <e0a>   DW_AT_decl_file   : 20
    <e0b>   DW_AT_decl_line   : 517
    <e0d>   DW_AT_decl_column : 12
    <e0e>   DW_AT_type        : <0x64>
    <e12>   DW_AT_external    : 1
    <e13>   DW_AT_declaration : 1
 <1><e14>: Abbrev Number: 13 (DW_TAG_variable)
    <e15>   DW_AT_name        : (indirect string, offset: 0x819): Tflag_width
    <e19>   DW_AT_decl_file   : 20
    <e1a>   DW_AT_decl_line   : 518
    <e1c>   DW_AT_decl_column : 12
    <e1d>   DW_AT_type        : <0x64>
    <e21>   DW_AT_external    : 1
    <e22>   DW_AT_declaration : 1
 <1><e23>: Abbrev Number: 13 (DW_TAG_variable)
    <e24>   DW_AT_name        : (indirect string, offset: 0xde1): iflag
    <e28>   DW_AT_decl_file   : 20
    <e29>   DW_AT_decl_line   : 519
    <e2b>   DW_AT_decl_column : 13
    <e2c>   DW_AT_type        : <0x556>
    <e30>   DW_AT_external    : 1
    <e31>   DW_AT_declaration : 1
 <1><e32>: Abbrev Number: 13 (DW_TAG_variable)
    <e33>   DW_AT_name        : (indirect string, offset: 0x57e): count_wallclock
    <e37>   DW_AT_decl_file   : 20
    <e38>   DW_AT_decl_line   : 520
    <e3a>   DW_AT_decl_column : 13
    <e3b>   DW_AT_type        : <0x556>
    <e3f>   DW_AT_external    : 1
    <e40>   DW_AT_declaration : 1
 <1><e41>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e42>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e46>   DW_AT_byte_size   : 4
    <e47>   DW_AT_decl_file   : 20
    <e48>   DW_AT_decl_line   : 522
    <e4a>   DW_AT_decl_column : 8
    <e4b>   DW_AT_sibling     : <0xe60>
 <2><e4f>: Abbrev Number: 23 (DW_TAG_member)
    <e50>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e54>   DW_AT_decl_file   : 20
    <e55>   DW_AT_decl_line   : 523
    <e57>   DW_AT_decl_column : 14
    <e58>   DW_AT_type        : <0x20a>
    <e5c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e5f>: Abbrev Number: 0
 <1><e60>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e61>   DW_AT_name        : (indirect string, offset: 0x73c): path_set
    <e65>   DW_AT_byte_size   : 12
    <e66>   DW_AT_decl_file   : 20
    <e67>   DW_AT_decl_line   : 527
    <e69>   DW_AT_decl_column : 15
    <e6a>   DW_AT_sibling     : <0xe9f>
 <2><e6e>: Abbrev Number: 23 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x6ca): paths_selected
    <e73>   DW_AT_decl_file   : 20
    <e74>   DW_AT_decl_line   : 528
    <e76>   DW_AT_decl_column : 24
    <e77>   DW_AT_type        : <0xe9f>
    <e7b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e7e>: Abbrev Number: 23 (DW_TAG_member)
    <e7f>   DW_AT_name        : (indirect string, offset: 0xfff): num_selected
    <e83>   DW_AT_decl_file   : 20
    <e84>   DW_AT_decl_line   : 529
    <e86>   DW_AT_decl_column : 9
    <e87>   DW_AT_type        : <0x122>
    <e8b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e8e>: Abbrev Number: 23 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0xb32): size
    <e93>   DW_AT_decl_file   : 20
    <e94>   DW_AT_decl_line   : 530
    <e96>   DW_AT_decl_column : 9
    <e97>   DW_AT_type        : <0x122>
    <e9b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e9e>: Abbrev Number: 0
 <1><e9f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ea0>   DW_AT_byte_size   : 4
    <ea1>   DW_AT_type        : <0xe41>
 <1><ea5>: Abbrev Number: 13 (DW_TAG_variable)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x104e): global_path_set
    <eaa>   DW_AT_decl_file   : 20
    <eab>   DW_AT_decl_line   : 531
    <ead>   DW_AT_decl_column : 3
    <eae>   DW_AT_type        : <0xe60>
    <eb2>   DW_AT_external    : 1
    <eb3>   DW_AT_declaration : 1
 <1><eb4>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xf41): xflag_opts
    <eb9>   DW_AT_encoding    : 7	(unsigned)
    <eba>   DW_AT_byte_size   : 4
    <ebb>   DW_AT_type        : <0x2b>
    <ebf>   DW_AT_decl_file   : 20
    <ec0>   DW_AT_decl_line   : 533
    <ec2>   DW_AT_decl_column : 6
    <ec3>   DW_AT_sibling     : <0xee6>
 <2><ec7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x9eb): HEXSTR_NONE
    <ecc>   DW_AT_const_value : 0
 <2><ecd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ece>   DW_AT_name        : (indirect string, offset: 0xf91): HEXSTR_NON_ASCII
    <ed2>   DW_AT_const_value : 1
 <2><ed3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x8db): HEXSTR_ALL
    <ed8>   DW_AT_const_value : 2
 <2><ed9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eda>   DW_AT_name        : (indirect string, offset: 0x655): HEXSTR_NON_ASCII_CHARS
    <ede>   DW_AT_const_value : 3
 <2><edf>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x1019): NUM_HEXSTR_OPTS
    <ee4>   DW_AT_const_value : 4
 <2><ee5>: Abbrev Number: 0
 <1><ee6>: Abbrev Number: 13 (DW_TAG_variable)
    <ee7>   DW_AT_name        : (indirect string, offset: 0xdb0): xflag
    <eeb>   DW_AT_decl_file   : 20
    <eec>   DW_AT_decl_line   : 546
    <eee>   DW_AT_decl_column : 17
    <eef>   DW_AT_type        : <0x2b>
    <ef3>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef5>: Abbrev Number: 13 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xc55): followfork
    <efa>   DW_AT_decl_file   : 20
    <efb>   DW_AT_decl_line   : 547
    <efd>   DW_AT_decl_column : 13
    <efe>   DW_AT_type        : <0x556>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 13 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0x302): output_separately
    <f09>   DW_AT_decl_file   : 20
    <f0a>   DW_AT_decl_line   : 548
    <f0c>   DW_AT_decl_column : 13
    <f0d>   DW_AT_type        : <0x556>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 13 (DW_TAG_variable)
    <f14>   DW_AT_name        : (indirect string, offset: 0x20c): stack_trace_enabled
    <f18>   DW_AT_decl_file   : 20
    <f19>   DW_AT_decl_line   : 551
    <f1b>   DW_AT_decl_column : 13
    <f1c>   DW_AT_type        : <0x556>
    <f20>   DW_AT_external    : 1
    <f21>   DW_AT_declaration : 1
 <1><f22>: Abbrev Number: 13 (DW_TAG_variable)
    <f23>   DW_AT_name        : (indirect string, offset: 0x643): ptrace_setoptions
    <f27>   DW_AT_decl_file   : 20
    <f28>   DW_AT_decl_line   : 555
    <f2a>   DW_AT_decl_column : 17
    <f2b>   DW_AT_type        : <0x2b>
    <f2f>   DW_AT_external    : 1
    <f30>   DW_AT_declaration : 1
 <1><f31>: Abbrev Number: 13 (DW_TAG_variable)
    <f32>   DW_AT_name        : (indirect string, offset: 0x9e0): max_strlen
    <f36>   DW_AT_decl_file   : 20
    <f37>   DW_AT_decl_line   : 556
    <f39>   DW_AT_decl_column : 17
    <f3a>   DW_AT_type        : <0x2b>
    <f3e>   DW_AT_external    : 1
    <f3f>   DW_AT_declaration : 1
 <1><f40>: Abbrev Number: 13 (DW_TAG_variable)
    <f41>   DW_AT_name        : (indirect string, offset: 0xa24): os_release
    <f45>   DW_AT_decl_file   : 20
    <f46>   DW_AT_decl_line   : 557
    <f48>   DW_AT_decl_column : 17
    <f49>   DW_AT_type        : <0x2b>
    <f4d>   DW_AT_external    : 1
    <f4e>   DW_AT_declaration : 1
 <1><f4f>: Abbrev Number: 13 (DW_TAG_variable)
    <f50>   DW_AT_name        : (indirect string, offset: 0x6d9): xlat_verbosity
    <f54>   DW_AT_decl_file   : 20
    <f55>   DW_AT_decl_line   : 919
    <f57>   DW_AT_decl_column : 24
    <f58>   DW_AT_type        : <0xa8d>
    <f5c>   DW_AT_external    : 1
    <f5d>   DW_AT_declaration : 1
 <1><f5e>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x561): xlat_style_private_flag_bits
    <f63>   DW_AT_encoding    : 7	(unsigned)
    <f64>   DW_AT_byte_size   : 4
    <f65>   DW_AT_type        : <0x2b>
    <f69>   DW_AT_decl_file   : 20
    <f6a>   DW_AT_decl_line   : 939
    <f6c>   DW_AT_decl_column : 6
    <f6d>   DW_AT_sibling     : <0xf8a>
 <2><f71>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f72>   DW_AT_name        : (indirect string, offset: 0x281): PAF_PRINT_INDICES_BIT
    <f76>   DW_AT_const_value : 5
 <2><f77>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0xae9): PAF_ARRAY_TRUNCATED_BIT
    <f7c>   DW_AT_const_value : 6
 <2><f7d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x3de): PXF_DEFAULT_STR_BIT
    <f82>   DW_AT_const_value : 7
 <2><f83>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f84>   DW_AT_name        : (indirect string, offset: 0xc37): SPFF_AUXSTR_MODE_BIT
    <f88>   DW_AT_const_value : 8
 <2><f89>: Abbrev Number: 0
 <1><f8a>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xce6): find_xlat_flag_bits
    <f8f>   DW_AT_encoding    : 7	(unsigned)
    <f90>   DW_AT_byte_size   : 4
    <f91>   DW_AT_type        : <0x2b>
    <f95>   DW_AT_decl_file   : 20
    <f96>   DW_AT_decl_line   : 1443
    <f98>   DW_AT_decl_column : 6
    <f99>   DW_AT_sibling     : <0xfa4>
 <2><f9d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x918): FXL_CASE_SENSITIVE_BIT
    <fa2>   DW_AT_const_value : 0
 <2><fa3>: Abbrev Number: 0
 <1><fa4>: Abbrev Number: 13 (DW_TAG_variable)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x9ad): printing_tcp
    <fa9>   DW_AT_decl_file   : 20
    <faa>   DW_AT_decl_line   : 1689
    <fac>   DW_AT_decl_column : 20
    <fad>   DW_AT_type        : <0x632>
    <fb1>   DW_AT_external    : 1
    <fb2>   DW_AT_declaration : 1
 <1><fb3>: Abbrev Number: 13 (DW_TAG_variable)
    <fb4>   DW_AT_name        : (indirect string, offset: 0x529): errnoent
    <fb8>   DW_AT_decl_file   : 20
    <fb9>   DW_AT_decl_line   : 1887
    <fbb>   DW_AT_decl_column : 26
    <fbc>   DW_AT_type        : <0x48a>
    <fc0>   DW_AT_external    : 1
    <fc1>   DW_AT_declaration : 1
 <1><fc2>: Abbrev Number: 13 (DW_TAG_variable)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x825): signalent
    <fc7>   DW_AT_decl_file   : 20
    <fc8>   DW_AT_decl_line   : 1888
    <fca>   DW_AT_decl_column : 26
    <fcb>   DW_AT_type        : <0x48a>
    <fcf>   DW_AT_external    : 1
    <fd0>   DW_AT_declaration : 1
 <1><fd1>: Abbrev Number: 13 (DW_TAG_variable)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xe29): nerrnos
    <fd6>   DW_AT_decl_file   : 20
    <fd7>   DW_AT_decl_line   : 1889
    <fd9>   DW_AT_decl_column : 27
    <fda>   DW_AT_type        : <0x32>
    <fde>   DW_AT_external    : 1
    <fdf>   DW_AT_declaration : 1
 <1><fe0>: Abbrev Number: 13 (DW_TAG_variable)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xfe8): nsignals
    <fe5>   DW_AT_decl_file   : 20
    <fe6>   DW_AT_decl_line   : 1890
    <fe8>   DW_AT_decl_column : 27
    <fe9>   DW_AT_type        : <0x32>
    <fed>   DW_AT_external    : 1
    <fee>   DW_AT_declaration : 1
 <1><fef>: Abbrev Number: 10 (DW_TAG_array_type)
    <ff0>   DW_AT_type        : <0x8ac>
    <ff4>   DW_AT_sibling     : <0xffa>
 <2><ff8>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><ff9>: Abbrev Number: 0
 <1><ffa>: Abbrev Number: 3 (DW_TAG_const_type)
    <ffb>   DW_AT_type        : <0xfef>
 <1><fff>: Abbrev Number: 13 (DW_TAG_variable)
    <1000>   DW_AT_name        : (indirect string, offset: 0xcb1): sysent0
    <1004>   DW_AT_decl_file   : 20
    <1005>   DW_AT_decl_line   : 1892
    <1007>   DW_AT_decl_column : 28
    <1008>   DW_AT_type        : <0xffa>
    <100c>   DW_AT_external    : 1
    <100d>   DW_AT_declaration : 1
 <1><100e>: Abbrev Number: 10 (DW_TAG_array_type)
    <100f>   DW_AT_type        : <0x913>
    <1013>   DW_AT_sibling     : <0x1019>
 <2><1017>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><1018>: Abbrev Number: 0
 <1><1019>: Abbrev Number: 3 (DW_TAG_const_type)
    <101a>   DW_AT_type        : <0x100e>
 <1><101e>: Abbrev Number: 13 (DW_TAG_variable)
    <101f>   DW_AT_name        : (indirect string, offset: 0x1044): ioctlent0
    <1023>   DW_AT_decl_file   : 20
    <1024>   DW_AT_decl_line   : 1893
    <1026>   DW_AT_decl_column : 30
    <1027>   DW_AT_type        : <0x1019>
    <102b>   DW_AT_external    : 1
    <102c>   DW_AT_declaration : 1
 <1><102d>: Abbrev Number: 13 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0xf4c): personality_names
    <1032>   DW_AT_decl_file   : 20
    <1033>   DW_AT_decl_line   : 1895
    <1035>   DW_AT_decl_column : 26
    <1036>   DW_AT_type        : <0x48a>
    <103a>   DW_AT_external    : 1
    <103b>   DW_AT_declaration : 1
 <1><103c>: Abbrev Number: 13 (DW_TAG_variable)
    <103d>   DW_AT_name        : (indirect string, offset: 0x845): sysent
    <1041>   DW_AT_decl_file   : 20
    <1042>   DW_AT_decl_line   : 1898
    <1044>   DW_AT_decl_column : 29
    <1045>   DW_AT_type        : <0x9f8>
    <1049>   DW_AT_external    : 1
    <104a>   DW_AT_declaration : 1
 <1><104b>: Abbrev Number: 13 (DW_TAG_variable)
    <104c>   DW_AT_name        : (indirect string, offset: 0xc4c): ioctlent
    <1050>   DW_AT_decl_file   : 20
    <1051>   DW_AT_decl_line   : 1899
    <1053>   DW_AT_decl_column : 31
    <1054>   DW_AT_type        : <0x105a>
    <1058>   DW_AT_external    : 1
    <1059>   DW_AT_declaration : 1
 <1><105a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <105b>   DW_AT_byte_size   : 4
    <105c>   DW_AT_type        : <0x913>
 <1><1060>: Abbrev Number: 13 (DW_TAG_variable)
    <1061>   DW_AT_name        : (indirect string, offset: 0x82f): nsyscalls
    <1065>   DW_AT_decl_file   : 20
    <1066>   DW_AT_decl_line   : 1905
    <1068>   DW_AT_decl_column : 17
    <1069>   DW_AT_type        : <0x2b>
    <106d>   DW_AT_external    : 1
    <106e>   DW_AT_declaration : 1
 <1><106f>: Abbrev Number: 13 (DW_TAG_variable)
    <1070>   DW_AT_name        : (indirect string, offset: 0xe49): nioctlents
    <1074>   DW_AT_decl_file   : 20
    <1075>   DW_AT_decl_line   : 1906
    <1077>   DW_AT_decl_column : 17
    <1078>   DW_AT_type        : <0x2b>
    <107c>   DW_AT_external    : 1
    <107d>   DW_AT_declaration : 1
 <1><107e>: Abbrev Number: 10 (DW_TAG_array_type)
    <107f>   DW_AT_type        : <0x32>
    <1083>   DW_AT_sibling     : <0x108e>
 <2><1087>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1088>   DW_AT_type        : <0x2b>
    <108c>   DW_AT_upper_bound : 2
 <2><108d>: Abbrev Number: 0
 <1><108e>: Abbrev Number: 3 (DW_TAG_const_type)
    <108f>   DW_AT_type        : <0x107e>
 <1><1093>: Abbrev Number: 13 (DW_TAG_variable)
    <1094>   DW_AT_name        : (indirect string, offset: 0xea9): nsyscall_vec
    <1098>   DW_AT_decl_file   : 20
    <1099>   DW_AT_decl_line   : 1908
    <109b>   DW_AT_decl_column : 27
    <109c>   DW_AT_type        : <0x108e>
    <10a0>   DW_AT_external    : 1
    <10a1>   DW_AT_declaration : 1
 <1><10a2>: Abbrev Number: 10 (DW_TAG_array_type)
    <10a3>   DW_AT_type        : <0x9fe>
    <10a7>   DW_AT_sibling     : <0x10b2>
 <2><10ab>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10ac>   DW_AT_type        : <0x2b>
    <10b0>   DW_AT_upper_bound : 2
 <2><10b1>: Abbrev Number: 0
 <1><10b2>: Abbrev Number: 3 (DW_TAG_const_type)
    <10b3>   DW_AT_type        : <0x10a2>
 <1><10b7>: Abbrev Number: 13 (DW_TAG_variable)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x774): sysent_vec
    <10bc>   DW_AT_decl_file   : 20
    <10bd>   DW_AT_decl_line   : 1909
    <10bf>   DW_AT_decl_column : 35
    <10c0>   DW_AT_type        : <0x10b2>
    <10c4>   DW_AT_external    : 1
    <10c5>   DW_AT_declaration : 1
 <1><10c6>: Abbrev Number: 13 (DW_TAG_variable)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x35b): inject_vec
    <10cb>   DW_AT_decl_file   : 20
    <10cc>   DW_AT_decl_line   : 1910
    <10ce>   DW_AT_decl_column : 28
    <10cf>   DW_AT_type        : <0xa03>
    <10d3>   DW_AT_external    : 1
    <10d4>   DW_AT_declaration : 1
 <1><10d5>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10d6>   DW_AT_name        : (indirect string, offset: 0xd3a): audit_arch_t
    <10da>   DW_AT_byte_size   : 8
    <10db>   DW_AT_decl_file   : 20
    <10dc>   DW_AT_decl_line   : 1912
    <10de>   DW_AT_decl_column : 8
    <10df>   DW_AT_sibling     : <0x1104>
 <2><10e3>: Abbrev Number: 23 (DW_TAG_member)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x553): arch
    <10e8>   DW_AT_decl_file   : 20
    <10e9>   DW_AT_decl_line   : 1913
    <10eb>   DW_AT_decl_column : 15
    <10ec>   DW_AT_type        : <0x2b>
    <10f0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10f3>: Abbrev Number: 23 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x993): flag
    <10f8>   DW_AT_decl_file   : 20
    <10f9>   DW_AT_decl_line   : 1914
    <10fb>   DW_AT_decl_column : 15
    <10fc>   DW_AT_type        : <0x2b>
    <1100>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1103>: Abbrev Number: 0
 <1><1104>: Abbrev Number: 3 (DW_TAG_const_type)
    <1105>   DW_AT_type        : <0x10d5>
 <1><1109>: Abbrev Number: 10 (DW_TAG_array_type)
    <110a>   DW_AT_type        : <0x1104>
    <110e>   DW_AT_sibling     : <0x1119>
 <2><1112>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1113>   DW_AT_type        : <0x2b>
    <1117>   DW_AT_upper_bound : 2
 <2><1118>: Abbrev Number: 0
 <1><1119>: Abbrev Number: 3 (DW_TAG_const_type)
    <111a>   DW_AT_type        : <0x1109>
 <1><111e>: Abbrev Number: 13 (DW_TAG_variable)
    <111f>   DW_AT_name        : (indirect string, offset: 0x909): audit_arch_vec
    <1123>   DW_AT_decl_file   : 20
    <1124>   DW_AT_decl_line   : 1917
    <1126>   DW_AT_decl_column : 34
    <1127>   DW_AT_type        : <0x1119>
    <112b>   DW_AT_external    : 1
    <112c>   DW_AT_declaration : 1
 <1><112d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <112e>   DW_AT_byte_size   : 180
    <112f>   DW_AT_decl_file   : 22
    <1130>   DW_AT_decl_line   : 2
    <1131>   DW_AT_decl_column : 9
    <1132>   DW_AT_sibling     : <0x13e7>
 <2><1136>: Abbrev Number: 9 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0x1bd): block_ioctl
    <113b>   DW_AT_decl_file   : 22
    <113c>   DW_AT_decl_line   : 3
    <113d>   DW_AT_decl_column : 8
    <113e>   DW_AT_type        : <0x1401>
    <1142>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1145>: Abbrev Number: 9 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0xa88): btrfs_ioctl
    <114a>   DW_AT_decl_file   : 22
    <114b>   DW_AT_decl_line   : 6
    <114c>   DW_AT_decl_column : 8
