Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1806 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x616): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5fc): mpers-m32/struct_ifconf.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xf06): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3bb): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x10a8): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9e6): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe69): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4c5): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8d9): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xf60): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x909): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7cb): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xbb8): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbfa): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2c2): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd6b): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xcd8): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x426): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1>   DW_AT_name        : (indirect string, offset: 0x304): __caddr_t
    <e5>   DW_AT_decl_file   : 1
    <e6>   DW_AT_decl_line   : 203
    <e7>   DW_AT_decl_column : 15
    <e8>   DW_AT_type        : <0xec>
 <1><ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed>   DW_AT_byte_size   : 4
    <ee>   DW_AT_type        : <0xf2>
 <1><f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3>   DW_AT_byte_size   : 1
    <f4>   DW_AT_encoding    : 6	(signed char)
    <f5>   DW_AT_name        : (indirect string, offset: 0x472): char
 <1><f9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fa>   DW_AT_type        : <0xf2>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x35c): uint8_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 24
    <105>   DW_AT_decl_column : 19
    <106>   DW_AT_type        : <0x45>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xbe5): uint16_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 25
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x58>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0x1022): uint32_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 26
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x70>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xe79): uint64_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 27
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x8f>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 209
    <135>   DW_AT_decl_column : 23
    <136>   DW_AT_type        : <0x2b>
 <1><13a>: Abbrev Number: 3 (DW_TAG_const_type)
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <140>   DW_AT_name        : (indirect string, offset: 0xb61): timespec
    <144>   DW_AT_byte_size   : 8
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 10
    <147>   DW_AT_decl_column : 8
    <148>   DW_AT_sibling     : <0x16b>
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x1180): tv_sec
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 12
    <153>   DW_AT_decl_column : 12
    <154>   DW_AT_type        : <0xc1>
    <158>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0xe9f): tv_nsec
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 16
    <162>   DW_AT_decl_column : 21
    <163>   DW_AT_type        : <0xd4>
    <167>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><16a>: Abbrev Number: 0
 <1><16b>: Abbrev Number: 2 (DW_TAG_base_type)
    <16c>   DW_AT_byte_size   : 12
    <16d>   DW_AT_encoding    : 4	(float)
    <16e>   DW_AT_name        : (indirect string, offset: 0xb23): long double
 <1><172>: Abbrev Number: 2 (DW_TAG_base_type)
    <173>   DW_AT_byte_size   : 16
    <174>   DW_AT_encoding    : 4	(float)
    <175>   DW_AT_name        : (indirect string, offset: 0x105d): _Float128
 <1><179>: Abbrev Number: 10 (DW_TAG_variable)
    <17a>   DW_AT_name        : (indirect string, offset: 0x279): __environ
    <17e>   DW_AT_decl_file   : 5
    <17f>   DW_AT_decl_line   : 543
    <181>   DW_AT_decl_column : 15
    <182>   DW_AT_type        : <0x188>
    <186>   DW_AT_external    : 1
    <187>   DW_AT_declaration : 1
 <1><188>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <189>   DW_AT_byte_size   : 4
    <18a>   DW_AT_type        : <0xec>
 <1><18e>: Abbrev Number: 10 (DW_TAG_variable)
    <18f>   DW_AT_name        : (indirect string, offset: 0x3b3): environ
    <193>   DW_AT_decl_file   : 5
    <194>   DW_AT_decl_line   : 545
    <196>   DW_AT_decl_column : 15
    <197>   DW_AT_type        : <0x188>
    <19b>   DW_AT_external    : 1
    <19c>   DW_AT_declaration : 1
 <1><19d>: Abbrev Number: 11 (DW_TAG_variable)
    <19e>   DW_AT_name        : (indirect string, offset: 0x108c): optarg
    <1a2>   DW_AT_decl_file   : 6
    <1a3>   DW_AT_decl_line   : 36
    <1a4>   DW_AT_decl_column : 14
    <1a5>   DW_AT_type        : <0xec>
    <1a9>   DW_AT_external    : 1
    <1aa>   DW_AT_declaration : 1
 <1><1ab>: Abbrev Number: 11 (DW_TAG_variable)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x79e): optind
    <1b0>   DW_AT_decl_file   : 6
    <1b1>   DW_AT_decl_line   : 50
    <1b2>   DW_AT_decl_column : 12
    <1b3>   DW_AT_type        : <0x64>
    <1b7>   DW_AT_external    : 1
    <1b8>   DW_AT_declaration : 1
 <1><1b9>: Abbrev Number: 11 (DW_TAG_variable)
    <1ba>   DW_AT_name        : (indirect string, offset: 0xcb2): opterr
    <1be>   DW_AT_decl_file   : 6
    <1bf>   DW_AT_decl_line   : 55
    <1c0>   DW_AT_decl_column : 12
    <1c1>   DW_AT_type        : <0x64>
    <1c5>   DW_AT_external    : 1
    <1c6>   DW_AT_declaration : 1
 <1><1c7>: Abbrev Number: 11 (DW_TAG_variable)
    <1c8>   DW_AT_name        : (indirect string, offset: 0xb9e): optopt
    <1cc>   DW_AT_decl_file   : 6
    <1cd>   DW_AT_decl_line   : 59
    <1ce>   DW_AT_decl_column : 12
    <1cf>   DW_AT_type        : <0x64>
    <1d3>   DW_AT_external    : 1
    <1d4>   DW_AT_declaration : 1
 <1><1d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d6>   DW_AT_byte_size   : 4
    <1d7>   DW_AT_type        : <0xf9>
 <1><1db>: Abbrev Number: 3 (DW_TAG_const_type)
    <1dc>   DW_AT_type        : <0x1d5>
 <1><1e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e1>   DW_AT_byte_size   : 4
    <1e2>   DW_AT_type        : <0x1e6>
 <1><1e6>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1e7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x364): _IO_FILE
    <1ec>   DW_AT_byte_size   : 148
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 49
    <1ef>   DW_AT_decl_column : 8
    <1f0>   DW_AT_sibling     : <0x3a8>
 <2><1f4>: Abbrev Number: 9 (DW_TAG_member)
    <1f5>   DW_AT_name        : (indirect string, offset: 0xa6b): _flags
    <1f9>   DW_AT_decl_file   : 7
    <1fa>   DW_AT_decl_line   : 51
    <1fb>   DW_AT_decl_column : 7
    <1fc>   DW_AT_type        : <0x64>
    <200>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><203>: Abbrev Number: 9 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x514): _IO_read_ptr
    <208>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 54
    <20a>   DW_AT_decl_column : 9
    <20b>   DW_AT_type        : <0xec>
    <20f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><212>: Abbrev Number: 9 (DW_TAG_member)
    <213>   DW_AT_name        : (indirect string, offset: 0xfbd): _IO_read_end
    <217>   DW_AT_decl_file   : 7
    <218>   DW_AT_decl_line   : 55
    <219>   DW_AT_decl_column : 9
    <21a>   DW_AT_type        : <0xec>
    <21e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><221>: Abbrev Number: 9 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x807): _IO_read_base
    <226>   DW_AT_decl_file   : 7
    <227>   DW_AT_decl_line   : 56
    <228>   DW_AT_decl_column : 9
    <229>   DW_AT_type        : <0xec>
    <22d>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><230>: Abbrev Number: 9 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x12e): _IO_write_base
    <235>   DW_AT_decl_file   : 7
    <236>   DW_AT_decl_line   : 57
    <237>   DW_AT_decl_column : 9
    <238>   DW_AT_type        : <0xec>
    <23c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><23f>: Abbrev Number: 9 (DW_TAG_member)
    <240>   DW_AT_name        : (indirect string, offset: 0x10ec): _IO_write_ptr
    <244>   DW_AT_decl_file   : 7
    <245>   DW_AT_decl_line   : 58
    <246>   DW_AT_decl_column : 9
    <247>   DW_AT_type        : <0xec>
    <24b>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><24e>: Abbrev Number: 9 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x955): _IO_write_end
    <253>   DW_AT_decl_file   : 7
    <254>   DW_AT_decl_line   : 59
    <255>   DW_AT_decl_column : 9
    <256>   DW_AT_type        : <0xec>
    <25a>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><25d>: Abbrev Number: 9 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x9cf): _IO_buf_base
    <262>   DW_AT_decl_file   : 7
    <263>   DW_AT_decl_line   : 60
    <264>   DW_AT_decl_column : 9
    <265>   DW_AT_type        : <0xec>
    <269>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><26c>: Abbrev Number: 9 (DW_TAG_member)
    <26d>   DW_AT_name        : (indirect string, offset: 0xe03): _IO_buf_end
    <271>   DW_AT_decl_file   : 7
    <272>   DW_AT_decl_line   : 61
    <273>   DW_AT_decl_column : 9
    <274>   DW_AT_type        : <0xec>
    <278>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27b>: Abbrev Number: 9 (DW_TAG_member)
    <27c>   DW_AT_name        : (indirect string, offset: 0x1d6): _IO_save_base
    <280>   DW_AT_decl_file   : 7
    <281>   DW_AT_decl_line   : 64
    <282>   DW_AT_decl_column : 9
    <283>   DW_AT_type        : <0xec>
    <287>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28a>: Abbrev Number: 9 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0xd2a): _IO_backup_base
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 65
    <291>   DW_AT_decl_column : 9
    <292>   DW_AT_type        : <0xec>
    <296>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><299>: Abbrev Number: 9 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0xb6): _IO_save_end
    <29e>   DW_AT_decl_file   : 7
    <29f>   DW_AT_decl_line   : 66
    <2a0>   DW_AT_decl_column : 9
    <2a1>   DW_AT_type        : <0xec>
    <2a5>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2a8>: Abbrev Number: 9 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x5a8): _markers
    <2ad>   DW_AT_decl_file   : 7
    <2ae>   DW_AT_decl_line   : 68
    <2af>   DW_AT_decl_column : 22
    <2b0>   DW_AT_type        : <0x3c2>
    <2b4>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2b7>: Abbrev Number: 9 (DW_TAG_member)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x219): _chain
    <2bc>   DW_AT_decl_file   : 7
    <2bd>   DW_AT_decl_line   : 70
    <2be>   DW_AT_decl_column : 20
    <2bf>   DW_AT_type        : <0x3c8>
    <2c3>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2c6>: Abbrev Number: 9 (DW_TAG_member)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x1048): _fileno
    <2cb>   DW_AT_decl_file   : 7
    <2cc>   DW_AT_decl_line   : 72
    <2cd>   DW_AT_decl_column : 7
    <2ce>   DW_AT_type        : <0x64>
    <2d2>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d5>: Abbrev Number: 9 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x7f3): _flags2
    <2da>   DW_AT_decl_file   : 7
    <2db>   DW_AT_decl_line   : 73
    <2dc>   DW_AT_decl_column : 7
    <2dd>   DW_AT_type        : <0x64>
    <2e1>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e4>: Abbrev Number: 9 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x885): _old_offset
    <2e9>   DW_AT_decl_file   : 7
    <2ea>   DW_AT_decl_line   : 74
    <2eb>   DW_AT_decl_column : 11
    <2ec>   DW_AT_type        : <0xa2>
    <2f0>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f3>: Abbrev Number: 9 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x247): _cur_column
    <2f8>   DW_AT_decl_file   : 7
    <2f9>   DW_AT_decl_line   : 77
    <2fa>   DW_AT_decl_column : 18
    <2fb>   DW_AT_type        : <0x24>
    <2ff>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><302>: Abbrev Number: 9 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0xec5): _vtable_offset
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 78
    <309>   DW_AT_decl_column : 15
    <30a>   DW_AT_type        : <0x3e>
    <30e>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><311>: Abbrev Number: 9 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0xd3a): _shortbuf
    <316>   DW_AT_decl_file   : 7
    <317>   DW_AT_decl_line   : 79
    <318>   DW_AT_decl_column : 8
    <319>   DW_AT_type        : <0x3ce>
    <31d>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><320>: Abbrev Number: 9 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x16f): _lock
    <325>   DW_AT_decl_file   : 7
    <326>   DW_AT_decl_line   : 81
    <327>   DW_AT_decl_column : 15
    <328>   DW_AT_type        : <0x3de>
    <32c>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><32f>: Abbrev Number: 9 (DW_TAG_member)
    <330>   DW_AT_name        : (indirect string, offset: 0x736): _offset
    <334>   DW_AT_decl_file   : 7
    <335>   DW_AT_decl_line   : 89
    <336>   DW_AT_decl_column : 13
    <337>   DW_AT_type        : <0xb5>
    <33b>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><33e>: Abbrev Number: 9 (DW_TAG_member)
    <33f>   DW_AT_name        : (indirect string, offset: 0xaab): _codecvt
    <343>   DW_AT_decl_file   : 7
    <344>   DW_AT_decl_line   : 91
    <345>   DW_AT_decl_column : 23
    <346>   DW_AT_type        : <0x3ea>
    <34a>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><34d>: Abbrev Number: 9 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x1070): _wide_data
    <352>   DW_AT_decl_file   : 7
    <353>   DW_AT_decl_line   : 92
    <354>   DW_AT_decl_column : 25
    <355>   DW_AT_type        : <0x3f6>
    <359>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><35c>: Abbrev Number: 9 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0x3d7): _freeres_list
    <361>   DW_AT_decl_file   : 7
    <362>   DW_AT_decl_line   : 93
    <363>   DW_AT_decl_column : 20
    <364>   DW_AT_type        : <0x3c8>
    <368>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36b>: Abbrev Number: 9 (DW_TAG_member)
    <36c>   DW_AT_name        : (indirect string, offset: 0xc88): _freeres_buf
    <370>   DW_AT_decl_file   : 7
    <371>   DW_AT_decl_line   : 94
    <372>   DW_AT_decl_column : 9
    <373>   DW_AT_type        : <0xcd>
    <377>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37a>: Abbrev Number: 9 (DW_TAG_member)
    <37b>   DW_AT_name        : (indirect string, offset: 0xa2d): __pad5
    <37f>   DW_AT_decl_file   : 7
    <380>   DW_AT_decl_line   : 95
    <381>   DW_AT_decl_column : 10
    <382>   DW_AT_type        : <0x12e>
    <386>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><389>: Abbrev Number: 9 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0xa8f): _mode
    <38e>   DW_AT_decl_file   : 7
    <38f>   DW_AT_decl_line   : 96
    <390>   DW_AT_decl_column : 7
    <391>   DW_AT_type        : <0x64>
    <395>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><398>: Abbrev Number: 9 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x82b): _unused2
    <39d>   DW_AT_decl_file   : 7
    <39e>   DW_AT_decl_line   : 98
    <39f>   DW_AT_decl_column : 8
    <3a0>   DW_AT_type        : <0x3fc>
    <3a4>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3a7>: Abbrev Number: 0
 <1><3a8>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xb43): FILE
    <3ad>   DW_AT_decl_file   : 8
    <3ae>   DW_AT_decl_line   : 7
    <3af>   DW_AT_decl_column : 25
    <3b0>   DW_AT_type        : <0x1e7>
 <1><3b4>: Abbrev Number: 13 (DW_TAG_typedef)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x4b1): _IO_lock_t
    <3b9>   DW_AT_decl_file   : 7
    <3ba>   DW_AT_decl_line   : 43
    <3bb>   DW_AT_decl_column : 14
 <1><3bc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x30e): _IO_marker
    <3c1>   DW_AT_declaration : 1
 <1><3c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c3>   DW_AT_byte_size   : 4
    <3c4>   DW_AT_type        : <0x3bc>
 <1><3c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c9>   DW_AT_byte_size   : 4
    <3ca>   DW_AT_type        : <0x1e7>
 <1><3ce>: Abbrev Number: 15 (DW_TAG_array_type)
    <3cf>   DW_AT_type        : <0xf2>
    <3d3>   DW_AT_sibling     : <0x3de>
 <2><3d7>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3d8>   DW_AT_type        : <0x2b>
    <3dc>   DW_AT_upper_bound : 0
 <2><3dd>: Abbrev Number: 0
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3b4>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x79): _IO_codecvt
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x378): _IO_wide_data
    <3f5>   DW_AT_declaration : 1
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x3f0>
 <1><3fc>: Abbrev Number: 15 (DW_TAG_array_type)
    <3fd>   DW_AT_type        : <0xf2>
    <401>   DW_AT_sibling     : <0x40c>
 <2><405>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <406>   DW_AT_type        : <0x2b>
    <40a>   DW_AT_upper_bound : 39
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 11 (DW_TAG_variable)
    <40d>   DW_AT_name        : (indirect string, offset: 0x573): stdin
    <411>   DW_AT_decl_file   : 9
    <412>   DW_AT_decl_line   : 137
    <413>   DW_AT_decl_column : 14
    <414>   DW_AT_type        : <0x41a>
    <418>   DW_AT_external    : 1
    <419>   DW_AT_declaration : 1
 <1><41a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41b>   DW_AT_byte_size   : 4
    <41c>   DW_AT_type        : <0x3a8>
 <1><420>: Abbrev Number: 11 (DW_TAG_variable)
    <421>   DW_AT_name        : (indirect string, offset: 0x10bb): stdout
    <425>   DW_AT_decl_file   : 9
    <426>   DW_AT_decl_line   : 138
    <427>   DW_AT_decl_column : 14
    <428>   DW_AT_type        : <0x41a>
    <42c>   DW_AT_external    : 1
    <42d>   DW_AT_declaration : 1
 <1><42e>: Abbrev Number: 11 (DW_TAG_variable)
    <42f>   DW_AT_name        : (indirect string, offset: 0xe62): stderr
    <433>   DW_AT_decl_file   : 9
    <434>   DW_AT_decl_line   : 139
    <435>   DW_AT_decl_column : 14
    <436>   DW_AT_type        : <0x41a>
    <43a>   DW_AT_external    : 1
    <43b>   DW_AT_declaration : 1
 <1><43c>: Abbrev Number: 11 (DW_TAG_variable)
    <43d>   DW_AT_name        : (indirect string, offset: 0x253): sys_nerr
    <441>   DW_AT_decl_file   : 10
    <442>   DW_AT_decl_line   : 26
    <443>   DW_AT_decl_column : 12
    <444>   DW_AT_type        : <0x64>
    <448>   DW_AT_external    : 1
    <449>   DW_AT_declaration : 1
 <1><44a>: Abbrev Number: 15 (DW_TAG_array_type)
    <44b>   DW_AT_type        : <0x1db>
    <44f>   DW_AT_sibling     : <0x455>
 <2><453>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><454>: Abbrev Number: 0
 <1><455>: Abbrev Number: 3 (DW_TAG_const_type)
    <456>   DW_AT_type        : <0x44a>
 <1><45a>: Abbrev Number: 11 (DW_TAG_variable)
    <45b>   DW_AT_name        : (indirect string, offset: 0x582): sys_errlist
    <45f>   DW_AT_decl_file   : 10
    <460>   DW_AT_decl_line   : 27
    <461>   DW_AT_decl_column : 26
    <462>   DW_AT_type        : <0x455>
    <466>   DW_AT_external    : 1
    <467>   DW_AT_declaration : 1
 <1><468>: Abbrev Number: 11 (DW_TAG_variable)
    <469>   DW_AT_name        : (indirect string, offset: 0x266): _sys_nerr
    <46d>   DW_AT_decl_file   : 10
    <46e>   DW_AT_decl_line   : 30
    <46f>   DW_AT_decl_column : 12
    <470>   DW_AT_type        : <0x64>
    <474>   DW_AT_external    : 1
    <475>   DW_AT_declaration : 1
 <1><476>: Abbrev Number: 11 (DW_TAG_variable)
    <477>   DW_AT_name        : (indirect string, offset: 0xed4): _sys_errlist
    <47b>   DW_AT_decl_file   : 10
    <47c>   DW_AT_decl_line   : 31
    <47d>   DW_AT_decl_column : 26
    <47e>   DW_AT_type        : <0x455>
    <482>   DW_AT_external    : 1
    <483>   DW_AT_declaration : 1
 <1><484>: Abbrev Number: 11 (DW_TAG_variable)
    <485>   DW_AT_name        : (indirect string, offset: 0x70f): program_invocation_name
    <489>   DW_AT_decl_file   : 11
    <48a>   DW_AT_decl_line   : 45
    <48b>   DW_AT_decl_column : 14
    <48c>   DW_AT_type        : <0xec>
    <490>   DW_AT_external    : 1
    <491>   DW_AT_declaration : 1
 <1><492>: Abbrev Number: 11 (DW_TAG_variable)
    <493>   DW_AT_name        : (indirect string, offset: 0xc25): program_invocation_short_name
    <497>   DW_AT_decl_file   : 11
    <498>   DW_AT_decl_line   : 46
    <499>   DW_AT_decl_column : 14
    <49a>   DW_AT_type        : <0xec>
    <49e>   DW_AT_external    : 1
    <49f>   DW_AT_declaration : 1
 <1><4a0>: Abbrev Number: 15 (DW_TAG_array_type)
    <4a1>   DW_AT_type        : <0xec>
    <4a5>   DW_AT_sibling     : <0x4b0>
 <2><4a9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4aa>   DW_AT_type        : <0x2b>
    <4ae>   DW_AT_upper_bound : 1
 <2><4af>: Abbrev Number: 0
 <1><4b0>: Abbrev Number: 11 (DW_TAG_variable)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x1c3): __tzname
    <4b5>   DW_AT_decl_file   : 12
    <4b6>   DW_AT_decl_line   : 159
    <4b7>   DW_AT_decl_column : 14
    <4b8>   DW_AT_type        : <0x4a0>
    <4bc>   DW_AT_external    : 1
    <4bd>   DW_AT_declaration : 1
 <1><4be>: Abbrev Number: 11 (DW_TAG_variable)
    <4bf>   DW_AT_name        : (indirect string, offset: 0xf47): __daylight
    <4c3>   DW_AT_decl_file   : 12
    <4c4>   DW_AT_decl_line   : 160
    <4c5>   DW_AT_decl_column : 12
    <4c6>   DW_AT_type        : <0x64>
    <4ca>   DW_AT_external    : 1
    <4cb>   DW_AT_declaration : 1
 <1><4cc>: Abbrev Number: 11 (DW_TAG_variable)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x36d): __timezone
    <4d1>   DW_AT_decl_file   : 12
    <4d2>   DW_AT_decl_line   : 161
    <4d3>   DW_AT_decl_column : 17
    <4d4>   DW_AT_type        : <0xae>
    <4d8>   DW_AT_external    : 1
    <4d9>   DW_AT_declaration : 1
 <1><4da>: Abbrev Number: 11 (DW_TAG_variable)
    <4db>   DW_AT_name        : (indirect string, offset: 0xa26): tzname
    <4df>   DW_AT_decl_file   : 12
    <4e0>   DW_AT_decl_line   : 166
    <4e1>   DW_AT_decl_column : 14
    <4e2>   DW_AT_type        : <0x4a0>
    <4e6>   DW_AT_external    : 1
    <4e7>   DW_AT_declaration : 1
 <1><4e8>: Abbrev Number: 11 (DW_TAG_variable)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x1136): daylight
    <4ed>   DW_AT_decl_file   : 12
    <4ee>   DW_AT_decl_line   : 174
    <4ef>   DW_AT_decl_column : 12
    <4f0>   DW_AT_type        : <0x64>
    <4f4>   DW_AT_external    : 1
    <4f5>   DW_AT_declaration : 1
 <1><4f6>: Abbrev Number: 11 (DW_TAG_variable)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x4ff): timezone
    <4fb>   DW_AT_decl_file   : 12
    <4fc>   DW_AT_decl_line   : 175
    <4fd>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0xae>
    <502>   DW_AT_external    : 1
    <503>   DW_AT_declaration : 1
 <1><504>: Abbrev Number: 10 (DW_TAG_variable)
    <505>   DW_AT_name        : (indirect string, offset: 0xfed): getdate_err
    <509>   DW_AT_decl_file   : 12
    <50a>   DW_AT_decl_line   : 274
    <50c>   DW_AT_decl_column : 12
    <50d>   DW_AT_type        : <0x64>
    <511>   DW_AT_external    : 1
    <512>   DW_AT_declaration : 1
 <1><513>: Abbrev Number: 11 (DW_TAG_variable)
    <514>   DW_AT_name        : (indirect string, offset: 0xa39): debug_flag
    <518>   DW_AT_decl_file   : 13
    <519>   DW_AT_decl_line   : 20
    <51a>   DW_AT_decl_column : 13
    <51b>   DW_AT_type        : <0x521>
    <51f>   DW_AT_external    : 1
    <520>   DW_AT_declaration : 1
 <1><521>: Abbrev Number: 2 (DW_TAG_base_type)
    <522>   DW_AT_byte_size   : 1
    <523>   DW_AT_encoding    : 2	(boolean)
    <524>   DW_AT_name        : (indirect string, offset: 0x438): _Bool
 <1><528>: Abbrev Number: 3 (DW_TAG_const_type)
    <529>   DW_AT_type        : <0x521>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0xaf9): __kernel_long_t
    <532>   DW_AT_decl_file   : 14
    <533>   DW_AT_decl_line   : 15
    <534>   DW_AT_decl_column : 15
    <535>   DW_AT_type        : <0xae>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x562): __kernel_ulong_t
    <53e>   DW_AT_decl_file   : 14
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 23
    <541>   DW_AT_type        : <0x37>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x3ec): kernel_long_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 16
    <54c>   DW_AT_decl_column : 25
    <54d>   DW_AT_type        : <0x52d>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x8fa): kernel_ulong_t
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 17
    <558>   DW_AT_decl_column : 26
    <559>   DW_AT_type        : <0x539>
 <1><55d>: Abbrev Number: 3 (DW_TAG_const_type)
    <55e>   DW_AT_type        : <0x551>
 <1><562>: Abbrev Number: 8 (DW_TAG_structure_type)
    <563>   DW_AT_name        : (indirect string, offset: 0xc43): list_item
    <567>   DW_AT_byte_size   : 8
    <568>   DW_AT_decl_file   : 16
    <569>   DW_AT_decl_line   : 92
    <56a>   DW_AT_decl_column : 8
    <56b>   DW_AT_sibling     : <0x58e>
 <2><56f>: Abbrev Number: 9 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x117b): prev
    <574>   DW_AT_decl_file   : 16
    <575>   DW_AT_decl_line   : 93
    <576>   DW_AT_decl_column : 20
    <577>   DW_AT_type        : <0x58e>
    <57b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><57e>: Abbrev Number: 9 (DW_TAG_member)
    <57f>   DW_AT_name        : (indirect string, offset: 0x1171): next
    <583>   DW_AT_decl_file   : 16
    <584>   DW_AT_decl_line   : 94
    <585>   DW_AT_decl_column : 20
    <586>   DW_AT_type        : <0x58e>
    <58a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><58d>: Abbrev Number: 0
 <1><58e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <58f>   DW_AT_byte_size   : 4
    <590>   DW_AT_type        : <0x562>
 <1><594>: Abbrev Number: 8 (DW_TAG_structure_type)
    <595>   DW_AT_name        : (indirect string, offset: 0x8d2): sysent
    <599>   DW_AT_byte_size   : 20
    <59a>   DW_AT_decl_file   : 17
    <59b>   DW_AT_decl_line   : 13
    <59c>   DW_AT_decl_column : 16
    <59d>   DW_AT_sibling     : <0x5ed>
 <2><5a1>: Abbrev Number: 9 (DW_TAG_member)
    <5a2>   DW_AT_name        : (indirect string, offset: 0x10d2): nargs
    <5a6>   DW_AT_decl_file   : 17
    <5a7>   DW_AT_decl_line   : 14
    <5a8>   DW_AT_decl_column : 11
    <5a9>   DW_AT_type        : <0x2b>
    <5ad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b0>: Abbrev Number: 9 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0x9dc): sys_flags
    <5b5>   DW_AT_decl_file   : 17
    <5b6>   DW_AT_decl_line   : 15
    <5b7>   DW_AT_decl_column : 6
    <5b8>   DW_AT_type        : <0x64>
    <5bc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5bf>: Abbrev Number: 18 (DW_TAG_member)
    <5c0>   DW_AT_name        : sen
    <5c4>   DW_AT_decl_file   : 17
    <5c5>   DW_AT_decl_line   : 16
    <5c6>   DW_AT_decl_column : 6
    <5c7>   DW_AT_type        : <0x64>
    <5cb>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5ce>: Abbrev Number: 9 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x2fb): sys_func
    <5d3>   DW_AT_decl_file   : 17
    <5d4>   DW_AT_decl_line   : 17
    <5d5>   DW_AT_decl_column : 8
    <5d6>   DW_AT_type        : <0x854>
    <5da>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5dd>: Abbrev Number: 9 (DW_TAG_member)
    <5de>   DW_AT_name        : (indirect string, offset: 0x270): sys_name
    <5e2>   DW_AT_decl_file   : 17
    <5e3>   DW_AT_decl_line   : 18
    <5e4>   DW_AT_decl_column : 14
    <5e5>   DW_AT_type        : <0x1d5>
    <5e9>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5ec>: Abbrev Number: 0
 <1><5ed>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5ee>   DW_AT_prototyped  : 1
    <5ef>   DW_AT_type        : <0x64>
    <5f3>   DW_AT_sibling     : <0x5fd>
 <2><5f7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5f8>   DW_AT_type        : <0x5fd>
 <2><5fc>: Abbrev Number: 0
 <1><5fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5fe>   DW_AT_byte_size   : 4
    <5ff>   DW_AT_type        : <0x608>
 <1><603>: Abbrev Number: 3 (DW_TAG_const_type)
    <604>   DW_AT_type        : <0x5fd>
 <1><608>: Abbrev Number: 21 (DW_TAG_structure_type)
    <609>   DW_AT_name        : tcb
    <60d>   DW_AT_byte_size   : 204
    <60e>   DW_AT_decl_file   : 18
    <60f>   DW_AT_decl_line   : 262
    <611>   DW_AT_decl_column : 8
    <612>   DW_AT_sibling     : <0x854>
 <2><616>: Abbrev Number: 22 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0x50e): flags
    <61b>   DW_AT_decl_file   : 18
    <61c>   DW_AT_decl_line   : 263
    <61e>   DW_AT_decl_column : 6
    <61f>   DW_AT_type        : <0x64>
    <623>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><626>: Abbrev Number: 23 (DW_TAG_member)
    <627>   DW_AT_name        : pid
    <62b>   DW_AT_decl_file   : 18
    <62c>   DW_AT_decl_line   : 264
    <62e>   DW_AT_decl_column : 6
    <62f>   DW_AT_type        : <0x64>
    <633>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><636>: Abbrev Number: 22 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x58): qual_flg
    <63b>   DW_AT_decl_file   : 18
    <63c>   DW_AT_decl_line   : 265
    <63e>   DW_AT_decl_column : 6
    <63f>   DW_AT_type        : <0x64>
    <643>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><646>: Abbrev Number: 22 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x39f): currpers
    <64b>   DW_AT_decl_file   : 18
    <64c>   DW_AT_decl_line   : 267
    <64e>   DW_AT_decl_column : 15
    <64f>   DW_AT_type        : <0x2b>
    <653>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><656>: Abbrev Number: 22 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0xb96): u_error
    <65b>   DW_AT_decl_file   : 18
    <65c>   DW_AT_decl_line   : 269
    <65e>   DW_AT_decl_column : 16
    <65f>   DW_AT_type        : <0x37>
    <663>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><666>: Abbrev Number: 22 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0x1a3): scno
    <66b>   DW_AT_decl_file   : 18
    <66c>   DW_AT_decl_line   : 270
    <66e>   DW_AT_decl_column : 17
    <66f>   DW_AT_type        : <0x551>
    <673>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><676>: Abbrev Number: 22 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0xbdb): true_scno
    <67b>   DW_AT_decl_file   : 18
    <67c>   DW_AT_decl_line   : 271
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x551>
    <683>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><686>: Abbrev Number: 22 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0x1ad): u_arg
    <68b>   DW_AT_decl_file   : 18
    <68c>   DW_AT_decl_line   : 272
    <68e>   DW_AT_decl_column : 17
    <68f>   DW_AT_type        : <0x984>
    <693>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><696>: Abbrev Number: 22 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x9f3): u_rval
    <69b>   DW_AT_decl_file   : 18
    <69c>   DW_AT_decl_line   : 273
    <69e>   DW_AT_decl_column : 16
    <69f>   DW_AT_type        : <0x545>
    <6a3>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6a6>: Abbrev Number: 22 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0xb15): sys_func_rval
    <6ab>   DW_AT_decl_file   : 18
    <6ac>   DW_AT_decl_line   : 274
    <6ae>   DW_AT_decl_column : 6
    <6af>   DW_AT_type        : <0x64>
    <6b3>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6b6>: Abbrev Number: 22 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xd5c): curcol
    <6bb>   DW_AT_decl_file   : 18
    <6bc>   DW_AT_decl_line   : 275
    <6be>   DW_AT_decl_column : 6
    <6bf>   DW_AT_type        : <0x64>
    <6c3>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6c6>: Abbrev Number: 22 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xa05): outf
    <6cb>   DW_AT_decl_file   : 18
    <6cc>   DW_AT_decl_line   : 276
    <6ce>   DW_AT_decl_column : 8
    <6cf>   DW_AT_type        : <0x41a>
    <6d3>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6d6>: Abbrev Number: 22 (DW_TAG_member)
    <6d7>   DW_AT_name        : (indirect string, offset: 0xf86): staged_output_data
    <6db>   DW_AT_decl_file   : 18
    <6dc>   DW_AT_decl_line   : 277
    <6de>   DW_AT_decl_column : 29
    <6df>   DW_AT_type        : <0x99a>
    <6e3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6e6>: Abbrev Number: 22 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xae0): auxstr
    <6eb>   DW_AT_decl_file   : 18
    <6ec>   DW_AT_decl_line   : 279
    <6ee>   DW_AT_decl_column : 14
    <6ef>   DW_AT_type        : <0x1d5>
    <6f3>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><6f6>: Abbrev Number: 22 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x175): _priv_data
    <6fb>   DW_AT_decl_file   : 18
    <6fc>   DW_AT_decl_line   : 280
    <6fe>   DW_AT_decl_column : 8
    <6ff>   DW_AT_type        : <0xcd>
    <703>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><706>: Abbrev Number: 22 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0xc70): _free_priv_data
    <70b>   DW_AT_decl_file   : 18
    <70c>   DW_AT_decl_line   : 281
    <70e>   DW_AT_decl_column : 9
    <70f>   DW_AT_type        : <0x9ac>
    <713>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><716>: Abbrev Number: 22 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0x186): s_ent
    <71b>   DW_AT_decl_file   : 18
    <71c>   DW_AT_decl_line   : 282
    <71e>   DW_AT_decl_column : 23
    <71f>   DW_AT_type        : <0x9b2>
    <723>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><726>: Abbrev Number: 22 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <72b>   DW_AT_decl_file   : 18
    <72c>   DW_AT_decl_line   : 285
    <72e>   DW_AT_decl_column : 23
    <72f>   DW_AT_type        : <0x9b2>
    <733>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><736>: Abbrev Number: 22 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x394): inject_vec
    <73b>   DW_AT_decl_file   : 18
    <73c>   DW_AT_decl_line   : 286
    <73e>   DW_AT_decl_column : 22
    <73f>   DW_AT_type        : <0x9bd>
    <743>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><746>: Abbrev Number: 22 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x834): stime
    <74b>   DW_AT_decl_file   : 18
    <74c>   DW_AT_decl_line   : 287
    <74e>   DW_AT_decl_column : 18
    <74f>   DW_AT_type        : <0x13f>
    <753>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><756>: Abbrev Number: 22 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x3a8): ltime
    <75b>   DW_AT_decl_file   : 18
    <75c>   DW_AT_decl_line   : 288
    <75e>   DW_AT_decl_column : 18
    <75f>   DW_AT_type        : <0x13f>
    <763>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><766>: Abbrev Number: 22 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x1093): atime
    <76b>   DW_AT_decl_file   : 18
    <76c>   DW_AT_decl_line   : 289
    <76e>   DW_AT_decl_column : 18
    <76f>   DW_AT_type        : <0x13f>
    <773>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><776>: Abbrev Number: 22 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x508): etime
    <77b>   DW_AT_decl_file   : 18
    <77c>   DW_AT_decl_line   : 290
    <77e>   DW_AT_decl_column : 18
    <77f>   DW_AT_type        : <0x13f>
    <783>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><787>: Abbrev Number: 22 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0xdc0): delay_expiration_time
    <78c>   DW_AT_decl_file   : 18
    <78d>   DW_AT_decl_line   : 291
    <78f>   DW_AT_decl_column : 18
    <790>   DW_AT_type        : <0x13f>
    <794>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><798>: Abbrev Number: 22 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <79d>   DW_AT_decl_file   : 18
    <79e>   DW_AT_decl_line   : 298
    <7a0>   DW_AT_decl_column : 15
    <7a1>   DW_AT_type        : <0x2b>
    <7a5>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7a9>: Abbrev Number: 22 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0xfca): last_dirfd
    <7ae>   DW_AT_decl_file   : 18
    <7af>   DW_AT_decl_line   : 301
    <7b1>   DW_AT_decl_column : 6
    <7b2>   DW_AT_type        : <0x64>
    <7b6>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ba>: Abbrev Number: 22 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x1002): mmap_cache
    <7bf>   DW_AT_decl_file   : 18
    <7c0>   DW_AT_decl_line   : 304
    <7c2>   DW_AT_decl_column : 23
    <7c3>   DW_AT_type        : <0x9d9>
    <7c7>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7cb>: Abbrev Number: 22 (DW_TAG_member)
    <7cc>   DW_AT_name        : (indirect string, offset: 0xba5): wait_data_idx
    <7d0>   DW_AT_decl_file   : 18
    <7d1>   DW_AT_decl_line   : 311
    <7d3>   DW_AT_decl_column : 9
    <7d4>   DW_AT_type        : <0x12e>
    <7d8>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7dc>: Abbrev Number: 22 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0xae7): delayed_wait_data
    <7e1>   DW_AT_decl_file   : 18
    <7e2>   DW_AT_decl_line   : 313
    <7e4>   DW_AT_decl_column : 24
    <7e5>   DW_AT_type        : <0x9e5>
    <7e9>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7ed>: Abbrev Number: 22 (DW_TAG_member)
    <7ee>   DW_AT_name        : (indirect string, offset: 0xb57): wait_list
    <7f2>   DW_AT_decl_file   : 18
    <7f3>   DW_AT_decl_line   : 314
    <7f5>   DW_AT_decl_column : 19
    <7f6>   DW_AT_type        : <0x562>
    <7fa>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><7fe>: Abbrev Number: 22 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x727): vcpu_info_list
    <803>   DW_AT_decl_file   : 18
    <804>   DW_AT_decl_line   : 318
    <806>   DW_AT_decl_column : 20
    <807>   DW_AT_type        : <0x9f1>
    <80b>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><80f>: Abbrev Number: 22 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0xd1f): unwind_ctx
    <814>   DW_AT_decl_file   : 18
    <815>   DW_AT_decl_line   : 322
    <817>   DW_AT_decl_column : 8
    <818>   DW_AT_type        : <0xcd>
    <81c>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><820>: Abbrev Number: 22 (DW_TAG_member)
    <821>   DW_AT_name        : (indirect string, offset: 0x4f2): unwind_queue
    <825>   DW_AT_decl_file   : 18
    <826>   DW_AT_decl_line   : 323
    <828>   DW_AT_decl_column : 25
    <829>   DW_AT_type        : <0x9fd>
    <82d>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><831>: Abbrev Number: 22 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x16a): comm
    <836>   DW_AT_decl_file   : 18
    <837>   DW_AT_decl_line   : 327
    <839>   DW_AT_decl_column : 7
    <83a>   DW_AT_type        : <0xa03>
    <83e>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><842>: Abbrev Number: 22 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x229): start_prc
    <847>   DW_AT_decl_file   : 18
    <848>   DW_AT_decl_line   : 329
    <84a>   DW_AT_decl_column : 16
    <84b>   DW_AT_type        : <0x37>
    <84f>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><853>: Abbrev Number: 0
 <1><854>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <855>   DW_AT_byte_size   : 4
    <856>   DW_AT_type        : <0x5ed>
 <1><85a>: Abbrev Number: 4 (DW_TAG_typedef)
    <85b>   DW_AT_name        : (indirect string, offset: 0x554): struct_sysent
    <85f>   DW_AT_decl_file   : 17
    <860>   DW_AT_decl_line   : 19
    <861>   DW_AT_decl_column : 3
    <862>   DW_AT_type        : <0x594>
 <1><866>: Abbrev Number: 3 (DW_TAG_const_type)
    <867>   DW_AT_type        : <0x85a>
 <1><86b>: Abbrev Number: 11 (DW_TAG_variable)
    <86c>   DW_AT_name        : (indirect string, offset: 0xdac): current_personality
    <870>   DW_AT_decl_file   : 18
    <871>   DW_AT_decl_line   : 158
    <872>   DW_AT_decl_column : 17
    <873>   DW_AT_type        : <0x2b>
    <877>   DW_AT_external    : 1
    <878>   DW_AT_declaration : 1
 <1><879>: Abbrev Number: 11 (DW_TAG_variable)
    <87a>   DW_AT_name        : (indirect string, offset: 0x874): current_wordsize
    <87e>   DW_AT_decl_file   : 18
    <87f>   DW_AT_decl_line   : 171
    <880>   DW_AT_decl_column : 17
    <881>   DW_AT_type        : <0x2b>
    <885>   DW_AT_external    : 1
    <886>   DW_AT_declaration : 1
 <1><887>: Abbrev Number: 11 (DW_TAG_variable)
    <888>   DW_AT_name        : (indirect string, offset: 0xab4): current_klongsize
    <88c>   DW_AT_decl_file   : 18
    <88d>   DW_AT_decl_line   : 176
    <88e>   DW_AT_decl_column : 17
    <88f>   DW_AT_type        : <0x2b>
    <893>   DW_AT_external    : 1
    <894>   DW_AT_declaration : 1
 <1><895>: Abbrev Number: 8 (DW_TAG_structure_type)
    <896>   DW_AT_name        : (indirect string, offset: 0xcf6): ioctlent
    <89a>   DW_AT_byte_size   : 8
    <89b>   DW_AT_decl_file   : 18
    <89c>   DW_AT_decl_line   : 217
    <89d>   DW_AT_decl_column : 16
    <89e>   DW_AT_sibling     : <0x8c1>
 <2><8a2>: Abbrev Number: 9 (DW_TAG_member)
    <8a3>   DW_AT_name        : (indirect string, offset: 0xfae): symbol
    <8a7>   DW_AT_decl_file   : 18
    <8a8>   DW_AT_decl_line   : 218
    <8a9>   DW_AT_decl_column : 14
    <8aa>   DW_AT_type        : <0x1d5>
    <8ae>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b1>: Abbrev Number: 9 (DW_TAG_member)
    <8b2>   DW_AT_name        : (indirect string, offset: 0xd75): code
    <8b6>   DW_AT_decl_file   : 18
    <8b7>   DW_AT_decl_line   : 219
    <8b8>   DW_AT_decl_column : 15
    <8b9>   DW_AT_type        : <0x2b>
    <8bd>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8c0>: Abbrev Number: 0
 <1><8c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c2>   DW_AT_name        : (indirect string, offset: 0xca2): struct_ioctlent
    <8c6>   DW_AT_decl_file   : 18
    <8c7>   DW_AT_decl_line   : 220
    <8c8>   DW_AT_decl_column : 3
    <8c9>   DW_AT_type        : <0x895>
 <1><8cd>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ce>   DW_AT_type        : <0x8c1>
 <1><8d2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x868): inject_data
    <8d7>   DW_AT_byte_size   : 10
    <8d8>   DW_AT_decl_file   : 18
    <8d9>   DW_AT_decl_line   : 241
    <8da>   DW_AT_decl_column : 8
    <8db>   DW_AT_sibling     : <0x93a>
 <2><8df>: Abbrev Number: 9 (DW_TAG_member)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x50e): flags
    <8e4>   DW_AT_decl_file   : 18
    <8e5>   DW_AT_decl_line   : 242
    <8e6>   DW_AT_decl_column : 10
    <8e7>   DW_AT_type        : <0xfe>
    <8eb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ee>: Abbrev Number: 9 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x987): signo
    <8f3>   DW_AT_decl_file   : 18
    <8f4>   DW_AT_decl_line   : 243
    <8f5>   DW_AT_decl_column : 10
    <8f6>   DW_AT_type        : <0xfe>
    <8fa>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8fd>: Abbrev Number: 9 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0xfc): rval_idx
    <902>   DW_AT_decl_file   : 18
    <903>   DW_AT_decl_line   : 244
    <904>   DW_AT_decl_column : 11
    <905>   DW_AT_type        : <0x10a>
    <909>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><90c>: Abbrev Number: 9 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0xd4a): delay_idx
    <911>   DW_AT_decl_file   : 18
    <912>   DW_AT_decl_line   : 245
    <913>   DW_AT_decl_column : 11
    <914>   DW_AT_type        : <0x10a>
    <918>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><91b>: Abbrev Number: 9 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0x59a): poke_idx
    <920>   DW_AT_decl_file   : 18
    <921>   DW_AT_decl_line   : 246
    <922>   DW_AT_decl_column : 11
    <923>   DW_AT_type        : <0x10a>
    <927>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><92a>: Abbrev Number: 9 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0x1a3): scno
    <92f>   DW_AT_decl_file   : 18
    <930>   DW_AT_decl_line   : 247
    <931>   DW_AT_decl_column : 11
    <932>   DW_AT_type        : <0x10a>
    <936>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><939>: Abbrev Number: 0
 <1><93a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <93b>   DW_AT_name        : (indirect string, offset: 0xdd): inject_opts
    <93f>   DW_AT_byte_size   : 16
    <940>   DW_AT_decl_file   : 18
    <941>   DW_AT_decl_line   : 250
    <942>   DW_AT_decl_column : 8
    <943>   DW_AT_sibling     : <0x984>
 <2><947>: Abbrev Number: 9 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0xa89): first
    <94c>   DW_AT_decl_file   : 18
    <94d>   DW_AT_decl_line   : 251
    <94e>   DW_AT_decl_column : 11
    <94f>   DW_AT_type        : <0x10a>
    <953>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><956>: Abbrev Number: 9 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x11a4): last
    <95b>   DW_AT_decl_file   : 18
    <95c>   DW_AT_decl_line   : 252
    <95d>   DW_AT_decl_column : 11
    <95e>   DW_AT_type        : <0x10a>
    <962>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><965>: Abbrev Number: 9 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0x3ae): step
    <96a>   DW_AT_decl_file   : 18
    <96b>   DW_AT_decl_line   : 253
    <96c>   DW_AT_decl_column : 11
    <96d>   DW_AT_type        : <0x10a>
    <971>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><974>: Abbrev Number: 9 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x1176): data
    <979>   DW_AT_decl_file   : 18
    <97a>   DW_AT_decl_line   : 254
    <97b>   DW_AT_decl_column : 21
    <97c>   DW_AT_type        : <0x8d2>
    <980>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><983>: Abbrev Number: 0
 <1><984>: Abbrev Number: 15 (DW_TAG_array_type)
    <985>   DW_AT_type        : <0x551>
    <989>   DW_AT_sibling     : <0x994>
 <2><98d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <98e>   DW_AT_type        : <0x2b>
    <992>   DW_AT_upper_bound : 5
 <2><993>: Abbrev Number: 0
 <1><994>: Abbrev Number: 14 (DW_TAG_structure_type)
    <995>   DW_AT_name        : (indirect string, offset: 0xf86): staged_output_data
    <999>   DW_AT_declaration : 1
 <1><99a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <99b>   DW_AT_byte_size   : 4
    <99c>   DW_AT_type        : <0x994>
 <1><9a0>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a1>   DW_AT_prototyped  : 1
    <9a2>   DW_AT_sibling     : <0x9ac>
 <2><9a6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9a7>   DW_AT_type        : <0xcd>
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ad>   DW_AT_byte_size   : 4
    <9ae>   DW_AT_type        : <0x9a0>
 <1><9b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_type        : <0x866>
 <1><9b8>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b9>   DW_AT_type        : <0x9b2>
 <1><9bd>: Abbrev Number: 15 (DW_TAG_array_type)
    <9be>   DW_AT_type        : <0x9cd>
    <9c2>   DW_AT_sibling     : <0x9cd>
 <2><9c6>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9c7>   DW_AT_type        : <0x2b>
    <9cb>   DW_AT_upper_bound : 2
 <2><9cc>: Abbrev Number: 0
 <1><9cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ce>   DW_AT_byte_size   : 4
    <9cf>   DW_AT_type        : <0x93a>
 <1><9d3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xa9): mmap_cache_t
    <9d8>   DW_AT_declaration : 1
 <1><9d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9da>   DW_AT_byte_size   : 4
    <9db>   DW_AT_type        : <0x9d3>
 <1><9df>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x3c9): tcb_wait_data
    <9e4>   DW_AT_declaration : 1
 <1><9e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x9df>
 <1><9eb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x160): vcpu_info
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0xf6a): unwind_queue_t
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 15 (DW_TAG_array_type)
    <a04>   DW_AT_type        : <0xf2>
    <a08>   DW_AT_sibling     : <0xa13>
 <2><a0c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a0d>   DW_AT_type        : <0x2b>
    <a11>   DW_AT_upper_bound : 15
 <2><a12>: Abbrev Number: 0
 <1><a13>: Abbrev Number: 10 (DW_TAG_variable)
    <a14>   DW_AT_name        : (indirect string, offset: 0xbee): stub_sysent
    <a18>   DW_AT_decl_file   : 18
    <a19>   DW_AT_decl_line   : 403
    <a1b>   DW_AT_decl_column : 28
    <a1c>   DW_AT_type        : <0x866>
    <a20>   DW_AT_external    : 1
    <a21>   DW_AT_declaration : 1
 <1><a22>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a23>   DW_AT_name        : (indirect string, offset: 0x1159): xlat_type
    <a27>   DW_AT_encoding    : 7	(unsigned)
    <a28>   DW_AT_byte_size   : 4
    <a29>   DW_AT_type        : <0x2b>
    <a2d>   DW_AT_decl_file   : 19
    <a2e>   DW_AT_decl_line   : 13
    <a2f>   DW_AT_decl_column : 6
    <a30>   DW_AT_sibling     : <0xa47>
 <2><a34>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a35>   DW_AT_name        : (indirect string, offset: 0x2cb): XT_NORMAL
    <a39>   DW_AT_const_value : 0
 <2><a3a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3b>   DW_AT_name        : (indirect string, offset: 0xcc5): XT_SORTED
    <a3f>   DW_AT_const_value : 1
 <2><a40>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0xe44): XT_INDEXED
    <a45>   DW_AT_const_value : 2
 <2><a46>: Abbrev Number: 0
 <1><a47>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a48>   DW_AT_name        : (indirect string, offset: 0xc1a): xlat_style
    <a4c>   DW_AT_encoding    : 7	(unsigned)
    <a4d>   DW_AT_byte_size   : 4
    <a4e>   DW_AT_type        : <0x2b>
    <a52>   DW_AT_decl_file   : 19
    <a53>   DW_AT_decl_line   : 19
    <a54>   DW_AT_decl_column : 6
    <a55>   DW_AT_sibling     : <0xa84>
 <2><a59>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xe9): XLAT_STYLE_DEFAULT
    <a5e>   DW_AT_const_value : 0
 <2><a5f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0xc4d): XLAT_STYLE_RAW
    <a64>   DW_AT_const_value : 1
 <2><a65>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0x1124): XLAT_STYLE_ABBREV
    <a6a>   DW_AT_const_value : 2
 <2><a6b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x2e8): XLAT_STYLE_VERBOSE
    <a70>   DW_AT_const_value : 3
 <2><a71>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a76>   DW_AT_const_value : 0
 <2><a77>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a7c>   DW_AT_const_value : 4
 <2><a7d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x1193): XLAT_STYLE_FMT_D
    <a82>   DW_AT_const_value : 8
 <2><a83>: Abbrev Number: 0
 <1><a84>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a85>   DW_AT_name        : (indirect string, offset: 0x323): xlat_data
    <a89>   DW_AT_byte_size   : 12
    <a8a>   DW_AT_decl_file   : 19
    <a8b>   DW_AT_decl_line   : 51
    <a8c>   DW_AT_decl_column : 8
    <a8d>   DW_AT_sibling     : <0xab0>
 <2><a91>: Abbrev Number: 18 (DW_TAG_member)
    <a92>   DW_AT_name        : val
    <a96>   DW_AT_decl_file   : 19
    <a97>   DW_AT_decl_line   : 52
    <a98>   DW_AT_decl_column : 11
    <a99>   DW_AT_type        : <0x122>
    <a9d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aa0>: Abbrev Number: 18 (DW_TAG_member)
    <aa1>   DW_AT_name        : str
    <aa5>   DW_AT_decl_file   : 19
    <aa6>   DW_AT_decl_line   : 53
    <aa7>   DW_AT_decl_column : 14
    <aa8>   DW_AT_type        : <0x1d5>
    <aac>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aaf>: Abbrev Number: 0
 <1><ab0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab1>   DW_AT_type        : <0xa84>
 <1><ab5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aba>   DW_AT_byte_size   : 24
    <abb>   DW_AT_decl_file   : 19
    <abc>   DW_AT_decl_line   : 56
    <abd>   DW_AT_decl_column : 8
    <abe>   DW_AT_sibling     : <0xb0e>
 <2><ac2>: Abbrev Number: 9 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x1176): data
    <ac7>   DW_AT_decl_file   : 19
    <ac8>   DW_AT_decl_line   : 57
    <ac9>   DW_AT_decl_column : 26
    <aca>   DW_AT_type        : <0xb13>
    <ace>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad1>: Abbrev Number: 9 (DW_TAG_member)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x8c6): flags_strsz
    <ad6>   DW_AT_decl_file   : 19
    <ad7>   DW_AT_decl_line   : 58
    <ad8>   DW_AT_decl_column : 9
    <ad9>   DW_AT_type        : <0x12e>
    <add>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ae0>: Abbrev Number: 9 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0xbb3): size
    <ae5>   DW_AT_decl_file   : 19
    <ae6>   DW_AT_decl_line   : 59
    <ae7>   DW_AT_decl_column : 11
    <ae8>   DW_AT_type        : <0x116>
    <aec>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aef>: Abbrev Number: 9 (DW_TAG_member)
    <af0>   DW_AT_name        : (indirect string, offset: 0x1a8): type
    <af4>   DW_AT_decl_file   : 19
    <af5>   DW_AT_decl_line   : 60
    <af6>   DW_AT_decl_column : 17
    <af7>   DW_AT_type        : <0xa22>
    <afb>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><afe>: Abbrev Number: 9 (DW_TAG_member)
    <aff>   DW_AT_name        : (indirect string, offset: 0x77b): flags_mask
    <b03>   DW_AT_decl_file   : 19
    <b04>   DW_AT_decl_line   : 61
    <b05>   DW_AT_decl_column : 11
    <b06>   DW_AT_type        : <0x122>
    <b0a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b0d>: Abbrev Number: 0
 <1><b0e>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0f>   DW_AT_type        : <0xab5>
 <1><b13>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b14>   DW_AT_byte_size   : 4
    <b15>   DW_AT_type        : <0xab0>
 <1><b19>: Abbrev Number: 15 (DW_TAG_array_type)
    <b1a>   DW_AT_type        : <0xb0e>
    <b1e>   DW_AT_sibling     : <0xb24>
 <2><b22>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b23>: Abbrev Number: 0
 <1><b24>: Abbrev Number: 3 (DW_TAG_const_type)
    <b25>   DW_AT_type        : <0xb19>
 <1><b29>: Abbrev Number: 10 (DW_TAG_variable)
    <b2a>   DW_AT_name        : (indirect string, offset: 0xeb2): addrfams
    <b2e>   DW_AT_decl_file   : 18
    <b2f>   DW_AT_decl_line   : 409
    <b31>   DW_AT_decl_column : 26
    <b32>   DW_AT_type        : <0xb24>
    <b36>   DW_AT_external    : 1
    <b37>   DW_AT_declaration : 1
 <1><b38>: Abbrev Number: 10 (DW_TAG_variable)
    <b39>   DW_AT_name        : (indirect string, offset: 0xd85): arp_hardware_types
    <b3d>   DW_AT_decl_file   : 18
    <b3e>   DW_AT_decl_line   : 410
    <b40>   DW_AT_decl_column : 26
    <b41>   DW_AT_type        : <0xb24>
    <b45>   DW_AT_external    : 1
    <b46>   DW_AT_declaration : 1
 <1><b47>: Abbrev Number: 10 (DW_TAG_variable)
    <b48>   DW_AT_name        : (indirect string, offset: 0x1099): at_flags
    <b4c>   DW_AT_decl_file   : 18
    <b4d>   DW_AT_decl_line   : 411
    <b4f>   DW_AT_decl_column : 26
    <b50>   DW_AT_type        : <0xb24>
    <b54>   DW_AT_external    : 1
    <b55>   DW_AT_declaration : 1
 <1><b56>: Abbrev Number: 10 (DW_TAG_variable)
    <b57>   DW_AT_name        : (indirect string, offset: 0x4d0): clocknames
    <b5b>   DW_AT_decl_file   : 18
    <b5c>   DW_AT_decl_line   : 412
    <b5e>   DW_AT_decl_column : 26
    <b5f>   DW_AT_type        : <0xb24>
    <b63>   DW_AT_external    : 1
    <b64>   DW_AT_declaration : 1
 <1><b65>: Abbrev Number: 10 (DW_TAG_variable)
    <b66>   DW_AT_name        : (indirect string, offset: 0x1050): dirent_types
    <b6a>   DW_AT_decl_file   : 18
    <b6b>   DW_AT_decl_line   : 413
    <b6d>   DW_AT_decl_column : 26
    <b6e>   DW_AT_type        : <0xb24>
    <b72>   DW_AT_external    : 1
    <b73>   DW_AT_declaration : 1
 <1><b74>: Abbrev Number: 10 (DW_TAG_variable)
    <b75>   DW_AT_name        : (indirect string, offset: 0x917): ethernet_protocols
    <b79>   DW_AT_decl_file   : 18
    <b7a>   DW_AT_decl_line   : 414
    <b7c>   DW_AT_decl_column : 26
    <b7d>   DW_AT_type        : <0xb24>
    <b81>   DW_AT_external    : 1
    <b82>   DW_AT_declaration : 1
 <1><b83>: Abbrev Number: 10 (DW_TAG_variable)
    <b84>   DW_AT_name        : (indirect string, offset: 0x5ed): inet_protocols
    <b88>   DW_AT_decl_file   : 18
    <b89>   DW_AT_decl_line   : 415
    <b8b>   DW_AT_decl_column : 26
    <b8c>   DW_AT_type        : <0xb24>
    <b90>   DW_AT_external    : 1
    <b91>   DW_AT_declaration : 1
 <1><b92>: Abbrev Number: 10 (DW_TAG_variable)
    <b93>   DW_AT_name        : (indirect string, offset: 0x2b8): evdev_abs
    <b97>   DW_AT_decl_file   : 18
    <b98>   DW_AT_decl_line   : 416
    <b9a>   DW_AT_decl_column : 26
    <b9b>   DW_AT_type        : <0xb24>
    <b9f>   DW_AT_external    : 1
    <ba0>   DW_AT_declaration : 1
 <1><ba1>: Abbrev Number: 10 (DW_TAG_variable)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x770): audit_arch
    <ba6>   DW_AT_decl_file   : 18
    <ba7>   DW_AT_decl_line   : 417
    <ba9>   DW_AT_decl_column : 26
    <baa>   DW_AT_type        : <0xb24>
    <bae>   DW_AT_external    : 1
    <baf>   DW_AT_declaration : 1
 <1><bb0>: Abbrev Number: 10 (DW_TAG_variable)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x95): evdev_ev
    <bb5>   DW_AT_decl_file   : 18
    <bb6>   DW_AT_decl_line   : 418
    <bb8>   DW_AT_decl_column : 26
    <bb9>   DW_AT_type        : <0xb24>
    <bbd>   DW_AT_external    : 1
    <bbe>   DW_AT_declaration : 1
 <1><bbf>: Abbrev Number: 10 (DW_TAG_variable)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x49b): iffflags
    <bc4>   DW_AT_decl_file   : 18
    <bc5>   DW_AT_decl_line   : 419
    <bc7>   DW_AT_decl_column : 26
    <bc8>   DW_AT_type        : <0xb24>
    <bcc>   DW_AT_external    : 1
    <bcd>   DW_AT_declaration : 1
 <1><bce>: Abbrev Number: 10 (DW_TAG_variable)
    <bcf>   DW_AT_name        : (indirect string, offset: 0xc5c): ip_type_of_services
    <bd3>   DW_AT_decl_file   : 18
    <bd4>   DW_AT_decl_line   : 420
    <bd6>   DW_AT_decl_column : 26
    <bd7>   DW_AT_type        : <0xb24>
    <bdb>   DW_AT_external    : 1
    <bdc>   DW_AT_declaration : 1
 <1><bdd>: Abbrev Number: 10 (DW_TAG_variable)
    <bde>   DW_AT_name        : (indirect string, offset: 0x6f9): ipc_private
    <be2>   DW_AT_decl_file   : 18
    <be3>   DW_AT_decl_line   : 421
    <be5>   DW_AT_decl_column : 26
    <be6>   DW_AT_type        : <0xb24>
    <bea>   DW_AT_external    : 1
    <beb>   DW_AT_declaration : 1
 <1><bec>: Abbrev Number: 10 (DW_TAG_variable)
    <bed>   DW_AT_name        : (indirect string, offset: 0x319): msg_flags
    <bf1>   DW_AT_decl_file   : 18
    <bf2>   DW_AT_decl_line   : 422
    <bf4>   DW_AT_decl_column : 26
    <bf5>   DW_AT_type        : <0xb24>
    <bf9>   DW_AT_external    : 1
    <bfa>   DW_AT_declaration : 1
 <1><bfb>: Abbrev Number: 10 (DW_TAG_variable)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x105): netlink_protocols
    <c00>   DW_AT_decl_file   : 18
    <c01>   DW_AT_decl_line   : 423
    <c03>   DW_AT_decl_column : 26
    <c04>   DW_AT_type        : <0xb24>
    <c08>   DW_AT_external    : 1
    <c09>   DW_AT_declaration : 1
 <1><c0a>: Abbrev Number: 10 (DW_TAG_variable)
    <c0b>   DW_AT_name        : (indirect string, offset: 0xf99): nl_bridge_vlan_flags
    <c0f>   DW_AT_decl_file   : 18
    <c10>   DW_AT_decl_line   : 424
    <c12>   DW_AT_decl_column : 26
    <c13>   DW_AT_type        : <0xb24>
    <c17>   DW_AT_external    : 1
    <c18>   DW_AT_declaration : 1
 <1><c19>: Abbrev Number: 10 (DW_TAG_variable)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xe2d): nl_netfilter_msg_types
    <c1e>   DW_AT_decl_file   : 18
    <c1f>   DW_AT_decl_line   : 425
    <c21>   DW_AT_decl_column : 26
    <c22>   DW_AT_type        : <0xb24>
    <c26>   DW_AT_external    : 1
    <c27>   DW_AT_declaration : 1
 <1><c28>: Abbrev Number: 10 (DW_TAG_variable)
    <c29>   DW_AT_name        : (indirect string, offset: 0x47d): nl_route_types
    <c2d>   DW_AT_decl_file   : 18
    <c2e>   DW_AT_decl_line   : 426
    <c30>   DW_AT_decl_column : 26
    <c31>   DW_AT_type        : <0xb24>
    <c35>   DW_AT_external    : 1
    <c36>   DW_AT_declaration : 1
 <1><c37>: Abbrev Number: 10 (DW_TAG_variable)
    <c38>   DW_AT_name        : (indirect string, offset: 0xee9): open_access_modes
    <c3c>   DW_AT_decl_file   : 18
    <c3d>   DW_AT_decl_line   : 427
    <c3f>   DW_AT_decl_column : 26
    <c40>   DW_AT_type        : <0xb24>
    <c44>   DW_AT_external    : 1
    <c45>   DW_AT_declaration : 1
 <1><c46>: Abbrev Number: 10 (DW_TAG_variable)
    <c47>   DW_AT_name        : (indirect string, offset: 0x85): open_mode_flags
    <c4b>   DW_AT_decl_file   : 18
    <c4c>   DW_AT_decl_line   : 428
    <c4e>   DW_AT_decl_column : 26
    <c4f>   DW_AT_type        : <0xb24>
    <c53>   DW_AT_external    : 1
    <c54>   DW_AT_declaration : 1
 <1><c55>: Abbrev Number: 10 (DW_TAG_variable)
    <c56>   DW_AT_name        : (indirect string, offset: 0xc95): perf_type_id
    <c5a>   DW_AT_decl_file   : 18
    <c5b>   DW_AT_decl_line   : 429
    <c5d>   DW_AT_decl_column : 26
    <c5e>   DW_AT_type        : <0xb24>
    <c62>   DW_AT_external    : 1
    <c63>   DW_AT_declaration : 1
 <1><c64>: Abbrev Number: 10 (DW_TAG_variable)
    <c65>   DW_AT_name        : (indirect string, offset: 0xebb): pollflags
    <c69>   DW_AT_decl_file   : 18
    <c6a>   DW_AT_decl_line   : 430
    <c6c>   DW_AT_decl_column : 26
    <c6d>   DW_AT_type        : <0xb24>
    <c71>   DW_AT_external    : 1
    <c72>   DW_AT_declaration : 1
 <1><c73>: Abbrev Number: 10 (DW_TAG_variable)
    <c74>   DW_AT_name        : (indirect string, offset: 0x58e): ptrace_cmds
    <c78>   DW_AT_decl_file   : 18
    <c79>   DW_AT_decl_line   : 431
    <c7b>   DW_AT_decl_column : 26
    <c7c>   DW_AT_type        : <0xb24>
    <c80>   DW_AT_external    : 1
    <c81>   DW_AT_declaration : 1
 <1><c82>: Abbrev Number: 10 (DW_TAG_variable)
    <c83>   DW_AT_name        : (indirect string, offset: 0x859): resource_flags
    <c87>   DW_AT_decl_file   : 18
    <c88>   DW_AT_decl_line   : 432
    <c8a>   DW_AT_decl_column : 26
    <c8b>   DW_AT_type        : <0xb24>
    <c8f>   DW_AT_external    : 1
    <c90>   DW_AT_declaration : 1
 <1><c91>: Abbrev Number: 10 (DW_TAG_variable)
    <c92>   DW_AT_name        : (indirect string, offset: 0x28e): route_nexthop_flags
    <c96>   DW_AT_decl_file   : 18
    <c97>   DW_AT_decl_line   : 433
    <c99>   DW_AT_decl_column : 26
    <c9a>   DW_AT_type        : <0xb24>
    <c9e>   DW_AT_external    : 1
    <c9f>   DW_AT_declaration : 1
 <1><ca0>: Abbrev Number: 10 (DW_TAG_variable)
    <ca1>   DW_AT_name        : (indirect string, offset: 0xf1b): routing_protocols
    <ca5>   DW_AT_decl_file   : 18
    <ca6>   DW_AT_decl_line   : 434
    <ca8>   DW_AT_decl_column : 26
    <ca9>   DW_AT_type        : <0xb24>
    <cad>   DW_AT_external    : 1
    <cae>   DW_AT_declaration : 1
 <1><caf>: Abbrev Number: 10 (DW_TAG_variable)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x48c): routing_scopes
    <cb4>   DW_AT_decl_file   : 18
    <cb5>   DW_AT_decl_line   : 435
    <cb7>   DW_AT_decl_column : 26
    <cb8>   DW_AT_type        : <0xb24>
    <cbc>   DW_AT_external    : 1
    <cbd>   DW_AT_declaration : 1
 <1><cbe>: Abbrev Number: 10 (DW_TAG_variable)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xe0f): routing_table_ids
    <cc3>   DW_AT_decl_file   : 18
    <cc4>   DW_AT_decl_line   : 436
    <cc6>   DW_AT_decl_column : 26
    <cc7>   DW_AT_type        : <0xb24>
    <ccb>   DW_AT_external    : 1
    <ccc>   DW_AT_declaration : 1
 <1><ccd>: Abbrev Number: 10 (DW_TAG_variable)
    <cce>   DW_AT_name        : (indirect string, offset: 0x6d6): routing_types
    <cd2>   DW_AT_decl_file   : 18
    <cd3>   DW_AT_decl_line   : 437
    <cd5>   DW_AT_decl_column : 26
    <cd6>   DW_AT_type        : <0xb24>
    <cda>   DW_AT_external    : 1
    <cdb>   DW_AT_declaration : 1
 <1><cdc>: Abbrev Number: 10 (DW_TAG_variable)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x1cc): rwf_flags
    <ce1>   DW_AT_decl_file   : 18
    <ce2>   DW_AT_decl_line   : 438
    <ce4>   DW_AT_decl_column : 26
    <ce5>   DW_AT_type        : <0xb24>
    <ce9>   DW_AT_external    : 1
    <cea>   DW_AT_declaration : 1
 <1><ceb>: Abbrev Number: 10 (DW_TAG_variable)
    <cec>   DW_AT_name        : (indirect string, offset: 0x891): seccomp_filter_flags
    <cf0>   DW_AT_decl_file   : 18
    <cf1>   DW_AT_decl_line   : 439
    <cf3>   DW_AT_decl_column : 26
    <cf4>   DW_AT_type        : <0xb24>
    <cf8>   DW_AT_external    : 1
    <cf9>   DW_AT_declaration : 1
 <1><cfa>: Abbrev Number: 10 (DW_TAG_variable)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x2d5): seccomp_ret_action
    <cff>   DW_AT_decl_file   : 18
    <d00>   DW_AT_decl_line   : 440
    <d02>   DW_AT_decl_column : 26
    <d03>   DW_AT_type        : <0xb24>
    <d07>   DW_AT_external    : 1
    <d08>   DW_AT_declaration : 1
 <1><d09>: Abbrev Number: 10 (DW_TAG_variable)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x452): setns_types
    <d0e>   DW_AT_decl_file   : 18
    <d0f>   DW_AT_decl_line   : 441
    <d11>   DW_AT_decl_column : 26
    <d12>   DW_AT_type        : <0xb24>
    <d16>   DW_AT_external    : 1
    <d17>   DW_AT_declaration : 1
 <1><d18>: Abbrev Number: 10 (DW_TAG_variable)
    <d19>   DW_AT_name        : (indirect string, offset: 0xea7): sg_io_info
    <d1d>   DW_AT_decl_file   : 18
    <d1e>   DW_AT_decl_line   : 442
    <d20>   DW_AT_decl_column : 26
    <d21>   DW_AT_type        : <0xb24>
    <d25>   DW_AT_external    : 1
    <d26>   DW_AT_declaration : 1
 <1><d27>: Abbrev Number: 10 (DW_TAG_variable)
    <d28>   DW_AT_name        : (indirect string, offset: 0xc02): socketlayers
    <d2c>   DW_AT_decl_file   : 18
    <d2d>   DW_AT_decl_line   : 443
    <d2f>   DW_AT_decl_column : 26
    <d30>   DW_AT_type        : <0xb24>
    <d34>   DW_AT_external    : 1
    <d35>   DW_AT_declaration : 1
 <1><d36>: Abbrev Number: 10 (DW_TAG_variable)
    <d37>   DW_AT_name        : (indirect string, offset: 0xdf9): socktypes
    <d3b>   DW_AT_decl_file   : 18
    <d3c>   DW_AT_decl_line   : 444
    <d3e>   DW_AT_decl_column : 26
    <d3f>   DW_AT_type        : <0xb24>
    <d43>   DW_AT_external    : 1
    <d44>   DW_AT_declaration : 1
 <1><d45>: Abbrev Number: 10 (DW_TAG_variable)
    <d46>   DW_AT_name        : (indirect string, offset: 0xac6): tcp_state_flags
    <d4a>   DW_AT_decl_file   : 18
    <d4b>   DW_AT_decl_line   : 445
    <d4d>   DW_AT_decl_column : 26
    <d4e>   DW_AT_type        : <0xb24>
    <d52>   DW_AT_external    : 1
    <d53>   DW_AT_declaration : 1
 <1><d54>: Abbrev Number: 10 (DW_TAG_variable)
    <d55>   DW_AT_name        : (indirect string, offset: 0x7a5): tcp_states
    <d59>   DW_AT_decl_file   : 18
    <d5a>   DW_AT_decl_line   : 446
    <d5c>   DW_AT_decl_column : 26
    <d5d>   DW_AT_type        : <0xb24>
    <d61>   DW_AT_external    : 1
    <d62>   DW_AT_declaration : 1
 <1><d63>: Abbrev Number: 10 (DW_TAG_variable)
    <d64>   DW_AT_name        : (indirect string, offset: 0x1107): whence_codes
    <d68>   DW_AT_decl_file   : 18
    <d69>   DW_AT_decl_line   : 447
    <d6b>   DW_AT_decl_column : 26
    <d6c>   DW_AT_type        : <0xb24>
    <d70>   DW_AT_external    : 1
    <d71>   DW_AT_declaration : 1
 <1><d72>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d73>   DW_AT_encoding    : 7	(unsigned)
    <d74>   DW_AT_byte_size   : 4
    <d75>   DW_AT_type        : <0x2b>
    <d79>   DW_AT_decl_file   : 18
    <d7a>   DW_AT_decl_line   : 508
    <d7c>   DW_AT_decl_column : 14
    <d7d>   DW_AT_sibling     : <0xd94>
 <2><d81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d82>   DW_AT_name        : (indirect string, offset: 0x9fa): CFLAG_NONE
    <d86>   DW_AT_const_value : 0
 <2><d87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d88>   DW_AT_name        : (indirect string, offset: 0x92a): CFLAG_ONLY_STATS
    <d8c>   DW_AT_const_value : 1
 <2><d8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xc0f): CFLAG_BOTH
    <d92>   DW_AT_const_value : 2
 <2><d93>: Abbrev Number: 0
 <1><d94>: Abbrev Number: 28 (DW_TAG_typedef)
    <d95>   DW_AT_name        : (indirect string, offset: 0x11a9): cflag_t
    <d99>   DW_AT_decl_file   : 18
    <d9a>   DW_AT_decl_line   : 512
    <d9c>   DW_AT_decl_column : 3
    <d9d>   DW_AT_type        : <0xd72>
 <1><da1>: Abbrev Number: 10 (DW_TAG_variable)
    <da2>   DW_AT_name        : (indirect string, offset: 0xd44): cflag
    <da6>   DW_AT_decl_file   : 18
    <da7>   DW_AT_decl_line   : 513
    <da9>   DW_AT_decl_column : 16
    <daa>   DW_AT_type        : <0xd94>
    <dae>   DW_AT_external    : 1
    <daf>   DW_AT_declaration : 1
 <1><db0>: Abbrev Number: 10 (DW_TAG_variable)
    <db1>   DW_AT_name        : (indirect string, offset: 0x180): Tflag
    <db5>   DW_AT_decl_file   : 18
    <db6>   DW_AT_decl_line   : 514
    <db8>   DW_AT_decl_column : 13
    <db9>   DW_AT_type        : <0x521>
    <dbd>   DW_AT_external    : 1
    <dbe>   DW_AT_declaration : 1
 <1><dbf>: Abbrev Number: 10 (DW_TAG_variable)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x7fb): Tflag_scale
    <dc4>   DW_AT_decl_file   : 18
    <dc5>   DW_AT_decl_line   : 515
    <dc7>   DW_AT_decl_column : 12
    <dc8>   DW_AT_type        : <0x64>
    <dcc>   DW_AT_external    : 1
    <dcd>   DW_AT_declaration : 1
 <1><dce>: Abbrev Number: 10 (DW_TAG_variable)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x8a6): Tflag_width
    <dd3>   DW_AT_decl_file   : 18
    <dd4>   DW_AT_decl_line   : 516
    <dd6>   DW_AT_decl_column : 12
    <dd7>   DW_AT_type        : <0x64>
    <ddb>   DW_AT_external    : 1
    <ddc>   DW_AT_declaration : 1
 <1><ddd>: Abbrev Number: 10 (DW_TAG_variable)
    <dde>   DW_AT_name        : (indirect string, offset: 0xe99): iflag
    <de2>   DW_AT_decl_file   : 18
    <de3>   DW_AT_decl_line   : 517
    <de5>   DW_AT_decl_column : 13
    <de6>   DW_AT_type        : <0x521>
    <dea>   DW_AT_external    : 1
    <deb>   DW_AT_declaration : 1
 <1><dec>: Abbrev Number: 10 (DW_TAG_variable)
    <ded>   DW_AT_name        : (indirect string, offset: 0x5ce): count_wallclock
    <df1>   DW_AT_decl_file   : 18
    <df2>   DW_AT_decl_line   : 518
    <df4>   DW_AT_decl_column : 13
    <df5>   DW_AT_type        : <0x521>
    <df9>   DW_AT_external    : 1
    <dfa>   DW_AT_declaration : 1
 <1><dfb>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x4a): path_set_item
    <e00>   DW_AT_byte_size   : 4
    <e01>   DW_AT_decl_file   : 18
    <e02>   DW_AT_decl_line   : 520
    <e04>   DW_AT_decl_column : 8
    <e05>   DW_AT_sibling     : <0xe1a>
 <2><e09>: Abbrev Number: 22 (DW_TAG_member)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xc3): path
    <e0e>   DW_AT_decl_file   : 18
    <e0f>   DW_AT_decl_line   : 521
    <e11>   DW_AT_decl_column : 14
    <e12>   DW_AT_type        : <0x1d5>
    <e16>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e19>: Abbrev Number: 0
 <1><e1a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x7b0): path_set
    <e1f>   DW_AT_byte_size   : 12
    <e20>   DW_AT_decl_file   : 18
    <e21>   DW_AT_decl_line   : 525
    <e23>   DW_AT_decl_column : 15
    <e24>   DW_AT_sibling     : <0xe59>
 <2><e28>: Abbrev Number: 22 (DW_TAG_member)
    <e29>   DW_AT_name        : (indirect string, offset: 0x73e): paths_selected
    <e2d>   DW_AT_decl_file   : 18
    <e2e>   DW_AT_decl_line   : 526
    <e30>   DW_AT_decl_column : 24
    <e31>   DW_AT_type        : <0xe59>
    <e35>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e38>: Abbrev Number: 22 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0x10fa): num_selected
    <e3d>   DW_AT_decl_file   : 18
    <e3e>   DW_AT_decl_line   : 527
    <e40>   DW_AT_decl_column : 9
    <e41>   DW_AT_type        : <0x12e>
    <e45>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e48>: Abbrev Number: 22 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0xbb3): size
    <e4d>   DW_AT_decl_file   : 18
    <e4e>   DW_AT_decl_line   : 528
    <e50>   DW_AT_decl_column : 9
    <e51>   DW_AT_type        : <0x12e>
    <e55>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e58>: Abbrev Number: 0
 <1><e59>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e5a>   DW_AT_byte_size   : 4
    <e5b>   DW_AT_type        : <0xdfb>
 <1><e5f>: Abbrev Number: 10 (DW_TAG_variable)
    <e60>   DW_AT_name        : (indirect string, offset: 0x1149): global_path_set
    <e64>   DW_AT_decl_file   : 18
    <e65>   DW_AT_decl_line   : 529
    <e67>   DW_AT_decl_column : 3
    <e68>   DW_AT_type        : <0xe1a>
    <e6c>   DW_AT_external    : 1
    <e6d>   DW_AT_declaration : 1
 <1><e6e>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x102b): xflag_opts
    <e73>   DW_AT_encoding    : 7	(unsigned)
    <e74>   DW_AT_byte_size   : 4
    <e75>   DW_AT_type        : <0x2b>
    <e79>   DW_AT_decl_file   : 18
    <e7a>   DW_AT_decl_line   : 531
    <e7c>   DW_AT_decl_column : 6
    <e7d>   DW_AT_sibling     : <0xea0>
 <2><e81>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e82>   DW_AT_name        : (indirect string, offset: 0xa7d): HEXSTR_NONE
    <e86>   DW_AT_const_value : 0
 <2><e87>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e88>   DW_AT_name        : (indirect string, offset: 0x107b): HEXSTR_NON_ASCII
    <e8c>   DW_AT_const_value : 1
 <2><e8d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x972): HEXSTR_ALL
    <e92>   DW_AT_const_value : 2
 <2><e93>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0x6bf): HEXSTR_NON_ASCII_CHARS
    <e98>   DW_AT_const_value : 3
 <2><e99>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x1114): NUM_HEXSTR_OPTS
    <e9e>   DW_AT_const_value : 4
 <2><e9f>: Abbrev Number: 0
 <1><ea0>: Abbrev Number: 10 (DW_TAG_variable)
    <ea1>   DW_AT_name        : (indirect string, offset: 0xe73): xflag
    <ea5>   DW_AT_decl_file   : 18
    <ea6>   DW_AT_decl_line   : 544
    <ea8>   DW_AT_decl_column : 17
    <ea9>   DW_AT_type        : <0x2b>
    <ead>   DW_AT_external    : 1
    <eae>   DW_AT_declaration : 1
 <1><eaf>: Abbrev Number: 10 (DW_TAG_variable)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xcff): followfork
    <eb4>   DW_AT_decl_file   : 18
    <eb5>   DW_AT_decl_line   : 545
    <eb7>   DW_AT_decl_column : 13
    <eb8>   DW_AT_type        : <0x521>
    <ebc>   DW_AT_external    : 1
    <ebd>   DW_AT_declaration : 1
 <1><ebe>: Abbrev Number: 10 (DW_TAG_variable)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x32d): output_separately
    <ec3>   DW_AT_decl_file   : 18
    <ec4>   DW_AT_decl_line   : 546
    <ec6>   DW_AT_decl_column : 13
    <ec7>   DW_AT_type        : <0x521>
    <ecb>   DW_AT_external    : 1
    <ecc>   DW_AT_declaration : 1
 <1><ecd>: Abbrev Number: 10 (DW_TAG_variable)
    <ece>   DW_AT_name        : (indirect string, offset: 0x233): stack_trace_enabled
    <ed2>   DW_AT_decl_file   : 18
    <ed3>   DW_AT_decl_line   : 549
    <ed5>   DW_AT_decl_column : 13
    <ed6>   DW_AT_type        : <0x521>
    <eda>   DW_AT_external    : 1
    <edb>   DW_AT_declaration : 1
 <1><edc>: Abbrev Number: 10 (DW_TAG_variable)
    <edd>   DW_AT_name        : (indirect string, offset: 0x6ad): ptrace_setoptions
    <ee1>   DW_AT_decl_file   : 18
    <ee2>   DW_AT_decl_line   : 553
    <ee4>   DW_AT_decl_column : 17
    <ee5>   DW_AT_type        : <0x2b>
    <ee9>   DW_AT_external    : 1
    <eea>   DW_AT_declaration : 1
 <1><eeb>: Abbrev Number: 10 (DW_TAG_variable)
    <eec>   DW_AT_name        : (indirect string, offset: 0xa72): max_strlen
    <ef0>   DW_AT_decl_file   : 18
    <ef1>   DW_AT_decl_line   : 554
    <ef3>   DW_AT_decl_column : 17
    <ef4>   DW_AT_type        : <0x2b>
    <ef8>   DW_AT_external    : 1
    <ef9>   DW_AT_declaration : 1
 <1><efa>: Abbrev Number: 10 (DW_TAG_variable)
    <efb>   DW_AT_name        : (indirect string, offset: 0xaa0): os_release
    <eff>   DW_AT_decl_file   : 18
    <f00>   DW_AT_decl_line   : 555
    <f02>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0x2b>
    <f07>   DW_AT_external    : 1
    <f08>   DW_AT_declaration : 1
 <1><f09>: Abbrev Number: 10 (DW_TAG_variable)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x74d): xlat_verbosity
    <f0e>   DW_AT_decl_file   : 18
    <f0f>   DW_AT_decl_line   : 917
    <f11>   DW_AT_decl_column : 24
    <f12>   DW_AT_type        : <0xa47>
    <f16>   DW_AT_external    : 1
    <f17>   DW_AT_declaration : 1
 <1><f18>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f19>   DW_AT_name        : (indirect string, offset: 0x5b1): xlat_style_private_flag_bits
    <f1d>   DW_AT_encoding    : 7	(unsigned)
    <f1e>   DW_AT_byte_size   : 4
    <f1f>   DW_AT_type        : <0x2b>
    <f23>   DW_AT_decl_file   : 18
    <f24>   DW_AT_decl_line   : 937
    <f26>   DW_AT_decl_column : 6
    <f27>   DW_AT_sibling     : <0xf44>
 <2><f2b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x2a2): PAF_PRINT_INDICES_BIT
    <f30>   DW_AT_const_value : 5
 <2><f31>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f32>   DW_AT_name        : (indirect string, offset: 0xb6a): PAF_ARRAY_TRUNCATED_BIT
    <f36>   DW_AT_const_value : 6
 <2><f37>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0x412): PXF_DEFAULT_STR_BIT
    <f3c>   DW_AT_const_value : 7
 <2><f3d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0xce1): SPFF_AUXSTR_MODE_BIT
    <f42>   DW_AT_const_value : 8
 <2><f43>: Abbrev Number: 0
 <1><f44>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f45>   DW_AT_name        : (indirect string, offset: 0xd98): find_xlat_flag_bits
    <f49>   DW_AT_encoding    : 7	(unsigned)
    <f4a>   DW_AT_byte_size   : 4
    <f4b>   DW_AT_type        : <0x2b>
    <f4f>   DW_AT_decl_file   : 18
    <f50>   DW_AT_decl_line   : 1441
    <f52>   DW_AT_decl_column : 6
    <f53>   DW_AT_sibling     : <0xf5e>
 <2><f57>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f58>   DW_AT_name        : (indirect string, offset: 0x9af): FXL_CASE_SENSITIVE_BIT
    <f5c>   DW_AT_const_value : 0
 <2><f5d>: Abbrev Number: 0
 <1><f5e>: Abbrev Number: 10 (DW_TAG_variable)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xa4e): printing_tcp
    <f63>   DW_AT_decl_file   : 18
    <f64>   DW_AT_decl_line   : 1687
    <f66>   DW_AT_decl_column : 20
    <f67>   DW_AT_type        : <0x5fd>
    <f6b>   DW_AT_external    : 1
    <f6c>   DW_AT_declaration : 1
 <1><f6d>: Abbrev Number: 10 (DW_TAG_variable)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x579): errnoent
    <f72>   DW_AT_decl_file   : 18
    <f73>   DW_AT_decl_line   : 1885
    <f75>   DW_AT_decl_column : 26
    <f76>   DW_AT_type        : <0x455>
    <f7a>   DW_AT_external    : 1
    <f7b>   DW_AT_declaration : 1
 <1><f7c>: Abbrev Number: 10 (DW_TAG_variable)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x8b2): signalent
    <f81>   DW_AT_decl_file   : 18
    <f82>   DW_AT_decl_line   : 1886
    <f84>   DW_AT_decl_column : 26
    <f85>   DW_AT_type        : <0x455>
    <f89>   DW_AT_external    : 1
    <f8a>   DW_AT_declaration : 1
 <1><f8b>: Abbrev Number: 10 (DW_TAG_variable)
    <f8c>   DW_AT_name        : (indirect string, offset: 0xee1): nerrnos
    <f90>   DW_AT_decl_file   : 18
    <f91>   DW_AT_decl_line   : 1887
    <f93>   DW_AT_decl_column : 27
    <f94>   DW_AT_type        : <0x32>
    <f98>   DW_AT_external    : 1
    <f99>   DW_AT_declaration : 1
 <1><f9a>: Abbrev Number: 10 (DW_TAG_variable)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x10e3): nsignals
    <f9f>   DW_AT_decl_file   : 18
    <fa0>   DW_AT_decl_line   : 1888
    <fa2>   DW_AT_decl_column : 27
    <fa3>   DW_AT_type        : <0x32>
    <fa7>   DW_AT_external    : 1
    <fa8>   DW_AT_declaration : 1
 <1><fa9>: Abbrev Number: 15 (DW_TAG_array_type)
    <faa>   DW_AT_type        : <0x866>
    <fae>   DW_AT_sibling     : <0xfb4>
 <2><fb2>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb3>: Abbrev Number: 0
 <1><fb4>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb5>   DW_AT_type        : <0xfa9>
 <1><fb9>: Abbrev Number: 10 (DW_TAG_variable)
    <fba>   DW_AT_name        : (indirect string, offset: 0xd63): sysent0
    <fbe>   DW_AT_decl_file   : 18
    <fbf>   DW_AT_decl_line   : 1890
    <fc1>   DW_AT_decl_column : 28
    <fc2>   DW_AT_type        : <0xfb4>
    <fc6>   DW_AT_external    : 1
    <fc7>   DW_AT_declaration : 1
 <1><fc8>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc9>   DW_AT_type        : <0x8cd>
    <fcd>   DW_AT_sibling     : <0xfd3>
 <2><fd1>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd2>: Abbrev Number: 0
 <1><fd3>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd4>   DW_AT_type        : <0xfc8>
 <1><fd8>: Abbrev Number: 10 (DW_TAG_variable)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x113f): ioctlent0
    <fdd>   DW_AT_decl_file   : 18
    <fde>   DW_AT_decl_line   : 1891
    <fe0>   DW_AT_decl_column : 30
    <fe1>   DW_AT_type        : <0xfd3>
    <fe5>   DW_AT_external    : 1
    <fe6>   DW_AT_declaration : 1
 <1><fe7>: Abbrev Number: 10 (DW_TAG_variable)
    <fe8>   DW_AT_name        : (indirect string, offset: 0x1036): personality_names
    <fec>   DW_AT_decl_file   : 18
    <fed>   DW_AT_decl_line   : 1893
    <fef>   DW_AT_decl_column : 26
    <ff0>   DW_AT_type        : <0x455>
    <ff4>   DW_AT_external    : 1
    <ff5>   DW_AT_declaration : 1
 <1><ff6>: Abbrev Number: 10 (DW_TAG_variable)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x8d2): sysent
    <ffb>   DW_AT_decl_file   : 18
    <ffc>   DW_AT_decl_line   : 1896
    <ffe>   DW_AT_decl_column : 29
    <fff>   DW_AT_type        : <0x9b2>
    <1003>   DW_AT_external    : 1
    <1004>   DW_AT_declaration : 1
 <1><1005>: Abbrev Number: 10 (DW_TAG_variable)
    <1006>   DW_AT_name        : (indirect string, offset: 0xcf6): ioctlent
    <100a>   DW_AT_decl_file   : 18
    <100b>   DW_AT_decl_line   : 1897
    <100d>   DW_AT_decl_column : 31
    <100e>   DW_AT_type        : <0x1014>
    <1012>   DW_AT_external    : 1
    <1013>   DW_AT_declaration : 1
 <1><1014>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1015>   DW_AT_byte_size   : 4
    <1016>   DW_AT_type        : <0x8cd>
 <1><101a>: Abbrev Number: 10 (DW_TAG_variable)
    <101b>   DW_AT_name        : (indirect string, offset: 0x8bc): nsyscalls
    <101f>   DW_AT_decl_file   : 18
    <1020>   DW_AT_decl_line   : 1903
    <1022>   DW_AT_decl_column : 17
    <1023>   DW_AT_type        : <0x2b>
    <1027>   DW_AT_external    : 1
    <1028>   DW_AT_declaration : 1
 <1><1029>: Abbrev Number: 10 (DW_TAG_variable)
    <102a>   DW_AT_name        : (indirect string, offset: 0xefb): nioctlents
    <102e>   DW_AT_decl_file   : 18
    <102f>   DW_AT_decl_line   : 1904
    <1031>   DW_AT_decl_column : 17
    <1032>   DW_AT_type        : <0x2b>
    <1036>   DW_AT_external    : 1
    <1037>   DW_AT_declaration : 1
 <1><1038>: Abbrev Number: 15 (DW_TAG_array_type)
    <1039>   DW_AT_type        : <0x32>
    <103d>   DW_AT_sibling     : <0x1048>
 <2><1041>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1042>   DW_AT_type        : <0x2b>
    <1046>   DW_AT_upper_bound : 2
 <2><1047>: Abbrev Number: 0
 <1><1048>: Abbrev Number: 3 (DW_TAG_const_type)
    <1049>   DW_AT_type        : <0x1038>
 <1><104d>: Abbrev Number: 10 (DW_TAG_variable)
    <104e>   DW_AT_name        : (indirect string, offset: 0xf79): nsyscall_vec
    <1052>   DW_AT_decl_file   : 18
    <1053>   DW_AT_decl_line   : 1906
    <1055>   DW_AT_decl_column : 27
    <1056>   DW_AT_type        : <0x1048>
    <105a>   DW_AT_external    : 1
    <105b>   DW_AT_declaration : 1
 <1><105c>: Abbrev Number: 15 (DW_TAG_array_type)
    <105d>   DW_AT_type        : <0x9b8>
    <1061>   DW_AT_sibling     : <0x106c>
 <2><1065>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1066>   DW_AT_type        : <0x2b>
    <106a>   DW_AT_upper_bound : 2
 <2><106b>: Abbrev Number: 0
 <1><106c>: Abbrev Number: 3 (DW_TAG_const_type)
    <106d>   DW_AT_type        : <0x105c>
 <1><1071>: Abbrev Number: 10 (DW_TAG_variable)
    <1072>   DW_AT_name        : (indirect string, offset: 0x7e8): sysent_vec
    <1076>   DW_AT_decl_file   : 18
    <1077>   DW_AT_decl_line   : 1907
    <1079>   DW_AT_decl_column : 35
    <107a>   DW_AT_type        : <0x106c>
    <107e>   DW_AT_external    : 1
    <107f>   DW_AT_declaration : 1
 <1><1080>: Abbrev Number: 10 (DW_TAG_variable)
    <1081>   DW_AT_name        : (indirect string, offset: 0x394): inject_vec
    <1085>   DW_AT_decl_file   : 18
    <1086>   DW_AT_decl_line   : 1908
    <1088>   DW_AT_decl_column : 28
    <1089>   DW_AT_type        : <0x9bd>
    <108d>   DW_AT_external    : 1
    <108e>   DW_AT_declaration : 1
 <1><108f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1090>   DW_AT_name        : (indirect string, offset: 0xdec): audit_arch_t
    <1094>   DW_AT_byte_size   : 8
    <1095>   DW_AT_decl_file   : 18
    <1096>   DW_AT_decl_line   : 1910
    <1098>   DW_AT_decl_column : 8
    <1099>   DW_AT_sibling     : <0x10be>
 <2><109d>: Abbrev Number: 22 (DW_TAG_member)
    <109e>   DW_AT_name        : (indirect string, offset: 0x5a3): arch
    <10a2>   DW_AT_decl_file   : 18
    <10a3>   DW_AT_decl_line   : 1911
    <10a5>   DW_AT_decl_column : 15
    <10a6>   DW_AT_type        : <0x2b>
    <10aa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ad>: Abbrev Number: 22 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0xa34): flag
    <10b2>   DW_AT_decl_file   : 18
    <10b3>   DW_AT_decl_line   : 1912
    <10b5>   DW_AT_decl_column : 15
    <10b6>   DW_AT_type        : <0x2b>
    <10ba>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10bd>: Abbrev Number: 0
 <1><10be>: Abbrev Number: 3 (DW_TAG_const_type)
    <10bf>   DW_AT_type        : <0x108f>
 <1><10c3>: Abbrev Number: 15 (DW_TAG_array_type)
    <10c4>   DW_AT_type        : <0x10be>
    <10c8>   DW_AT_sibling     : <0x10d3>
 <2><10cc>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10cd>   DW_AT_type        : <0x2b>
    <10d1>   DW_AT_upper_bound : 2
 <2><10d2>: Abbrev Number: 0
 <1><10d3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d4>   DW_AT_type        : <0x10c3>
 <1><10d8>: Abbrev Number: 10 (DW_TAG_variable)
    <10d9>   DW_AT_name        : (indirect string, offset: 0x9a0): audit_arch_vec
    <10dd>   DW_AT_decl_file   : 18
    <10de>   DW_AT_decl_line   : 1915
    <10e0>   DW_AT_decl_column : 34
    <10e1>   DW_AT_type        : <0x10d3>
    <10e5>   DW_AT_external    : 1
    <10e6>   DW_AT_declaration : 1
 <1><10e7>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e8>   DW_AT_byte_size   : 180
    <10e9>   DW_AT_decl_file   : 20
    <10ea>   DW_AT_decl_line   : 2
    <10eb>   DW_AT_decl_column : 9
    <10ec>   DW_AT_sibling     : <0x13a1>
 <2><10f0>: Abbrev Number: 9 (DW_TAG_member)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x1e4): block_ioctl
    <10f5>   DW_AT_decl_file   : 20
    <10f6>   DW_AT_decl_line   : 3
    <10f7>   DW_AT_decl_column : 8
    <10f8>   DW_AT_type        : <0x13bb>
    <10fc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ff>: Abbrev Number: 9 (DW_TAG_member)
    <1100>   DW_AT_name        : (indirect string, offset: 0xb09): btrfs_ioctl
    <1104>   DW_AT_decl_file   : 20
    <1105>   DW_AT_decl_line   : 6
    <1106>   DW_AT_decl_column : 8
    <1107>   DW_AT_type        : <0x13bb>
    <110b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><110e>: Abbrev Number: 9 (DW_TAG_member)
    <110f>   DW_AT_name        : (indirect string, offset: 0x786): evdev_write_ioctl_mpers
    <1113>   DW_AT_decl_file   : 20
    <1114>   DW_AT_decl_line   : 9
    <1115>   DW_AT_decl_column : 8
    <1116>   DW_AT_type        : <0x13bb>
    <111a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><111d>: Abbrev Number: 9 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0x75c): get_sock_fprog_size
    <1122>   DW_AT_decl_file   : 20
    <1123>   DW_AT_decl_line   : 12
    <1124>   DW_AT_decl_column : 17
    <1125>   DW_AT_type        : <0x13c7>
    <1129>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><112c>: Abbrev Number: 9 (DW_TAG_member)
    <112d>   DW_AT_name        : (indirect string, offset: 0x1b3): fetch_bpf_fprog
    <1131>   DW_AT_decl_file   : 20
    <1132>   DW_AT_decl_line   : 15
    <1133>   DW_AT_decl_column : 10
    <1134>   DW_AT_type        : <0x13e7>
    <1138>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><113b>: Abbrev Number: 9 (DW_TAG_member)
    <113c>   DW_AT_name        : (indirect string, offset: 0x98d): fetch_struct_flock
    <1140>   DW_AT_decl_file   : 20
    <1141>   DW_AT_decl_line   : 18
    <1142>   DW_AT_decl_column : 10
    <1143>   DW_AT_type        : <0x13e7>
    <1147>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><114a>: Abbrev Number: 9 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0xd0a): fetch_struct_flock64
    <114f>   DW_AT_decl_file   : 20
    <1150>   DW_AT_decl_line   : 21
    <1151>   DW_AT_decl_column : 10
    <1152>   DW_AT_type        : <0x13e7>
