Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x173b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5c5): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x6e9): mpers-m32/struct_loop_info.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa53): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b6): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1025): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x9b3): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x359): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x255): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xe11): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x48e): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8aa): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xef4): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8da): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x7aa): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb92): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xbc8): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2d5): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd24): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc91): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x402): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x457): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x365): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xbb3): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf9c): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xe21): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb31): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x1103): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe47): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xe6>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 3
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xaf3): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfd7): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x278): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xe0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3ae): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x1006): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xe0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x77d): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc80): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xb6e): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xed>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x36d): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 9 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xa2f): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 9 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4dd): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xe0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 9 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf49): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xe0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 9 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7f1): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xe0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 9 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xe0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 9 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x105e): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xe0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 9 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x92b): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xe0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 9 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x99c): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xe0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 9 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xdbc): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xe0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 9 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xe0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 9 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xce3): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xe0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 9 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xe0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 9 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x571): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 9 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x212): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 9 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xfc2): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 9 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x7dd): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 9 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x856): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 9 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x240): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 9 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe6d): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 9 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xcf3): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 9 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 9 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x715): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 9 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa85): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 9 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfea): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 9 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3d2): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 9 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc56): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xcd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 9 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x9f1): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x122>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 9 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x25f): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 9 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x80b): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xb13): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x483): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x317): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 10 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xe6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x381): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 10 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xe6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x53c): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x1038): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xe0a): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x24c): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 10 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x54b): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x265): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe7c): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6d1): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xe0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbf3): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xe0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 10 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xe0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1bc): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xedb): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x376): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x9ea): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x10b9): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4c8): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf70): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9fd): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x414): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0x69d): __kernel_old_dev_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 21
    <538>   DW_AT_decl_column : 24
    <539>   DW_AT_type        : <0x24>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0xac9): __kernel_long_t
    <542>   DW_AT_decl_file   : 15
    <543>   DW_AT_decl_line   : 15
    <544>   DW_AT_decl_column : 15
    <545>   DW_AT_type        : <0xae>
 <1><549>: Abbrev Number: 4 (DW_TAG_typedef)
    <54a>   DW_AT_name        : (indirect string, offset: 0x52b): __kernel_ulong_t
    <54e>   DW_AT_decl_file   : 15
    <54f>   DW_AT_decl_line   : 16
    <550>   DW_AT_decl_column : 23
    <551>   DW_AT_type        : <0x37>
 <1><555>: Abbrev Number: 4 (DW_TAG_typedef)
    <556>   DW_AT_name        : (indirect string, offset: 0x3e0): kernel_long_t
    <55a>   DW_AT_decl_file   : 16
    <55b>   DW_AT_decl_line   : 16
    <55c>   DW_AT_decl_column : 25
    <55d>   DW_AT_type        : <0x53d>
 <1><561>: Abbrev Number: 4 (DW_TAG_typedef)
    <562>   DW_AT_name        : (indirect string, offset: 0x8cb): kernel_ulong_t
    <566>   DW_AT_decl_file   : 16
    <567>   DW_AT_decl_line   : 17
    <568>   DW_AT_decl_column : 26
    <569>   DW_AT_type        : <0x549>
 <1><56d>: Abbrev Number: 3 (DW_TAG_const_type)
    <56e>   DW_AT_type        : <0x561>
 <1><572>: Abbrev Number: 8 (DW_TAG_structure_type)
    <573>   DW_AT_name        : (indirect string, offset: 0xc11): list_item
    <577>   DW_AT_byte_size   : 8
    <578>   DW_AT_decl_file   : 17
    <579>   DW_AT_decl_line   : 92
    <57a>   DW_AT_decl_column : 8
    <57b>   DW_AT_sibling     : <0x59e>
 <2><57f>: Abbrev Number: 9 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0x10fe): prev
    <584>   DW_AT_decl_file   : 17
    <585>   DW_AT_decl_line   : 93
    <586>   DW_AT_decl_column : 20
    <587>   DW_AT_type        : <0x59e>
    <58b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58e>: Abbrev Number: 9 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x10f4): next
    <593>   DW_AT_decl_file   : 17
    <594>   DW_AT_decl_line   : 94
    <595>   DW_AT_decl_column : 20
    <596>   DW_AT_type        : <0x59e>
    <59a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><59d>: Abbrev Number: 0
 <1><59e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59f>   DW_AT_byte_size   : 4
    <5a0>   DW_AT_type        : <0x572>
 <1><5a4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x8a3): sysent
    <5a9>   DW_AT_byte_size   : 20
    <5aa>   DW_AT_decl_file   : 18
    <5ab>   DW_AT_decl_line   : 13
    <5ac>   DW_AT_decl_column : 16
    <5ad>   DW_AT_sibling     : <0x5fd>
 <2><5b1>: Abbrev Number: 9 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x104f): nargs
    <5b6>   DW_AT_decl_file   : 18
    <5b7>   DW_AT_decl_line   : 14
    <5b8>   DW_AT_decl_column : 11
    <5b9>   DW_AT_type        : <0x2b>
    <5bd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5c0>: Abbrev Number: 9 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x9a9): sys_flags
    <5c5>   DW_AT_decl_file   : 18
    <5c6>   DW_AT_decl_line   : 15
    <5c7>   DW_AT_decl_column : 6
    <5c8>   DW_AT_type        : <0x64>
    <5cc>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cf>: Abbrev Number: 18 (DW_TAG_member)
    <5d0>   DW_AT_name        : sen
    <5d4>   DW_AT_decl_file   : 18
    <5d5>   DW_AT_decl_line   : 16
    <5d6>   DW_AT_decl_column : 6
    <5d7>   DW_AT_type        : <0x64>
    <5db>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5de>: Abbrev Number: 9 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x30e): sys_func
    <5e3>   DW_AT_decl_file   : 18
    <5e4>   DW_AT_decl_line   : 17
    <5e5>   DW_AT_decl_column : 8
    <5e6>   DW_AT_type        : <0x875>
    <5ea>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5ed>: Abbrev Number: 9 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x26f): sys_name
    <5f2>   DW_AT_decl_file   : 18
    <5f3>   DW_AT_decl_line   : 18
    <5f4>   DW_AT_decl_column : 14
    <5f5>   DW_AT_type        : <0x1d9>
    <5f9>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5fc>: Abbrev Number: 0
 <1><5fd>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fe>   DW_AT_prototyped  : 1
    <5ff>   DW_AT_type        : <0x64>
    <603>   DW_AT_sibling     : <0x60d>
 <2><607>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <608>   DW_AT_type        : <0x60d>
 <2><60c>: Abbrev Number: 0
 <1><60d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60e>   DW_AT_byte_size   : 4
    <60f>   DW_AT_type        : <0x618>
 <1><613>: Abbrev Number: 3 (DW_TAG_const_type)
    <614>   DW_AT_type        : <0x60d>
 <1><618>: Abbrev Number: 21 (DW_TAG_structure_type)
    <619>   DW_AT_name        : tcb
    <61d>   DW_AT_byte_size   : 220
    <61e>   DW_AT_decl_file   : 19
    <61f>   DW_AT_decl_line   : 262
    <621>   DW_AT_decl_column : 8
    <622>   DW_AT_sibling     : <0x875>
 <2><626>: Abbrev Number: 22 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x4d7): flags
    <62b>   DW_AT_decl_file   : 19
    <62c>   DW_AT_decl_line   : 263
    <62e>   DW_AT_decl_column : 6
    <62f>   DW_AT_type        : <0x64>
    <633>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><636>: Abbrev Number: 23 (DW_TAG_member)
    <637>   DW_AT_name        : pid
    <63b>   DW_AT_decl_file   : 19
    <63c>   DW_AT_decl_line   : 264
    <63e>   DW_AT_decl_column : 6
    <63f>   DW_AT_type        : <0x64>
    <643>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><646>: Abbrev Number: 22 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <64b>   DW_AT_decl_file   : 19
    <64c>   DW_AT_decl_line   : 265
    <64e>   DW_AT_decl_column : 6
    <64f>   DW_AT_type        : <0x64>
    <653>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><656>: Abbrev Number: 22 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0x39a): currpers
    <65b>   DW_AT_decl_file   : 19
    <65c>   DW_AT_decl_line   : 267
    <65e>   DW_AT_decl_column : 15
    <65f>   DW_AT_type        : <0x2b>
    <663>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><666>: Abbrev Number: 22 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xb66): u_error
    <66b>   DW_AT_decl_file   : 19
    <66c>   DW_AT_decl_line   : 269
    <66e>   DW_AT_decl_column : 16
    <66f>   DW_AT_type        : <0x37>
    <673>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><676>: Abbrev Number: 22 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <67b>   DW_AT_decl_file   : 19
    <67c>   DW_AT_decl_line   : 270
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x561>
    <683>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><686>: Abbrev Number: 22 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0xba9): true_scno
    <68b>   DW_AT_decl_file   : 19
    <68c>   DW_AT_decl_line   : 271
    <68e>   DW_AT_decl_column : 17
    <68f>   DW_AT_type        : <0x561>
    <693>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><696>: Abbrev Number: 22 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x1a6): u_arg
    <69b>   DW_AT_decl_file   : 19
    <69c>   DW_AT_decl_line   : 272
    <69e>   DW_AT_decl_column : 17
    <69f>   DW_AT_type        : <0x9a5>
    <6a3>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a6>: Abbrev Number: 22 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x9c0): u_rval
    <6ab>   DW_AT_decl_file   : 19
    <6ac>   DW_AT_decl_line   : 273
    <6ae>   DW_AT_decl_column : 16
    <6af>   DW_AT_type        : <0x555>
    <6b3>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b6>: Abbrev Number: 22 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xae5): sys_func_rval
    <6bb>   DW_AT_decl_file   : 19
    <6bc>   DW_AT_decl_line   : 274
    <6be>   DW_AT_decl_column : 6
    <6bf>   DW_AT_type        : <0x64>
    <6c3>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c6>: Abbrev Number: 22 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xd15): curcol
    <6cb>   DW_AT_decl_file   : 19
    <6cc>   DW_AT_decl_line   : 275
    <6ce>   DW_AT_decl_column : 6
    <6cf>   DW_AT_type        : <0x64>
    <6d3>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d6>: Abbrev Number: 22 (DW_TAG_member)
    <6d7>   DW_AT_name        : (indirect string, offset: 0x9d2): outf
    <6db>   DW_AT_decl_file   : 19
    <6dc>   DW_AT_decl_line   : 276
    <6de>   DW_AT_decl_column : 8
    <6df>   DW_AT_type        : <0x41e>
    <6e3>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e6>: Abbrev Number: 22 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xf1a): staged_output_data
    <6eb>   DW_AT_decl_file   : 19
    <6ec>   DW_AT_decl_line   : 277
    <6ee>   DW_AT_decl_column : 29
    <6ef>   DW_AT_type        : <0x9bb>
    <6f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f6>: Abbrev Number: 22 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xab0): auxstr
    <6fb>   DW_AT_decl_file   : 19
    <6fc>   DW_AT_decl_line   : 279
    <6fe>   DW_AT_decl_column : 14
    <6ff>   DW_AT_type        : <0x1d9>
    <703>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><706>: Abbrev Number: 22 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <70b>   DW_AT_decl_file   : 19
    <70c>   DW_AT_decl_line   : 280
    <70e>   DW_AT_decl_column : 8
    <70f>   DW_AT_type        : <0xcd>
    <713>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><716>: Abbrev Number: 22 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0xc46): _free_priv_data
    <71b>   DW_AT_decl_file   : 19
    <71c>   DW_AT_decl_line   : 281
    <71e>   DW_AT_decl_column : 9
    <71f>   DW_AT_type        : <0x9cd>
    <723>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><726>: Abbrev Number: 22 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0x18c): s_ent
    <72b>   DW_AT_decl_file   : 19
    <72c>   DW_AT_decl_line   : 282
    <72e>   DW_AT_decl_column : 23
    <72f>   DW_AT_type        : <0x9d3>
    <733>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><736>: Abbrev Number: 22 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <73b>   DW_AT_decl_file   : 19
    <73c>   DW_AT_decl_line   : 285
    <73e>   DW_AT_decl_column : 23
    <73f>   DW_AT_type        : <0x9d3>
    <743>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><746>: Abbrev Number: 22 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x38f): inject_vec
    <74b>   DW_AT_decl_file   : 19
    <74c>   DW_AT_decl_line   : 286
    <74e>   DW_AT_decl_column : 22
    <74f>   DW_AT_type        : <0x9de>
    <753>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><756>: Abbrev Number: 22 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x814): stime
    <75b>   DW_AT_decl_file   : 19
    <75c>   DW_AT_decl_line   : 287
    <75e>   DW_AT_decl_column : 18
    <75f>   DW_AT_type        : <0x133>
    <763>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><766>: Abbrev Number: 22 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x3a3): ltime
    <76b>   DW_AT_decl_file   : 19
    <76c>   DW_AT_decl_line   : 288
    <76e>   DW_AT_decl_column : 18
    <76f>   DW_AT_type        : <0x133>
    <773>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><776>: Abbrev Number: 22 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x1016): atime
    <77b>   DW_AT_decl_file   : 19
    <77c>   DW_AT_decl_line   : 289
    <77e>   DW_AT_decl_column : 18
    <77f>   DW_AT_type        : <0x133>
    <783>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><786>: Abbrev Number: 22 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0x4d1): etime
    <78b>   DW_AT_decl_file   : 19
    <78c>   DW_AT_decl_line   : 290
    <78e>   DW_AT_decl_column : 18
    <78f>   DW_AT_type        : <0x133>
    <793>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><797>: Abbrev Number: 22 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0xd79): delay_expiration_time
    <79c>   DW_AT_decl_file   : 19
    <79d>   DW_AT_decl_line   : 291
    <79f>   DW_AT_decl_column : 18
    <7a0>   DW_AT_type        : <0x133>
    <7a4>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a8>: Abbrev Number: 22 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7ad>   DW_AT_decl_file   : 19
    <7ae>   DW_AT_decl_line   : 298
    <7b0>   DW_AT_decl_column : 15
    <7b1>   DW_AT_type        : <0x2b>
    <7b5>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b9>: Abbrev Number: 22 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0xf56): last_dirfd
    <7be>   DW_AT_decl_file   : 19
    <7bf>   DW_AT_decl_line   : 301
    <7c1>   DW_AT_decl_column : 6
    <7c2>   DW_AT_type        : <0x64>
    <7c6>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ca>: Abbrev Number: 22 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xf7c): mmap_cache
    <7cf>   DW_AT_decl_file   : 19
    <7d0>   DW_AT_decl_line   : 304
    <7d2>   DW_AT_decl_column : 23
    <7d3>   DW_AT_type        : <0x9fa>
    <7d7>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7db>: Abbrev Number: 22 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xb7f): wait_data_idx
    <7e0>   DW_AT_decl_file   : 19
    <7e1>   DW_AT_decl_line   : 311
    <7e3>   DW_AT_decl_column : 9
    <7e4>   DW_AT_type        : <0x122>
    <7e8>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7ec>: Abbrev Number: 22 (DW_TAG_member)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xab7): delayed_wait_data
    <7f1>   DW_AT_decl_file   : 19
    <7f2>   DW_AT_decl_line   : 313
    <7f4>   DW_AT_decl_column : 24
    <7f5>   DW_AT_type        : <0xa06>
    <7f9>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7fd>: Abbrev Number: 22 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xb27): wait_list
    <802>   DW_AT_decl_file   : 19
    <803>   DW_AT_decl_line   : 314
    <805>   DW_AT_decl_column : 19
    <806>   DW_AT_type        : <0x572>
    <80a>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x706): vcpu_info_list
    <813>   DW_AT_decl_file   : 19
    <814>   DW_AT_decl_line   : 318
    <816>   DW_AT_decl_column : 20
    <817>   DW_AT_type        : <0xa12>
    <81b>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81f>: Abbrev Number: 22 (DW_TAG_member)
    <820>   DW_AT_name        : (indirect string, offset: 0xcd8): unwind_ctx
    <824>   DW_AT_decl_file   : 19
    <825>   DW_AT_decl_line   : 322
    <827>   DW_AT_decl_column : 8
    <828>   DW_AT_type        : <0xcd>
    <82c>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><830>: Abbrev Number: 22 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x4bb): unwind_queue
    <835>   DW_AT_decl_file   : 19
    <836>   DW_AT_decl_line   : 323
    <838>   DW_AT_decl_column : 25
    <839>   DW_AT_type        : <0xa1e>
    <83d>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><841>: Abbrev Number: 22 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <846>   DW_AT_decl_file   : 19
    <847>   DW_AT_decl_line   : 327
    <849>   DW_AT_decl_column : 7
    <84a>   DW_AT_type        : <0xa24>
    <84e>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><852>: Abbrev Number: 22 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0x222): start_prc
    <857>   DW_AT_decl_file   : 19
    <858>   DW_AT_decl_line   : 329
    <85a>   DW_AT_decl_column : 16
    <85b>   DW_AT_type        : <0x37>
    <85f>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><863>: Abbrev Number: 22 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0xfe1): pre_comm
    <868>   DW_AT_decl_file   : 19
    <869>   DW_AT_decl_line   : 330
    <86b>   DW_AT_decl_column : 7
    <86c>   DW_AT_type        : <0xa24>
    <870>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><874>: Abbrev Number: 0
 <1><875>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <876>   DW_AT_byte_size   : 4
    <877>   DW_AT_type        : <0x5fd>
 <1><87b>: Abbrev Number: 4 (DW_TAG_typedef)
    <87c>   DW_AT_name        : (indirect string, offset: 0x51d): struct_sysent
    <880>   DW_AT_decl_file   : 18
    <881>   DW_AT_decl_line   : 19
    <882>   DW_AT_decl_column : 3
    <883>   DW_AT_type        : <0x5a4>
 <1><887>: Abbrev Number: 3 (DW_TAG_const_type)
    <888>   DW_AT_type        : <0x87b>
 <1><88c>: Abbrev Number: 13 (DW_TAG_variable)
    <88d>   DW_AT_name        : (indirect string, offset: 0xd65): current_personality
    <891>   DW_AT_decl_file   : 19
    <892>   DW_AT_decl_line   : 158
    <893>   DW_AT_decl_column : 17
    <894>   DW_AT_type        : <0x2b>
    <898>   DW_AT_external    : 1
    <899>   DW_AT_declaration : 1
 <1><89a>: Abbrev Number: 13 (DW_TAG_variable)
    <89b>   DW_AT_name        : (indirect string, offset: 0x845): current_wordsize
    <89f>   DW_AT_decl_file   : 19
    <8a0>   DW_AT_decl_line   : 171
    <8a1>   DW_AT_decl_column : 17
    <8a2>   DW_AT_type        : <0x2b>
    <8a6>   DW_AT_external    : 1
    <8a7>   DW_AT_declaration : 1
 <1><8a8>: Abbrev Number: 13 (DW_TAG_variable)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xa8e): current_klongsize
    <8ad>   DW_AT_decl_file   : 19
    <8ae>   DW_AT_decl_line   : 176
    <8af>   DW_AT_decl_column : 17
    <8b0>   DW_AT_type        : <0x2b>
    <8b4>   DW_AT_external    : 1
    <8b5>   DW_AT_declaration : 1
 <1><8b6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xcaf): ioctlent
    <8bb>   DW_AT_byte_size   : 8
    <8bc>   DW_AT_decl_file   : 19
    <8bd>   DW_AT_decl_line   : 217
    <8be>   DW_AT_decl_column : 16
    <8bf>   DW_AT_sibling     : <0x8e2>
 <2><8c3>: Abbrev Number: 9 (DW_TAG_member)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xf42): symbol
    <8c8>   DW_AT_decl_file   : 19
    <8c9>   DW_AT_decl_line   : 218
    <8ca>   DW_AT_decl_column : 14
    <8cb>   DW_AT_type        : <0x1d9>
    <8cf>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8d2>: Abbrev Number: 9 (DW_TAG_member)
    <8d3>   DW_AT_name        : (indirect string, offset: 0xd2e): code
    <8d7>   DW_AT_decl_file   : 19
    <8d8>   DW_AT_decl_line   : 219
    <8d9>   DW_AT_decl_column : 15
    <8da>   DW_AT_type        : <0x2b>
    <8de>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e1>: Abbrev Number: 0
 <1><8e2>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e3>   DW_AT_name        : (indirect string, offset: 0xc70): struct_ioctlent
    <8e7>   DW_AT_decl_file   : 19
    <8e8>   DW_AT_decl_line   : 220
    <8e9>   DW_AT_decl_column : 3
    <8ea>   DW_AT_type        : <0x8b6>
 <1><8ee>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ef>   DW_AT_type        : <0x8e2>
 <1><8f3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x839): inject_data
    <8f8>   DW_AT_byte_size   : 10
    <8f9>   DW_AT_decl_file   : 19
    <8fa>   DW_AT_decl_line   : 241
    <8fb>   DW_AT_decl_column : 8
    <8fc>   DW_AT_sibling     : <0x95b>
 <2><900>: Abbrev Number: 9 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x4d7): flags
    <905>   DW_AT_decl_file   : 19
    <906>   DW_AT_decl_line   : 242
    <907>   DW_AT_decl_column : 10
    <908>   DW_AT_type        : <0xf2>
    <90c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90f>: Abbrev Number: 9 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0x95d): signo
    <914>   DW_AT_decl_file   : 19
    <915>   DW_AT_decl_line   : 243
    <916>   DW_AT_decl_column : 10
    <917>   DW_AT_type        : <0xf2>
    <91b>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><91e>: Abbrev Number: 9 (DW_TAG_member)
    <91f>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <923>   DW_AT_decl_file   : 19
    <924>   DW_AT_decl_line   : 244
    <925>   DW_AT_decl_column : 11
    <926>   DW_AT_type        : <0xfe>
    <92a>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><92d>: Abbrev Number: 9 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0xd03): delay_idx
    <932>   DW_AT_decl_file   : 19
    <933>   DW_AT_decl_line   : 245
    <934>   DW_AT_decl_column : 11
    <935>   DW_AT_type        : <0xfe>
    <939>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><93c>: Abbrev Number: 9 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0x563): poke_idx
    <941>   DW_AT_decl_file   : 19
    <942>   DW_AT_decl_line   : 246
    <943>   DW_AT_decl_column : 11
    <944>   DW_AT_type        : <0xfe>
    <948>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><94b>: Abbrev Number: 9 (DW_TAG_member)
    <94c>   DW_AT_name        : (indirect string, offset: 0x19c): scno
    <950>   DW_AT_decl_file   : 19
    <951>   DW_AT_decl_line   : 247
    <952>   DW_AT_decl_column : 11
    <953>   DW_AT_type        : <0xfe>
    <957>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><95a>: Abbrev Number: 0
 <1><95b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <95c>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <960>   DW_AT_byte_size   : 16
    <961>   DW_AT_decl_file   : 19
    <962>   DW_AT_decl_line   : 250
    <963>   DW_AT_decl_column : 8
    <964>   DW_AT_sibling     : <0x9a5>
 <2><968>: Abbrev Number: 9 (DW_TAG_member)
    <969>   DW_AT_name        : (indirect string, offset: 0xa4d): first
    <96d>   DW_AT_decl_file   : 19
    <96e>   DW_AT_decl_line   : 251
    <96f>   DW_AT_decl_column : 11
    <970>   DW_AT_type        : <0xfe>
    <974>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><977>: Abbrev Number: 9 (DW_TAG_member)
    <978>   DW_AT_name        : (indirect string, offset: 0x1127): last
    <97c>   DW_AT_decl_file   : 19
    <97d>   DW_AT_decl_line   : 252
    <97e>   DW_AT_decl_column : 11
    <97f>   DW_AT_type        : <0xfe>
    <983>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><986>: Abbrev Number: 9 (DW_TAG_member)
    <987>   DW_AT_name        : (indirect string, offset: 0x3a9): step
    <98b>   DW_AT_decl_file   : 19
    <98c>   DW_AT_decl_line   : 253
    <98d>   DW_AT_decl_column : 11
    <98e>   DW_AT_type        : <0xfe>
    <992>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><995>: Abbrev Number: 9 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x10f9): data
    <99a>   DW_AT_decl_file   : 19
    <99b>   DW_AT_decl_line   : 254
    <99c>   DW_AT_decl_column : 21
    <99d>   DW_AT_type        : <0x8f3>
    <9a1>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a4>: Abbrev Number: 0
 <1><9a5>: Abbrev Number: 10 (DW_TAG_array_type)
    <9a6>   DW_AT_type        : <0x561>
    <9aa>   DW_AT_sibling     : <0x9b5>
 <2><9ae>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9af>   DW_AT_type        : <0x2b>
    <9b3>   DW_AT_upper_bound : 5
 <2><9b4>: Abbrev Number: 0
 <1><9b5>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9b6>   DW_AT_name        : (indirect string, offset: 0xf1a): staged_output_data
    <9ba>   DW_AT_declaration : 1
 <1><9bb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9bc>   DW_AT_byte_size   : 4
    <9bd>   DW_AT_type        : <0x9b5>
 <1><9c1>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9c2>   DW_AT_prototyped  : 1
    <9c3>   DW_AT_sibling     : <0x9cd>
 <2><9c7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9c8>   DW_AT_type        : <0xcd>
 <2><9cc>: Abbrev Number: 0
 <1><9cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ce>   DW_AT_byte_size   : 4
    <9cf>   DW_AT_type        : <0x9c1>
 <1><9d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d4>   DW_AT_byte_size   : 4
    <9d5>   DW_AT_type        : <0x887>
 <1><9d9>: Abbrev Number: 3 (DW_TAG_const_type)
    <9da>   DW_AT_type        : <0x9d3>
 <1><9de>: Abbrev Number: 10 (DW_TAG_array_type)
    <9df>   DW_AT_type        : <0x9ee>
    <9e3>   DW_AT_sibling     : <0x9ee>
 <2><9e7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9e8>   DW_AT_type        : <0x2b>
    <9ec>   DW_AT_upper_bound : 2
 <2><9ed>: Abbrev Number: 0
 <1><9ee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ef>   DW_AT_byte_size   : 4
    <9f0>   DW_AT_type        : <0x95b>
 <1><9f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9f9>   DW_AT_declaration : 1
 <1><9fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fb>   DW_AT_byte_size   : 4
    <9fc>   DW_AT_type        : <0x9f4>
 <1><a00>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a01>   DW_AT_name        : (indirect string, offset: 0x3c4): tcb_wait_data
    <a05>   DW_AT_declaration : 1
 <1><a06>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a07>   DW_AT_byte_size   : 4
    <a08>   DW_AT_type        : <0xa00>
 <1><a0c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <a11>   DW_AT_declaration : 1
 <1><a12>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a13>   DW_AT_byte_size   : 4
    <a14>   DW_AT_type        : <0xa0c>
 <1><a18>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a19>   DW_AT_name        : (indirect string, offset: 0xefe): unwind_queue_t
    <a1d>   DW_AT_declaration : 1
 <1><a1e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1f>   DW_AT_byte_size   : 4
    <a20>   DW_AT_type        : <0xa18>
 <1><a24>: Abbrev Number: 10 (DW_TAG_array_type)
    <a25>   DW_AT_type        : <0xe6>
    <a29>   DW_AT_sibling     : <0xa34>
 <2><a2d>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a2e>   DW_AT_type        : <0x2b>
    <a32>   DW_AT_upper_bound : 15
 <2><a33>: Abbrev Number: 0
 <1><a34>: Abbrev Number: 12 (DW_TAG_variable)
    <a35>   DW_AT_name        : (indirect string, offset: 0xbbc): stub_sysent
    <a39>   DW_AT_decl_file   : 19
    <a3a>   DW_AT_decl_line   : 405
    <a3c>   DW_AT_decl_column : 28
    <a3d>   DW_AT_type        : <0x887>
    <a41>   DW_AT_external    : 1
    <a42>   DW_AT_declaration : 1
 <1><a43>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a44>   DW_AT_name        : (indirect string, offset: 0x10dc): xlat_type
    <a48>   DW_AT_encoding    : 7	(unsigned)
    <a49>   DW_AT_byte_size   : 4
    <a4a>   DW_AT_type        : <0x2b>
    <a4e>   DW_AT_decl_file   : 20
    <a4f>   DW_AT_decl_line   : 13
    <a50>   DW_AT_decl_column : 6
    <a51>   DW_AT_sibling     : <0xa68>
 <2><a55>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a56>   DW_AT_name        : (indirect string, offset: 0x2de): XT_NORMAL
    <a5a>   DW_AT_const_value : 0
 <2><a5b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5c>   DW_AT_name        : (indirect string, offset: 0xc87): XT_SORTED
    <a60>   DW_AT_const_value : 1
 <2><a61>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a62>   DW_AT_name        : (indirect string, offset: 0xdf1): XT_INDEXED
    <a66>   DW_AT_const_value : 2
 <2><a67>: Abbrev Number: 0
 <1><a68>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a69>   DW_AT_name        : (indirect string, offset: 0xbe8): xlat_style
    <a6d>   DW_AT_encoding    : 7	(unsigned)
    <a6e>   DW_AT_byte_size   : 4
    <a6f>   DW_AT_type        : <0x2b>
    <a73>   DW_AT_decl_file   : 20
    <a74>   DW_AT_decl_line   : 19
    <a75>   DW_AT_decl_column : 6
    <a76>   DW_AT_sibling     : <0xaa5>
 <2><a7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a7f>   DW_AT_const_value : 0
 <2><a80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0xc23): XLAT_STYLE_RAW
    <a85>   DW_AT_const_value : 1
 <2><a86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a87>   DW_AT_name        : (indirect string, offset: 0x10a7): XLAT_STYLE_ABBREV
    <a8b>   DW_AT_const_value : 2
 <2><a8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x2fb): XLAT_STYLE_VERBOSE
    <a91>   DW_AT_const_value : 3
 <2><a92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a93>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a97>   DW_AT_const_value : 0
 <2><a98>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a99>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a9d>   DW_AT_const_value : 4
 <2><a9e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x1116): XLAT_STYLE_FMT_D
    <aa3>   DW_AT_const_value : 8
 <2><aa4>: Abbrev Number: 0
 <1><aa5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x32c): xlat_data
    <aaa>   DW_AT_byte_size   : 12
    <aab>   DW_AT_decl_file   : 20
    <aac>   DW_AT_decl_line   : 51
    <aad>   DW_AT_decl_column : 8
    <aae>   DW_AT_sibling     : <0xad1>
 <2><ab2>: Abbrev Number: 18 (DW_TAG_member)
    <ab3>   DW_AT_name        : val
    <ab7>   DW_AT_decl_file   : 20
    <ab8>   DW_AT_decl_line   : 52
    <ab9>   DW_AT_decl_column : 11
    <aba>   DW_AT_type        : <0x116>
    <abe>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac1>: Abbrev Number: 18 (DW_TAG_member)
    <ac2>   DW_AT_name        : str
    <ac6>   DW_AT_decl_file   : 20
    <ac7>   DW_AT_decl_line   : 53
    <ac8>   DW_AT_decl_column : 14
    <ac9>   DW_AT_type        : <0x1d9>
    <acd>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad0>: Abbrev Number: 0
 <1><ad1>: Abbrev Number: 3 (DW_TAG_const_type)
    <ad2>   DW_AT_type        : <0xaa5>
 <1><ad6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <adb>   DW_AT_byte_size   : 24
    <adc>   DW_AT_decl_file   : 20
    <add>   DW_AT_decl_line   : 56
    <ade>   DW_AT_decl_column : 8
    <adf>   DW_AT_sibling     : <0xb2f>
 <2><ae3>: Abbrev Number: 9 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x10f9): data
    <ae8>   DW_AT_decl_file   : 20
    <ae9>   DW_AT_decl_line   : 57
    <aea>   DW_AT_decl_column : 26
    <aeb>   DW_AT_type        : <0xb34>
    <aef>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><af2>: Abbrev Number: 9 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x897): flags_strsz
    <af7>   DW_AT_decl_file   : 20
    <af8>   DW_AT_decl_line   : 58
    <af9>   DW_AT_decl_column : 9
    <afa>   DW_AT_type        : <0x122>
    <afe>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b01>: Abbrev Number: 9 (DW_TAG_member)
    <b02>   DW_AT_name        : (indirect string, offset: 0xb8d): size
    <b06>   DW_AT_decl_file   : 20
    <b07>   DW_AT_decl_line   : 59
    <b08>   DW_AT_decl_column : 11
    <b09>   DW_AT_type        : <0x10a>
    <b0d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b10>: Abbrev Number: 9 (DW_TAG_member)
    <b11>   DW_AT_name        : (indirect string, offset: 0x1a1): type
    <b15>   DW_AT_decl_file   : 20
    <b16>   DW_AT_decl_line   : 60
    <b17>   DW_AT_decl_column : 17
    <b18>   DW_AT_type        : <0xa43>
    <b1c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b1f>: Abbrev Number: 9 (DW_TAG_member)
    <b20>   DW_AT_name        : (indirect string, offset: 0x75a): flags_mask
    <b24>   DW_AT_decl_file   : 20
    <b25>   DW_AT_decl_line   : 61
    <b26>   DW_AT_decl_column : 11
    <b27>   DW_AT_type        : <0x116>
    <b2b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b2e>: Abbrev Number: 0
 <1><b2f>: Abbrev Number: 3 (DW_TAG_const_type)
    <b30>   DW_AT_type        : <0xad6>
 <1><b34>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b35>   DW_AT_byte_size   : 4
    <b36>   DW_AT_type        : <0xad1>
 <1><b3a>: Abbrev Number: 10 (DW_TAG_array_type)
    <b3b>   DW_AT_type        : <0xb2f>
    <b3f>   DW_AT_sibling     : <0xb45>
 <2><b43>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b44>: Abbrev Number: 0
 <1><b45>: Abbrev Number: 3 (DW_TAG_const_type)
    <b46>   DW_AT_type        : <0xb3a>
 <1><b4a>: Abbrev Number: 12 (DW_TAG_variable)
    <b4b>   DW_AT_name        : (indirect string, offset: 0xe5a): addrfams
    <b4f>   DW_AT_decl_file   : 19
    <b50>   DW_AT_decl_line   : 411
    <b52>   DW_AT_decl_column : 26
    <b53>   DW_AT_type        : <0xb45>
    <b57>   DW_AT_external    : 1
    <b58>   DW_AT_declaration : 1
 <1><b59>: Abbrev Number: 12 (DW_TAG_variable)
    <b5a>   DW_AT_name        : (indirect string, offset: 0xd3e): arp_hardware_types
    <b5e>   DW_AT_decl_file   : 19
    <b5f>   DW_AT_decl_line   : 412
    <b61>   DW_AT_decl_column : 26
    <b62>   DW_AT_type        : <0xb45>
    <b66>   DW_AT_external    : 1
    <b67>   DW_AT_declaration : 1
 <1><b68>: Abbrev Number: 12 (DW_TAG_variable)
    <b69>   DW_AT_name        : (indirect string, offset: 0x101c): at_flags
    <b6d>   DW_AT_decl_file   : 19
    <b6e>   DW_AT_decl_line   : 413
    <b70>   DW_AT_decl_column : 26
    <b71>   DW_AT_type        : <0xb45>
    <b75>   DW_AT_external    : 1
    <b76>   DW_AT_declaration : 1
 <1><b77>: Abbrev Number: 12 (DW_TAG_variable)
    <b78>   DW_AT_name        : (indirect string, offset: 0x499): clocknames
    <b7c>   DW_AT_decl_file   : 19
    <b7d>   DW_AT_decl_line   : 414
    <b7f>   DW_AT_decl_column : 26
    <b80>   DW_AT_type        : <0xb45>
    <b84>   DW_AT_external    : 1
    <b85>   DW_AT_declaration : 1
 <1><b86>: Abbrev Number: 12 (DW_TAG_variable)
    <b87>   DW_AT_name        : (indirect string, offset: 0xfca): dirent_types
    <b8b>   DW_AT_decl_file   : 19
    <b8c>   DW_AT_decl_line   : 415
    <b8e>   DW_AT_decl_column : 26
    <b8f>   DW_AT_type        : <0xb45>
    <b93>   DW_AT_external    : 1
    <b94>   DW_AT_declaration : 1
 <1><b95>: Abbrev Number: 12 (DW_TAG_variable)
    <b96>   DW_AT_name        : (indirect string, offset: 0x8e8): ethernet_protocols
    <b9a>   DW_AT_decl_file   : 19
    <b9b>   DW_AT_decl_line   : 416
    <b9d>   DW_AT_decl_column : 26
    <b9e>   DW_AT_type        : <0xb45>
    <ba2>   DW_AT_external    : 1
    <ba3>   DW_AT_declaration : 1
 <1><ba4>: Abbrev Number: 12 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x5b6): inet_protocols
    <ba9>   DW_AT_decl_file   : 19
    <baa>   DW_AT_decl_line   : 417
    <bac>   DW_AT_decl_column : 26
    <bad>   DW_AT_type        : <0xb45>
    <bb1>   DW_AT_external    : 1
    <bb2>   DW_AT_declaration : 1
 <1><bb3>: Abbrev Number: 12 (DW_TAG_variable)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x2cb): evdev_abs
    <bb8>   DW_AT_decl_file   : 19
    <bb9>   DW_AT_decl_line   : 418
    <bbb>   DW_AT_decl_column : 26
    <bbc>   DW_AT_type        : <0xb45>
    <bc0>   DW_AT_external    : 1
    <bc1>   DW_AT_declaration : 1
 <1><bc2>: Abbrev Number: 12 (DW_TAG_variable)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x74f): audit_arch
    <bc7>   DW_AT_decl_file   : 19
    <bc8>   DW_AT_decl_line   : 419
    <bca>   DW_AT_decl_column : 26
    <bcb>   DW_AT_type        : <0xb45>
    <bcf>   DW_AT_external    : 1
    <bd0>   DW_AT_declaration : 1
 <1><bd1>: Abbrev Number: 12 (DW_TAG_variable)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bd6>   DW_AT_decl_file   : 19
    <bd7>   DW_AT_decl_line   : 420
    <bd9>   DW_AT_decl_column : 26
    <bda>   DW_AT_type        : <0xb45>
    <bde>   DW_AT_external    : 1
    <bdf>   DW_AT_declaration : 1
 <1><be0>: Abbrev Number: 12 (DW_TAG_variable)
    <be1>   DW_AT_name        : (indirect string, offset: 0x47a): iffflags
    <be5>   DW_AT_decl_file   : 19
    <be6>   DW_AT_decl_line   : 421
    <be8>   DW_AT_decl_column : 26
    <be9>   DW_AT_type        : <0xb45>
    <bed>   DW_AT_external    : 1
    <bee>   DW_AT_declaration : 1
 <1><bef>: Abbrev Number: 12 (DW_TAG_variable)
    <bf0>   DW_AT_name        : (indirect string, offset: 0xc32): ip_type_of_services
    <bf4>   DW_AT_decl_file   : 19
    <bf5>   DW_AT_decl_line   : 422
    <bf7>   DW_AT_decl_column : 26
    <bf8>   DW_AT_type        : <0xb45>
    <bfc>   DW_AT_external    : 1
    <bfd>   DW_AT_declaration : 1
 <1><bfe>: Abbrev Number: 12 (DW_TAG_variable)
    <bff>   DW_AT_name        : (indirect string, offset: 0x6c5): ipc_private
    <c03>   DW_AT_decl_file   : 19
    <c04>   DW_AT_decl_line   : 423
    <c06>   DW_AT_decl_column : 26
    <c07>   DW_AT_type        : <0xb45>
    <c0b>   DW_AT_external    : 1
    <c0c>   DW_AT_declaration : 1
 <1><c0d>: Abbrev Number: 12 (DW_TAG_variable)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x322): msg_flags
    <c12>   DW_AT_decl_file   : 19
    <c13>   DW_AT_decl_line   : 424
    <c15>   DW_AT_decl_column : 26
    <c16>   DW_AT_type        : <0xb45>
    <c1a>   DW_AT_external    : 1
    <c1b>   DW_AT_declaration : 1
 <1><c1c>: Abbrev Number: 12 (DW_TAG_variable)
    <c1d>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c21>   DW_AT_decl_file   : 19
    <c22>   DW_AT_decl_line   : 425
    <c24>   DW_AT_decl_column : 26
    <c25>   DW_AT_type        : <0xb45>
    <c29>   DW_AT_external    : 1
    <c2a>   DW_AT_declaration : 1
 <1><c2b>: Abbrev Number: 12 (DW_TAG_variable)
    <c2c>   DW_AT_name        : (indirect string, offset: 0xf2d): nl_bridge_vlan_flags
    <c30>   DW_AT_decl_file   : 19
    <c31>   DW_AT_decl_line   : 426
    <c33>   DW_AT_decl_column : 26
    <c34>   DW_AT_type        : <0xb45>
    <c38>   DW_AT_external    : 1
    <c39>   DW_AT_declaration : 1
 <1><c3a>: Abbrev Number: 12 (DW_TAG_variable)
    <c3b>   DW_AT_name        : (indirect string, offset: 0xdda): nl_netfilter_msg_types
    <c3f>   DW_AT_decl_file   : 19
    <c40>   DW_AT_decl_line   : 427
    <c42>   DW_AT_decl_column : 26
    <c43>   DW_AT_type        : <0xb45>
    <c47>   DW_AT_external    : 1
    <c48>   DW_AT_declaration : 1
 <1><c49>: Abbrev Number: 12 (DW_TAG_variable)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x45c): nl_route_types
    <c4e>   DW_AT_decl_file   : 19
    <c4f>   DW_AT_decl_line   : 428
    <c51>   DW_AT_decl_column : 26
    <c52>   DW_AT_type        : <0xb45>
    <c56>   DW_AT_external    : 1
    <c57>   DW_AT_declaration : 1
 <1><c58>: Abbrev Number: 12 (DW_TAG_variable)
    <c59>   DW_AT_name        : (indirect string, offset: 0xe91): open_access_modes
    <c5d>   DW_AT_decl_file   : 19
    <c5e>   DW_AT_decl_line   : 429
    <c60>   DW_AT_decl_column : 26
    <c61>   DW_AT_type        : <0xb45>
    <c65>   DW_AT_external    : 1
    <c66>   DW_AT_declaration : 1
 <1><c67>: Abbrev Number: 12 (DW_TAG_variable)
    <c68>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c6c>   DW_AT_decl_file   : 19
    <c6d>   DW_AT_decl_line   : 430
    <c6f>   DW_AT_decl_column : 26
    <c70>   DW_AT_type        : <0xb45>
    <c74>   DW_AT_external    : 1
    <c75>   DW_AT_declaration : 1
 <1><c76>: Abbrev Number: 12 (DW_TAG_variable)
    <c77>   DW_AT_name        : (indirect string, offset: 0xc63): perf_type_id
    <c7b>   DW_AT_decl_file   : 19
    <c7c>   DW_AT_decl_line   : 431
    <c7e>   DW_AT_decl_column : 26
    <c7f>   DW_AT_type        : <0xb45>
    <c83>   DW_AT_external    : 1
    <c84>   DW_AT_declaration : 1
 <1><c85>: Abbrev Number: 12 (DW_TAG_variable)
    <c86>   DW_AT_name        : (indirect string, offset: 0xe63): pollflags
    <c8a>   DW_AT_decl_file   : 19
    <c8b>   DW_AT_decl_line   : 432
    <c8d>   DW_AT_decl_column : 26
    <c8e>   DW_AT_type        : <0xb45>
    <c92>   DW_AT_external    : 1
    <c93>   DW_AT_declaration : 1
 <1><c94>: Abbrev Number: 12 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0x557): ptrace_cmds
    <c99>   DW_AT_decl_file   : 19
    <c9a>   DW_AT_decl_line   : 433
    <c9c>   DW_AT_decl_column : 26
    <c9d>   DW_AT_type        : <0xb45>
    <ca1>   DW_AT_external    : 1
    <ca2>   DW_AT_declaration : 1
 <1><ca3>: Abbrev Number: 12 (DW_TAG_variable)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x82a): resource_flags
    <ca8>   DW_AT_decl_file   : 19
    <ca9>   DW_AT_decl_line   : 434
    <cab>   DW_AT_decl_column : 26
    <cac>   DW_AT_type        : <0xb45>
    <cb0>   DW_AT_external    : 1
    <cb1>   DW_AT_declaration : 1
 <1><cb2>: Abbrev Number: 12 (DW_TAG_variable)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x28d): route_nexthop_flags
    <cb7>   DW_AT_decl_file   : 19
    <cb8>   DW_AT_decl_line   : 435
    <cba>   DW_AT_decl_column : 26
    <cbb>   DW_AT_type        : <0xb45>
    <cbf>   DW_AT_external    : 1
    <cc0>   DW_AT_declaration : 1
 <1><cc1>: Abbrev Number: 12 (DW_TAG_variable)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xeb8): routing_protocols
    <cc6>   DW_AT_decl_file   : 19
    <cc7>   DW_AT_decl_line   : 436
    <cc9>   DW_AT_decl_column : 26
    <cca>   DW_AT_type        : <0xb45>
    <cce>   DW_AT_external    : 1
    <ccf>   DW_AT_declaration : 1
 <1><cd0>: Abbrev Number: 12 (DW_TAG_variable)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x46b): routing_scopes
    <cd5>   DW_AT_decl_file   : 19
    <cd6>   DW_AT_decl_line   : 437
    <cd8>   DW_AT_decl_column : 26
    <cd9>   DW_AT_type        : <0xb45>
    <cdd>   DW_AT_external    : 1
    <cde>   DW_AT_declaration : 1
 <1><cdf>: Abbrev Number: 12 (DW_TAG_variable)
    <ce0>   DW_AT_name        : (indirect string, offset: 0xdc8): routing_table_ids
    <ce4>   DW_AT_decl_file   : 19
    <ce5>   DW_AT_decl_line   : 438
    <ce7>   DW_AT_decl_column : 26
    <ce8>   DW_AT_type        : <0xb45>
    <cec>   DW_AT_external    : 1
    <ced>   DW_AT_declaration : 1
 <1><cee>: Abbrev Number: 12 (DW_TAG_variable)
    <cef>   DW_AT_name        : (indirect string, offset: 0x68f): routing_types
    <cf3>   DW_AT_decl_file   : 19
    <cf4>   DW_AT_decl_line   : 439
    <cf6>   DW_AT_decl_column : 26
    <cf7>   DW_AT_type        : <0xb45>
    <cfb>   DW_AT_external    : 1
    <cfc>   DW_AT_declaration : 1
 <1><cfd>: Abbrev Number: 12 (DW_TAG_variable)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x1c5): rwf_flags
    <d02>   DW_AT_decl_file   : 19
    <d03>   DW_AT_decl_line   : 440
    <d05>   DW_AT_decl_column : 26
    <d06>   DW_AT_type        : <0xb45>
    <d0a>   DW_AT_external    : 1
    <d0b>   DW_AT_declaration : 1
 <1><d0c>: Abbrev Number: 12 (DW_TAG_variable)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x862): seccomp_filter_flags
    <d11>   DW_AT_decl_file   : 19
    <d12>   DW_AT_decl_line   : 441
    <d14>   DW_AT_decl_column : 26
    <d15>   DW_AT_type        : <0xb45>
    <d19>   DW_AT_external    : 1
    <d1a>   DW_AT_declaration : 1
 <1><d1b>: Abbrev Number: 12 (DW_TAG_variable)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x2e8): seccomp_ret_action
    <d20>   DW_AT_decl_file   : 19
    <d21>   DW_AT_decl_line   : 442
    <d23>   DW_AT_decl_column : 26
    <d24>   DW_AT_type        : <0xb45>
    <d28>   DW_AT_external    : 1
    <d29>   DW_AT_declaration : 1
 <1><d2a>: Abbrev Number: 12 (DW_TAG_variable)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x42e): setns_types
    <d2f>   DW_AT_decl_file   : 19
    <d30>   DW_AT_decl_line   : 443
    <d32>   DW_AT_decl_column : 26
    <d33>   DW_AT_type        : <0xb45>
    <d37>   DW_AT_external    : 1
    <d38>   DW_AT_declaration : 1
 <1><d39>: Abbrev Number: 12 (DW_TAG_variable)
    <d3a>   DW_AT_name        : (indirect string, offset: 0xe4f): sg_io_info
    <d3e>   DW_AT_decl_file   : 19
    <d3f>   DW_AT_decl_line   : 444
    <d41>   DW_AT_decl_column : 26
    <d42>   DW_AT_type        : <0xb45>
    <d46>   DW_AT_external    : 1
    <d47>   DW_AT_declaration : 1
 <1><d48>: Abbrev Number: 12 (DW_TAG_variable)
    <d49>   DW_AT_name        : (indirect string, offset: 0xbd0): socketlayers
    <d4d>   DW_AT_decl_file   : 19
    <d4e>   DW_AT_decl_line   : 445
    <d50>   DW_AT_decl_column : 26
    <d51>   DW_AT_type        : <0xb45>
    <d55>   DW_AT_external    : 1
    <d56>   DW_AT_declaration : 1
 <1><d57>: Abbrev Number: 12 (DW_TAG_variable)
    <d58>   DW_AT_name        : (indirect string, offset: 0xdb2): socktypes
    <d5c>   DW_AT_decl_file   : 19
    <d5d>   DW_AT_decl_line   : 446
    <d5f>   DW_AT_decl_column : 26
    <d60>   DW_AT_type        : <0xb45>
    <d64>   DW_AT_external    : 1
    <d65>   DW_AT_declaration : 1
 <1><d66>: Abbrev Number: 12 (DW_TAG_variable)
    <d67>   DW_AT_name        : (indirect string, offset: 0xaa0): tcp_state_flags
    <d6b>   DW_AT_decl_file   : 19
    <d6c>   DW_AT_decl_line   : 447
    <d6e>   DW_AT_decl_column : 26
    <d6f>   DW_AT_type        : <0xb45>
    <d73>   DW_AT_external    : 1
    <d74>   DW_AT_declaration : 1
 <1><d75>: Abbrev Number: 12 (DW_TAG_variable)
    <d76>   DW_AT_name        : (indirect string, offset: 0x784): tcp_states
    <d7a>   DW_AT_decl_file   : 19
    <d7b>   DW_AT_decl_line   : 448
    <d7d>   DW_AT_decl_column : 26
    <d7e>   DW_AT_type        : <0xb45>
    <d82>   DW_AT_external    : 1
    <d83>   DW_AT_declaration : 1
 <1><d84>: Abbrev Number: 12 (DW_TAG_variable)
    <d85>   DW_AT_name        : (indirect string, offset: 0x108a): whence_codes
    <d89>   DW_AT_decl_file   : 19
    <d8a>   DW_AT_decl_line   : 449
    <d8c>   DW_AT_decl_column : 26
    <d8d>   DW_AT_type        : <0xb45>
    <d91>   DW_AT_external    : 1
    <d92>   DW_AT_declaration : 1
 <1><d93>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d94>   DW_AT_encoding    : 7	(unsigned)
    <d95>   DW_AT_byte_size   : 4
    <d96>   DW_AT_type        : <0x2b>
    <d9a>   DW_AT_decl_file   : 19
    <d9b>   DW_AT_decl_line   : 510
    <d9d>   DW_AT_decl_column : 14
    <d9e>   DW_AT_sibling     : <0xdb5>
 <2><da2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da3>   DW_AT_name        : (indirect string, offset: 0x9c7): CFLAG_NONE
    <da7>   DW_AT_const_value : 0
 <2><da8>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da9>   DW_AT_name        : (indirect string, offset: 0x8fb): CFLAG_ONLY_STATS
    <dad>   DW_AT_const_value : 1
 <2><dae>: Abbrev Number: 26 (DW_TAG_enumerator)
    <daf>   DW_AT_name        : (indirect string, offset: 0xbdd): CFLAG_BOTH
    <db3>   DW_AT_const_value : 2
 <2><db4>: Abbrev Number: 0
 <1><db5>: Abbrev Number: 28 (DW_TAG_typedef)
    <db6>   DW_AT_name        : (indirect string, offset: 0x1135): cflag_t
    <dba>   DW_AT_decl_file   : 19
    <dbb>   DW_AT_decl_line   : 514
    <dbd>   DW_AT_decl_column : 3
    <dbe>   DW_AT_type        : <0xd93>
 <1><dc2>: Abbrev Number: 12 (DW_TAG_variable)
    <dc3>   DW_AT_name        : (indirect string, offset: 0xcfd): cflag
    <dc7>   DW_AT_decl_file   : 19
    <dc8>   DW_AT_decl_line   : 515
    <dca>   DW_AT_decl_column : 16
    <dcb>   DW_AT_type        : <0xdb5>
    <dcf>   DW_AT_external    : 1
    <dd0>   DW_AT_declaration : 1
 <1><dd1>: Abbrev Number: 12 (DW_TAG_variable)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <dd6>   DW_AT_decl_file   : 19
    <dd7>   DW_AT_decl_line   : 516
    <dd9>   DW_AT_decl_column : 13
    <dda>   DW_AT_type        : <0x525>
    <dde>   DW_AT_external    : 1
    <ddf>   DW_AT_declaration : 1
 <1><de0>: Abbrev Number: 12 (DW_TAG_variable)
    <de1>   DW_AT_name        : (indirect string, offset: 0x7e5): Tflag_scale
    <de5>   DW_AT_decl_file   : 19
    <de6>   DW_AT_decl_line   : 517
    <de8>   DW_AT_decl_column : 12
    <de9>   DW_AT_type        : <0x64>
    <ded>   DW_AT_external    : 1
    <dee>   DW_AT_declaration : 1
 <1><def>: Abbrev Number: 12 (DW_TAG_variable)
    <df0>   DW_AT_name        : (indirect string, offset: 0x877): Tflag_width
    <df4>   DW_AT_decl_file   : 19
    <df5>   DW_AT_decl_line   : 518
    <df7>   DW_AT_decl_column : 12
    <df8>   DW_AT_type        : <0x64>
    <dfc>   DW_AT_external    : 1
    <dfd>   DW_AT_declaration : 1
 <1><dfe>: Abbrev Number: 12 (DW_TAG_variable)
    <dff>   DW_AT_name        : (indirect string, offset: 0xe41): iflag
    <e03>   DW_AT_decl_file   : 19
    <e04>   DW_AT_decl_line   : 519
    <e06>   DW_AT_decl_column : 13
    <e07>   DW_AT_type        : <0x525>
    <e0b>   DW_AT_external    : 1
    <e0c>   DW_AT_declaration : 1
 <1><e0d>: Abbrev Number: 12 (DW_TAG_variable)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x597): count_wallclock
    <e12>   DW_AT_decl_file   : 19
    <e13>   DW_AT_decl_line   : 520
    <e15>   DW_AT_decl_column : 13
    <e16>   DW_AT_type        : <0x525>
    <e1a>   DW_AT_external    : 1
    <e1b>   DW_AT_declaration : 1
 <1><e1c>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e21>   DW_AT_byte_size   : 4
    <e22>   DW_AT_decl_file   : 19
    <e23>   DW_AT_decl_line   : 522
    <e25>   DW_AT_decl_column : 8
    <e26>   DW_AT_sibling     : <0xe3b>
 <2><e2a>: Abbrev Number: 22 (DW_TAG_member)
    <e2b>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e2f>   DW_AT_decl_file   : 19
    <e30>   DW_AT_decl_line   : 523
    <e32>   DW_AT_decl_column : 14
    <e33>   DW_AT_type        : <0x1d9>
    <e37>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3a>: Abbrev Number: 0
 <1><e3b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x78f): path_set
    <e40>   DW_AT_byte_size   : 12
    <e41>   DW_AT_decl_file   : 19
    <e42>   DW_AT_decl_line   : 527
    <e44>   DW_AT_decl_column : 15
    <e45>   DW_AT_sibling     : <0xe7a>
 <2><e49>: Abbrev Number: 22 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x71d): paths_selected
    <e4e>   DW_AT_decl_file   : 19
    <e4f>   DW_AT_decl_line   : 528
    <e51>   DW_AT_decl_column : 24
    <e52>   DW_AT_type        : <0xe7a>
    <e56>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e59>: Abbrev Number: 22 (DW_TAG_member)
    <e5a>   DW_AT_name        : (indirect string, offset: 0x107d): num_selected
    <e5e>   DW_AT_decl_file   : 19
    <e5f>   DW_AT_decl_line   : 529
    <e61>   DW_AT_decl_column : 9
    <e62>   DW_AT_type        : <0x122>
    <e66>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e69>: Abbrev Number: 22 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xb8d): size
    <e6e>   DW_AT_decl_file   : 19
    <e6f>   DW_AT_decl_line   : 530
    <e71>   DW_AT_decl_column : 9
    <e72>   DW_AT_type        : <0x122>
    <e76>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e79>: Abbrev Number: 0
 <1><e7a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7b>   DW_AT_byte_size   : 4
    <e7c>   DW_AT_type        : <0xe1c>
 <1><e80>: Abbrev Number: 12 (DW_TAG_variable)
    <e81>   DW_AT_name        : (indirect string, offset: 0x10cc): global_path_set
    <e85>   DW_AT_decl_file   : 19
    <e86>   DW_AT_decl_line   : 531
    <e88>   DW_AT_decl_column : 3
    <e89>   DW_AT_type        : <0xe3b>
    <e8d>   DW_AT_external    : 1
    <e8e>   DW_AT_declaration : 1
 <1><e8f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e90>   DW_AT_name        : (indirect string, offset: 0xfa5): xflag_opts
    <e94>   DW_AT_encoding    : 7	(unsigned)
    <e95>   DW_AT_byte_size   : 4
    <e96>   DW_AT_type        : <0x2b>
    <e9a>   DW_AT_decl_file   : 19
    <e9b>   DW_AT_decl_line   : 533
    <e9d>   DW_AT_decl_column : 6
    <e9e>   DW_AT_sibling     : <0xec1>
 <2><ea2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea3>   DW_AT_name        : (indirect string, offset: 0xa41): HEXSTR_NONE
    <ea7>   DW_AT_const_value : 0
 <2><ea8>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea9>   DW_AT_name        : (indirect string, offset: 0xff5): HEXSTR_NON_ASCII
    <ead>   DW_AT_const_value : 1
 <2><eae>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x948): HEXSTR_ALL
    <eb3>   DW_AT_const_value : 2
 <2><eb4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x66e): HEXSTR_NON_ASCII_CHARS
    <eb9>   DW_AT_const_value : 3
 <2><eba>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x1097): NUM_HEXSTR_OPTS
    <ebf>   DW_AT_const_value : 4
 <2><ec0>: Abbrev Number: 0
 <1><ec1>: Abbrev Number: 12 (DW_TAG_variable)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xe1b): xflag
    <ec6>   DW_AT_decl_file   : 19
    <ec7>   DW_AT_decl_line   : 546
    <ec9>   DW_AT_decl_column : 17
    <eca>   DW_AT_type        : <0x2b>
    <ece>   DW_AT_external    : 1
    <ecf>   DW_AT_declaration : 1
 <1><ed0>: Abbrev Number: 12 (DW_TAG_variable)
    <ed1>   DW_AT_name        : (indirect string, offset: 0xcb8): followfork
    <ed5>   DW_AT_decl_file   : 19
    <ed6>   DW_AT_decl_line   : 547
    <ed8>   DW_AT_decl_column : 13
    <ed9>   DW_AT_type        : <0x525>
    <edd>   DW_AT_external    : 1
    <ede>   DW_AT_declaration : 1
 <1><edf>: Abbrev Number: 12 (DW_TAG_variable)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x336): output_separately
    <ee4>   DW_AT_decl_file   : 19
    <ee5>   DW_AT_decl_line   : 548
    <ee7>   DW_AT_decl_column : 13
    <ee8>   DW_AT_type        : <0x525>
    <eec>   DW_AT_external    : 1
    <eed>   DW_AT_declaration : 1
 <1><eee>: Abbrev Number: 12 (DW_TAG_variable)
    <eef>   DW_AT_name        : (indirect string, offset: 0x22c): stack_trace_enabled
    <ef3>   DW_AT_decl_file   : 19
    <ef4>   DW_AT_decl_line   : 551
    <ef6>   DW_AT_decl_column : 13
    <ef7>   DW_AT_type        : <0x525>
    <efb>   DW_AT_external    : 1
    <efc>   DW_AT_declaration : 1
 <1><efd>: Abbrev Number: 12 (DW_TAG_variable)
    <efe>   DW_AT_name        : (indirect string, offset: 0x65c): ptrace_setoptions
    <f02>   DW_AT_decl_file   : 19
    <f03>   DW_AT_decl_line   : 555
    <f05>   DW_AT_decl_column : 17
    <f06>   DW_AT_type        : <0x2b>
    <f0a>   DW_AT_external    : 1
    <f0b>   DW_AT_declaration : 1
 <1><f0c>: Abbrev Number: 12 (DW_TAG_variable)
    <f0d>   DW_AT_name        : (indirect string, offset: 0xa36): max_strlen
    <f11>   DW_AT_decl_file   : 19
    <f12>   DW_AT_decl_line   : 556
    <f14>   DW_AT_decl_column : 17
    <f15>   DW_AT_type        : <0x2b>
    <f19>   DW_AT_external    : 1
    <f1a>   DW_AT_declaration : 1
 <1><f1b>: Abbrev Number: 12 (DW_TAG_variable)
    <f1c>   DW_AT_name        : (indirect string, offset: 0xa7a): os_release
    <f20>   DW_AT_decl_file   : 19
    <f21>   DW_AT_decl_line   : 557
    <f23>   DW_AT_decl_column : 17
    <f24>   DW_AT_type        : <0x2b>
    <f28>   DW_AT_external    : 1
    <f29>   DW_AT_declaration : 1
 <1><f2a>: Abbrev Number: 12 (DW_TAG_variable)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x72c): xlat_verbosity
    <f2f>   DW_AT_decl_file   : 19
    <f30>   DW_AT_decl_line   : 919
    <f32>   DW_AT_decl_column : 24
    <f33>   DW_AT_type        : <0xa68>
    <f37>   DW_AT_external    : 1
    <f38>   DW_AT_declaration : 1
 <1><f39>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f3a>   DW_AT_name        : (indirect string, offset: 0x57a): xlat_style_private_flag_bits
    <f3e>   DW_AT_encoding    : 7	(unsigned)
    <f3f>   DW_AT_byte_size   : 4
    <f40>   DW_AT_type        : <0x2b>
    <f44>   DW_AT_decl_file   : 19
    <f45>   DW_AT_decl_line   : 939
    <f47>   DW_AT_decl_column : 6
    <f48>   DW_AT_sibling     : <0xf65>
 <2><f4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x2b5): PAF_PRINT_INDICES_BIT
    <f51>   DW_AT_const_value : 5
 <2><f52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f53>   DW_AT_name        : (indirect string, offset: 0xb3a): PAF_ARRAY_TRUNCATED_BIT
    <f57>   DW_AT_const_value : 6
 <2><f58>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f59>   DW_AT_name        : (indirect string, offset: 0x3ee): PXF_DEFAULT_STR_BIT
    <f5d>   DW_AT_const_value : 7
 <2><f5e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xc9a): SPFF_AUXSTR_MODE_BIT
    <f63>   DW_AT_const_value : 8
 <2><f64>: Abbrev Number: 0
 <1><f65>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f66>   DW_AT_name        : (indirect string, offset: 0xd51): find_xlat_flag_bits
    <f6a>   DW_AT_encoding    : 7	(unsigned)
    <f6b>   DW_AT_byte_size   : 4
    <f6c>   DW_AT_type        : <0x2b>
    <f70>   DW_AT_decl_file   : 19
    <f71>   DW_AT_decl_line   : 1443
    <f73>   DW_AT_decl_column : 6
    <f74>   DW_AT_sibling     : <0xf7f>
 <2><f78>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f79>   DW_AT_name        : (indirect string, offset: 0x985): FXL_CASE_SENSITIVE_BIT
    <f7d>   DW_AT_const_value : 0
 <2><f7e>: Abbrev Number: 0
 <1><f7f>: Abbrev Number: 12 (DW_TAG_variable)
    <f80>   DW_AT_name        : (indirect string, offset: 0xa12): printing_tcp
    <f84>   DW_AT_decl_file   : 19
    <f85>   DW_AT_decl_line   : 1689
    <f87>   DW_AT_decl_column : 20
    <f88>   DW_AT_type        : <0x60d>
    <f8c>   DW_AT_external    : 1
    <f8d>   DW_AT_declaration : 1
 <1><f8e>: Abbrev Number: 12 (DW_TAG_variable)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x542): errnoent
    <f93>   DW_AT_decl_file   : 19
    <f94>   DW_AT_decl_line   : 1887
    <f96>   DW_AT_decl_column : 26
    <f97>   DW_AT_type        : <0x459>
    <f9b>   DW_AT_external    : 1
    <f9c>   DW_AT_declaration : 1
 <1><f9d>: Abbrev Number: 12 (DW_TAG_variable)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x883): signalent
    <fa2>   DW_AT_decl_file   : 19
    <fa3>   DW_AT_decl_line   : 1888
    <fa5>   DW_AT_decl_column : 26
    <fa6>   DW_AT_type        : <0x459>
    <faa>   DW_AT_external    : 1
    <fab>   DW_AT_declaration : 1
 <1><fac>: Abbrev Number: 12 (DW_TAG_variable)
    <fad>   DW_AT_name        : (indirect string, offset: 0xe89): nerrnos
    <fb1>   DW_AT_decl_file   : 19
    <fb2>   DW_AT_decl_line   : 1889
    <fb4>   DW_AT_decl_column : 27
    <fb5>   DW_AT_type        : <0x32>
    <fb9>   DW_AT_external    : 1
    <fba>   DW_AT_declaration : 1
 <1><fbb>: Abbrev Number: 12 (DW_TAG_variable)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x1055): nsignals
    <fc0>   DW_AT_decl_file   : 19
    <fc1>   DW_AT_decl_line   : 1890
    <fc3>   DW_AT_decl_column : 27
    <fc4>   DW_AT_type        : <0x32>
    <fc8>   DW_AT_external    : 1
    <fc9>   DW_AT_declaration : 1
 <1><fca>: Abbrev Number: 10 (DW_TAG_array_type)
    <fcb>   DW_AT_type        : <0x887>
    <fcf>   DW_AT_sibling     : <0xfd5>
 <2><fd3>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd4>: Abbrev Number: 0
 <1><fd5>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd6>   DW_AT_type        : <0xfca>
 <1><fda>: Abbrev Number: 12 (DW_TAG_variable)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xd1c): sysent0
    <fdf>   DW_AT_decl_file   : 19
    <fe0>   DW_AT_decl_line   : 1892
    <fe2>   DW_AT_decl_column : 28
    <fe3>   DW_AT_type        : <0xfd5>
    <fe7>   DW_AT_external    : 1
    <fe8>   DW_AT_declaration : 1
 <1><fe9>: Abbrev Number: 10 (DW_TAG_array_type)
    <fea>   DW_AT_type        : <0x8ee>
    <fee>   DW_AT_sibling     : <0xff4>
 <2><ff2>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ff3>: Abbrev Number: 0
 <1><ff4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff5>   DW_AT_type        : <0xfe9>
 <1><ff9>: Abbrev Number: 12 (DW_TAG_variable)
    <ffa>   DW_AT_name        : (indirect string, offset: 0x10c2): ioctlent0
    <ffe>   DW_AT_decl_file   : 19
    <fff>   DW_AT_decl_line   : 1893
    <1001>   DW_AT_decl_column : 30
    <1002>   DW_AT_type        : <0xff4>
    <1006>   DW_AT_external    : 1
    <1007>   DW_AT_declaration : 1
 <1><1008>: Abbrev Number: 12 (DW_TAG_variable)
    <1009>   DW_AT_name        : (indirect string, offset: 0xfb0): personality_names
    <100d>   DW_AT_decl_file   : 19
    <100e>   DW_AT_decl_line   : 1895
    <1010>   DW_AT_decl_column : 26
    <1011>   DW_AT_type        : <0x459>
    <1015>   DW_AT_external    : 1
    <1016>   DW_AT_declaration : 1
 <1><1017>: Abbrev Number: 12 (DW_TAG_variable)
    <1018>   DW_AT_name        : (indirect string, offset: 0x8a3): sysent
    <101c>   DW_AT_decl_file   : 19
    <101d>   DW_AT_decl_line   : 1898
    <101f>   DW_AT_decl_column : 29
    <1020>   DW_AT_type        : <0x9d3>
    <1024>   DW_AT_external    : 1
    <1025>   DW_AT_declaration : 1
 <1><1026>: Abbrev Number: 12 (DW_TAG_variable)
    <1027>   DW_AT_name        : (indirect string, offset: 0xcaf): ioctlent
    <102b>   DW_AT_decl_file   : 19
    <102c>   DW_AT_decl_line   : 1899
    <102e>   DW_AT_decl_column : 31
    <102f>   DW_AT_type        : <0x1035>
    <1033>   DW_AT_external    : 1
    <1034>   DW_AT_declaration : 1
 <1><1035>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1036>   DW_AT_byte_size   : 4
    <1037>   DW_AT_type        : <0x8ee>
 <1><103b>: Abbrev Number: 12 (DW_TAG_variable)
    <103c>   DW_AT_name        : (indirect string, offset: 0x88d): nsyscalls
    <1040>   DW_AT_decl_file   : 19
    <1041>   DW_AT_decl_line   : 1905
    <1043>   DW_AT_decl_column : 17
    <1044>   DW_AT_type        : <0x2b>
    <1048>   DW_AT_external    : 1
    <1049>   DW_AT_declaration : 1
 <1><104a>: Abbrev Number: 12 (DW_TAG_variable)
    <104b>   DW_AT_name        : (indirect string, offset: 0xead): nioctlents
    <104f>   DW_AT_decl_file   : 19
    <1050>   DW_AT_decl_line   : 1906
    <1052>   DW_AT_decl_column : 17
    <1053>   DW_AT_type        : <0x2b>
    <1057>   DW_AT_external    : 1
    <1058>   DW_AT_declaration : 1
 <1><1059>: Abbrev Number: 10 (DW_TAG_array_type)
    <105a>   DW_AT_type        : <0x32>
    <105e>   DW_AT_sibling     : <0x1069>
 <2><1062>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1063>   DW_AT_type        : <0x2b>
    <1067>   DW_AT_upper_bound : 2
 <2><1068>: Abbrev Number: 0
 <1><1069>: Abbrev Number: 3 (DW_TAG_const_type)
    <106a>   DW_AT_type        : <0x1059>
 <1><106e>: Abbrev Number: 12 (DW_TAG_variable)
    <106f>   DW_AT_name        : (indirect string, offset: 0xf0d): nsyscall_vec
    <1073>   DW_AT_decl_file   : 19
    <1074>   DW_AT_decl_line   : 1908
    <1076>   DW_AT_decl_column : 27
    <1077>   DW_AT_type        : <0x1069>
    <107b>   DW_AT_external    : 1
    <107c>   DW_AT_declaration : 1
 <1><107d>: Abbrev Number: 10 (DW_TAG_array_type)
    <107e>   DW_AT_type        : <0x9d9>
    <1082>   DW_AT_sibling     : <0x108d>
 <2><1086>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1087>   DW_AT_type        : <0x2b>
    <108b>   DW_AT_upper_bound : 2
 <2><108c>: Abbrev Number: 0
 <1><108d>: Abbrev Number: 3 (DW_TAG_const_type)
    <108e>   DW_AT_type        : <0x107d>
 <1><1092>: Abbrev Number: 12 (DW_TAG_variable)
    <1093>   DW_AT_name        : (indirect string, offset: 0x7d2): sysent_vec
    <1097>   DW_AT_decl_file   : 19
    <1098>   DW_AT_decl_line   : 1909
    <109a>   DW_AT_decl_column : 35
    <109b>   DW_AT_type        : <0x108d>
    <109f>   DW_AT_external    : 1
    <10a0>   DW_AT_declaration : 1
 <1><10a1>: Abbrev Number: 12 (DW_TAG_variable)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x38f): inject_vec
    <10a6>   DW_AT_decl_file   : 19
    <10a7>   DW_AT_decl_line   : 1910
    <10a9>   DW_AT_decl_column : 28
    <10aa>   DW_AT_type        : <0x9de>
    <10ae>   DW_AT_external    : 1
    <10af>   DW_AT_declaration : 1
 <1><10b0>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10b1>   DW_AT_name        : (indirect string, offset: 0xda5): audit_arch_t
    <10b5>   DW_AT_byte_size   : 8
    <10b6>   DW_AT_decl_file   : 19
    <10b7>   DW_AT_decl_line   : 1912
    <10b9>   DW_AT_decl_column : 8
    <10ba>   DW_AT_sibling     : <0x10df>
 <2><10be>: Abbrev Number: 22 (DW_TAG_member)
    <10bf>   DW_AT_name        : (indirect string, offset: 0x56c): arch
    <10c3>   DW_AT_decl_file   : 19
    <10c4>   DW_AT_decl_line   : 1913
    <10c6>   DW_AT_decl_column : 15
    <10c7>   DW_AT_type        : <0x2b>
    <10cb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ce>: Abbrev Number: 22 (DW_TAG_member)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x9f8): flag
    <10d3>   DW_AT_decl_file   : 19
    <10d4>   DW_AT_decl_line   : 1914
    <10d6>   DW_AT_decl_column : 15
    <10d7>   DW_AT_type        : <0x2b>
    <10db>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10de>: Abbrev Number: 0
 <1><10df>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e0>   DW_AT_type        : <0x10b0>
 <1><10e4>: Abbrev Number: 10 (DW_TAG_array_type)
    <10e5>   DW_AT_type        : <0x10df>
    <10e9>   DW_AT_sibling     : <0x10f4>
 <2><10ed>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10ee>   DW_AT_type        : <0x2b>
    <10f2>   DW_AT_upper_bound : 2
 <2><10f3>: Abbrev Number: 0
 <1><10f4>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f5>   DW_AT_type        : <0x10e4>
 <1><10f9>: Abbrev Number: 12 (DW_TAG_variable)
    <10fa>   DW_AT_name        : (indirect string, offset: 0x976): audit_arch_vec
    <10fe>   DW_AT_decl_file   : 19
    <10ff>   DW_AT_decl_line   : 1917
    <1101>   DW_AT_decl_column : 34
    <1102>   DW_AT_type        : <0x10f4>
    <1106>   DW_AT_external    : 1
    <1107>   DW_AT_declaration : 1
 <1><1108>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1109>   DW_AT_byte_size   : 180
    <110a>   DW_AT_decl_file   : 21
    <110b>   DW_AT_decl_line   : 2
    <110c>   DW_AT_decl_column : 9
    <110d>   DW_AT_sibling     : <0x13c2>
 <2><1111>: Abbrev Number: 9 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0x1dd): block_ioctl
    <1116>   DW_AT_decl_file   : 21
    <1117>   DW_AT_decl_line   : 3
    <1118>   DW_AT_decl_column : 8
    <1119>   DW_AT_type        : <0x13dc>
    <111d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1120>: Abbrev Number: 9 (DW_TAG_member)
    <1121>   DW_AT_name        : (indirect string, offset: 0xad9): btrfs_ioctl
    <1125>   DW_AT_decl_file   : 21
    <1126>   DW_AT_decl_line   : 6
    <1127>   DW_AT_decl_column : 8
    <1128>   DW_AT_type        : <0x13dc>
    <112c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><112f>: Abbrev Number: 9 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0x765): evdev_write_ioctl_mpers
    <1134>   DW_AT_decl_file   : 21
    <1135>   DW_AT_decl_line   : 9
    <1136>   DW_AT_decl_column : 8
    <1137>   DW_AT_type        : <0x13dc>
    <113b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><113e>: Abbrev Number: 9 (DW_TAG_member)
    <113f>   DW_AT_name        : (indirect string, offset: 0x73b): get_sock_fprog_size
    <1143>   DW_AT_decl_file   : 21
    <1144>   DW_AT_decl_line   : 12
    <1145>   DW_AT_decl_column : 17
    <1146>   DW_AT_type        : <0x13e8>
    <114a>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><114d>: Abbrev Number: 9 (DW_TAG_member)
    <114e>   DW_AT_name        : (indirect string, offset: 0x1ac): fetch_bpf_fprog
