Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x16e5 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5dc): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x2b6): mpers-m32/struct_keyctl_kdf_params.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa1f): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3bd): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfeb): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x976): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x360): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x241): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdea): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x48c): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x87c): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xec3): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8ac): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x787): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb54): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb8a): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2ad): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcfd): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc58): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x409): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x455): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x36c): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb75): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf6b): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xdfa): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xafd): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10b8): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe20): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xabf): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0xfa6): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x264): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x3b5): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0xfd5): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x75a): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc47): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xb3a): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x374): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x9fb): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4db): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xf18): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x7c3): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x1024): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x8ee): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x95f): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xd95): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1b5): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xcb2): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x588): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x1f8): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xf91): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x7af): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x828): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x226): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe46): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xcc2): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x6f2): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xa51): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xfb9): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3d9): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xc10): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x9bd): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x24b): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x7dd): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xadf): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x481): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x314): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x388): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x53a): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0xffe): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xde3): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x238): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x549): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x251): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xe55): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x6cb): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xbb5): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1a2): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xeaa): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x37d): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x9ad): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x106e): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4c6): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xf3f): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x9c9): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x41b): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0xa95): __kernel_long_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 15
    <528>   DW_AT_decl_column : 15
    <529>   DW_AT_type        : <0xae>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0x529): __kernel_ulong_t
    <532>   DW_AT_decl_file   : 14
    <533>   DW_AT_decl_line   : 16
    <534>   DW_AT_decl_column : 23
    <535>   DW_AT_type        : <0x37>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x3e7): kernel_long_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 16
    <540>   DW_AT_decl_column : 25
    <541>   DW_AT_type        : <0x521>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x89d): kernel_ulong_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 17
    <54c>   DW_AT_decl_column : 26
    <54d>   DW_AT_type        : <0x52d>
 <1><551>: Abbrev Number: 3 (DW_TAG_const_type)
    <552>   DW_AT_type        : <0x545>
 <1><556>: Abbrev Number: 8 (DW_TAG_structure_type)
    <557>   DW_AT_name        : (indirect string, offset: 0xbd3): list_item
    <55b>   DW_AT_byte_size   : 8
    <55c>   DW_AT_decl_file   : 16
    <55d>   DW_AT_decl_line   : 92
    <55e>   DW_AT_decl_column : 8
    <55f>   DW_AT_sibling     : <0x582>
 <2><563>: Abbrev Number: 9 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x10b3): prev
    <568>   DW_AT_decl_file   : 16
    <569>   DW_AT_decl_line   : 93
    <56a>   DW_AT_decl_column : 20
    <56b>   DW_AT_type        : <0x582>
    <56f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><572>: Abbrev Number: 9 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x10a9): next
    <577>   DW_AT_decl_file   : 16
    <578>   DW_AT_decl_line   : 94
    <579>   DW_AT_decl_column : 20
    <57a>   DW_AT_type        : <0x582>
    <57e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><581>: Abbrev Number: 0
 <1><582>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <583>   DW_AT_byte_size   : 4
    <584>   DW_AT_type        : <0x556>
 <1><588>: Abbrev Number: 8 (DW_TAG_structure_type)
    <589>   DW_AT_name        : (indirect string, offset: 0x875): sysent
    <58d>   DW_AT_byte_size   : 20
    <58e>   DW_AT_decl_file   : 17
    <58f>   DW_AT_decl_line   : 13
    <590>   DW_AT_decl_column : 16
    <591>   DW_AT_sibling     : <0x5e1>
 <2><595>: Abbrev Number: 9 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x1015): nargs
    <59a>   DW_AT_decl_file   : 17
    <59b>   DW_AT_decl_line   : 14
    <59c>   DW_AT_decl_column : 11
    <59d>   DW_AT_type        : <0x2b>
    <5a1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x96c): sys_flags
    <5a9>   DW_AT_decl_file   : 17
    <5aa>   DW_AT_decl_line   : 15
    <5ab>   DW_AT_decl_column : 6
    <5ac>   DW_AT_type        : <0x64>
    <5b0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b3>: Abbrev Number: 18 (DW_TAG_member)
    <5b4>   DW_AT_name        : sen
    <5b8>   DW_AT_decl_file   : 17
    <5b9>   DW_AT_decl_line   : 16
    <5ba>   DW_AT_decl_column : 6
    <5bb>   DW_AT_type        : <0x64>
    <5bf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5c2>: Abbrev Number: 9 (DW_TAG_member)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x30b): sys_func
    <5c7>   DW_AT_decl_file   : 17
    <5c8>   DW_AT_decl_line   : 17
    <5c9>   DW_AT_decl_column : 8
    <5ca>   DW_AT_type        : <0x859>
    <5ce>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5d1>: Abbrev Number: 9 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x25b): sys_name
    <5d6>   DW_AT_decl_file   : 17
    <5d7>   DW_AT_decl_line   : 18
    <5d8>   DW_AT_decl_column : 14
    <5d9>   DW_AT_type        : <0x1c9>
    <5dd>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5e0>: Abbrev Number: 0
 <1><5e1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5e2>   DW_AT_prototyped  : 1
    <5e3>   DW_AT_type        : <0x64>
    <5e7>   DW_AT_sibling     : <0x5f1>
 <2><5eb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5ec>   DW_AT_type        : <0x5f1>
 <2><5f0>: Abbrev Number: 0
 <1><5f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5f2>   DW_AT_byte_size   : 4
    <5f3>   DW_AT_type        : <0x5fc>
 <1><5f7>: Abbrev Number: 3 (DW_TAG_const_type)
    <5f8>   DW_AT_type        : <0x5f1>
 <1><5fc>: Abbrev Number: 21 (DW_TAG_structure_type)
    <5fd>   DW_AT_name        : tcb
    <601>   DW_AT_byte_size   : 220
    <602>   DW_AT_decl_file   : 18
    <603>   DW_AT_decl_line   : 262
    <605>   DW_AT_decl_column : 8
    <606>   DW_AT_sibling     : <0x859>
 <2><60a>: Abbrev Number: 22 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x4d5): flags
    <60f>   DW_AT_decl_file   : 18
    <610>   DW_AT_decl_line   : 263
    <612>   DW_AT_decl_column : 6
    <613>   DW_AT_type        : <0x64>
    <617>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><61a>: Abbrev Number: 23 (DW_TAG_member)
    <61b>   DW_AT_name        : pid
    <61f>   DW_AT_decl_file   : 18
    <620>   DW_AT_decl_line   : 264
    <622>   DW_AT_decl_column : 6
    <623>   DW_AT_type        : <0x64>
    <627>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><62a>: Abbrev Number: 22 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <62f>   DW_AT_decl_file   : 18
    <630>   DW_AT_decl_line   : 265
    <632>   DW_AT_decl_column : 6
    <633>   DW_AT_type        : <0x64>
    <637>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><63a>: Abbrev Number: 22 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x3a1): currpers
    <63f>   DW_AT_decl_file   : 18
    <640>   DW_AT_decl_line   : 267
    <642>   DW_AT_decl_column : 15
    <643>   DW_AT_type        : <0x2b>
    <647>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><64a>: Abbrev Number: 22 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0xb32): u_error
    <64f>   DW_AT_decl_file   : 18
    <650>   DW_AT_decl_line   : 269
    <652>   DW_AT_decl_column : 16
    <653>   DW_AT_type        : <0x37>
    <657>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><65a>: Abbrev Number: 22 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <65f>   DW_AT_decl_file   : 18
    <660>   DW_AT_decl_line   : 270
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x545>
    <667>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><66a>: Abbrev Number: 22 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0xb6b): true_scno
    <66f>   DW_AT_decl_file   : 18
    <670>   DW_AT_decl_line   : 271
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x545>
    <677>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><67a>: Abbrev Number: 22 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x18c): u_arg
    <67f>   DW_AT_decl_file   : 18
    <680>   DW_AT_decl_line   : 272
    <682>   DW_AT_decl_column : 17
    <683>   DW_AT_type        : <0x989>
    <687>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><68a>: Abbrev Number: 22 (DW_TAG_member)
    <68b>   DW_AT_name        : (indirect string, offset: 0x983): u_rval
    <68f>   DW_AT_decl_file   : 18
    <690>   DW_AT_decl_line   : 273
    <692>   DW_AT_decl_column : 16
    <693>   DW_AT_type        : <0x539>
    <697>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><69a>: Abbrev Number: 22 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0xab1): sys_func_rval
    <69f>   DW_AT_decl_file   : 18
    <6a0>   DW_AT_decl_line   : 274
    <6a2>   DW_AT_decl_column : 6
    <6a3>   DW_AT_type        : <0x64>
    <6a7>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6aa>: Abbrev Number: 22 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0xcee): curcol
    <6af>   DW_AT_decl_file   : 18
    <6b0>   DW_AT_decl_line   : 275
    <6b2>   DW_AT_decl_column : 6
    <6b3>   DW_AT_type        : <0x64>
    <6b7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ba>: Abbrev Number: 22 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x995): outf
    <6bf>   DW_AT_decl_file   : 18
    <6c0>   DW_AT_decl_line   : 276
    <6c2>   DW_AT_decl_column : 8
    <6c3>   DW_AT_type        : <0x40e>
    <6c7>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ca>: Abbrev Number: 22 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0xee9): staged_output_data
    <6cf>   DW_AT_decl_file   : 18
    <6d0>   DW_AT_decl_line   : 277
    <6d2>   DW_AT_decl_column : 29
    <6d3>   DW_AT_type        : <0x99f>
    <6d7>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6da>: Abbrev Number: 22 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xa7c): auxstr
    <6df>   DW_AT_decl_file   : 18
    <6e0>   DW_AT_decl_line   : 279
    <6e2>   DW_AT_decl_column : 14
    <6e3>   DW_AT_type        : <0x1c9>
    <6e7>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><6ea>: Abbrev Number: 22 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <6ef>   DW_AT_decl_file   : 18
    <6f0>   DW_AT_decl_line   : 280
    <6f2>   DW_AT_decl_column : 8
    <6f3>   DW_AT_type        : <0xcd>
    <6f7>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><6fa>: Abbrev Number: 22 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0xc00): _free_priv_data
    <6ff>   DW_AT_decl_file   : 18
    <700>   DW_AT_decl_line   : 281
    <702>   DW_AT_decl_column : 9
    <703>   DW_AT_type        : <0x9b1>
    <707>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><70a>: Abbrev Number: 22 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0x17c): s_ent
    <70f>   DW_AT_decl_file   : 18
    <710>   DW_AT_decl_line   : 282
    <712>   DW_AT_decl_column : 23
    <713>   DW_AT_type        : <0x9b7>
    <717>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><71a>: Abbrev Number: 22 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <71f>   DW_AT_decl_file   : 18
    <720>   DW_AT_decl_line   : 285
    <722>   DW_AT_decl_column : 23
    <723>   DW_AT_type        : <0x9b7>
    <727>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><72a>: Abbrev Number: 22 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x396): inject_vec
    <72f>   DW_AT_decl_file   : 18
    <730>   DW_AT_decl_line   : 286
    <732>   DW_AT_decl_column : 22
    <733>   DW_AT_type        : <0x9c2>
    <737>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><73a>: Abbrev Number: 22 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x7e6): stime
    <73f>   DW_AT_decl_file   : 18
    <740>   DW_AT_decl_line   : 287
    <742>   DW_AT_decl_column : 18
    <743>   DW_AT_type        : <0x133>
    <747>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><74a>: Abbrev Number: 22 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x3aa): ltime
    <74f>   DW_AT_decl_file   : 18
    <750>   DW_AT_decl_line   : 288
    <752>   DW_AT_decl_column : 18
    <753>   DW_AT_type        : <0x133>
    <757>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0xfdc): atime
    <75f>   DW_AT_decl_file   : 18
    <760>   DW_AT_decl_line   : 289
    <762>   DW_AT_decl_column : 18
    <763>   DW_AT_type        : <0x133>
    <767>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><76a>: Abbrev Number: 22 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x4cf): etime
    <76f>   DW_AT_decl_file   : 18
    <770>   DW_AT_decl_line   : 290
    <772>   DW_AT_decl_column : 18
    <773>   DW_AT_type        : <0x133>
    <777>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><77b>: Abbrev Number: 22 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0xd52): delay_expiration_time
    <780>   DW_AT_decl_file   : 18
    <781>   DW_AT_decl_line   : 291
    <783>   DW_AT_decl_column : 18
    <784>   DW_AT_type        : <0x133>
    <788>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><78c>: Abbrev Number: 22 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <791>   DW_AT_decl_file   : 18
    <792>   DW_AT_decl_line   : 298
    <794>   DW_AT_decl_column : 15
    <795>   DW_AT_type        : <0x2b>
    <799>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><79d>: Abbrev Number: 22 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0xf25): last_dirfd
    <7a2>   DW_AT_decl_file   : 18
    <7a3>   DW_AT_decl_line   : 301
    <7a5>   DW_AT_decl_column : 6
    <7a6>   DW_AT_type        : <0x64>
    <7aa>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ae>: Abbrev Number: 22 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0xf4b): mmap_cache
    <7b3>   DW_AT_decl_file   : 18
    <7b4>   DW_AT_decl_line   : 304
    <7b6>   DW_AT_decl_column : 23
    <7b7>   DW_AT_type        : <0x9de>
    <7bb>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7bf>: Abbrev Number: 22 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0xb41): wait_data_idx
    <7c4>   DW_AT_decl_file   : 18
    <7c5>   DW_AT_decl_line   : 311
    <7c7>   DW_AT_decl_column : 9
    <7c8>   DW_AT_type        : <0x122>
    <7cc>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7d0>: Abbrev Number: 22 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xa83): delayed_wait_data
    <7d5>   DW_AT_decl_file   : 18
    <7d6>   DW_AT_decl_line   : 313
    <7d8>   DW_AT_decl_column : 24
    <7d9>   DW_AT_type        : <0x9ea>
    <7dd>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7e1>: Abbrev Number: 22 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0xaf3): wait_list
    <7e6>   DW_AT_decl_file   : 18
    <7e7>   DW_AT_decl_line   : 314
    <7e9>   DW_AT_decl_column : 19
    <7ea>   DW_AT_type        : <0x556>
    <7ee>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><7f2>: Abbrev Number: 22 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x6e3): vcpu_info_list
    <7f7>   DW_AT_decl_file   : 18
    <7f8>   DW_AT_decl_line   : 318
    <7fa>   DW_AT_decl_column : 20
    <7fb>   DW_AT_type        : <0x9f6>
    <7ff>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><803>: Abbrev Number: 22 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0xca7): unwind_ctx
    <808>   DW_AT_decl_file   : 18
    <809>   DW_AT_decl_line   : 322
    <80b>   DW_AT_decl_column : 8
    <80c>   DW_AT_type        : <0xcd>
    <810>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><814>: Abbrev Number: 22 (DW_TAG_member)
    <815>   DW_AT_name        : (indirect string, offset: 0x4b9): unwind_queue
    <819>   DW_AT_decl_file   : 18
    <81a>   DW_AT_decl_line   : 323
    <81c>   DW_AT_decl_column : 25
    <81d>   DW_AT_type        : <0xa02>
    <821>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><825>: Abbrev Number: 22 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <82a>   DW_AT_decl_file   : 18
    <82b>   DW_AT_decl_line   : 327
    <82d>   DW_AT_decl_column : 7
    <82e>   DW_AT_type        : <0xa08>
    <832>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><836>: Abbrev Number: 22 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x208): start_prc
    <83b>   DW_AT_decl_file   : 18
    <83c>   DW_AT_decl_line   : 329
    <83e>   DW_AT_decl_column : 16
    <83f>   DW_AT_type        : <0x37>
    <843>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><847>: Abbrev Number: 22 (DW_TAG_member)
    <848>   DW_AT_name        : (indirect string, offset: 0xfb0): pre_comm
    <84c>   DW_AT_decl_file   : 18
    <84d>   DW_AT_decl_line   : 330
    <84f>   DW_AT_decl_column : 7
    <850>   DW_AT_type        : <0xa08>
    <854>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><858>: Abbrev Number: 0
 <1><859>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <85a>   DW_AT_byte_size   : 4
    <85b>   DW_AT_type        : <0x5e1>
 <1><85f>: Abbrev Number: 4 (DW_TAG_typedef)
    <860>   DW_AT_name        : (indirect string, offset: 0x51b): struct_sysent
    <864>   DW_AT_decl_file   : 17
    <865>   DW_AT_decl_line   : 19
    <866>   DW_AT_decl_column : 3
    <867>   DW_AT_type        : <0x588>
 <1><86b>: Abbrev Number: 3 (DW_TAG_const_type)
    <86c>   DW_AT_type        : <0x85f>
 <1><870>: Abbrev Number: 11 (DW_TAG_variable)
    <871>   DW_AT_name        : (indirect string, offset: 0xd3e): current_personality
    <875>   DW_AT_decl_file   : 18
    <876>   DW_AT_decl_line   : 158
    <877>   DW_AT_decl_column : 17
    <878>   DW_AT_type        : <0x2b>
    <87c>   DW_AT_external    : 1
    <87d>   DW_AT_declaration : 1
 <1><87e>: Abbrev Number: 11 (DW_TAG_variable)
    <87f>   DW_AT_name        : (indirect string, offset: 0x817): current_wordsize
    <883>   DW_AT_decl_file   : 18
    <884>   DW_AT_decl_line   : 171
    <885>   DW_AT_decl_column : 17
    <886>   DW_AT_type        : <0x2b>
    <88a>   DW_AT_external    : 1
    <88b>   DW_AT_declaration : 1
 <1><88c>: Abbrev Number: 11 (DW_TAG_variable)
    <88d>   DW_AT_name        : (indirect string, offset: 0xa5a): current_klongsize
    <891>   DW_AT_decl_file   : 18
    <892>   DW_AT_decl_line   : 176
    <893>   DW_AT_decl_column : 17
    <894>   DW_AT_type        : <0x2b>
    <898>   DW_AT_external    : 1
    <899>   DW_AT_declaration : 1
 <1><89a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <89b>   DW_AT_name        : (indirect string, offset: 0xc7e): ioctlent
    <89f>   DW_AT_byte_size   : 8
    <8a0>   DW_AT_decl_file   : 18
    <8a1>   DW_AT_decl_line   : 217
    <8a2>   DW_AT_decl_column : 16
    <8a3>   DW_AT_sibling     : <0x8c6>
 <2><8a7>: Abbrev Number: 9 (DW_TAG_member)
    <8a8>   DW_AT_name        : (indirect string, offset: 0xf11): symbol
    <8ac>   DW_AT_decl_file   : 18
    <8ad>   DW_AT_decl_line   : 218
    <8ae>   DW_AT_decl_column : 14
    <8af>   DW_AT_type        : <0x1c9>
    <8b3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8b6>: Abbrev Number: 9 (DW_TAG_member)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xd07): code
    <8bb>   DW_AT_decl_file   : 18
    <8bc>   DW_AT_decl_line   : 219
    <8bd>   DW_AT_decl_column : 15
    <8be>   DW_AT_type        : <0x2b>
    <8c2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8c5>: Abbrev Number: 0
 <1><8c6>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xc37): struct_ioctlent
    <8cb>   DW_AT_decl_file   : 18
    <8cc>   DW_AT_decl_line   : 220
    <8cd>   DW_AT_decl_column : 3
    <8ce>   DW_AT_type        : <0x89a>
 <1><8d2>: Abbrev Number: 3 (DW_TAG_const_type)
    <8d3>   DW_AT_type        : <0x8c6>
 <1><8d7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x80b): inject_data
    <8dc>   DW_AT_byte_size   : 10
    <8dd>   DW_AT_decl_file   : 18
    <8de>   DW_AT_decl_line   : 241
    <8df>   DW_AT_decl_column : 8
    <8e0>   DW_AT_sibling     : <0x93f>
 <2><8e4>: Abbrev Number: 9 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x4d5): flags
    <8e9>   DW_AT_decl_file   : 18
    <8ea>   DW_AT_decl_line   : 242
    <8eb>   DW_AT_decl_column : 10
    <8ec>   DW_AT_type        : <0xf2>
    <8f0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f3>: Abbrev Number: 9 (DW_TAG_member)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x920): signo
    <8f8>   DW_AT_decl_file   : 18
    <8f9>   DW_AT_decl_line   : 243
    <8fa>   DW_AT_decl_column : 10
    <8fb>   DW_AT_type        : <0xf2>
    <8ff>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><902>: Abbrev Number: 9 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <907>   DW_AT_decl_file   : 18
    <908>   DW_AT_decl_line   : 244
    <909>   DW_AT_decl_column : 11
    <90a>   DW_AT_type        : <0xfe>
    <90e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><911>: Abbrev Number: 9 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0xcd2): delay_idx
    <916>   DW_AT_decl_file   : 18
    <917>   DW_AT_decl_line   : 245
    <918>   DW_AT_decl_column : 11
    <919>   DW_AT_type        : <0xfe>
    <91d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><920>: Abbrev Number: 9 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0x57a): poke_idx
    <925>   DW_AT_decl_file   : 18
    <926>   DW_AT_decl_line   : 246
    <927>   DW_AT_decl_column : 11
    <928>   DW_AT_type        : <0xfe>
    <92c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><92f>: Abbrev Number: 9 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <934>   DW_AT_decl_file   : 18
    <935>   DW_AT_decl_line   : 247
    <936>   DW_AT_decl_column : 11
    <937>   DW_AT_type        : <0xfe>
    <93b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><93e>: Abbrev Number: 0
 <1><93f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <940>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <944>   DW_AT_byte_size   : 16
    <945>   DW_AT_decl_file   : 18
    <946>   DW_AT_decl_line   : 250
    <947>   DW_AT_decl_column : 8
    <948>   DW_AT_sibling     : <0x989>
 <2><94c>: Abbrev Number: 9 (DW_TAG_member)
    <94d>   DW_AT_name        : (indirect string, offset: 0xa19): first
    <951>   DW_AT_decl_file   : 18
    <952>   DW_AT_decl_line   : 251
    <953>   DW_AT_decl_column : 11
    <954>   DW_AT_type        : <0xfe>
    <958>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><95b>: Abbrev Number: 9 (DW_TAG_member)
    <95c>   DW_AT_name        : (indirect string, offset: 0x10dc): last
    <960>   DW_AT_decl_file   : 18
    <961>   DW_AT_decl_line   : 252
    <962>   DW_AT_decl_column : 11
    <963>   DW_AT_type        : <0xfe>
    <967>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><96a>: Abbrev Number: 9 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x3b0): step
    <96f>   DW_AT_decl_file   : 18
    <970>   DW_AT_decl_line   : 253
    <971>   DW_AT_decl_column : 11
    <972>   DW_AT_type        : <0xfe>
    <976>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><979>: Abbrev Number: 9 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x10ae): data
    <97e>   DW_AT_decl_file   : 18
    <97f>   DW_AT_decl_line   : 254
    <980>   DW_AT_decl_column : 21
    <981>   DW_AT_type        : <0x8d7>
    <985>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><988>: Abbrev Number: 0
 <1><989>: Abbrev Number: 15 (DW_TAG_array_type)
    <98a>   DW_AT_type        : <0x545>
    <98e>   DW_AT_sibling     : <0x999>
 <2><992>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <993>   DW_AT_type        : <0x2b>
    <997>   DW_AT_upper_bound : 5
 <2><998>: Abbrev Number: 0
 <1><999>: Abbrev Number: 14 (DW_TAG_structure_type)
    <99a>   DW_AT_name        : (indirect string, offset: 0xee9): staged_output_data
    <99e>   DW_AT_declaration : 1
 <1><99f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a0>   DW_AT_byte_size   : 4
    <9a1>   DW_AT_type        : <0x999>
 <1><9a5>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9a6>   DW_AT_prototyped  : 1
    <9a7>   DW_AT_sibling     : <0x9b1>
 <2><9ab>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ac>   DW_AT_type        : <0xcd>
 <2><9b0>: Abbrev Number: 0
 <1><9b1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b2>   DW_AT_byte_size   : 4
    <9b3>   DW_AT_type        : <0x9a5>
 <1><9b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b8>   DW_AT_byte_size   : 4
    <9b9>   DW_AT_type        : <0x86b>
 <1><9bd>: Abbrev Number: 3 (DW_TAG_const_type)
    <9be>   DW_AT_type        : <0x9b7>
 <1><9c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <9c3>   DW_AT_type        : <0x9d2>
    <9c7>   DW_AT_sibling     : <0x9d2>
 <2><9cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9cc>   DW_AT_type        : <0x2b>
    <9d0>   DW_AT_upper_bound : 2
 <2><9d1>: Abbrev Number: 0
 <1><9d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d3>   DW_AT_byte_size   : 4
    <9d4>   DW_AT_type        : <0x93f>
 <1><9d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9dd>   DW_AT_declaration : 1
 <1><9de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9df>   DW_AT_byte_size   : 4
    <9e0>   DW_AT_type        : <0x9d8>
 <1><9e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x3cb): tcb_wait_data
    <9e9>   DW_AT_declaration : 1
 <1><9ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9eb>   DW_AT_byte_size   : 4
    <9ec>   DW_AT_type        : <0x9e4>
 <1><9f0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <9f5>   DW_AT_declaration : 1
 <1><9f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f7>   DW_AT_byte_size   : 4
    <9f8>   DW_AT_type        : <0x9f0>
 <1><9fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fd>   DW_AT_name        : (indirect string, offset: 0xecd): unwind_queue_t
    <a01>   DW_AT_declaration : 1
 <1><a02>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a03>   DW_AT_byte_size   : 4
    <a04>   DW_AT_type        : <0x9fc>
 <1><a08>: Abbrev Number: 15 (DW_TAG_array_type)
    <a09>   DW_AT_type        : <0xe6>
    <a0d>   DW_AT_sibling     : <0xa18>
 <2><a11>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a12>   DW_AT_type        : <0x2b>
    <a16>   DW_AT_upper_bound : 15
 <2><a17>: Abbrev Number: 0
 <1><a18>: Abbrev Number: 10 (DW_TAG_variable)
    <a19>   DW_AT_name        : (indirect string, offset: 0xb7e): stub_sysent
    <a1d>   DW_AT_decl_file   : 18
    <a1e>   DW_AT_decl_line   : 405
    <a20>   DW_AT_decl_column : 28
    <a21>   DW_AT_type        : <0x86b>
    <a25>   DW_AT_external    : 1
    <a26>   DW_AT_declaration : 1
 <1><a27>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a28>   DW_AT_name        : (indirect string, offset: 0x1091): xlat_type
    <a2c>   DW_AT_encoding    : 7	(unsigned)
    <a2d>   DW_AT_byte_size   : 4
    <a2e>   DW_AT_type        : <0x2b>
    <a32>   DW_AT_decl_file   : 19
    <a33>   DW_AT_decl_line   : 13
    <a34>   DW_AT_decl_column : 6
    <a35>   DW_AT_sibling     : <0xa4c>
 <2><a39>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x2db): XT_NORMAL
    <a3e>   DW_AT_const_value : 0
 <2><a3f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a40>   DW_AT_name        : (indirect string, offset: 0xc4e): XT_SORTED
    <a44>   DW_AT_const_value : 1
 <2><a45>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a46>   DW_AT_name        : (indirect string, offset: 0xdca): XT_INDEXED
    <a4a>   DW_AT_const_value : 2
 <2><a4b>: Abbrev Number: 0
 <1><a4c>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a4d>   DW_AT_name        : (indirect string, offset: 0xbaa): xlat_style
    <a51>   DW_AT_encoding    : 7	(unsigned)
    <a52>   DW_AT_byte_size   : 4
    <a53>   DW_AT_type        : <0x2b>
    <a57>   DW_AT_decl_file   : 19
    <a58>   DW_AT_decl_line   : 19
    <a59>   DW_AT_decl_column : 6
    <a5a>   DW_AT_sibling     : <0xa89>
 <2><a5e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a63>   DW_AT_const_value : 0
 <2><a64>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a65>   DW_AT_name        : (indirect string, offset: 0xbdd): XLAT_STYLE_RAW
    <a69>   DW_AT_const_value : 1
 <2><a6a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x105c): XLAT_STYLE_ABBREV
    <a6f>   DW_AT_const_value : 2
 <2><a70>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a71>   DW_AT_name        : (indirect string, offset: 0x2f8): XLAT_STYLE_VERBOSE
    <a75>   DW_AT_const_value : 3
 <2><a76>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a77>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a7b>   DW_AT_const_value : 0
 <2><a7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a81>   DW_AT_const_value : 4
 <2><a82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0x10cb): XLAT_STYLE_FMT_D
    <a87>   DW_AT_const_value : 8
 <2><a88>: Abbrev Number: 0
 <1><a89>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x333): xlat_data
    <a8e>   DW_AT_byte_size   : 12
    <a8f>   DW_AT_decl_file   : 19
    <a90>   DW_AT_decl_line   : 51
    <a91>   DW_AT_decl_column : 8
    <a92>   DW_AT_sibling     : <0xab5>
 <2><a96>: Abbrev Number: 18 (DW_TAG_member)
    <a97>   DW_AT_name        : val
    <a9b>   DW_AT_decl_file   : 19
    <a9c>   DW_AT_decl_line   : 52
    <a9d>   DW_AT_decl_column : 11
    <a9e>   DW_AT_type        : <0x116>
    <aa2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aa5>: Abbrev Number: 18 (DW_TAG_member)
    <aa6>   DW_AT_name        : str
    <aaa>   DW_AT_decl_file   : 19
    <aab>   DW_AT_decl_line   : 53
    <aac>   DW_AT_decl_column : 14
    <aad>   DW_AT_type        : <0x1c9>
    <ab1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ab4>: Abbrev Number: 0
 <1><ab5>: Abbrev Number: 3 (DW_TAG_const_type)
    <ab6>   DW_AT_type        : <0xa89>
 <1><aba>: Abbrev Number: 8 (DW_TAG_structure_type)
    <abb>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <abf>   DW_AT_byte_size   : 24
    <ac0>   DW_AT_decl_file   : 19
    <ac1>   DW_AT_decl_line   : 56
    <ac2>   DW_AT_decl_column : 8
    <ac3>   DW_AT_sibling     : <0xb13>
 <2><ac7>: Abbrev Number: 9 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x10ae): data
    <acc>   DW_AT_decl_file   : 19
    <acd>   DW_AT_decl_line   : 57
    <ace>   DW_AT_decl_column : 26
    <acf>   DW_AT_type        : <0xb18>
    <ad3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad6>: Abbrev Number: 9 (DW_TAG_member)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x869): flags_strsz
    <adb>   DW_AT_decl_file   : 19
    <adc>   DW_AT_decl_line   : 58
    <add>   DW_AT_decl_column : 9
    <ade>   DW_AT_type        : <0x122>
    <ae2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ae5>: Abbrev Number: 9 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0xb4f): size
    <aea>   DW_AT_decl_file   : 19
    <aeb>   DW_AT_decl_line   : 59
    <aec>   DW_AT_decl_column : 11
    <aed>   DW_AT_type        : <0x10a>
    <af1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><af4>: Abbrev Number: 9 (DW_TAG_member)
    <af5>   DW_AT_name        : (indirect string, offset: 0x187): type
    <af9>   DW_AT_decl_file   : 19
    <afa>   DW_AT_decl_line   : 60
    <afb>   DW_AT_decl_column : 17
    <afc>   DW_AT_type        : <0xa27>
    <b00>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b03>: Abbrev Number: 9 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0x737): flags_mask
    <b08>   DW_AT_decl_file   : 19
    <b09>   DW_AT_decl_line   : 61
    <b0a>   DW_AT_decl_column : 11
    <b0b>   DW_AT_type        : <0x116>
    <b0f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b12>: Abbrev Number: 0
 <1><b13>: Abbrev Number: 3 (DW_TAG_const_type)
    <b14>   DW_AT_type        : <0xaba>
 <1><b18>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b19>   DW_AT_byte_size   : 4
    <b1a>   DW_AT_type        : <0xab5>
 <1><b1e>: Abbrev Number: 15 (DW_TAG_array_type)
    <b1f>   DW_AT_type        : <0xb13>
    <b23>   DW_AT_sibling     : <0xb29>
 <2><b27>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b28>: Abbrev Number: 0
 <1><b29>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2a>   DW_AT_type        : <0xb1e>
 <1><b2e>: Abbrev Number: 10 (DW_TAG_variable)
    <b2f>   DW_AT_name        : (indirect string, offset: 0xe33): addrfams
    <b33>   DW_AT_decl_file   : 18
    <b34>   DW_AT_decl_line   : 411
    <b36>   DW_AT_decl_column : 26
    <b37>   DW_AT_type        : <0xb29>
    <b3b>   DW_AT_external    : 1
    <b3c>   DW_AT_declaration : 1
 <1><b3d>: Abbrev Number: 10 (DW_TAG_variable)
    <b3e>   DW_AT_name        : (indirect string, offset: 0xd17): arp_hardware_types
    <b42>   DW_AT_decl_file   : 18
    <b43>   DW_AT_decl_line   : 412
    <b45>   DW_AT_decl_column : 26
    <b46>   DW_AT_type        : <0xb29>
    <b4a>   DW_AT_external    : 1
    <b4b>   DW_AT_declaration : 1
 <1><b4c>: Abbrev Number: 10 (DW_TAG_variable)
    <b4d>   DW_AT_name        : (indirect string, offset: 0xfe2): at_flags
    <b51>   DW_AT_decl_file   : 18
    <b52>   DW_AT_decl_line   : 413
    <b54>   DW_AT_decl_column : 26
    <b55>   DW_AT_type        : <0xb29>
    <b59>   DW_AT_external    : 1
    <b5a>   DW_AT_declaration : 1
 <1><b5b>: Abbrev Number: 10 (DW_TAG_variable)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x497): clocknames
    <b60>   DW_AT_decl_file   : 18
    <b61>   DW_AT_decl_line   : 414
    <b63>   DW_AT_decl_column : 26
    <b64>   DW_AT_type        : <0xb29>
    <b68>   DW_AT_external    : 1
    <b69>   DW_AT_declaration : 1
 <1><b6a>: Abbrev Number: 10 (DW_TAG_variable)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xf99): dirent_types
    <b6f>   DW_AT_decl_file   : 18
    <b70>   DW_AT_decl_line   : 415
    <b72>   DW_AT_decl_column : 26
    <b73>   DW_AT_type        : <0xb29>
    <b77>   DW_AT_external    : 1
    <b78>   DW_AT_declaration : 1
 <1><b79>: Abbrev Number: 10 (DW_TAG_variable)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x8ba): ethernet_protocols
    <b7e>   DW_AT_decl_file   : 18
    <b7f>   DW_AT_decl_line   : 416
    <b81>   DW_AT_decl_column : 26
    <b82>   DW_AT_type        : <0xb29>
    <b86>   DW_AT_external    : 1
    <b87>   DW_AT_declaration : 1
 <1><b88>: Abbrev Number: 10 (DW_TAG_variable)
    <b89>   DW_AT_name        : (indirect string, offset: 0x5cd): inet_protocols
    <b8d>   DW_AT_decl_file   : 18
    <b8e>   DW_AT_decl_line   : 417
    <b90>   DW_AT_decl_column : 26
    <b91>   DW_AT_type        : <0xb29>
    <b95>   DW_AT_external    : 1
    <b96>   DW_AT_declaration : 1
 <1><b97>: Abbrev Number: 10 (DW_TAG_variable)
    <b98>   DW_AT_name        : (indirect string, offset: 0x2a3): evdev_abs
    <b9c>   DW_AT_decl_file   : 18
    <b9d>   DW_AT_decl_line   : 418
    <b9f>   DW_AT_decl_column : 26
    <ba0>   DW_AT_type        : <0xb29>
    <ba4>   DW_AT_external    : 1
    <ba5>   DW_AT_declaration : 1
 <1><ba6>: Abbrev Number: 10 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x72c): audit_arch
    <bab>   DW_AT_decl_file   : 18
    <bac>   DW_AT_decl_line   : 419
    <bae>   DW_AT_decl_column : 26
    <baf>   DW_AT_type        : <0xb29>
    <bb3>   DW_AT_external    : 1
    <bb4>   DW_AT_declaration : 1
 <1><bb5>: Abbrev Number: 10 (DW_TAG_variable)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bba>   DW_AT_decl_file   : 18
    <bbb>   DW_AT_decl_line   : 420
    <bbd>   DW_AT_decl_column : 26
    <bbe>   DW_AT_type        : <0xb29>
    <bc2>   DW_AT_external    : 1
    <bc3>   DW_AT_declaration : 1
 <1><bc4>: Abbrev Number: 10 (DW_TAG_variable)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x478): iffflags
    <bc9>   DW_AT_decl_file   : 18
    <bca>   DW_AT_decl_line   : 421
    <bcc>   DW_AT_decl_column : 26
    <bcd>   DW_AT_type        : <0xb29>
    <bd1>   DW_AT_external    : 1
    <bd2>   DW_AT_declaration : 1
 <1><bd3>: Abbrev Number: 10 (DW_TAG_variable)
    <bd4>   DW_AT_name        : (indirect string, offset: 0xbec): ip_type_of_services
    <bd8>   DW_AT_decl_file   : 18
    <bd9>   DW_AT_decl_line   : 422
    <bdb>   DW_AT_decl_column : 26
    <bdc>   DW_AT_type        : <0xb29>
    <be0>   DW_AT_external    : 1
    <be1>   DW_AT_declaration : 1
 <1><be2>: Abbrev Number: 10 (DW_TAG_variable)
    <be3>   DW_AT_name        : (indirect string, offset: 0x6bf): ipc_private
    <be7>   DW_AT_decl_file   : 18
    <be8>   DW_AT_decl_line   : 423
    <bea>   DW_AT_decl_column : 26
    <beb>   DW_AT_type        : <0xb29>
    <bef>   DW_AT_external    : 1
    <bf0>   DW_AT_declaration : 1
 <1><bf1>: Abbrev Number: 10 (DW_TAG_variable)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x31f): msg_flags
    <bf6>   DW_AT_decl_file   : 18
    <bf7>   DW_AT_decl_line   : 424
    <bf9>   DW_AT_decl_column : 26
    <bfa>   DW_AT_type        : <0xb29>
    <bfe>   DW_AT_external    : 1
    <bff>   DW_AT_declaration : 1
 <1><c00>: Abbrev Number: 10 (DW_TAG_variable)
    <c01>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c05>   DW_AT_decl_file   : 18
    <c06>   DW_AT_decl_line   : 425
    <c08>   DW_AT_decl_column : 26
    <c09>   DW_AT_type        : <0xb29>
    <c0d>   DW_AT_external    : 1
    <c0e>   DW_AT_declaration : 1
 <1><c0f>: Abbrev Number: 10 (DW_TAG_variable)
    <c10>   DW_AT_name        : (indirect string, offset: 0xefc): nl_bridge_vlan_flags
    <c14>   DW_AT_decl_file   : 18
    <c15>   DW_AT_decl_line   : 426
    <c17>   DW_AT_decl_column : 26
    <c18>   DW_AT_type        : <0xb29>
    <c1c>   DW_AT_external    : 1
    <c1d>   DW_AT_declaration : 1
 <1><c1e>: Abbrev Number: 10 (DW_TAG_variable)
    <c1f>   DW_AT_name        : (indirect string, offset: 0xdb3): nl_netfilter_msg_types
    <c23>   DW_AT_decl_file   : 18
    <c24>   DW_AT_decl_line   : 427
    <c26>   DW_AT_decl_column : 26
    <c27>   DW_AT_type        : <0xb29>
    <c2b>   DW_AT_external    : 1
    <c2c>   DW_AT_declaration : 1
 <1><c2d>: Abbrev Number: 10 (DW_TAG_variable)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x45a): nl_route_types
    <c32>   DW_AT_decl_file   : 18
    <c33>   DW_AT_decl_line   : 428
    <c35>   DW_AT_decl_column : 26
    <c36>   DW_AT_type        : <0xb29>
    <c3a>   DW_AT_external    : 1
    <c3b>   DW_AT_declaration : 1
 <1><c3c>: Abbrev Number: 10 (DW_TAG_variable)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xe6a): open_access_modes
    <c41>   DW_AT_decl_file   : 18
    <c42>   DW_AT_decl_line   : 429
    <c44>   DW_AT_decl_column : 26
    <c45>   DW_AT_type        : <0xb29>
    <c49>   DW_AT_external    : 1
    <c4a>   DW_AT_declaration : 1
 <1><c4b>: Abbrev Number: 10 (DW_TAG_variable)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c50>   DW_AT_decl_file   : 18
    <c51>   DW_AT_decl_line   : 430
    <c53>   DW_AT_decl_column : 26
    <c54>   DW_AT_type        : <0xb29>
    <c58>   DW_AT_external    : 1
    <c59>   DW_AT_declaration : 1
 <1><c5a>: Abbrev Number: 10 (DW_TAG_variable)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xc1d): perf_type_id
    <c5f>   DW_AT_decl_file   : 18
    <c60>   DW_AT_decl_line   : 431
    <c62>   DW_AT_decl_column : 26
    <c63>   DW_AT_type        : <0xb29>
    <c67>   DW_AT_external    : 1
    <c68>   DW_AT_declaration : 1
 <1><c69>: Abbrev Number: 10 (DW_TAG_variable)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xe3c): pollflags
    <c6e>   DW_AT_decl_file   : 18
    <c6f>   DW_AT_decl_line   : 432
    <c71>   DW_AT_decl_column : 26
    <c72>   DW_AT_type        : <0xb29>
    <c76>   DW_AT_external    : 1
    <c77>   DW_AT_declaration : 1
 <1><c78>: Abbrev Number: 10 (DW_TAG_variable)
    <c79>   DW_AT_name        : (indirect string, offset: 0x56e): ptrace_cmds
    <c7d>   DW_AT_decl_file   : 18
    <c7e>   DW_AT_decl_line   : 433
    <c80>   DW_AT_decl_column : 26
    <c81>   DW_AT_type        : <0xb29>
    <c85>   DW_AT_external    : 1
    <c86>   DW_AT_declaration : 1
 <1><c87>: Abbrev Number: 10 (DW_TAG_variable)
    <c88>   DW_AT_name        : (indirect string, offset: 0x7fc): resource_flags
    <c8c>   DW_AT_decl_file   : 18
    <c8d>   DW_AT_decl_line   : 434
    <c8f>   DW_AT_decl_column : 26
    <c90>   DW_AT_type        : <0xb29>
    <c94>   DW_AT_external    : 1
    <c95>   DW_AT_declaration : 1
 <1><c96>: Abbrev Number: 10 (DW_TAG_variable)
    <c97>   DW_AT_name        : (indirect string, offset: 0x279): route_nexthop_flags
    <c9b>   DW_AT_decl_file   : 18
    <c9c>   DW_AT_decl_line   : 435
    <c9e>   DW_AT_decl_column : 26
    <c9f>   DW_AT_type        : <0xb29>
    <ca3>   DW_AT_external    : 1
    <ca4>   DW_AT_declaration : 1
 <1><ca5>: Abbrev Number: 10 (DW_TAG_variable)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xe87): routing_protocols
    <caa>   DW_AT_decl_file   : 18
    <cab>   DW_AT_decl_line   : 436
    <cad>   DW_AT_decl_column : 26
    <cae>   DW_AT_type        : <0xb29>
    <cb2>   DW_AT_external    : 1
    <cb3>   DW_AT_declaration : 1
 <1><cb4>: Abbrev Number: 10 (DW_TAG_variable)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x469): routing_scopes
    <cb9>   DW_AT_decl_file   : 18
    <cba>   DW_AT_decl_line   : 437
    <cbc>   DW_AT_decl_column : 26
    <cbd>   DW_AT_type        : <0xb29>
    <cc1>   DW_AT_external    : 1
    <cc2>   DW_AT_declaration : 1
 <1><cc3>: Abbrev Number: 10 (DW_TAG_variable)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xda1): routing_table_ids
    <cc8>   DW_AT_decl_file   : 18
    <cc9>   DW_AT_decl_line   : 438
    <ccb>   DW_AT_decl_column : 26
    <ccc>   DW_AT_type        : <0xb29>
    <cd0>   DW_AT_external    : 1
    <cd1>   DW_AT_declaration : 1
 <1><cd2>: Abbrev Number: 10 (DW_TAG_variable)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x69c): routing_types
    <cd7>   DW_AT_decl_file   : 18
    <cd8>   DW_AT_decl_line   : 439
    <cda>   DW_AT_decl_column : 26
    <cdb>   DW_AT_type        : <0xb29>
    <cdf>   DW_AT_external    : 1
    <ce0>   DW_AT_declaration : 1
 <1><ce1>: Abbrev Number: 10 (DW_TAG_variable)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x1ab): rwf_flags
    <ce6>   DW_AT_decl_file   : 18
    <ce7>   DW_AT_decl_line   : 440
    <ce9>   DW_AT_decl_column : 26
    <cea>   DW_AT_type        : <0xb29>
    <cee>   DW_AT_external    : 1
    <cef>   DW_AT_declaration : 1
 <1><cf0>: Abbrev Number: 10 (DW_TAG_variable)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x834): seccomp_filter_flags
    <cf5>   DW_AT_decl_file   : 18
    <cf6>   DW_AT_decl_line   : 441
    <cf8>   DW_AT_decl_column : 26
    <cf9>   DW_AT_type        : <0xb29>
    <cfd>   DW_AT_external    : 1
    <cfe>   DW_AT_declaration : 1
 <1><cff>: Abbrev Number: 10 (DW_TAG_variable)
    <d00>   DW_AT_name        : (indirect string, offset: 0x2e5): seccomp_ret_action
    <d04>   DW_AT_decl_file   : 18
    <d05>   DW_AT_decl_line   : 442
    <d07>   DW_AT_decl_column : 26
    <d08>   DW_AT_type        : <0xb29>
    <d0c>   DW_AT_external    : 1
    <d0d>   DW_AT_declaration : 1
 <1><d0e>: Abbrev Number: 10 (DW_TAG_variable)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x435): setns_types
    <d13>   DW_AT_decl_file   : 18
    <d14>   DW_AT_decl_line   : 443
    <d16>   DW_AT_decl_column : 26
    <d17>   DW_AT_type        : <0xb29>
    <d1b>   DW_AT_external    : 1
    <d1c>   DW_AT_declaration : 1
 <1><d1d>: Abbrev Number: 10 (DW_TAG_variable)
    <d1e>   DW_AT_name        : (indirect string, offset: 0xe28): sg_io_info
    <d22>   DW_AT_decl_file   : 18
    <d23>   DW_AT_decl_line   : 444
    <d25>   DW_AT_decl_column : 26
    <d26>   DW_AT_type        : <0xb29>
    <d2a>   DW_AT_external    : 1
    <d2b>   DW_AT_declaration : 1
 <1><d2c>: Abbrev Number: 10 (DW_TAG_variable)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xb92): socketlayers
    <d31>   DW_AT_decl_file   : 18
    <d32>   DW_AT_decl_line   : 445
    <d34>   DW_AT_decl_column : 26
    <d35>   DW_AT_type        : <0xb29>
    <d39>   DW_AT_external    : 1
    <d3a>   DW_AT_declaration : 1
 <1><d3b>: Abbrev Number: 10 (DW_TAG_variable)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xd8b): socktypes
    <d40>   DW_AT_decl_file   : 18
    <d41>   DW_AT_decl_line   : 446
    <d43>   DW_AT_decl_column : 26
    <d44>   DW_AT_type        : <0xb29>
    <d48>   DW_AT_external    : 1
    <d49>   DW_AT_declaration : 1
 <1><d4a>: Abbrev Number: 10 (DW_TAG_variable)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xa6c): tcp_state_flags
    <d4f>   DW_AT_decl_file   : 18
    <d50>   DW_AT_decl_line   : 447
    <d52>   DW_AT_decl_column : 26
    <d53>   DW_AT_type        : <0xb29>
    <d57>   DW_AT_external    : 1
    <d58>   DW_AT_declaration : 1
 <1><d59>: Abbrev Number: 10 (DW_TAG_variable)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x761): tcp_states
    <d5e>   DW_AT_decl_file   : 18
    <d5f>   DW_AT_decl_line   : 448
    <d61>   DW_AT_decl_column : 26
    <d62>   DW_AT_type        : <0xb29>
    <d66>   DW_AT_external    : 1
    <d67>   DW_AT_declaration : 1
 <1><d68>: Abbrev Number: 10 (DW_TAG_variable)
    <d69>   DW_AT_name        : (indirect string, offset: 0x103f): whence_codes
    <d6d>   DW_AT_decl_file   : 18
    <d6e>   DW_AT_decl_line   : 449
    <d70>   DW_AT_decl_column : 26
    <d71>   DW_AT_type        : <0xb29>
    <d75>   DW_AT_external    : 1
    <d76>   DW_AT_declaration : 1
 <1><d77>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d78>   DW_AT_encoding    : 7	(unsigned)
    <d79>   DW_AT_byte_size   : 4
    <d7a>   DW_AT_type        : <0x2b>
    <d7e>   DW_AT_decl_file   : 18
    <d7f>   DW_AT_decl_line   : 510
    <d81>   DW_AT_decl_column : 14
    <d82>   DW_AT_sibling     : <0xd99>
 <2><d86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d87>   DW_AT_name        : (indirect string, offset: 0x98a): CFLAG_NONE
    <d8b>   DW_AT_const_value : 0
 <2><d8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x8cd): CFLAG_ONLY_STATS
    <d91>   DW_AT_const_value : 1
 <2><d92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d93>   DW_AT_name        : (indirect string, offset: 0xb9f): CFLAG_BOTH
    <d97>   DW_AT_const_value : 2
 <2><d98>: Abbrev Number: 0
 <1><d99>: Abbrev Number: 28 (DW_TAG_typedef)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x10e1): cflag_t
    <d9e>   DW_AT_decl_file   : 18
    <d9f>   DW_AT_decl_line   : 514
    <da1>   DW_AT_decl_column : 3
    <da2>   DW_AT_type        : <0xd77>
 <1><da6>: Abbrev Number: 10 (DW_TAG_variable)
    <da7>   DW_AT_name        : (indirect string, offset: 0xccc): cflag
    <dab>   DW_AT_decl_file   : 18
    <dac>   DW_AT_decl_line   : 515
    <dae>   DW_AT_decl_column : 16
    <daf>   DW_AT_type        : <0xd99>
    <db3>   DW_AT_external    : 1
    <db4>   DW_AT_declaration : 1
 <1><db5>: Abbrev Number: 10 (DW_TAG_variable)
    <db6>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <dba>   DW_AT_decl_file   : 18
    <dbb>   DW_AT_decl_line   : 516
    <dbd>   DW_AT_decl_column : 13
    <dbe>   DW_AT_type        : <0x515>
    <dc2>   DW_AT_external    : 1
    <dc3>   DW_AT_declaration : 1
 <1><dc4>: Abbrev Number: 10 (DW_TAG_variable)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x7b7): Tflag_scale
    <dc9>   DW_AT_decl_file   : 18
    <dca>   DW_AT_decl_line   : 517
    <dcc>   DW_AT_decl_column : 12
    <dcd>   DW_AT_type        : <0x64>
    <dd1>   DW_AT_external    : 1
    <dd2>   DW_AT_declaration : 1
 <1><dd3>: Abbrev Number: 10 (DW_TAG_variable)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x849): Tflag_width
    <dd8>   DW_AT_decl_file   : 18
    <dd9>   DW_AT_decl_line   : 518
    <ddb>   DW_AT_decl_column : 12
    <ddc>   DW_AT_type        : <0x64>
    <de0>   DW_AT_external    : 1
    <de1>   DW_AT_declaration : 1
 <1><de2>: Abbrev Number: 10 (DW_TAG_variable)
    <de3>   DW_AT_name        : (indirect string, offset: 0xe1a): iflag
    <de7>   DW_AT_decl_file   : 18
    <de8>   DW_AT_decl_line   : 519
    <dea>   DW_AT_decl_column : 13
    <deb>   DW_AT_type        : <0x515>
    <def>   DW_AT_external    : 1
    <df0>   DW_AT_declaration : 1
 <1><df1>: Abbrev Number: 10 (DW_TAG_variable)
    <df2>   DW_AT_name        : (indirect string, offset: 0x5ae): count_wallclock
    <df6>   DW_AT_decl_file   : 18
    <df7>   DW_AT_decl_line   : 520
    <df9>   DW_AT_decl_column : 13
    <dfa>   DW_AT_type        : <0x515>
    <dfe>   DW_AT_external    : 1
    <dff>   DW_AT_declaration : 1
 <1><e00>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e01>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e05>   DW_AT_byte_size   : 4
    <e06>   DW_AT_decl_file   : 18
    <e07>   DW_AT_decl_line   : 522
    <e09>   DW_AT_decl_column : 8
    <e0a>   DW_AT_sibling     : <0xe1f>
 <2><e0e>: Abbrev Number: 22 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e13>   DW_AT_decl_file   : 18
    <e14>   DW_AT_decl_line   : 523
    <e16>   DW_AT_decl_column : 14
    <e17>   DW_AT_type        : <0x1c9>
    <e1b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e1e>: Abbrev Number: 0
 <1><e1f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e20>   DW_AT_name        : (indirect string, offset: 0x76c): path_set
    <e24>   DW_AT_byte_size   : 12
    <e25>   DW_AT_decl_file   : 18
    <e26>   DW_AT_decl_line   : 527
    <e28>   DW_AT_decl_column : 15
    <e29>   DW_AT_sibling     : <0xe5e>
 <2><e2d>: Abbrev Number: 22 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x6fa): paths_selected
    <e32>   DW_AT_decl_file   : 18
    <e33>   DW_AT_decl_line   : 528
    <e35>   DW_AT_decl_column : 24
    <e36>   DW_AT_type        : <0xe5e>
    <e3a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e3d>: Abbrev Number: 22 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x1032): num_selected
    <e42>   DW_AT_decl_file   : 18
    <e43>   DW_AT_decl_line   : 529
    <e45>   DW_AT_decl_column : 9
    <e46>   DW_AT_type        : <0x122>
    <e4a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e4d>: Abbrev Number: 22 (DW_TAG_member)
    <e4e>   DW_AT_name        : (indirect string, offset: 0xb4f): size
    <e52>   DW_AT_decl_file   : 18
    <e53>   DW_AT_decl_line   : 530
    <e55>   DW_AT_decl_column : 9
    <e56>   DW_AT_type        : <0x122>
    <e5a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e5d>: Abbrev Number: 0
 <1><e5e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e5f>   DW_AT_byte_size   : 4
    <e60>   DW_AT_type        : <0xe00>
 <1><e64>: Abbrev Number: 10 (DW_TAG_variable)
    <e65>   DW_AT_name        : (indirect string, offset: 0x1081): global_path_set
    <e69>   DW_AT_decl_file   : 18
    <e6a>   DW_AT_decl_line   : 531
    <e6c>   DW_AT_decl_column : 3
    <e6d>   DW_AT_type        : <0xe1f>
    <e71>   DW_AT_external    : 1
    <e72>   DW_AT_declaration : 1
 <1><e73>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e74>   DW_AT_name        : (indirect string, offset: 0xf74): xflag_opts
    <e78>   DW_AT_encoding    : 7	(unsigned)
    <e79>   DW_AT_byte_size   : 4
    <e7a>   DW_AT_type        : <0x2b>
    <e7e>   DW_AT_decl_file   : 18
    <e7f>   DW_AT_decl_line   : 533
    <e81>   DW_AT_decl_column : 6
    <e82>   DW_AT_sibling     : <0xea5>
 <2><e86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e87>   DW_AT_name        : (indirect string, offset: 0xa0d): HEXSTR_NONE
    <e8b>   DW_AT_const_value : 0
 <2><e8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8d>   DW_AT_name        : (indirect string, offset: 0xfc4): HEXSTR_NON_ASCII
    <e91>   DW_AT_const_value : 1
 <2><e92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e93>   DW_AT_name        : (indirect string, offset: 0x90b): HEXSTR_ALL
    <e97>   DW_AT_const_value : 2
 <2><e98>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e99>   DW_AT_name        : (indirect string, offset: 0x685): HEXSTR_NON_ASCII_CHARS
    <e9d>   DW_AT_const_value : 3
 <2><e9e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x104c): NUM_HEXSTR_OPTS
    <ea3>   DW_AT_const_value : 4
 <2><ea4>: Abbrev Number: 0
 <1><ea5>: Abbrev Number: 10 (DW_TAG_variable)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xdf4): xflag
    <eaa>   DW_AT_decl_file   : 18
    <eab>   DW_AT_decl_line   : 546
    <ead>   DW_AT_decl_column : 17
    <eae>   DW_AT_type        : <0x2b>
    <eb2>   DW_AT_external    : 1
    <eb3>   DW_AT_declaration : 1
 <1><eb4>: Abbrev Number: 10 (DW_TAG_variable)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xc87): followfork
    <eb9>   DW_AT_decl_file   : 18
    <eba>   DW_AT_decl_line   : 547
    <ebc>   DW_AT_decl_column : 13
    <ebd>   DW_AT_type        : <0x515>
    <ec1>   DW_AT_external    : 1
    <ec2>   DW_AT_declaration : 1
 <1><ec3>: Abbrev Number: 10 (DW_TAG_variable)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x33d): output_separately
    <ec8>   DW_AT_decl_file   : 18
    <ec9>   DW_AT_decl_line   : 548
    <ecb>   DW_AT_decl_column : 13
    <ecc>   DW_AT_type        : <0x515>
    <ed0>   DW_AT_external    : 1
    <ed1>   DW_AT_declaration : 1
 <1><ed2>: Abbrev Number: 10 (DW_TAG_variable)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x212): stack_trace_enabled
    <ed7>   DW_AT_decl_file   : 18
    <ed8>   DW_AT_decl_line   : 551
    <eda>   DW_AT_decl_column : 13
    <edb>   DW_AT_type        : <0x515>
    <edf>   DW_AT_external    : 1
    <ee0>   DW_AT_declaration : 1
 <1><ee1>: Abbrev Number: 10 (DW_TAG_variable)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x673): ptrace_setoptions
    <ee6>   DW_AT_decl_file   : 18
    <ee7>   DW_AT_decl_line   : 555
    <ee9>   DW_AT_decl_column : 17
    <eea>   DW_AT_type        : <0x2b>
    <eee>   DW_AT_external    : 1
    <eef>   DW_AT_declaration : 1
 <1><ef0>: Abbrev Number: 10 (DW_TAG_variable)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xa02): max_strlen
    <ef5>   DW_AT_decl_file   : 18
    <ef6>   DW_AT_decl_line   : 556
    <ef8>   DW_AT_decl_column : 17
    <ef9>   DW_AT_type        : <0x2b>
    <efd>   DW_AT_external    : 1
    <efe>   DW_AT_declaration : 1
 <1><eff>: Abbrev Number: 10 (DW_TAG_variable)
    <f00>   DW_AT_name        : (indirect string, offset: 0xa46): os_release
    <f04>   DW_AT_decl_file   : 18
    <f05>   DW_AT_decl_line   : 557
    <f07>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0x2b>
    <f0c>   DW_AT_external    : 1
    <f0d>   DW_AT_declaration : 1
 <1><f0e>: Abbrev Number: 10 (DW_TAG_variable)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x709): xlat_verbosity
    <f13>   DW_AT_decl_file   : 18
    <f14>   DW_AT_decl_line   : 919
    <f16>   DW_AT_decl_column : 24
    <f17>   DW_AT_type        : <0xa4c>
    <f1b>   DW_AT_external    : 1
    <f1c>   DW_AT_declaration : 1
 <1><f1d>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x591): xlat_style_private_flag_bits
    <f22>   DW_AT_encoding    : 7	(unsigned)
    <f23>   DW_AT_byte_size   : 4
    <f24>   DW_AT_type        : <0x2b>
    <f28>   DW_AT_decl_file   : 18
    <f29>   DW_AT_decl_line   : 939
    <f2b>   DW_AT_decl_column : 6
    <f2c>   DW_AT_sibling     : <0xf49>
 <2><f30>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0x28d): PAF_PRINT_INDICES_BIT
    <f35>   DW_AT_const_value : 5
 <2><f36>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0xb06): PAF_ARRAY_TRUNCATED_BIT
    <f3b>   DW_AT_const_value : 6
 <2><f3c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x3f5): PXF_DEFAULT_STR_BIT
    <f41>   DW_AT_const_value : 7
 <2><f42>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0xc61): SPFF_AUXSTR_MODE_BIT
    <f47>   DW_AT_const_value : 8
 <2><f48>: Abbrev Number: 0
 <1><f49>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xd2a): find_xlat_flag_bits
    <f4e>   DW_AT_encoding    : 7	(unsigned)
    <f4f>   DW_AT_byte_size   : 4
    <f50>   DW_AT_type        : <0x2b>
    <f54>   DW_AT_decl_file   : 18
    <f55>   DW_AT_decl_line   : 1443
    <f57>   DW_AT_decl_column : 6
    <f58>   DW_AT_sibling     : <0xf63>
 <2><f5c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x948): FXL_CASE_SENSITIVE_BIT
    <f61>   DW_AT_const_value : 0
 <2><f62>: Abbrev Number: 0
 <1><f63>: Abbrev Number: 10 (DW_TAG_variable)
    <f64>   DW_AT_name        : (indirect string, offset: 0x9de): printing_tcp
    <f68>   DW_AT_decl_file   : 18
    <f69>   DW_AT_decl_line   : 1689
    <f6b>   DW_AT_decl_column : 20
    <f6c>   DW_AT_type        : <0x5f1>
    <f70>   DW_AT_external    : 1
    <f71>   DW_AT_declaration : 1
 <1><f72>: Abbrev Number: 10 (DW_TAG_variable)
    <f73>   DW_AT_name        : (indirect string, offset: 0x540): errnoent
    <f77>   DW_AT_decl_file   : 18
    <f78>   DW_AT_decl_line   : 1887
    <f7a>   DW_AT_decl_column : 26
    <f7b>   DW_AT_type        : <0x449>
    <f7f>   DW_AT_external    : 1
    <f80>   DW_AT_declaration : 1
 <1><f81>: Abbrev Number: 10 (DW_TAG_variable)
    <f82>   DW_AT_name        : (indirect string, offset: 0x855): signalent
    <f86>   DW_AT_decl_file   : 18
    <f87>   DW_AT_decl_line   : 1888
    <f89>   DW_AT_decl_column : 26
    <f8a>   DW_AT_type        : <0x449>
    <f8e>   DW_AT_external    : 1
    <f8f>   DW_AT_declaration : 1
 <1><f90>: Abbrev Number: 10 (DW_TAG_variable)
    <f91>   DW_AT_name        : (indirect string, offset: 0xe62): nerrnos
    <f95>   DW_AT_decl_file   : 18
    <f96>   DW_AT_decl_line   : 1889
    <f98>   DW_AT_decl_column : 27
    <f99>   DW_AT_type        : <0x32>
    <f9d>   DW_AT_external    : 1
    <f9e>   DW_AT_declaration : 1
 <1><f9f>: Abbrev Number: 10 (DW_TAG_variable)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x101b): nsignals
    <fa4>   DW_AT_decl_file   : 18
    <fa5>   DW_AT_decl_line   : 1890
    <fa7>   DW_AT_decl_column : 27
    <fa8>   DW_AT_type        : <0x32>
    <fac>   DW_AT_external    : 1
    <fad>   DW_AT_declaration : 1
 <1><fae>: Abbrev Number: 15 (DW_TAG_array_type)
    <faf>   DW_AT_type        : <0x86b>
    <fb3>   DW_AT_sibling     : <0xfb9>
 <2><fb7>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fb8>: Abbrev Number: 0
 <1><fb9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fba>   DW_AT_type        : <0xfae>
 <1><fbe>: Abbrev Number: 10 (DW_TAG_variable)
    <fbf>   DW_AT_name        : (indirect string, offset: 0xcf5): sysent0
    <fc3>   DW_AT_decl_file   : 18
    <fc4>   DW_AT_decl_line   : 1892
    <fc6>   DW_AT_decl_column : 28
    <fc7>   DW_AT_type        : <0xfb9>
    <fcb>   DW_AT_external    : 1
    <fcc>   DW_AT_declaration : 1
 <1><fcd>: Abbrev Number: 15 (DW_TAG_array_type)
    <fce>   DW_AT_type        : <0x8d2>
    <fd2>   DW_AT_sibling     : <0xfd8>
 <2><fd6>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd7>: Abbrev Number: 0
 <1><fd8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd9>   DW_AT_type        : <0xfcd>
 <1><fdd>: Abbrev Number: 10 (DW_TAG_variable)
    <fde>   DW_AT_name        : (indirect string, offset: 0x1077): ioctlent0
    <fe2>   DW_AT_decl_file   : 18
    <fe3>   DW_AT_decl_line   : 1893
    <fe5>   DW_AT_decl_column : 30
    <fe6>   DW_AT_type        : <0xfd8>
    <fea>   DW_AT_external    : 1
    <feb>   DW_AT_declaration : 1
 <1><fec>: Abbrev Number: 10 (DW_TAG_variable)
    <fed>   DW_AT_name        : (indirect string, offset: 0xf7f): personality_names
    <ff1>   DW_AT_decl_file   : 18
    <ff2>   DW_AT_decl_line   : 1895
    <ff4>   DW_AT_decl_column : 26
    <ff5>   DW_AT_type        : <0x449>
    <ff9>   DW_AT_external    : 1
    <ffa>   DW_AT_declaration : 1
 <1><ffb>: Abbrev Number: 10 (DW_TAG_variable)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x875): sysent
    <1000>   DW_AT_decl_file   : 18
    <1001>   DW_AT_decl_line   : 1898
    <1003>   DW_AT_decl_column : 29
    <1004>   DW_AT_type        : <0x9b7>
    <1008>   DW_AT_external    : 1
    <1009>   DW_AT_declaration : 1
 <1><100a>: Abbrev Number: 10 (DW_TAG_variable)
    <100b>   DW_AT_name        : (indirect string, offset: 0xc7e): ioctlent
    <100f>   DW_AT_decl_file   : 18
    <1010>   DW_AT_decl_line   : 1899
    <1012>   DW_AT_decl_column : 31
    <1013>   DW_AT_type        : <0x1019>
    <1017>   DW_AT_external    : 1
    <1018>   DW_AT_declaration : 1
 <1><1019>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <101a>   DW_AT_byte_size   : 4
    <101b>   DW_AT_type        : <0x8d2>
 <1><101f>: Abbrev Number: 10 (DW_TAG_variable)
    <1020>   DW_AT_name        : (indirect string, offset: 0x85f): nsyscalls
    <1024>   DW_AT_decl_file   : 18
    <1025>   DW_AT_decl_line   : 1905
    <1027>   DW_AT_decl_column : 17
    <1028>   DW_AT_type        : <0x2b>
    <102c>   DW_AT_external    : 1
    <102d>   DW_AT_declaration : 1
 <1><102e>: Abbrev Number: 10 (DW_TAG_variable)
    <102f>   DW_AT_name        : (indirect string, offset: 0xe7c): nioctlents
    <1033>   DW_AT_decl_file   : 18
    <1034>   DW_AT_decl_line   : 1906
    <1036>   DW_AT_decl_column : 17
    <1037>   DW_AT_type        : <0x2b>
    <103b>   DW_AT_external    : 1
    <103c>   DW_AT_declaration : 1
 <1><103d>: Abbrev Number: 15 (DW_TAG_array_type)
    <103e>   DW_AT_type        : <0x32>
    <1042>   DW_AT_sibling     : <0x104d>
 <2><1046>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1047>   DW_AT_type        : <0x2b>
    <104b>   DW_AT_upper_bound : 2
 <2><104c>: Abbrev Number: 0
 <1><104d>: Abbrev Number: 3 (DW_TAG_const_type)
    <104e>   DW_AT_type        : <0x103d>
 <1><1052>: Abbrev Number: 10 (DW_TAG_variable)
    <1053>   DW_AT_name        : (indirect string, offset: 0xedc): nsyscall_vec
    <1057>   DW_AT_decl_file   : 18
    <1058>   DW_AT_decl_line   : 1908
    <105a>   DW_AT_decl_column : 27
    <105b>   DW_AT_type        : <0x104d>
    <105f>   DW_AT_external    : 1
    <1060>   DW_AT_declaration : 1
 <1><1061>: Abbrev Number: 15 (DW_TAG_array_type)
    <1062>   DW_AT_type        : <0x9bd>
    <1066>   DW_AT_sibling     : <0x1071>
 <2><106a>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <106b>   DW_AT_type        : <0x2b>
    <106f>   DW_AT_upper_bound : 2
 <2><1070>: Abbrev Number: 0
 <1><1071>: Abbrev Number: 3 (DW_TAG_const_type)
    <1072>   DW_AT_type        : <0x1061>
 <1><1076>: Abbrev Number: 10 (DW_TAG_variable)
    <1077>   DW_AT_name        : (indirect string, offset: 0x7a4): sysent_vec
    <107b>   DW_AT_decl_file   : 18
    <107c>   DW_AT_decl_line   : 1909
    <107e>   DW_AT_decl_column : 35
    <107f>   DW_AT_type        : <0x1071>
    <1083>   DW_AT_external    : 1
    <1084>   DW_AT_declaration : 1
 <1><1085>: Abbrev Number: 10 (DW_TAG_variable)
    <1086>   DW_AT_name        : (indirect string, offset: 0x396): inject_vec
    <108a>   DW_AT_decl_file   : 18
    <108b>   DW_AT_decl_line   : 1910
    <108d>   DW_AT_decl_column : 28
    <108e>   DW_AT_type        : <0x9c2>
    <1092>   DW_AT_external    : 1
    <1093>   DW_AT_declaration : 1
 <1><1094>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1095>   DW_AT_name        : (indirect string, offset: 0xd7e): audit_arch_t
    <1099>   DW_AT_byte_size   : 8
    <109a>   DW_AT_decl_file   : 18
    <109b>   DW_AT_decl_line   : 1912
    <109d>   DW_AT_decl_column : 8
    <109e>   DW_AT_sibling     : <0x10c3>
 <2><10a2>: Abbrev Number: 22 (DW_TAG_member)
    <10a3>   DW_AT_name        : (indirect string, offset: 0x583): arch
    <10a7>   DW_AT_decl_file   : 18
    <10a8>   DW_AT_decl_line   : 1913
    <10aa>   DW_AT_decl_column : 15
    <10ab>   DW_AT_type        : <0x2b>
    <10af>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10b2>: Abbrev Number: 22 (DW_TAG_member)
    <10b3>   DW_AT_name        : (indirect string, offset: 0x9c4): flag
    <10b7>   DW_AT_decl_file   : 18
    <10b8>   DW_AT_decl_line   : 1914
    <10ba>   DW_AT_decl_column : 15
    <10bb>   DW_AT_type        : <0x2b>
    <10bf>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10c2>: Abbrev Number: 0
 <1><10c3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10c4>   DW_AT_type        : <0x1094>
 <1><10c8>: Abbrev Number: 15 (DW_TAG_array_type)
    <10c9>   DW_AT_type        : <0x10c3>
    <10cd>   DW_AT_sibling     : <0x10d8>
 <2><10d1>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10d2>   DW_AT_type        : <0x2b>
    <10d6>   DW_AT_upper_bound : 2
 <2><10d7>: Abbrev Number: 0
 <1><10d8>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d9>   DW_AT_type        : <0x10c8>
 <1><10dd>: Abbrev Number: 10 (DW_TAG_variable)
    <10de>   DW_AT_name        : (indirect string, offset: 0x939): audit_arch_vec
    <10e2>   DW_AT_decl_file   : 18
    <10e3>   DW_AT_decl_line   : 1917
    <10e5>   DW_AT_decl_column : 34
    <10e6>   DW_AT_type        : <0x10d8>
    <10ea>   DW_AT_external    : 1
    <10eb>   DW_AT_declaration : 1
 <1><10ec>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10ed>   DW_AT_byte_size   : 180
    <10ee>   DW_AT_decl_file   : 20
    <10ef>   DW_AT_decl_line   : 2
    <10f0>   DW_AT_decl_column : 9
    <10f1>   DW_AT_sibling     : <0x13a6>
 <2><10f5>: Abbrev Number: 9 (DW_TAG_member)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x1c3): block_ioctl
    <10fa>   DW_AT_decl_file   : 20
    <10fb>   DW_AT_decl_line   : 3
    <10fc>   DW_AT_decl_column : 8
    <10fd>   DW_AT_type        : <0x13c0>
    <1101>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1104>: Abbrev Number: 9 (DW_TAG_member)
    <1105>   DW_AT_name        : (indirect string, offset: 0xaa5): btrfs_ioctl
    <1109>   DW_AT_decl_file   : 20
    <110a>   DW_AT_decl_line   : 6
    <110b>   DW_AT_decl_column : 8
    <110c>   DW_AT_type        : <0x13c0>
    <1110>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1113>: Abbrev Number: 9 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0x742): evdev_write_ioctl_mpers
    <1118>   DW_AT_decl_file   : 20
    <1119>   DW_AT_decl_line   : 9
    <111a>   DW_AT_decl_column : 8
    <111b>   DW_AT_type        : <0x13c0>
    <111f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1122>: Abbrev Number: 9 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0x718): get_sock_fprog_size
    <1127>   DW_AT_decl_file   : 20
    <1128>   DW_AT_decl_line   : 12
    <1129>   DW_AT_decl_column : 17
    <112a>   DW_AT_type        : <0x13cc>
    <112e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1131>: Abbrev Number: 9 (DW_TAG_member)
    <1132>   DW_AT_name        : (indirect string, offset: 0x192): fetch_bpf_fprog
    <1136>   DW_AT_decl_file   : 20
    <1137>   DW_AT_decl_line   : 15
    <1138>   DW_AT_decl_column : 10
    <1139>   DW_AT_type        : <0x13ec>
    <113d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1140>: Abbrev Number: 9 (DW_TAG_member)
    <1141>   DW_AT_name        : (indirect string, offset: 0x926): fetch_struct_flock
    <1145>   DW_AT_decl_file   : 20
    <1146>   DW_AT_decl_line   : 18
    <1147>   DW_AT_decl_column : 10
    <1148>   DW_AT_type        : <0x13ec>
