Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1728 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5cc): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc6c): mpers-m32/struct_statfs64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb3f): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3bc): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1005): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x97f): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdfe): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x48e): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x885): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xee7): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8b5): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x790): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb6c): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xba2): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2d5): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd0a): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 6 (DW_TAG_array_type)
    <c2>   DW_AT_type        : <0x64>
    <c6>   DW_AT_sibling     : <0xd1>
 <2><ca>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <cb>   DW_AT_type        : <0x2b>
    <cf>   DW_AT_upper_bound : 1
 <2><d0>: Abbrev Number: 0
 <1><d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0xc63): __time_t
    <d6>   DW_AT_decl_file   : 1
    <d7>   DW_AT_decl_line   : 160
    <d8>   DW_AT_decl_column : 26
    <d9>   DW_AT_type        : <0xae>
 <1><dd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <de>   DW_AT_byte_size   : 4
 <1><df>: Abbrev Number: 3 (DW_TAG_const_type)
    <e0>   DW_AT_type        : <0xdd>
 <1><e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5>   DW_AT_name        : (indirect string, offset: 0x408): __syscall_slong_t
    <e9>   DW_AT_decl_file   : 1
    <ea>   DW_AT_decl_line   : 196
    <eb>   DW_AT_decl_column : 33
    <ec>   DW_AT_type        : <0xae>
 <1><f0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <f1>   DW_AT_byte_size   : 4
    <f2>   DW_AT_type        : <0xf6>
 <1><f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <f7>   DW_AT_byte_size   : 1
    <f8>   DW_AT_encoding    : 6	(signed char)
    <f9>   DW_AT_name        : (indirect string, offset: 0x454): char
 <1><fd>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe>   DW_AT_type        : <0xf6>
 <1><102>: Abbrev Number: 4 (DW_TAG_typedef)
    <103>   DW_AT_name        : (indirect string, offset: 0x365): uint8_t
    <107>   DW_AT_decl_file   : 2
    <108>   DW_AT_decl_line   : 24
    <109>   DW_AT_decl_column : 19
    <10a>   DW_AT_type        : <0x45>
 <1><10e>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f>   DW_AT_name        : (indirect string, offset: 0xb8d): uint16_t
    <113>   DW_AT_decl_file   : 2
    <114>   DW_AT_decl_line   : 25
    <115>   DW_AT_decl_column : 20
    <116>   DW_AT_type        : <0x58>
 <1><11a>: Abbrev Number: 4 (DW_TAG_typedef)
    <11b>   DW_AT_name        : (indirect string, offset: 0xf8f): uint32_t
    <11f>   DW_AT_decl_file   : 2
    <120>   DW_AT_decl_line   : 26
    <121>   DW_AT_decl_column : 20
    <122>   DW_AT_type        : <0x70>
 <1><126>: Abbrev Number: 4 (DW_TAG_typedef)
    <127>   DW_AT_name        : (indirect string, offset: 0xe0e): uint64_t
    <12b>   DW_AT_decl_file   : 2
    <12c>   DW_AT_decl_line   : 27
    <12d>   DW_AT_decl_column : 20
    <12e>   DW_AT_type        : <0x8f>
 <1><132>: Abbrev Number: 4 (DW_TAG_typedef)
    <133>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <137>   DW_AT_decl_file   : 3
    <138>   DW_AT_decl_line   : 209
    <139>   DW_AT_decl_column : 23
    <13a>   DW_AT_type        : <0x2b>
 <1><13e>: Abbrev Number: 3 (DW_TAG_const_type)
    <13f>   DW_AT_type        : <0x132>
 <1><143>: Abbrev Number: 10 (DW_TAG_structure_type)
    <144>   DW_AT_name        : (indirect string, offset: 0xaf0): timespec
    <148>   DW_AT_byte_size   : 8
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 10
    <14b>   DW_AT_decl_column : 8
    <14c>   DW_AT_sibling     : <0x16f>
 <2><150>: Abbrev Number: 11 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x10d2): tv_sec
    <155>   DW_AT_decl_file   : 4
    <156>   DW_AT_decl_line   : 12
    <157>   DW_AT_decl_column : 12
    <158>   DW_AT_type        : <0xd1>
    <15c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15f>: Abbrev Number: 11 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xe34): tv_nsec
    <164>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 16
    <166>   DW_AT_decl_column : 21
    <167>   DW_AT_type        : <0xe4>
    <16b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xab2): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfb8): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x28c): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xf0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3b4): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xfde): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xf0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x763): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc52): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x10e5): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xfd>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x36d): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 11 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xa04): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 11 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4e4): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xf0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 11 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf3c): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xf0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 11 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7cc): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xf0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 11 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x13d): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xf0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 11 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x103e): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xf0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 11 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x8f7): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xf0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 11 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x968): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xf0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 11 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xda2): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xf0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 11 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1d6): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xf0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 11 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xcd1): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xf0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 11 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xf0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 11 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x578): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 11 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x219): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 11 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xfa3): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 11 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x7b8): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 11 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x831): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 11 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x24c): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 11 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe5a): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 11 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xce1): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 11 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x17e): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 11 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x6fb): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 11 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa44): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 11 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfc2): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 11 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3d8): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 11 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc28): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xdd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 11 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x9bd): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x132>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 11 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0xa28): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 11 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x7e6): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xad2): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x483): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x317): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 6 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xf6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x381): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 6 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xf6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x543): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x1018): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xdf7): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x25e): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 6 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x552): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x279): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe79): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6d4): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xf0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbcd): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xf0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 6 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xf0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1c3): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xece): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x376): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x9b6): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x1088): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4c8): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf63): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9c9): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x41a): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0xa88): __kernel_long_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 15
    <538>   DW_AT_decl_column : 15
    <539>   DW_AT_type        : <0xae>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x532): __kernel_ulong_t
    <542>   DW_AT_decl_file   : 14
    <543>   DW_AT_decl_line   : 16
    <544>   DW_AT_decl_column : 23
    <545>   DW_AT_type        : <0x37>
 <1><549>: Abbrev Number: 18 (DW_TAG_structure_type)
    <54a>   DW_AT_byte_size   : 8
    <54b>   DW_AT_decl_file   : 14
    <54c>   DW_AT_decl_line   : 79
    <54d>   DW_AT_decl_column : 9
    <54e>   DW_AT_sibling     : <0x562>
 <2><552>: Abbrev Number: 19 (DW_TAG_member)
    <553>   DW_AT_name        : val
    <557>   DW_AT_decl_file   : 14
    <558>   DW_AT_decl_line   : 80
    <559>   DW_AT_decl_column : 6
    <55a>   DW_AT_type        : <0xc1>
    <55e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><561>: Abbrev Number: 0
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0xe69): __kernel_fsid_t
    <567>   DW_AT_decl_file   : 14
    <568>   DW_AT_decl_line   : 81
    <569>   DW_AT_decl_column : 3
    <56a>   DW_AT_type        : <0x549>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x3e6): kernel_long_t
    <573>   DW_AT_decl_file   : 15
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 25
    <576>   DW_AT_type        : <0x531>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x8a6): kernel_ulong_t
    <57f>   DW_AT_decl_file   : 15
    <580>   DW_AT_decl_line   : 17
    <581>   DW_AT_decl_column : 26
    <582>   DW_AT_type        : <0x53d>
 <1><586>: Abbrev Number: 3 (DW_TAG_const_type)
    <587>   DW_AT_type        : <0x57a>
 <1><58b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <58c>   DW_AT_name        : (indirect string, offset: 0xbeb): list_item
    <590>   DW_AT_byte_size   : 8
    <591>   DW_AT_decl_file   : 16
    <592>   DW_AT_decl_line   : 92
    <593>   DW_AT_decl_column : 8
    <594>   DW_AT_sibling     : <0x5b7>
 <2><598>: Abbrev Number: 11 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x10cd): prev
    <59d>   DW_AT_decl_file   : 16
    <59e>   DW_AT_decl_line   : 93
    <59f>   DW_AT_decl_column : 20
    <5a0>   DW_AT_type        : <0x5b7>
    <5a4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a7>: Abbrev Number: 11 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x10c3): next
    <5ac>   DW_AT_decl_file   : 16
    <5ad>   DW_AT_decl_line   : 94
    <5ae>   DW_AT_decl_column : 20
    <5af>   DW_AT_type        : <0x5b7>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b6>: Abbrev Number: 0
 <1><5b7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5b8>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x58b>
 <1><5bd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x87e): sysent
    <5c2>   DW_AT_byte_size   : 20
    <5c3>   DW_AT_decl_file   : 17
    <5c4>   DW_AT_decl_line   : 13
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_sibling     : <0x616>
 <2><5ca>: Abbrev Number: 11 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x102f): nargs
    <5cf>   DW_AT_decl_file   : 17
    <5d0>   DW_AT_decl_line   : 14
    <5d1>   DW_AT_decl_column : 11
    <5d2>   DW_AT_type        : <0x2b>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d9>: Abbrev Number: 11 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x975): sys_flags
    <5de>   DW_AT_decl_file   : 17
    <5df>   DW_AT_decl_line   : 15
    <5e0>   DW_AT_decl_column : 6
    <5e1>   DW_AT_type        : <0x64>
    <5e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e8>: Abbrev Number: 19 (DW_TAG_member)
    <5e9>   DW_AT_name        : sen
    <5ed>   DW_AT_decl_file   : 17
    <5ee>   DW_AT_decl_line   : 16
    <5ef>   DW_AT_decl_column : 6
    <5f0>   DW_AT_type        : <0x64>
    <5f4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f7>: Abbrev Number: 11 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x30e): sys_func
    <5fc>   DW_AT_decl_file   : 17
    <5fd>   DW_AT_decl_line   : 17
    <5fe>   DW_AT_decl_column : 8
    <5ff>   DW_AT_type        : <0x86c>
    <603>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><606>: Abbrev Number: 11 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x283): sys_name
    <60b>   DW_AT_decl_file   : 17
    <60c>   DW_AT_decl_line   : 18
    <60d>   DW_AT_decl_column : 14
    <60e>   DW_AT_type        : <0x1d9>
    <612>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><615>: Abbrev Number: 0
 <1><616>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <617>   DW_AT_prototyped  : 1
    <618>   DW_AT_type        : <0x64>
    <61c>   DW_AT_sibling     : <0x626>
 <2><620>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <621>   DW_AT_type        : <0x626>
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x631>
 <1><62c>: Abbrev Number: 3 (DW_TAG_const_type)
    <62d>   DW_AT_type        : <0x626>
 <1><631>: Abbrev Number: 22 (DW_TAG_structure_type)
    <632>   DW_AT_name        : tcb
    <636>   DW_AT_byte_size   : 200
    <637>   DW_AT_decl_file   : 18
    <638>   DW_AT_decl_line   : 262
    <63a>   DW_AT_decl_column : 8
    <63b>   DW_AT_sibling     : <0x86c>
 <2><63f>: Abbrev Number: 23 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x4de): flags
    <644>   DW_AT_decl_file   : 18
    <645>   DW_AT_decl_line   : 263
    <647>   DW_AT_decl_column : 6
    <648>   DW_AT_type        : <0x64>
    <64c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><64f>: Abbrev Number: 24 (DW_TAG_member)
    <650>   DW_AT_name        : pid
    <654>   DW_AT_decl_file   : 18
    <655>   DW_AT_decl_line   : 264
    <657>   DW_AT_decl_column : 6
    <658>   DW_AT_type        : <0x64>
    <65c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><65f>: Abbrev Number: 23 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <664>   DW_AT_decl_file   : 18
    <665>   DW_AT_decl_line   : 265
    <667>   DW_AT_decl_column : 6
    <668>   DW_AT_type        : <0x64>
    <66c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><66f>: Abbrev Number: 23 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0x3a0): currpers
    <674>   DW_AT_decl_file   : 18
    <675>   DW_AT_decl_line   : 267
    <677>   DW_AT_decl_column : 15
    <678>   DW_AT_type        : <0x2b>
    <67c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><67f>: Abbrev Number: 23 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0xb2d): u_error
    <684>   DW_AT_decl_file   : 18
    <685>   DW_AT_decl_line   : 269
    <687>   DW_AT_decl_column : 16
    <688>   DW_AT_type        : <0x37>
    <68c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><68f>: Abbrev Number: 23 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <694>   DW_AT_decl_file   : 18
    <695>   DW_AT_decl_line   : 270
    <697>   DW_AT_decl_column : 17
    <698>   DW_AT_type        : <0x57a>
    <69c>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><69f>: Abbrev Number: 23 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0xb83): true_scno
    <6a4>   DW_AT_decl_file   : 18
    <6a5>   DW_AT_decl_line   : 271
    <6a7>   DW_AT_decl_column : 17
    <6a8>   DW_AT_type        : <0x57a>
    <6ac>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6af>: Abbrev Number: 23 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x1a5): u_arg
    <6b4>   DW_AT_decl_file   : 18
    <6b5>   DW_AT_decl_line   : 272
    <6b7>   DW_AT_decl_column : 17
    <6b8>   DW_AT_type        : <0x99c>
    <6bc>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6bf>: Abbrev Number: 23 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x98c): u_rval
    <6c4>   DW_AT_decl_file   : 18
    <6c5>   DW_AT_decl_line   : 273
    <6c7>   DW_AT_decl_column : 16
    <6c8>   DW_AT_type        : <0x56e>
    <6cc>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6cf>: Abbrev Number: 23 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xaa4): sys_func_rval
    <6d4>   DW_AT_decl_file   : 18
    <6d5>   DW_AT_decl_line   : 274
    <6d7>   DW_AT_decl_column : 6
    <6d8>   DW_AT_type        : <0x64>
    <6dc>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6df>: Abbrev Number: 23 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xcfb): curcol
    <6e4>   DW_AT_decl_file   : 18
    <6e5>   DW_AT_decl_line   : 275
    <6e7>   DW_AT_decl_column : 6
    <6e8>   DW_AT_type        : <0x64>
    <6ec>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ef>: Abbrev Number: 23 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x99e): outf
    <6f4>   DW_AT_decl_file   : 18
    <6f5>   DW_AT_decl_line   : 276
    <6f7>   DW_AT_decl_column : 8
    <6f8>   DW_AT_type        : <0x41e>
    <6fc>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ff>: Abbrev Number: 23 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0xf0d): staged_output_data
    <704>   DW_AT_decl_file   : 18
    <705>   DW_AT_decl_line   : 277
    <707>   DW_AT_decl_column : 29
    <708>   DW_AT_type        : <0x9b2>
    <70c>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><70f>: Abbrev Number: 23 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0xa6f): auxstr
    <714>   DW_AT_decl_file   : 18
    <715>   DW_AT_decl_line   : 279
    <717>   DW_AT_decl_column : 14
    <718>   DW_AT_type        : <0x1d9>
    <71c>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><71f>: Abbrev Number: 23 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x184): _priv_data
    <724>   DW_AT_decl_file   : 18
    <725>   DW_AT_decl_line   : 280
    <727>   DW_AT_decl_column : 8
    <728>   DW_AT_type        : <0xdd>
    <72c>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><72f>: Abbrev Number: 23 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0xc18): _free_priv_data
    <734>   DW_AT_decl_file   : 18
    <735>   DW_AT_decl_line   : 281
    <737>   DW_AT_decl_column : 9
    <738>   DW_AT_type        : <0x9c4>
    <73c>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><73f>: Abbrev Number: 23 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x195): s_ent
    <744>   DW_AT_decl_file   : 18
    <745>   DW_AT_decl_line   : 282
    <747>   DW_AT_decl_column : 23
    <748>   DW_AT_type        : <0x9ca>
    <74c>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <754>   DW_AT_decl_file   : 18
    <755>   DW_AT_decl_line   : 285
    <757>   DW_AT_decl_column : 23
    <758>   DW_AT_type        : <0x9ca>
    <75c>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><75f>: Abbrev Number: 23 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x395): inject_vec
    <764>   DW_AT_decl_file   : 18
    <765>   DW_AT_decl_line   : 286
    <767>   DW_AT_decl_column : 22
    <768>   DW_AT_type        : <0x9d5>
    <76c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><76f>: Abbrev Number: 23 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x7ef): stime
    <774>   DW_AT_decl_file   : 18
    <775>   DW_AT_decl_line   : 287
    <777>   DW_AT_decl_column : 18
    <778>   DW_AT_type        : <0x143>
    <77c>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><77f>: Abbrev Number: 23 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0x3a9): ltime
    <784>   DW_AT_decl_file   : 18
    <785>   DW_AT_decl_line   : 288
    <787>   DW_AT_decl_column : 18
    <788>   DW_AT_type        : <0x143>
    <78c>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><78f>: Abbrev Number: 23 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0xff6): atime
    <794>   DW_AT_decl_file   : 18
    <795>   DW_AT_decl_line   : 289
    <797>   DW_AT_decl_column : 18
    <798>   DW_AT_type        : <0x143>
    <79c>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><79f>: Abbrev Number: 23 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x4d8): etime
    <7a4>   DW_AT_decl_file   : 18
    <7a5>   DW_AT_decl_line   : 290
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x143>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7b0>: Abbrev Number: 23 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0xd5f): delay_expiration_time
    <7b5>   DW_AT_decl_file   : 18
    <7b6>   DW_AT_decl_line   : 291
    <7b8>   DW_AT_decl_column : 18
    <7b9>   DW_AT_type        : <0x143>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7c1>: Abbrev Number: 23 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7c6>   DW_AT_decl_file   : 18
    <7c7>   DW_AT_decl_line   : 298
    <7c9>   DW_AT_decl_column : 15
    <7ca>   DW_AT_type        : <0x2b>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7d2>: Abbrev Number: 23 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0xf49): last_dirfd
    <7d7>   DW_AT_decl_file   : 18
    <7d8>   DW_AT_decl_line   : 301
    <7da>   DW_AT_decl_column : 6
    <7db>   DW_AT_type        : <0x64>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7e3>: Abbrev Number: 23 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xf6f): mmap_cache
    <7e8>   DW_AT_decl_file   : 18
    <7e9>   DW_AT_decl_line   : 304
    <7eb>   DW_AT_decl_column : 23
    <7ec>   DW_AT_type        : <0x9f1>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7f4>: Abbrev Number: 23 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xb59): wait_data_idx
    <7f9>   DW_AT_decl_file   : 18
    <7fa>   DW_AT_decl_line   : 311
    <7fc>   DW_AT_decl_column : 9
    <7fd>   DW_AT_type        : <0x132>
    <801>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><805>: Abbrev Number: 23 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xa76): delayed_wait_data
    <80a>   DW_AT_decl_file   : 18
    <80b>   DW_AT_decl_line   : 313
    <80d>   DW_AT_decl_column : 24
    <80e>   DW_AT_type        : <0x9fd>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><816>: Abbrev Number: 23 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0xae6): wait_list
    <81b>   DW_AT_decl_file   : 18
    <81c>   DW_AT_decl_line   : 314
    <81e>   DW_AT_decl_column : 19
    <81f>   DW_AT_type        : <0x58b>
    <823>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><827>: Abbrev Number: 23 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x6ec): vcpu_info_list
    <82c>   DW_AT_decl_file   : 18
    <82d>   DW_AT_decl_line   : 318
    <82f>   DW_AT_decl_column : 20
    <830>   DW_AT_type        : <0xa09>
    <834>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><838>: Abbrev Number: 23 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0xcc6): unwind_ctx
    <83d>   DW_AT_decl_file   : 18
    <83e>   DW_AT_decl_line   : 322
    <840>   DW_AT_decl_column : 8
    <841>   DW_AT_type        : <0xdd>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><849>: Abbrev Number: 23 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x4bb): unwind_queue
    <84e>   DW_AT_decl_file   : 18
    <84f>   DW_AT_decl_line   : 323
    <851>   DW_AT_decl_column : 25
    <852>   DW_AT_type        : <0xa15>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><85a>: Abbrev Number: 23 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x179): comm
    <85f>   DW_AT_decl_file   : 18
    <860>   DW_AT_decl_line   : 327
    <862>   DW_AT_decl_column : 7
    <863>   DW_AT_type        : <0xa1b>
    <867>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><86b>: Abbrev Number: 0
 <1><86c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <86d>   DW_AT_byte_size   : 4
    <86e>   DW_AT_type        : <0x616>
 <1><872>: Abbrev Number: 4 (DW_TAG_typedef)
    <873>   DW_AT_name        : (indirect string, offset: 0x524): struct_sysent
    <877>   DW_AT_decl_file   : 17
    <878>   DW_AT_decl_line   : 19
    <879>   DW_AT_decl_column : 3
    <87a>   DW_AT_type        : <0x5bd>
 <1><87e>: Abbrev Number: 3 (DW_TAG_const_type)
    <87f>   DW_AT_type        : <0x872>
 <1><883>: Abbrev Number: 13 (DW_TAG_variable)
    <884>   DW_AT_name        : (indirect string, offset: 0xd4b): current_personality
    <888>   DW_AT_decl_file   : 18
    <889>   DW_AT_decl_line   : 158
    <88a>   DW_AT_decl_column : 17
    <88b>   DW_AT_type        : <0x2b>
    <88f>   DW_AT_external    : 1
    <890>   DW_AT_declaration : 1
 <1><891>: Abbrev Number: 13 (DW_TAG_variable)
    <892>   DW_AT_name        : (indirect string, offset: 0x820): current_wordsize
    <896>   DW_AT_decl_file   : 18
    <897>   DW_AT_decl_line   : 171
    <898>   DW_AT_decl_column : 17
    <899>   DW_AT_type        : <0x2b>
    <89d>   DW_AT_external    : 1
    <89e>   DW_AT_declaration : 1
 <1><89f>: Abbrev Number: 13 (DW_TAG_variable)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xa4d): current_klongsize
    <8a4>   DW_AT_decl_file   : 18
    <8a5>   DW_AT_decl_line   : 176
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0x2b>
    <8ab>   DW_AT_external    : 1
    <8ac>   DW_AT_declaration : 1
 <1><8ad>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xc9d): ioctlent
    <8b2>   DW_AT_byte_size   : 8
    <8b3>   DW_AT_decl_file   : 18
    <8b4>   DW_AT_decl_line   : 217
    <8b5>   DW_AT_decl_column : 16
    <8b6>   DW_AT_sibling     : <0x8d9>
 <2><8ba>: Abbrev Number: 11 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xf35): symbol
    <8bf>   DW_AT_decl_file   : 18
    <8c0>   DW_AT_decl_line   : 218
    <8c1>   DW_AT_decl_column : 14
    <8c2>   DW_AT_type        : <0x1d9>
    <8c6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c9>: Abbrev Number: 11 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xd14): code
    <8ce>   DW_AT_decl_file   : 18
    <8cf>   DW_AT_decl_line   : 219
    <8d0>   DW_AT_decl_column : 15
    <8d1>   DW_AT_type        : <0x2b>
    <8d5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d8>: Abbrev Number: 0
 <1><8d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <8da>   DW_AT_name        : (indirect string, offset: 0xc42): struct_ioctlent
    <8de>   DW_AT_decl_file   : 18
    <8df>   DW_AT_decl_line   : 220
    <8e0>   DW_AT_decl_column : 3
    <8e1>   DW_AT_type        : <0x8ad>
 <1><8e5>: Abbrev Number: 3 (DW_TAG_const_type)
    <8e6>   DW_AT_type        : <0x8d9>
 <1><8ea>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x814): inject_data
    <8ef>   DW_AT_byte_size   : 10
    <8f0>   DW_AT_decl_file   : 18
    <8f1>   DW_AT_decl_line   : 241
    <8f2>   DW_AT_decl_column : 8
    <8f3>   DW_AT_sibling     : <0x952>
 <2><8f7>: Abbrev Number: 11 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x4de): flags
    <8fc>   DW_AT_decl_file   : 18
    <8fd>   DW_AT_decl_line   : 242
    <8fe>   DW_AT_decl_column : 10
    <8ff>   DW_AT_type        : <0x102>
    <903>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><906>: Abbrev Number: 11 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x929): signo
    <90b>   DW_AT_decl_file   : 18
    <90c>   DW_AT_decl_line   : 243
    <90d>   DW_AT_decl_column : 10
    <90e>   DW_AT_type        : <0x102>
    <912>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><915>: Abbrev Number: 11 (DW_TAG_member)
    <916>   DW_AT_name        : (indirect string, offset: 0x10b): rval_idx
    <91a>   DW_AT_decl_file   : 18
    <91b>   DW_AT_decl_line   : 244
    <91c>   DW_AT_decl_column : 11
    <91d>   DW_AT_type        : <0x10e>
    <921>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><924>: Abbrev Number: 11 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0xcf1): delay_idx
    <929>   DW_AT_decl_file   : 18
    <92a>   DW_AT_decl_line   : 245
    <92b>   DW_AT_decl_column : 11
    <92c>   DW_AT_type        : <0x10e>
    <930>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><933>: Abbrev Number: 11 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0x56a): poke_idx
    <938>   DW_AT_decl_file   : 18
    <939>   DW_AT_decl_line   : 246
    <93a>   DW_AT_decl_column : 11
    <93b>   DW_AT_type        : <0x10e>
    <93f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><942>: Abbrev Number: 11 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <947>   DW_AT_decl_file   : 18
    <948>   DW_AT_decl_line   : 247
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0x10e>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 10 (DW_TAG_structure_type)
    <953>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <957>   DW_AT_byte_size   : 16
    <958>   DW_AT_decl_file   : 18
    <959>   DW_AT_decl_line   : 250
    <95a>   DW_AT_decl_column : 8
    <95b>   DW_AT_sibling     : <0x99c>
 <2><95f>: Abbrev Number: 11 (DW_TAG_member)
    <960>   DW_AT_name        : (indirect string, offset: 0xa22): first
    <964>   DW_AT_decl_file   : 18
    <965>   DW_AT_decl_line   : 251
    <966>   DW_AT_decl_column : 11
    <967>   DW_AT_type        : <0x10e>
    <96b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><96e>: Abbrev Number: 11 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0x10fd): last
    <973>   DW_AT_decl_file   : 18
    <974>   DW_AT_decl_line   : 252
    <975>   DW_AT_decl_column : 11
    <976>   DW_AT_type        : <0x10e>
    <97a>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><97d>: Abbrev Number: 11 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x3af): step
    <982>   DW_AT_decl_file   : 18
    <983>   DW_AT_decl_line   : 253
    <984>   DW_AT_decl_column : 11
    <985>   DW_AT_type        : <0x10e>
    <989>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><98c>: Abbrev Number: 11 (DW_TAG_member)
    <98d>   DW_AT_name        : (indirect string, offset: 0x10c8): data
    <991>   DW_AT_decl_file   : 18
    <992>   DW_AT_decl_line   : 254
    <993>   DW_AT_decl_column : 21
    <994>   DW_AT_type        : <0x8ea>
    <998>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><99b>: Abbrev Number: 0
 <1><99c>: Abbrev Number: 6 (DW_TAG_array_type)
    <99d>   DW_AT_type        : <0x57a>
    <9a1>   DW_AT_sibling     : <0x9ac>
 <2><9a5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9a6>   DW_AT_type        : <0x2b>
    <9aa>   DW_AT_upper_bound : 5
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9ad>   DW_AT_name        : (indirect string, offset: 0xf0d): staged_output_data
    <9b1>   DW_AT_declaration : 1
 <1><9b2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_type        : <0x9ac>
 <1><9b8>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9b9>   DW_AT_prototyped  : 1
    <9ba>   DW_AT_sibling     : <0x9c4>
 <2><9be>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9bf>   DW_AT_type        : <0xdd>
 <2><9c3>: Abbrev Number: 0
 <1><9c4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9c5>   DW_AT_byte_size   : 4
    <9c6>   DW_AT_type        : <0x9b8>
 <1><9ca>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_type        : <0x87e>
 <1><9d0>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d1>   DW_AT_type        : <0x9ca>
 <1><9d5>: Abbrev Number: 6 (DW_TAG_array_type)
    <9d6>   DW_AT_type        : <0x9e5>
    <9da>   DW_AT_sibling     : <0x9e5>
 <2><9de>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9df>   DW_AT_type        : <0x2b>
    <9e3>   DW_AT_upper_bound : 2
 <2><9e4>: Abbrev Number: 0
 <1><9e5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_type        : <0x952>
 <1><9eb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <9f0>   DW_AT_declaration : 1
 <1><9f1>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x9eb>
 <1><9f7>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x3ca): tcb_wait_data
    <9fc>   DW_AT_declaration : 1
 <1><9fd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9f7>
 <1><a03>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0x16f): vcpu_info
    <a08>   DW_AT_declaration : 1
 <1><a09>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0xa03>
 <1><a0f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a10>   DW_AT_name        : (indirect string, offset: 0xef1): unwind_queue_t
    <a14>   DW_AT_declaration : 1
 <1><a15>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a16>   DW_AT_byte_size   : 4
    <a17>   DW_AT_type        : <0xa0f>
 <1><a1b>: Abbrev Number: 6 (DW_TAG_array_type)
    <a1c>   DW_AT_type        : <0xf6>
    <a20>   DW_AT_sibling     : <0xa2b>
 <2><a24>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a25>   DW_AT_type        : <0x2b>
    <a29>   DW_AT_upper_bound : 15
 <2><a2a>: Abbrev Number: 0
 <1><a2b>: Abbrev Number: 12 (DW_TAG_variable)
    <a2c>   DW_AT_name        : (indirect string, offset: 0xb96): stub_sysent
    <a30>   DW_AT_decl_file   : 18
    <a31>   DW_AT_decl_line   : 400
    <a33>   DW_AT_decl_column : 28
    <a34>   DW_AT_type        : <0x87e>
    <a38>   DW_AT_external    : 1
    <a39>   DW_AT_declaration : 1
 <1><a3a>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x10ab): xlat_type
    <a3f>   DW_AT_encoding    : 7	(unsigned)
    <a40>   DW_AT_byte_size   : 4
    <a41>   DW_AT_type        : <0x2b>
    <a45>   DW_AT_decl_file   : 19
    <a46>   DW_AT_decl_line   : 13
    <a47>   DW_AT_decl_column : 6
    <a48>   DW_AT_sibling     : <0xa5f>
 <2><a4c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x2de): XT_NORMAL
    <a51>   DW_AT_const_value : 0
 <2><a52>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0xc59): XT_SORTED
    <a57>   DW_AT_const_value : 1
 <2><a58>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0xdd7): XT_INDEXED
    <a5d>   DW_AT_const_value : 2
 <2><a5e>: Abbrev Number: 0
 <1><a5f>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a60>   DW_AT_name        : (indirect string, offset: 0xbc2): xlat_style
    <a64>   DW_AT_encoding    : 7	(unsigned)
    <a65>   DW_AT_byte_size   : 4
    <a66>   DW_AT_type        : <0x2b>
    <a6a>   DW_AT_decl_file   : 19
    <a6b>   DW_AT_decl_line   : 19
    <a6c>   DW_AT_decl_column : 6
    <a6d>   DW_AT_sibling     : <0xa9c>
 <2><a71>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a76>   DW_AT_const_value : 0
 <2><a77>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0xbf5): XLAT_STYLE_RAW
    <a7c>   DW_AT_const_value : 1
 <2><a7d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x1076): XLAT_STYLE_ABBREV
    <a82>   DW_AT_const_value : 2
 <2><a83>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x2fb): XLAT_STYLE_VERBOSE
    <a88>   DW_AT_const_value : 3
 <2><a89>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a8e>   DW_AT_const_value : 0
 <2><a8f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a94>   DW_AT_const_value : 4
 <2><a95>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0x10ec): XLAT_STYLE_FMT_D
    <a9a>   DW_AT_const_value : 8
 <2><a9b>: Abbrev Number: 0
 <1><a9c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x32c): xlat_data
    <aa1>   DW_AT_byte_size   : 12
    <aa2>   DW_AT_decl_file   : 19
    <aa3>   DW_AT_decl_line   : 51
    <aa4>   DW_AT_decl_column : 8
    <aa5>   DW_AT_sibling     : <0xac8>
 <2><aa9>: Abbrev Number: 19 (DW_TAG_member)
    <aaa>   DW_AT_name        : val
    <aae>   DW_AT_decl_file   : 19
    <aaf>   DW_AT_decl_line   : 52
    <ab0>   DW_AT_decl_column : 11
    <ab1>   DW_AT_type        : <0x126>
    <ab5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab8>: Abbrev Number: 19 (DW_TAG_member)
    <ab9>   DW_AT_name        : str
    <abd>   DW_AT_decl_file   : 19
    <abe>   DW_AT_decl_line   : 53
    <abf>   DW_AT_decl_column : 14
    <ac0>   DW_AT_type        : <0x1d9>
    <ac4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac9>   DW_AT_type        : <0xa9c>
 <1><acd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ace>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ad2>   DW_AT_byte_size   : 24
    <ad3>   DW_AT_decl_file   : 19
    <ad4>   DW_AT_decl_line   : 56
    <ad5>   DW_AT_decl_column : 8
    <ad6>   DW_AT_sibling     : <0xb26>
 <2><ada>: Abbrev Number: 11 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x10c8): data
    <adf>   DW_AT_decl_file   : 19
    <ae0>   DW_AT_decl_line   : 57
    <ae1>   DW_AT_decl_column : 26
    <ae2>   DW_AT_type        : <0xb2b>
    <ae6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae9>: Abbrev Number: 11 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x872): flags_strsz
    <aee>   DW_AT_decl_file   : 19
    <aef>   DW_AT_decl_line   : 58
    <af0>   DW_AT_decl_column : 9
    <af1>   DW_AT_type        : <0x132>
    <af5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af8>: Abbrev Number: 11 (DW_TAG_member)
    <af9>   DW_AT_name        : (indirect string, offset: 0xb67): size
    <afd>   DW_AT_decl_file   : 19
    <afe>   DW_AT_decl_line   : 59
    <aff>   DW_AT_decl_column : 11
    <b00>   DW_AT_type        : <0x11a>
    <b04>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b07>: Abbrev Number: 11 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x1a0): type
    <b0c>   DW_AT_decl_file   : 19
    <b0d>   DW_AT_decl_line   : 60
    <b0e>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0xa3a>
    <b13>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b16>: Abbrev Number: 11 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x740): flags_mask
    <b1b>   DW_AT_decl_file   : 19
    <b1c>   DW_AT_decl_line   : 61
    <b1d>   DW_AT_decl_column : 11
    <b1e>   DW_AT_type        : <0x126>
    <b22>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b25>: Abbrev Number: 0
 <1><b26>: Abbrev Number: 3 (DW_TAG_const_type)
    <b27>   DW_AT_type        : <0xacd>
 <1><b2b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b2c>   DW_AT_byte_size   : 4
    <b2d>   DW_AT_type        : <0xac8>
 <1><b31>: Abbrev Number: 6 (DW_TAG_array_type)
    <b32>   DW_AT_type        : <0xb26>
    <b36>   DW_AT_sibling     : <0xb3c>
 <2><b3a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b3b>: Abbrev Number: 0
 <1><b3c>: Abbrev Number: 3 (DW_TAG_const_type)
    <b3d>   DW_AT_type        : <0xb31>
 <1><b41>: Abbrev Number: 12 (DW_TAG_variable)
    <b42>   DW_AT_name        : (indirect string, offset: 0xe47): addrfams
    <b46>   DW_AT_decl_file   : 18
    <b47>   DW_AT_decl_line   : 406
    <b49>   DW_AT_decl_column : 26
    <b4a>   DW_AT_type        : <0xb3c>
    <b4e>   DW_AT_external    : 1
    <b4f>   DW_AT_declaration : 1
 <1><b50>: Abbrev Number: 12 (DW_TAG_variable)
    <b51>   DW_AT_name        : (indirect string, offset: 0xd24): arp_hardware_types
    <b55>   DW_AT_decl_file   : 18
    <b56>   DW_AT_decl_line   : 407
    <b58>   DW_AT_decl_column : 26
    <b59>   DW_AT_type        : <0xb3c>
    <b5d>   DW_AT_external    : 1
    <b5e>   DW_AT_declaration : 1
 <1><b5f>: Abbrev Number: 12 (DW_TAG_variable)
    <b60>   DW_AT_name        : (indirect string, offset: 0xffc): at_flags
    <b64>   DW_AT_decl_file   : 18
    <b65>   DW_AT_decl_line   : 408
    <b67>   DW_AT_decl_column : 26
    <b68>   DW_AT_type        : <0xb3c>
    <b6c>   DW_AT_external    : 1
    <b6d>   DW_AT_declaration : 1
 <1><b6e>: Abbrev Number: 12 (DW_TAG_variable)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x499): clocknames
    <b73>   DW_AT_decl_file   : 18
    <b74>   DW_AT_decl_line   : 409
    <b76>   DW_AT_decl_column : 26
    <b77>   DW_AT_type        : <0xb3c>
    <b7b>   DW_AT_external    : 1
    <b7c>   DW_AT_declaration : 1
 <1><b7d>: Abbrev Number: 12 (DW_TAG_variable)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xfab): dirent_types
    <b82>   DW_AT_decl_file   : 18
    <b83>   DW_AT_decl_line   : 410
    <b85>   DW_AT_decl_column : 26
    <b86>   DW_AT_type        : <0xb3c>
    <b8a>   DW_AT_external    : 1
    <b8b>   DW_AT_declaration : 1
 <1><b8c>: Abbrev Number: 12 (DW_TAG_variable)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x8c3): ethernet_protocols
    <b91>   DW_AT_decl_file   : 18
    <b92>   DW_AT_decl_line   : 411
    <b94>   DW_AT_decl_column : 26
    <b95>   DW_AT_type        : <0xb3c>
    <b99>   DW_AT_external    : 1
    <b9a>   DW_AT_declaration : 1
 <1><b9b>: Abbrev Number: 12 (DW_TAG_variable)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x5bd): inet_protocols
    <ba0>   DW_AT_decl_file   : 18
    <ba1>   DW_AT_decl_line   : 412
    <ba3>   DW_AT_decl_column : 26
    <ba4>   DW_AT_type        : <0xb3c>
    <ba8>   DW_AT_external    : 1
    <ba9>   DW_AT_declaration : 1
 <1><baa>: Abbrev Number: 12 (DW_TAG_variable)
    <bab>   DW_AT_name        : (indirect string, offset: 0x2cb): evdev_abs
    <baf>   DW_AT_decl_file   : 18
    <bb0>   DW_AT_decl_line   : 413
    <bb2>   DW_AT_decl_column : 26
    <bb3>   DW_AT_type        : <0xb3c>
    <bb7>   DW_AT_external    : 1
    <bb8>   DW_AT_declaration : 1
 <1><bb9>: Abbrev Number: 12 (DW_TAG_variable)
    <bba>   DW_AT_name        : (indirect string, offset: 0x735): audit_arch
    <bbe>   DW_AT_decl_file   : 18
    <bbf>   DW_AT_decl_line   : 414
    <bc1>   DW_AT_decl_column : 26
    <bc2>   DW_AT_type        : <0xb3c>
    <bc6>   DW_AT_external    : 1
    <bc7>   DW_AT_declaration : 1
 <1><bc8>: Abbrev Number: 12 (DW_TAG_variable)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bcd>   DW_AT_decl_file   : 18
    <bce>   DW_AT_decl_line   : 415
    <bd0>   DW_AT_decl_column : 26
    <bd1>   DW_AT_type        : <0xb3c>
    <bd5>   DW_AT_external    : 1
    <bd6>   DW_AT_declaration : 1
 <1><bd7>: Abbrev Number: 12 (DW_TAG_variable)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x47a): iffflags
    <bdc>   DW_AT_decl_file   : 18
    <bdd>   DW_AT_decl_line   : 416
    <bdf>   DW_AT_decl_column : 26
    <be0>   DW_AT_type        : <0xb3c>
    <be4>   DW_AT_external    : 1
    <be5>   DW_AT_declaration : 1
 <1><be6>: Abbrev Number: 12 (DW_TAG_variable)
    <be7>   DW_AT_name        : (indirect string, offset: 0xc04): ip_type_of_services
    <beb>   DW_AT_decl_file   : 18
    <bec>   DW_AT_decl_line   : 417
    <bee>   DW_AT_decl_column : 26
    <bef>   DW_AT_type        : <0xb3c>
    <bf3>   DW_AT_external    : 1
    <bf4>   DW_AT_declaration : 1
 <1><bf5>: Abbrev Number: 12 (DW_TAG_variable)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x6c8): ipc_private
    <bfa>   DW_AT_decl_file   : 18
    <bfb>   DW_AT_decl_line   : 418
    <bfd>   DW_AT_decl_column : 26
    <bfe>   DW_AT_type        : <0xb3c>
    <c02>   DW_AT_external    : 1
    <c03>   DW_AT_declaration : 1
 <1><c04>: Abbrev Number: 12 (DW_TAG_variable)
    <c05>   DW_AT_name        : (indirect string, offset: 0x322): msg_flags
    <c09>   DW_AT_decl_file   : 18
    <c0a>   DW_AT_decl_line   : 419
    <c0c>   DW_AT_decl_column : 26
    <c0d>   DW_AT_type        : <0xb3c>
    <c11>   DW_AT_external    : 1
    <c12>   DW_AT_declaration : 1
 <1><c13>: Abbrev Number: 12 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x114): netlink_protocols
    <c18>   DW_AT_decl_file   : 18
    <c19>   DW_AT_decl_line   : 420
    <c1b>   DW_AT_decl_column : 26
    <c1c>   DW_AT_type        : <0xb3c>
    <c20>   DW_AT_external    : 1
    <c21>   DW_AT_declaration : 1
 <1><c22>: Abbrev Number: 12 (DW_TAG_variable)
    <c23>   DW_AT_name        : (indirect string, offset: 0xf20): nl_bridge_vlan_flags
    <c27>   DW_AT_decl_file   : 18
    <c28>   DW_AT_decl_line   : 421
    <c2a>   DW_AT_decl_column : 26
    <c2b>   DW_AT_type        : <0xb3c>
    <c2f>   DW_AT_external    : 1
    <c30>   DW_AT_declaration : 1
 <1><c31>: Abbrev Number: 12 (DW_TAG_variable)
    <c32>   DW_AT_name        : (indirect string, offset: 0xdc0): nl_netfilter_msg_types
    <c36>   DW_AT_decl_file   : 18
    <c37>   DW_AT_decl_line   : 422
    <c39>   DW_AT_decl_column : 26
    <c3a>   DW_AT_type        : <0xb3c>
    <c3e>   DW_AT_external    : 1
    <c3f>   DW_AT_declaration : 1
 <1><c40>: Abbrev Number: 12 (DW_TAG_variable)
    <c41>   DW_AT_name        : (indirect string, offset: 0x229): nl_route_types
    <c45>   DW_AT_decl_file   : 18
    <c46>   DW_AT_decl_line   : 423
    <c48>   DW_AT_decl_column : 26
    <c49>   DW_AT_type        : <0xb3c>
    <c4d>   DW_AT_external    : 1
    <c4e>   DW_AT_declaration : 1
 <1><c4f>: Abbrev Number: 12 (DW_TAG_variable)
    <c50>   DW_AT_name        : (indirect string, offset: 0xe8e): open_access_modes
    <c54>   DW_AT_decl_file   : 18
    <c55>   DW_AT_decl_line   : 424
    <c57>   DW_AT_decl_column : 26
    <c58>   DW_AT_type        : <0xb3c>
    <c5c>   DW_AT_external    : 1
    <c5d>   DW_AT_declaration : 1
 <1><c5e>: Abbrev Number: 12 (DW_TAG_variable)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c63>   DW_AT_decl_file   : 18
    <c64>   DW_AT_decl_line   : 425
    <c66>   DW_AT_decl_column : 26
    <c67>   DW_AT_type        : <0xb3c>
    <c6b>   DW_AT_external    : 1
    <c6c>   DW_AT_declaration : 1
 <1><c6d>: Abbrev Number: 12 (DW_TAG_variable)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xc35): perf_type_id
    <c72>   DW_AT_decl_file   : 18
    <c73>   DW_AT_decl_line   : 426
    <c75>   DW_AT_decl_column : 26
    <c76>   DW_AT_type        : <0xb3c>
    <c7a>   DW_AT_external    : 1
    <c7b>   DW_AT_declaration : 1
 <1><c7c>: Abbrev Number: 12 (DW_TAG_variable)
    <c7d>   DW_AT_name        : (indirect string, offset: 0xe50): pollflags
    <c81>   DW_AT_decl_file   : 18
    <c82>   DW_AT_decl_line   : 427
    <c84>   DW_AT_decl_column : 26
    <c85>   DW_AT_type        : <0xb3c>
    <c89>   DW_AT_external    : 1
    <c8a>   DW_AT_declaration : 1
 <1><c8b>: Abbrev Number: 12 (DW_TAG_variable)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x55e): ptrace_cmds
    <c90>   DW_AT_decl_file   : 18
    <c91>   DW_AT_decl_line   : 428
    <c93>   DW_AT_decl_column : 26
    <c94>   DW_AT_type        : <0xb3c>
    <c98>   DW_AT_external    : 1
    <c99>   DW_AT_declaration : 1
 <1><c9a>: Abbrev Number: 12 (DW_TAG_variable)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x805): resource_flags
    <c9f>   DW_AT_decl_file   : 18
    <ca0>   DW_AT_decl_line   : 429
    <ca2>   DW_AT_decl_column : 26
    <ca3>   DW_AT_type        : <0xb3c>
    <ca7>   DW_AT_external    : 1
    <ca8>   DW_AT_declaration : 1
 <1><ca9>: Abbrev Number: 12 (DW_TAG_variable)
    <caa>   DW_AT_name        : (indirect string, offset: 0x2a1): route_nexthop_flags
    <cae>   DW_AT_decl_file   : 18
    <caf>   DW_AT_decl_line   : 430
    <cb1>   DW_AT_decl_column : 26
    <cb2>   DW_AT_type        : <0xb3c>
    <cb6>   DW_AT_external    : 1
    <cb7>   DW_AT_declaration : 1
 <1><cb8>: Abbrev Number: 12 (DW_TAG_variable)
    <cb9>   DW_AT_name        : (indirect string, offset: 0xeab): routing_protocols
    <cbd>   DW_AT_decl_file   : 18
    <cbe>   DW_AT_decl_line   : 431
    <cc0>   DW_AT_decl_column : 26
    <cc1>   DW_AT_type        : <0xb3c>
    <cc5>   DW_AT_external    : 1
    <cc6>   DW_AT_declaration : 1
 <1><cc7>: Abbrev Number: 12 (DW_TAG_variable)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x46b): routing_scopes
    <ccc>   DW_AT_decl_file   : 18
    <ccd>   DW_AT_decl_line   : 432
    <ccf>   DW_AT_decl_column : 26
    <cd0>   DW_AT_type        : <0xb3c>
    <cd4>   DW_AT_external    : 1
    <cd5>   DW_AT_declaration : 1
 <1><cd6>: Abbrev Number: 12 (DW_TAG_variable)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xdae): routing_table_ids
    <cdb>   DW_AT_decl_file   : 18
    <cdc>   DW_AT_decl_line   : 433
    <cde>   DW_AT_decl_column : 26
    <cdf>   DW_AT_type        : <0xb3c>
    <ce3>   DW_AT_external    : 1
    <ce4>   DW_AT_declaration : 1
 <1><ce5>: Abbrev Number: 12 (DW_TAG_variable)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x6a5): routing_types
    <cea>   DW_AT_decl_file   : 18
    <ceb>   DW_AT_decl_line   : 434
    <ced>   DW_AT_decl_column : 26
    <cee>   DW_AT_type        : <0xb3c>
    <cf2>   DW_AT_external    : 1
    <cf3>   DW_AT_declaration : 1
 <1><cf4>: Abbrev Number: 12 (DW_TAG_variable)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x1cc): rwf_flags
    <cf9>   DW_AT_decl_file   : 18
    <cfa>   DW_AT_decl_line   : 435
    <cfc>   DW_AT_decl_column : 26
    <cfd>   DW_AT_type        : <0xb3c>
    <d01>   DW_AT_external    : 1
    <d02>   DW_AT_declaration : 1
 <1><d03>: Abbrev Number: 12 (DW_TAG_variable)
    <d04>   DW_AT_name        : (indirect string, offset: 0x83d): seccomp_filter_flags
    <d08>   DW_AT_decl_file   : 18
    <d09>   DW_AT_decl_line   : 436
    <d0b>   DW_AT_decl_column : 26
    <d0c>   DW_AT_type        : <0xb3c>
    <d10>   DW_AT_external    : 1
    <d11>   DW_AT_declaration : 1
 <1><d12>: Abbrev Number: 12 (DW_TAG_variable)
    <d13>   DW_AT_name        : (indirect string, offset: 0x2e8): seccomp_ret_action
    <d17>   DW_AT_decl_file   : 18
    <d18>   DW_AT_decl_line   : 437
    <d1a>   DW_AT_decl_column : 26
    <d1b>   DW_AT_type        : <0xb3c>
    <d1f>   DW_AT_external    : 1
    <d20>   DW_AT_declaration : 1
 <1><d21>: Abbrev Number: 12 (DW_TAG_variable)
    <d22>   DW_AT_name        : (indirect string, offset: 0x434): setns_types
    <d26>   DW_AT_decl_file   : 18
    <d27>   DW_AT_decl_line   : 438
    <d29>   DW_AT_decl_column : 26
    <d2a>   DW_AT_type        : <0xb3c>
    <d2e>   DW_AT_external    : 1
    <d2f>   DW_AT_declaration : 1
 <1><d30>: Abbrev Number: 12 (DW_TAG_variable)
    <d31>   DW_AT_name        : (indirect string, offset: 0xe3c): sg_io_info
    <d35>   DW_AT_decl_file   : 18
    <d36>   DW_AT_decl_line   : 439
    <d38>   DW_AT_decl_column : 26
    <d39>   DW_AT_type        : <0xb3c>
    <d3d>   DW_AT_external    : 1
    <d3e>   DW_AT_declaration : 1
 <1><d3f>: Abbrev Number: 12 (DW_TAG_variable)
    <d40>   DW_AT_name        : (indirect string, offset: 0xbaa): socketlayers
    <d44>   DW_AT_decl_file   : 18
    <d45>   DW_AT_decl_line   : 440
    <d47>   DW_AT_decl_column : 26
    <d48>   DW_AT_type        : <0xb3c>
    <d4c>   DW_AT_external    : 1
    <d4d>   DW_AT_declaration : 1
 <1><d4e>: Abbrev Number: 12 (DW_TAG_variable)
    <d4f>   DW_AT_name        : (indirect string, offset: 0xd98): socktypes
    <d53>   DW_AT_decl_file   : 18
    <d54>   DW_AT_decl_line   : 441
    <d56>   DW_AT_decl_column : 26
    <d57>   DW_AT_type        : <0xb3c>
    <d5b>   DW_AT_external    : 1
    <d5c>   DW_AT_declaration : 1
 <1><d5d>: Abbrev Number: 12 (DW_TAG_variable)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xa5f): tcp_state_flags
    <d62>   DW_AT_decl_file   : 18
    <d63>   DW_AT_decl_line   : 442
    <d65>   DW_AT_decl_column : 26
    <d66>   DW_AT_type        : <0xb3c>
    <d6a>   DW_AT_external    : 1
    <d6b>   DW_AT_declaration : 1
 <1><d6c>: Abbrev Number: 12 (DW_TAG_variable)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x76a): tcp_states
    <d71>   DW_AT_decl_file   : 18
    <d72>   DW_AT_decl_line   : 443
    <d74>   DW_AT_decl_column : 26
    <d75>   DW_AT_type        : <0xb3c>
    <d79>   DW_AT_external    : 1
    <d7a>   DW_AT_declaration : 1
 <1><d7b>: Abbrev Number: 12 (DW_TAG_variable)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x1059): whence_codes
    <d80>   DW_AT_decl_file   : 18
    <d81>   DW_AT_decl_line   : 444
    <d83>   DW_AT_decl_column : 26
    <d84>   DW_AT_type        : <0xb3c>
    <d88>   DW_AT_external    : 1
    <d89>   DW_AT_declaration : 1
 <1><d8a>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d8b>   DW_AT_encoding    : 7	(unsigned)
    <d8c>   DW_AT_byte_size   : 4
    <d8d>   DW_AT_type        : <0x2b>
    <d91>   DW_AT_decl_file   : 18
    <d92>   DW_AT_decl_line   : 505
    <d94>   DW_AT_decl_column : 14
    <d95>   DW_AT_sibling     : <0xdac>
 <2><d99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x993): CFLAG_NONE
    <d9e>   DW_AT_const_value : 0
 <2><d9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x8d6): CFLAG_ONLY_STATS
    <da4>   DW_AT_const_value : 1
 <2><da5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0xbb7): CFLAG_BOTH
    <daa>   DW_AT_const_value : 2
 <2><dab>: Abbrev Number: 0
 <1><dac>: Abbrev Number: 29 (DW_TAG_typedef)
    <dad>   DW_AT_name        : (indirect string, offset: 0x1102): cflag_t
    <db1>   DW_AT_decl_file   : 18
    <db2>   DW_AT_decl_line   : 509
    <db4>   DW_AT_decl_column : 3
    <db5>   DW_AT_type        : <0xd8a>
 <1><db9>: Abbrev Number: 12 (DW_TAG_variable)
    <dba>   DW_AT_name        : (indirect string, offset: 0xceb): cflag
    <dbe>   DW_AT_decl_file   : 18
    <dbf>   DW_AT_decl_line   : 510
    <dc1>   DW_AT_decl_column : 16
    <dc2>   DW_AT_type        : <0xdac>
    <dc6>   DW_AT_external    : 1
    <dc7>   DW_AT_declaration : 1
 <1><dc8>: Abbrev Number: 12 (DW_TAG_variable)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x18f): Tflag
    <dcd>   DW_AT_decl_file   : 18
    <dce>   DW_AT_decl_line   : 511
    <dd0>   DW_AT_decl_column : 13
    <dd1>   DW_AT_type        : <0x525>
    <dd5>   DW_AT_external    : 1
    <dd6>   DW_AT_declaration : 1
 <1><dd7>: Abbrev Number: 12 (DW_TAG_variable)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x7c0): Tflag_scale
    <ddc>   DW_AT_decl_file   : 18
    <ddd>   DW_AT_decl_line   : 512
    <ddf>   DW_AT_decl_column : 12
    <de0>   DW_AT_type        : <0x64>
    <de4>   DW_AT_external    : 1
    <de5>   DW_AT_declaration : 1
 <1><de6>: Abbrev Number: 12 (DW_TAG_variable)
    <de7>   DW_AT_name        : (indirect string, offset: 0x852): Tflag_width
    <deb>   DW_AT_decl_file   : 18
    <dec>   DW_AT_decl_line   : 513
    <dee>   DW_AT_decl_column : 12
    <def>   DW_AT_type        : <0x64>
    <df3>   DW_AT_external    : 1
    <df4>   DW_AT_declaration : 1
 <1><df5>: Abbrev Number: 12 (DW_TAG_variable)
    <df6>   DW_AT_name        : (indirect string, offset: 0xe2e): iflag
    <dfa>   DW_AT_decl_file   : 18
    <dfb>   DW_AT_decl_line   : 514
    <dfd>   DW_AT_decl_column : 13
    <dfe>   DW_AT_type        : <0x525>
    <e02>   DW_AT_external    : 1
    <e03>   DW_AT_declaration : 1
 <1><e04>: Abbrev Number: 12 (DW_TAG_variable)
    <e05>   DW_AT_name        : (indirect string, offset: 0x59e): count_wallclock
    <e09>   DW_AT_decl_file   : 18
    <e0a>   DW_AT_decl_line   : 515
    <e0c>   DW_AT_decl_column : 13
    <e0d>   DW_AT_type        : <0x525>
    <e11>   DW_AT_external    : 1
    <e12>   DW_AT_declaration : 1
 <1><e13>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e14>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e18>   DW_AT_byte_size   : 4
    <e19>   DW_AT_decl_file   : 18
    <e1a>   DW_AT_decl_line   : 517
    <e1c>   DW_AT_decl_column : 8
    <e1d>   DW_AT_sibling     : <0xe32>
 <2><e21>: Abbrev Number: 23 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e26>   DW_AT_decl_file   : 18
    <e27>   DW_AT_decl_line   : 518
    <e29>   DW_AT_decl_column : 14
    <e2a>   DW_AT_type        : <0x1d9>
    <e2e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e31>: Abbrev Number: 0
 <1><e32>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e33>   DW_AT_name        : (indirect string, offset: 0x775): path_set
    <e37>   DW_AT_byte_size   : 12
    <e38>   DW_AT_decl_file   : 18
    <e39>   DW_AT_decl_line   : 522
    <e3b>   DW_AT_decl_column : 15
    <e3c>   DW_AT_sibling     : <0xe71>
 <2><e40>: Abbrev Number: 23 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x703): paths_selected
    <e45>   DW_AT_decl_file   : 18
    <e46>   DW_AT_decl_line   : 523
    <e48>   DW_AT_decl_column : 24
    <e49>   DW_AT_type        : <0xe71>
    <e4d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e50>: Abbrev Number: 23 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x104c): num_selected
    <e55>   DW_AT_decl_file   : 18
    <e56>   DW_AT_decl_line   : 524
    <e58>   DW_AT_decl_column : 9
    <e59>   DW_AT_type        : <0x132>
    <e5d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e60>: Abbrev Number: 23 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0xb67): size
    <e65>   DW_AT_decl_file   : 18
    <e66>   DW_AT_decl_line   : 525
    <e68>   DW_AT_decl_column : 9
    <e69>   DW_AT_type        : <0x132>
    <e6d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e70>: Abbrev Number: 0
 <1><e71>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e72>   DW_AT_byte_size   : 4
    <e73>   DW_AT_type        : <0xe13>
 <1><e77>: Abbrev Number: 12 (DW_TAG_variable)
    <e78>   DW_AT_name        : (indirect string, offset: 0x109b): global_path_set
    <e7c>   DW_AT_decl_file   : 18
    <e7d>   DW_AT_decl_line   : 526
    <e7f>   DW_AT_decl_column : 3
    <e80>   DW_AT_type        : <0xe32>
    <e84>   DW_AT_external    : 1
    <e85>   DW_AT_declaration : 1
 <1><e86>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e87>   DW_AT_name        : (indirect string, offset: 0xf98): xflag_opts
    <e8b>   DW_AT_encoding    : 7	(unsigned)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0x2b>
    <e91>   DW_AT_decl_file   : 18
    <e92>   DW_AT_decl_line   : 528
    <e94>   DW_AT_decl_column : 6
    <e95>   DW_AT_sibling     : <0xeb8>
 <2><e99>: Abbrev Number: 27 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xa16): HEXSTR_NONE
    <e9e>   DW_AT_const_value : 0
 <2><e9f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xfcd): HEXSTR_NON_ASCII
    <ea4>   DW_AT_const_value : 1
 <2><ea5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x914): HEXSTR_ALL
    <eaa>   DW_AT_const_value : 2
 <2><eab>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0x685): HEXSTR_NON_ASCII_CHARS
    <eb0>   DW_AT_const_value : 3
 <2><eb1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x1066): NUM_HEXSTR_OPTS
    <eb6>   DW_AT_const_value : 4
 <2><eb7>: Abbrev Number: 0
 <1><eb8>: Abbrev Number: 12 (DW_TAG_variable)
    <eb9>   DW_AT_name        : (indirect string, offset: 0xe08): xflag
    <ebd>   DW_AT_decl_file   : 18
    <ebe>   DW_AT_decl_line   : 541
    <ec0>   DW_AT_decl_column : 17
    <ec1>   DW_AT_type        : <0x2b>
    <ec5>   DW_AT_external    : 1
    <ec6>   DW_AT_declaration : 1
 <1><ec7>: Abbrev Number: 12 (DW_TAG_variable)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xca6): followfork
    <ecc>   DW_AT_decl_file   : 18
    <ecd>   DW_AT_decl_line   : 542
    <ecf>   DW_AT_decl_column : 13
    <ed0>   DW_AT_type        : <0x525>
    <ed4>   DW_AT_external    : 1
    <ed5>   DW_AT_declaration : 1
 <1><ed6>: Abbrev Number: 12 (DW_TAG_variable)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x336): output_separately
    <edb>   DW_AT_decl_file   : 18
    <edc>   DW_AT_decl_line   : 543
    <ede>   DW_AT_decl_column : 13
    <edf>   DW_AT_type        : <0x525>
    <ee3>   DW_AT_external    : 1
    <ee4>   DW_AT_declaration : 1
 <1><ee5>: Abbrev Number: 12 (DW_TAG_variable)
    <ee6>   DW_AT_name        : (indirect string, offset: 0x238): stack_trace_enabled
    <eea>   DW_AT_decl_file   : 18
    <eeb>   DW_AT_decl_line   : 546
    <eed>   DW_AT_decl_column : 13
    <eee>   DW_AT_type        : <0x525>
    <ef2>   DW_AT_external    : 1
    <ef3>   DW_AT_declaration : 1
 <1><ef4>: Abbrev Number: 12 (DW_TAG_variable)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x663): ptrace_setoptions
    <ef9>   DW_AT_decl_file   : 18
    <efa>   DW_AT_decl_line   : 550
    <efc>   DW_AT_decl_column : 17
    <efd>   DW_AT_type        : <0x2b>
    <f01>   DW_AT_external    : 1
    <f02>   DW_AT_declaration : 1
 <1><f03>: Abbrev Number: 12 (DW_TAG_variable)
    <f04>   DW_AT_name        : (indirect string, offset: 0xa0b): max_strlen
    <f08>   DW_AT_decl_file   : 18
    <f09>   DW_AT_decl_line   : 551
    <f0b>   DW_AT_decl_column : 17
    <f0c>   DW_AT_type        : <0x2b>
    <f10>   DW_AT_external    : 1
    <f11>   DW_AT_declaration : 1
 <1><f12>: Abbrev Number: 12 (DW_TAG_variable)
    <f13>   DW_AT_name        : (indirect string, offset: 0xa39): os_release
    <f17>   DW_AT_decl_file   : 18
    <f18>   DW_AT_decl_line   : 552
    <f1a>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0x2b>
    <f1f>   DW_AT_external    : 1
    <f20>   DW_AT_declaration : 1
 <1><f21>: Abbrev Number: 12 (DW_TAG_variable)
    <f22>   DW_AT_name        : (indirect string, offset: 0x712): xlat_verbosity
    <f26>   DW_AT_decl_file   : 18
    <f27>   DW_AT_decl_line   : 914
    <f29>   DW_AT_decl_column : 24
    <f2a>   DW_AT_type        : <0xa5f>
    <f2e>   DW_AT_external    : 1
    <f2f>   DW_AT_declaration : 1
 <1><f30>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f31>   DW_AT_name        : (indirect string, offset: 0x581): xlat_style_private_flag_bits
    <f35>   DW_AT_encoding    : 7	(unsigned)
    <f36>   DW_AT_byte_size   : 4
    <f37>   DW_AT_type        : <0x2b>
    <f3b>   DW_AT_decl_file   : 18
    <f3c>   DW_AT_decl_line   : 934
    <f3e>   DW_AT_decl_column : 6
    <f3f>   DW_AT_sibling     : <0xf5c>
 <2><f43>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x2b5): PAF_PRINT_INDICES_BIT
    <f48>   DW_AT_const_value : 5
 <2><f49>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xb01): PAF_ARRAY_TRUNCATED_BIT
    <f4e>   DW_AT_const_value : 6
 <2><f4f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x3f4): PXF_DEFAULT_STR_BIT
    <f54>   DW_AT_const_value : 7
 <2><f55>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0xc88): SPFF_AUXSTR_MODE_BIT
    <f5a>   DW_AT_const_value : 8
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xd37): find_xlat_flag_bits
    <f61>   DW_AT_encoding    : 7	(unsigned)
    <f62>   DW_AT_byte_size   : 4
    <f63>   DW_AT_type        : <0x2b>
    <f67>   DW_AT_decl_file   : 18
    <f68>   DW_AT_decl_line   : 1438
    <f6a>   DW_AT_decl_column : 6
    <f6b>   DW_AT_sibling     : <0xf76>
 <2><f6f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f70>   DW_AT_name        : (indirect string, offset: 0x951): FXL_CASE_SENSITIVE_BIT
    <f74>   DW_AT_const_value : 0
 <2><f75>: Abbrev Number: 0
 <1><f76>: Abbrev Number: 12 (DW_TAG_variable)
    <f77>   DW_AT_name        : (indirect string, offset: 0x9de): printing_tcp
    <f7b>   DW_AT_decl_file   : 18
    <f7c>   DW_AT_decl_line   : 1684
    <f7e>   DW_AT_decl_column : 20
    <f7f>   DW_AT_type        : <0x626>
    <f83>   DW_AT_external    : 1
    <f84>   DW_AT_declaration : 1
 <1><f85>: Abbrev Number: 12 (DW_TAG_variable)
    <f86>   DW_AT_name        : (indirect string, offset: 0x549): errnoent
    <f8a>   DW_AT_decl_file   : 18
    <f8b>   DW_AT_decl_line   : 1882
    <f8d>   DW_AT_decl_column : 26
    <f8e>   DW_AT_type        : <0x459>
    <f92>   DW_AT_external    : 1
    <f93>   DW_AT_declaration : 1
 <1><f94>: Abbrev Number: 12 (DW_TAG_variable)
    <f95>   DW_AT_name        : (indirect string, offset: 0x85e): signalent
    <f99>   DW_AT_decl_file   : 18
    <f9a>   DW_AT_decl_line   : 1883
    <f9c>   DW_AT_decl_column : 26
    <f9d>   DW_AT_type        : <0x459>
    <fa1>   DW_AT_external    : 1
    <fa2>   DW_AT_declaration : 1
 <1><fa3>: Abbrev Number: 12 (DW_TAG_variable)
    <fa4>   DW_AT_name        : (indirect string, offset: 0xe86): nerrnos
    <fa8>   DW_AT_decl_file   : 18
    <fa9>   DW_AT_decl_line   : 1884
    <fab>   DW_AT_decl_column : 27
    <fac>   DW_AT_type        : <0x32>
    <fb0>   DW_AT_external    : 1
    <fb1>   DW_AT_declaration : 1
 <1><fb2>: Abbrev Number: 12 (DW_TAG_variable)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x1035): nsignals
    <fb7>   DW_AT_decl_file   : 18
    <fb8>   DW_AT_decl_line   : 1885
    <fba>   DW_AT_decl_column : 27
    <fbb>   DW_AT_type        : <0x32>
    <fbf>   DW_AT_external    : 1
    <fc0>   DW_AT_declaration : 1
 <1><fc1>: Abbrev Number: 6 (DW_TAG_array_type)
    <fc2>   DW_AT_type        : <0x87e>
    <fc6>   DW_AT_sibling     : <0xfcc>
 <2><fca>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fcb>: Abbrev Number: 0
 <1><fcc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fcd>   DW_AT_type        : <0xfc1>
 <1><fd1>: Abbrev Number: 12 (DW_TAG_variable)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xd02): sysent0
    <fd6>   DW_AT_decl_file   : 18
    <fd7>   DW_AT_decl_line   : 1887
    <fd9>   DW_AT_decl_column : 28
    <fda>   DW_AT_type        : <0xfcc>
    <fde>   DW_AT_external    : 1
    <fdf>   DW_AT_declaration : 1
 <1><fe0>: Abbrev Number: 6 (DW_TAG_array_type)
    <fe1>   DW_AT_type        : <0x8e5>
    <fe5>   DW_AT_sibling     : <0xfeb>
 <2><fe9>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fea>: Abbrev Number: 0
 <1><feb>: Abbrev Number: 3 (DW_TAG_const_type)
    <fec>   DW_AT_type        : <0xfe0>
 <1><ff0>: Abbrev Number: 12 (DW_TAG_variable)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x1091): ioctlent0
    <ff5>   DW_AT_decl_file   : 18
    <ff6>   DW_AT_decl_line   : 1888
    <ff8>   DW_AT_decl_column : 30
    <ff9>   DW_AT_type        : <0xfeb>
    <ffd>   DW_AT_external    : 1
    <ffe>   DW_AT_declaration : 1
 <1><fff>: Abbrev Number: 12 (DW_TAG_variable)
    <1000>   DW_AT_name        : (indirect string, offset: 0x459): personality_names
    <1004>   DW_AT_decl_file   : 18
    <1005>   DW_AT_decl_line   : 1890
    <1007>   DW_AT_decl_column : 26
    <1008>   DW_AT_type        : <0x459>
    <100c>   DW_AT_external    : 1
    <100d>   DW_AT_declaration : 1
 <1><100e>: Abbrev Number: 12 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0x87e): sysent
    <1013>   DW_AT_decl_file   : 18
    <1014>   DW_AT_decl_line   : 1893
    <1016>   DW_AT_decl_column : 29
    <1017>   DW_AT_type        : <0x9ca>
    <101b>   DW_AT_external    : 1
    <101c>   DW_AT_declaration : 1
 <1><101d>: Abbrev Number: 12 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0xc9d): ioctlent
    <1022>   DW_AT_decl_file   : 18
    <1023>   DW_AT_decl_line   : 1894
    <1025>   DW_AT_decl_column : 31
    <1026>   DW_AT_type        : <0x102c>
    <102a>   DW_AT_external    : 1
    <102b>   DW_AT_declaration : 1
 <1><102c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <102d>   DW_AT_byte_size   : 4
    <102e>   DW_AT_type        : <0x8e5>
 <1><1032>: Abbrev Number: 12 (DW_TAG_variable)
    <1033>   DW_AT_name        : (indirect string, offset: 0x868): nsyscalls
    <1037>   DW_AT_decl_file   : 18
    <1038>   DW_AT_decl_line   : 1900
    <103a>   DW_AT_decl_column : 17
    <103b>   DW_AT_type        : <0x2b>
    <103f>   DW_AT_external    : 1
    <1040>   DW_AT_declaration : 1
 <1><1041>: Abbrev Number: 12 (DW_TAG_variable)
    <1042>   DW_AT_name        : (indirect string, offset: 0xea0): nioctlents
    <1046>   DW_AT_decl_file   : 18
    <1047>   DW_AT_decl_line   : 1901
    <1049>   DW_AT_decl_column : 17
    <104a>   DW_AT_type        : <0x2b>
    <104e>   DW_AT_external    : 1
    <104f>   DW_AT_declaration : 1
 <1><1050>: Abbrev Number: 6 (DW_TAG_array_type)
    <1051>   DW_AT_type        : <0x32>
    <1055>   DW_AT_sibling     : <0x1060>
 <2><1059>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <105a>   DW_AT_type        : <0x2b>
    <105e>   DW_AT_upper_bound : 2
 <2><105f>: Abbrev Number: 0
 <1><1060>: Abbrev Number: 3 (DW_TAG_const_type)
    <1061>   DW_AT_type        : <0x1050>
 <1><1065>: Abbrev Number: 12 (DW_TAG_variable)
    <1066>   DW_AT_name        : (indirect string, offset: 0xf00): nsyscall_vec
    <106a>   DW_AT_decl_file   : 18
    <106b>   DW_AT_decl_line   : 1903
    <106d>   DW_AT_decl_column : 27
    <106e>   DW_AT_type        : <0x1060>
    <1072>   DW_AT_external    : 1
    <1073>   DW_AT_declaration : 1
 <1><1074>: Abbrev Number: 6 (DW_TAG_array_type)
    <1075>   DW_AT_type        : <0x9d0>
    <1079>   DW_AT_sibling     : <0x1084>
 <2><107d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <107e>   DW_AT_type        : <0x2b>
    <1082>   DW_AT_upper_bound : 2
 <2><1083>: Abbrev Number: 0
 <1><1084>: Abbrev Number: 3 (DW_TAG_const_type)
    <1085>   DW_AT_type        : <0x1074>
 <1><1089>: Abbrev Number: 12 (DW_TAG_variable)
    <108a>   DW_AT_name        : (indirect string, offset: 0x7ad): sysent_vec
    <108e>   DW_AT_decl_file   : 18
    <108f>   DW_AT_decl_line   : 1904
    <1091>   DW_AT_decl_column : 35
    <1092>   DW_AT_type        : <0x1084>
    <1096>   DW_AT_external    : 1
    <1097>   DW_AT_declaration : 1
 <1><1098>: Abbrev Number: 12 (DW_TAG_variable)
    <1099>   DW_AT_name        : (indirect string, offset: 0x395): inject_vec
    <109d>   DW_AT_decl_file   : 18
    <109e>   DW_AT_decl_line   : 1905
    <10a0>   DW_AT_decl_column : 28
    <10a1>   DW_AT_type        : <0x9d5>
    <10a5>   DW_AT_external    : 1
    <10a6>   DW_AT_declaration : 1
 <1><10a7>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10a8>   DW_AT_name        : (indirect string, offset: 0xd8b): audit_arch_t
    <10ac>   DW_AT_byte_size   : 8
    <10ad>   DW_AT_decl_file   : 18
    <10ae>   DW_AT_decl_line   : 1907
    <10b0>   DW_AT_decl_column : 8
    <10b1>   DW_AT_sibling     : <0x10d6>
 <2><10b5>: Abbrev Number: 23 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x573): arch
    <10ba>   DW_AT_decl_file   : 18
    <10bb>   DW_AT_decl_line   : 1908
    <10bd>   DW_AT_decl_column : 15
    <10be>   DW_AT_type        : <0x2b>
    <10c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c5>: Abbrev Number: 23 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x9c4): flag
    <10ca>   DW_AT_decl_file   : 18
    <10cb>   DW_AT_decl_line   : 1909
    <10cd>   DW_AT_decl_column : 15
    <10ce>   DW_AT_type        : <0x2b>
    <10d2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d5>: Abbrev Number: 0
 <1><10d6>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d7>   DW_AT_type        : <0x10a7>
 <1><10db>: Abbrev Number: 6 (DW_TAG_array_type)
    <10dc>   DW_AT_type        : <0x10d6>
    <10e0>   DW_AT_sibling     : <0x10eb>
 <2><10e4>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10e5>   DW_AT_type        : <0x2b>
    <10e9>   DW_AT_upper_bound : 2
 <2><10ea>: Abbrev Number: 0
 <1><10eb>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ec>   DW_AT_type        : <0x10db>
 <1><10f0>: Abbrev Number: 12 (DW_TAG_variable)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x942): audit_arch_vec
    <10f5>   DW_AT_decl_file   : 18
    <10f6>   DW_AT_decl_line   : 1912
    <10f8>   DW_AT_decl_column : 34
    <10f9>   DW_AT_type        : <0x10eb>
    <10fd>   DW_AT_external    : 1
    <10fe>   DW_AT_declaration : 1
 <1><10ff>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1100>   DW_AT_byte_size   : 180
    <1101>   DW_AT_decl_file   : 20
    <1102>   DW_AT_decl_line   : 2
    <1103>   DW_AT_decl_column : 9
    <1104>   DW_AT_sibling     : <0x13b9>
 <2><1108>: Abbrev Number: 11 (DW_TAG_member)
    <1109>   DW_AT_name        : (indirect string, offset: 0x1e4): block_ioctl
    <110d>   DW_AT_decl_file   : 20
    <110e>   DW_AT_decl_line   : 3
    <110f>   DW_AT_decl_column : 8
    <1110>   DW_AT_type        : <0x13d3>
    <1114>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1117>: Abbrev Number: 11 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0xa98): btrfs_ioctl
    <111c>   DW_AT_decl_file   : 20
    <111d>   DW_AT_decl_line   : 6
    <111e>   DW_AT_decl_column : 8
    <111f>   DW_AT_type        : <0x13d3>
    <1123>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1126>: Abbrev Number: 11 (DW_TAG_member)
    <1127>   DW_AT_name        : (indirect string, offset: 0x74b): evdev_write_ioctl_mpers
    <112b>   DW_AT_decl_file   : 20
    <112c>   DW_AT_decl_line   : 9
    <112d>   DW_AT_decl_column : 8
    <112e>   DW_AT_type        : <0x13d3>
    <1132>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1135>: Abbrev Number: 11 (DW_TAG_member)
    <1136>   DW_AT_name        : (indirect string, offset: 0x721): get_sock_fprog_size
    <113a>   DW_AT_decl_file   : 20
    <113b>   DW_AT_decl_line   : 12
    <113c>   DW_AT_decl_column : 17
    <113d>   DW_AT_type        : <0x13df>
    <1141>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1144>: Abbrev Number: 11 (DW_TAG_member)
    <1145>   DW_AT_name        : (indirect string, offset: 0x1ab): fetch_bpf_fprog
    <1149>   DW_AT_decl_file   : 20
    <114a>   DW_AT_decl_line   : 15
    <114b>   DW_AT_decl_column : 10
    <114c>   DW_AT_type        : <0x13ff>
    <1150>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1153>: Abbrev Number: 11 (DW_TAG_member)
    <1154>   DW_AT_name        : (indirect string, offset: 0x92f): fetch_struct_flock
    <1158>   DW_AT_decl_file   : 20
