Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1739 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5c4): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc51): mpers-m32/struct_statfs64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe90): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3b7): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1011): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x977): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xde3): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x486): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x87d): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xee1): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8ad): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x788): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb51): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb87): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2d0): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcef): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 6 (DW_TAG_array_type)
    <c2>   DW_AT_type        : <0x64>
    <c6>   DW_AT_sibling     : <0xd1>
 <2><ca>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <cb>   DW_AT_type        : <0x2b>
    <cf>   DW_AT_upper_bound : 1
 <2><d0>: Abbrev Number: 0
 <1><d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0xc48): __time_t
    <d6>   DW_AT_decl_file   : 1
    <d7>   DW_AT_decl_line   : 160
    <d8>   DW_AT_decl_column : 26
    <d9>   DW_AT_type        : <0xae>
 <1><dd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <de>   DW_AT_byte_size   : 4
 <1><df>: Abbrev Number: 3 (DW_TAG_const_type)
    <e0>   DW_AT_type        : <0xdd>
 <1><e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5>   DW_AT_name        : (indirect string, offset: 0x403): __syscall_slong_t
    <e9>   DW_AT_decl_file   : 1
    <ea>   DW_AT_decl_line   : 196
    <eb>   DW_AT_decl_column : 33
    <ec>   DW_AT_type        : <0xae>
 <1><f0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <f1>   DW_AT_byte_size   : 4
    <f2>   DW_AT_type        : <0xf6>
 <1><f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <f7>   DW_AT_byte_size   : 1
    <f8>   DW_AT_encoding    : 6	(signed char)
    <f9>   DW_AT_name        : (indirect string, offset: 0x44f): char
 <1><fd>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe>   DW_AT_type        : <0xf6>
 <1><102>: Abbrev Number: 4 (DW_TAG_typedef)
    <103>   DW_AT_name        : (indirect string, offset: 0x360): uint8_t
    <107>   DW_AT_decl_file   : 2
    <108>   DW_AT_decl_line   : 24
    <109>   DW_AT_decl_column : 19
    <10a>   DW_AT_type        : <0x45>
 <1><10e>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f>   DW_AT_name        : (indirect string, offset: 0xb72): uint16_t
    <113>   DW_AT_decl_file   : 2
    <114>   DW_AT_decl_line   : 25
    <115>   DW_AT_decl_column : 20
    <116>   DW_AT_type        : <0x58>
 <1><11a>: Abbrev Number: 4 (DW_TAG_typedef)
    <11b>   DW_AT_name        : (indirect string, offset: 0xf89): uint32_t
    <11f>   DW_AT_decl_file   : 2
    <120>   DW_AT_decl_line   : 26
    <121>   DW_AT_decl_column : 20
    <122>   DW_AT_type        : <0x70>
 <1><126>: Abbrev Number: 4 (DW_TAG_typedef)
    <127>   DW_AT_name        : (indirect string, offset: 0xdf3): uint64_t
    <12b>   DW_AT_decl_file   : 2
    <12c>   DW_AT_decl_line   : 27
    <12d>   DW_AT_decl_column : 20
    <12e>   DW_AT_type        : <0x8f>
 <1><132>: Abbrev Number: 4 (DW_TAG_typedef)
    <133>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <137>   DW_AT_decl_file   : 3
    <138>   DW_AT_decl_line   : 209
    <139>   DW_AT_decl_column : 23
    <13a>   DW_AT_type        : <0x2b>
 <1><13e>: Abbrev Number: 3 (DW_TAG_const_type)
    <13f>   DW_AT_type        : <0x132>
 <1><143>: Abbrev Number: 10 (DW_TAG_structure_type)
    <144>   DW_AT_name        : (indirect string, offset: 0xae8): timespec
    <148>   DW_AT_byte_size   : 8
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 10
    <14b>   DW_AT_decl_column : 8
    <14c>   DW_AT_sibling     : <0x16f>
 <2><150>: Abbrev Number: 11 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x10de): tv_sec
    <155>   DW_AT_decl_file   : 4
    <156>   DW_AT_decl_line   : 12
    <157>   DW_AT_decl_column : 12
    <158>   DW_AT_type        : <0xd1>
    <15c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15f>: Abbrev Number: 11 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xe19): tv_nsec
    <164>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 16
    <166>   DW_AT_decl_column : 21
    <167>   DW_AT_type        : <0xe4>
    <16b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xaaa): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfc4): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x287): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xf0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3af): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xfea): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xf0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x75b): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc37): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xb37): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xfd>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x368): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 11 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x9fc): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 11 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4dc): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xf0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 11 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf36): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xf0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 11 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7c4): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xf0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 11 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x13d): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xf0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 11 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x104a): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xf0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 11 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x8ef): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xf0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 11 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x960): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xf0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 11 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xd87): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xf0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 11 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1d6): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xf0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 11 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xcb6): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xf0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 11 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xf0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 11 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x570): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 11 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x219): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 11 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xfaf): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 11 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x7b0): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 11 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x829): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 11 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x247): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 11 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe3f): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 11 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xcc6): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 11 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x17e): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 11 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x6f3): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 11 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa3c): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 11 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfce): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 11 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3d3): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 11 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc0d): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xdd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 11 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x9b5): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x132>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 11 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0xa20): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 11 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x7de): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xaca): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x47b): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x312): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 6 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xf6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x37c): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 6 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xf6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x53b): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x1024): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xddc): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x259): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 6 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x54a): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x274): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe5e): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6cc): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xf0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbb2): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xf0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 6 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xf0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1c3): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xec8): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x371): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x9ae): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x1094): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4c0): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf5d): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9c1): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x415): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0xa80): __kernel_long_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 15
    <538>   DW_AT_decl_column : 15
    <539>   DW_AT_type        : <0xae>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x52a): __kernel_ulong_t
    <542>   DW_AT_decl_file   : 14
    <543>   DW_AT_decl_line   : 16
    <544>   DW_AT_decl_column : 23
    <545>   DW_AT_type        : <0x37>
 <1><549>: Abbrev Number: 18 (DW_TAG_structure_type)
    <54a>   DW_AT_byte_size   : 8
    <54b>   DW_AT_decl_file   : 14
    <54c>   DW_AT_decl_line   : 79
    <54d>   DW_AT_decl_column : 9
    <54e>   DW_AT_sibling     : <0x562>
 <2><552>: Abbrev Number: 19 (DW_TAG_member)
    <553>   DW_AT_name        : val
    <557>   DW_AT_decl_file   : 14
    <558>   DW_AT_decl_line   : 80
    <559>   DW_AT_decl_column : 6
    <55a>   DW_AT_type        : <0xc1>
    <55e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><561>: Abbrev Number: 0
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0xe4e): __kernel_fsid_t
    <567>   DW_AT_decl_file   : 14
    <568>   DW_AT_decl_line   : 81
    <569>   DW_AT_decl_column : 3
    <56a>   DW_AT_type        : <0x549>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x3e1): kernel_long_t
    <573>   DW_AT_decl_file   : 15
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 25
    <576>   DW_AT_type        : <0x531>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x89e): kernel_ulong_t
    <57f>   DW_AT_decl_file   : 15
    <580>   DW_AT_decl_line   : 17
    <581>   DW_AT_decl_column : 26
    <582>   DW_AT_type        : <0x53d>
 <1><586>: Abbrev Number: 3 (DW_TAG_const_type)
    <587>   DW_AT_type        : <0x57a>
 <1><58b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <58c>   DW_AT_name        : (indirect string, offset: 0xbd0): list_item
    <590>   DW_AT_byte_size   : 8
    <591>   DW_AT_decl_file   : 16
    <592>   DW_AT_decl_line   : 92
    <593>   DW_AT_decl_column : 8
    <594>   DW_AT_sibling     : <0x5b7>
 <2><598>: Abbrev Number: 11 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x10d9): prev
    <59d>   DW_AT_decl_file   : 16
    <59e>   DW_AT_decl_line   : 93
    <59f>   DW_AT_decl_column : 20
    <5a0>   DW_AT_type        : <0x5b7>
    <5a4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5a7>: Abbrev Number: 11 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x10cf): next
    <5ac>   DW_AT_decl_file   : 16
    <5ad>   DW_AT_decl_line   : 94
    <5ae>   DW_AT_decl_column : 20
    <5af>   DW_AT_type        : <0x5b7>
    <5b3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5b6>: Abbrev Number: 0
 <1><5b7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5b8>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x58b>
 <1><5bd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x876): sysent
    <5c2>   DW_AT_byte_size   : 20
    <5c3>   DW_AT_decl_file   : 17
    <5c4>   DW_AT_decl_line   : 13
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_sibling     : <0x616>
 <2><5ca>: Abbrev Number: 11 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x103b): nargs
    <5cf>   DW_AT_decl_file   : 17
    <5d0>   DW_AT_decl_line   : 14
    <5d1>   DW_AT_decl_column : 11
    <5d2>   DW_AT_type        : <0x2b>
    <5d6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5d9>: Abbrev Number: 11 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x96d): sys_flags
    <5de>   DW_AT_decl_file   : 17
    <5df>   DW_AT_decl_line   : 15
    <5e0>   DW_AT_decl_column : 6
    <5e1>   DW_AT_type        : <0x64>
    <5e5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5e8>: Abbrev Number: 19 (DW_TAG_member)
    <5e9>   DW_AT_name        : sen
    <5ed>   DW_AT_decl_file   : 17
    <5ee>   DW_AT_decl_line   : 16
    <5ef>   DW_AT_decl_column : 6
    <5f0>   DW_AT_type        : <0x64>
    <5f4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5f7>: Abbrev Number: 11 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x309): sys_func
    <5fc>   DW_AT_decl_file   : 17
    <5fd>   DW_AT_decl_line   : 17
    <5fe>   DW_AT_decl_column : 8
    <5ff>   DW_AT_type        : <0x87d>
    <603>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><606>: Abbrev Number: 11 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x27e): sys_name
    <60b>   DW_AT_decl_file   : 17
    <60c>   DW_AT_decl_line   : 18
    <60d>   DW_AT_decl_column : 14
    <60e>   DW_AT_type        : <0x1d9>
    <612>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><615>: Abbrev Number: 0
 <1><616>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <617>   DW_AT_prototyped  : 1
    <618>   DW_AT_type        : <0x64>
    <61c>   DW_AT_sibling     : <0x626>
 <2><620>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <621>   DW_AT_type        : <0x626>
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x631>
 <1><62c>: Abbrev Number: 3 (DW_TAG_const_type)
    <62d>   DW_AT_type        : <0x626>
 <1><631>: Abbrev Number: 22 (DW_TAG_structure_type)
    <632>   DW_AT_name        : tcb
    <636>   DW_AT_byte_size   : 204
    <637>   DW_AT_decl_file   : 18
    <638>   DW_AT_decl_line   : 262
    <63a>   DW_AT_decl_column : 8
    <63b>   DW_AT_sibling     : <0x87d>
 <2><63f>: Abbrev Number: 23 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x4d6): flags
    <644>   DW_AT_decl_file   : 18
    <645>   DW_AT_decl_line   : 263
    <647>   DW_AT_decl_column : 6
    <648>   DW_AT_type        : <0x64>
    <64c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><64f>: Abbrev Number: 24 (DW_TAG_member)
    <650>   DW_AT_name        : pid
    <654>   DW_AT_decl_file   : 18
    <655>   DW_AT_decl_line   : 264
    <657>   DW_AT_decl_column : 6
    <658>   DW_AT_type        : <0x64>
    <65c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><65f>: Abbrev Number: 23 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <664>   DW_AT_decl_file   : 18
    <665>   DW_AT_decl_line   : 265
    <667>   DW_AT_decl_column : 6
    <668>   DW_AT_type        : <0x64>
    <66c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><66f>: Abbrev Number: 23 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0x39b): currpers
    <674>   DW_AT_decl_file   : 18
    <675>   DW_AT_decl_line   : 267
    <677>   DW_AT_decl_column : 15
    <678>   DW_AT_type        : <0x2b>
    <67c>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><67f>: Abbrev Number: 23 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0xb25): u_error
    <684>   DW_AT_decl_file   : 18
    <685>   DW_AT_decl_line   : 269
    <687>   DW_AT_decl_column : 16
    <688>   DW_AT_type        : <0x37>
    <68c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><68f>: Abbrev Number: 23 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <694>   DW_AT_decl_file   : 18
    <695>   DW_AT_decl_line   : 270
    <697>   DW_AT_decl_column : 17
    <698>   DW_AT_type        : <0x57a>
    <69c>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><69f>: Abbrev Number: 23 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0xb68): true_scno
    <6a4>   DW_AT_decl_file   : 18
    <6a5>   DW_AT_decl_line   : 271
    <6a7>   DW_AT_decl_column : 17
    <6a8>   DW_AT_type        : <0x57a>
    <6ac>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6af>: Abbrev Number: 23 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x1a5): u_arg
    <6b4>   DW_AT_decl_file   : 18
    <6b5>   DW_AT_decl_line   : 272
    <6b7>   DW_AT_decl_column : 17
    <6b8>   DW_AT_type        : <0x9ad>
    <6bc>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6bf>: Abbrev Number: 23 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x984): u_rval
    <6c4>   DW_AT_decl_file   : 18
    <6c5>   DW_AT_decl_line   : 273
    <6c7>   DW_AT_decl_column : 16
    <6c8>   DW_AT_type        : <0x56e>
    <6cc>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6cf>: Abbrev Number: 23 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xa9c): sys_func_rval
    <6d4>   DW_AT_decl_file   : 18
    <6d5>   DW_AT_decl_line   : 274
    <6d7>   DW_AT_decl_column : 6
    <6d8>   DW_AT_type        : <0x64>
    <6dc>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6df>: Abbrev Number: 23 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xce0): curcol
    <6e4>   DW_AT_decl_file   : 18
    <6e5>   DW_AT_decl_line   : 275
    <6e7>   DW_AT_decl_column : 6
    <6e8>   DW_AT_type        : <0x64>
    <6ec>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ef>: Abbrev Number: 23 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x996): outf
    <6f4>   DW_AT_decl_file   : 18
    <6f5>   DW_AT_decl_line   : 276
    <6f7>   DW_AT_decl_column : 8
    <6f8>   DW_AT_type        : <0x41e>
    <6fc>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6ff>: Abbrev Number: 23 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0xf07): staged_output_data
    <704>   DW_AT_decl_file   : 18
    <705>   DW_AT_decl_line   : 277
    <707>   DW_AT_decl_column : 29
    <708>   DW_AT_type        : <0x9c3>
    <70c>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><70f>: Abbrev Number: 23 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0xa67): auxstr
    <714>   DW_AT_decl_file   : 18
    <715>   DW_AT_decl_line   : 279
    <717>   DW_AT_decl_column : 14
    <718>   DW_AT_type        : <0x1d9>
    <71c>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><71f>: Abbrev Number: 23 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x184): _priv_data
    <724>   DW_AT_decl_file   : 18
    <725>   DW_AT_decl_line   : 280
    <727>   DW_AT_decl_column : 8
    <728>   DW_AT_type        : <0xdd>
    <72c>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><72f>: Abbrev Number: 23 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0xbfd): _free_priv_data
    <734>   DW_AT_decl_file   : 18
    <735>   DW_AT_decl_line   : 281
    <737>   DW_AT_decl_column : 9
    <738>   DW_AT_type        : <0x9d5>
    <73c>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><73f>: Abbrev Number: 23 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x195): s_ent
    <744>   DW_AT_decl_file   : 18
    <745>   DW_AT_decl_line   : 282
    <747>   DW_AT_decl_column : 23
    <748>   DW_AT_type        : <0x9db>
    <74c>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><74f>: Abbrev Number: 23 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <754>   DW_AT_decl_file   : 18
    <755>   DW_AT_decl_line   : 285
    <757>   DW_AT_decl_column : 23
    <758>   DW_AT_type        : <0x9db>
    <75c>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><75f>: Abbrev Number: 23 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x390): inject_vec
    <764>   DW_AT_decl_file   : 18
    <765>   DW_AT_decl_line   : 286
    <767>   DW_AT_decl_column : 22
    <768>   DW_AT_type        : <0x9e6>
    <76c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><76f>: Abbrev Number: 23 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x7e7): stime
    <774>   DW_AT_decl_file   : 18
    <775>   DW_AT_decl_line   : 287
    <777>   DW_AT_decl_column : 18
    <778>   DW_AT_type        : <0x143>
    <77c>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><77f>: Abbrev Number: 23 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0x3a4): ltime
    <784>   DW_AT_decl_file   : 18
    <785>   DW_AT_decl_line   : 288
    <787>   DW_AT_decl_column : 18
    <788>   DW_AT_type        : <0x143>
    <78c>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><78f>: Abbrev Number: 23 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x1002): atime
    <794>   DW_AT_decl_file   : 18
    <795>   DW_AT_decl_line   : 289
    <797>   DW_AT_decl_column : 18
    <798>   DW_AT_type        : <0x143>
    <79c>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><79f>: Abbrev Number: 23 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x4d0): etime
    <7a4>   DW_AT_decl_file   : 18
    <7a5>   DW_AT_decl_line   : 290
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x143>
    <7ac>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7b0>: Abbrev Number: 23 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0xd44): delay_expiration_time
    <7b5>   DW_AT_decl_file   : 18
    <7b6>   DW_AT_decl_line   : 291
    <7b8>   DW_AT_decl_column : 18
    <7b9>   DW_AT_type        : <0x143>
    <7bd>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7c1>: Abbrev Number: 23 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7c6>   DW_AT_decl_file   : 18
    <7c7>   DW_AT_decl_line   : 298
    <7c9>   DW_AT_decl_column : 15
    <7ca>   DW_AT_type        : <0x2b>
    <7ce>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7d2>: Abbrev Number: 23 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0xf43): last_dirfd
    <7d7>   DW_AT_decl_file   : 18
    <7d8>   DW_AT_decl_line   : 301
    <7da>   DW_AT_decl_column : 6
    <7db>   DW_AT_type        : <0x64>
    <7df>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7e3>: Abbrev Number: 23 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xf69): mmap_cache
    <7e8>   DW_AT_decl_file   : 18
    <7e9>   DW_AT_decl_line   : 304
    <7eb>   DW_AT_decl_column : 23
    <7ec>   DW_AT_type        : <0xa02>
    <7f0>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7f4>: Abbrev Number: 23 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xb3e): wait_data_idx
    <7f9>   DW_AT_decl_file   : 18
    <7fa>   DW_AT_decl_line   : 311
    <7fc>   DW_AT_decl_column : 9
    <7fd>   DW_AT_type        : <0x132>
    <801>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><805>: Abbrev Number: 23 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xa6e): delayed_wait_data
    <80a>   DW_AT_decl_file   : 18
    <80b>   DW_AT_decl_line   : 313
    <80d>   DW_AT_decl_column : 24
    <80e>   DW_AT_type        : <0xa0e>
    <812>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><816>: Abbrev Number: 23 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0xade): wait_list
    <81b>   DW_AT_decl_file   : 18
    <81c>   DW_AT_decl_line   : 314
    <81e>   DW_AT_decl_column : 19
    <81f>   DW_AT_type        : <0x58b>
    <823>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><827>: Abbrev Number: 23 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x6e4): vcpu_info_list
    <82c>   DW_AT_decl_file   : 18
    <82d>   DW_AT_decl_line   : 318
    <82f>   DW_AT_decl_column : 20
    <830>   DW_AT_type        : <0xa1a>
    <834>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><838>: Abbrev Number: 23 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0xcab): unwind_ctx
    <83d>   DW_AT_decl_file   : 18
    <83e>   DW_AT_decl_line   : 322
    <840>   DW_AT_decl_column : 8
    <841>   DW_AT_type        : <0xdd>
    <845>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><849>: Abbrev Number: 23 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x4b3): unwind_queue
    <84e>   DW_AT_decl_file   : 18
    <84f>   DW_AT_decl_line   : 323
    <851>   DW_AT_decl_column : 25
    <852>   DW_AT_type        : <0xa26>
    <856>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><85a>: Abbrev Number: 23 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x179): comm
    <85f>   DW_AT_decl_file   : 18
    <860>   DW_AT_decl_line   : 327
    <862>   DW_AT_decl_column : 7
    <863>   DW_AT_type        : <0xa2c>
    <867>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><86b>: Abbrev Number: 23 (DW_TAG_member)
    <86c>   DW_AT_name        : (indirect string, offset: 0x229): start_prc
    <870>   DW_AT_decl_file   : 18
    <871>   DW_AT_decl_line   : 329
    <873>   DW_AT_decl_column : 16
    <874>   DW_AT_type        : <0x37>
    <878>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><87c>: Abbrev Number: 0
 <1><87d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <87e>   DW_AT_byte_size   : 4
    <87f>   DW_AT_type        : <0x616>
 <1><883>: Abbrev Number: 4 (DW_TAG_typedef)
    <884>   DW_AT_name        : (indirect string, offset: 0x51c): struct_sysent
    <888>   DW_AT_decl_file   : 17
    <889>   DW_AT_decl_line   : 19
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x5bd>
 <1><88f>: Abbrev Number: 3 (DW_TAG_const_type)
    <890>   DW_AT_type        : <0x883>
 <1><894>: Abbrev Number: 13 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0xd30): current_personality
    <899>   DW_AT_decl_file   : 18
    <89a>   DW_AT_decl_line   : 158
    <89b>   DW_AT_decl_column : 17
    <89c>   DW_AT_type        : <0x2b>
    <8a0>   DW_AT_external    : 1
    <8a1>   DW_AT_declaration : 1
 <1><8a2>: Abbrev Number: 13 (DW_TAG_variable)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x818): current_wordsize
    <8a7>   DW_AT_decl_file   : 18
    <8a8>   DW_AT_decl_line   : 171
    <8a9>   DW_AT_decl_column : 17
    <8aa>   DW_AT_type        : <0x2b>
    <8ae>   DW_AT_external    : 1
    <8af>   DW_AT_declaration : 1
 <1><8b0>: Abbrev Number: 13 (DW_TAG_variable)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xa45): current_klongsize
    <8b5>   DW_AT_decl_file   : 18
    <8b6>   DW_AT_decl_line   : 176
    <8b7>   DW_AT_decl_column : 17
    <8b8>   DW_AT_type        : <0x2b>
    <8bc>   DW_AT_external    : 1
    <8bd>   DW_AT_declaration : 1
 <1><8be>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xc82): ioctlent
    <8c3>   DW_AT_byte_size   : 8
    <8c4>   DW_AT_decl_file   : 18
    <8c5>   DW_AT_decl_line   : 217
    <8c6>   DW_AT_decl_column : 16
    <8c7>   DW_AT_sibling     : <0x8ea>
 <2><8cb>: Abbrev Number: 11 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0xf2f): symbol
    <8d0>   DW_AT_decl_file   : 18
    <8d1>   DW_AT_decl_line   : 218
    <8d2>   DW_AT_decl_column : 14
    <8d3>   DW_AT_type        : <0x1d9>
    <8d7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8da>: Abbrev Number: 11 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0xcf9): code
    <8df>   DW_AT_decl_file   : 18
    <8e0>   DW_AT_decl_line   : 219
    <8e1>   DW_AT_decl_column : 15
    <8e2>   DW_AT_type        : <0x2b>
    <8e6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8e9>: Abbrev Number: 0
 <1><8ea>: Abbrev Number: 4 (DW_TAG_typedef)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xc27): struct_ioctlent
    <8ef>   DW_AT_decl_file   : 18
    <8f0>   DW_AT_decl_line   : 220
    <8f1>   DW_AT_decl_column : 3
    <8f2>   DW_AT_type        : <0x8be>
 <1><8f6>: Abbrev Number: 3 (DW_TAG_const_type)
    <8f7>   DW_AT_type        : <0x8ea>
 <1><8fb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x80c): inject_data
    <900>   DW_AT_byte_size   : 10
    <901>   DW_AT_decl_file   : 18
    <902>   DW_AT_decl_line   : 241
    <903>   DW_AT_decl_column : 8
    <904>   DW_AT_sibling     : <0x963>
 <2><908>: Abbrev Number: 11 (DW_TAG_member)
    <909>   DW_AT_name        : (indirect string, offset: 0x4d6): flags
    <90d>   DW_AT_decl_file   : 18
    <90e>   DW_AT_decl_line   : 242
    <90f>   DW_AT_decl_column : 10
    <910>   DW_AT_type        : <0x102>
    <914>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><917>: Abbrev Number: 11 (DW_TAG_member)
    <918>   DW_AT_name        : (indirect string, offset: 0x921): signo
    <91c>   DW_AT_decl_file   : 18
    <91d>   DW_AT_decl_line   : 243
    <91e>   DW_AT_decl_column : 10
    <91f>   DW_AT_type        : <0x102>
    <923>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><926>: Abbrev Number: 11 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x10b): rval_idx
    <92b>   DW_AT_decl_file   : 18
    <92c>   DW_AT_decl_line   : 244
    <92d>   DW_AT_decl_column : 11
    <92e>   DW_AT_type        : <0x10e>
    <932>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><935>: Abbrev Number: 11 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0xcd6): delay_idx
    <93a>   DW_AT_decl_file   : 18
    <93b>   DW_AT_decl_line   : 245
    <93c>   DW_AT_decl_column : 11
    <93d>   DW_AT_type        : <0x10e>
    <941>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><944>: Abbrev Number: 11 (DW_TAG_member)
    <945>   DW_AT_name        : (indirect string, offset: 0x562): poke_idx
    <949>   DW_AT_decl_file   : 18
    <94a>   DW_AT_decl_line   : 246
    <94b>   DW_AT_decl_column : 11
    <94c>   DW_AT_type        : <0x10e>
    <950>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><953>: Abbrev Number: 11 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <958>   DW_AT_decl_file   : 18
    <959>   DW_AT_decl_line   : 247
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0x10e>
    <95f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><962>: Abbrev Number: 0
 <1><963>: Abbrev Number: 10 (DW_TAG_structure_type)
    <964>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <968>   DW_AT_byte_size   : 16
    <969>   DW_AT_decl_file   : 18
    <96a>   DW_AT_decl_line   : 250
    <96b>   DW_AT_decl_column : 8
    <96c>   DW_AT_sibling     : <0x9ad>
 <2><970>: Abbrev Number: 11 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0xa1a): first
    <975>   DW_AT_decl_file   : 18
    <976>   DW_AT_decl_line   : 251
    <977>   DW_AT_decl_column : 11
    <978>   DW_AT_type        : <0x10e>
    <97c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><97f>: Abbrev Number: 11 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0x1102): last
    <984>   DW_AT_decl_file   : 18
    <985>   DW_AT_decl_line   : 252
    <986>   DW_AT_decl_column : 11
    <987>   DW_AT_type        : <0x10e>
    <98b>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><98e>: Abbrev Number: 11 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x3aa): step
    <993>   DW_AT_decl_file   : 18
    <994>   DW_AT_decl_line   : 253
    <995>   DW_AT_decl_column : 11
    <996>   DW_AT_type        : <0x10e>
    <99a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><99d>: Abbrev Number: 11 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x10d4): data
    <9a2>   DW_AT_decl_file   : 18
    <9a3>   DW_AT_decl_line   : 254
    <9a4>   DW_AT_decl_column : 21
    <9a5>   DW_AT_type        : <0x8fb>
    <9a9>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9ac>: Abbrev Number: 0
 <1><9ad>: Abbrev Number: 6 (DW_TAG_array_type)
    <9ae>   DW_AT_type        : <0x57a>
    <9b2>   DW_AT_sibling     : <0x9bd>
 <2><9b6>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9b7>   DW_AT_type        : <0x2b>
    <9bb>   DW_AT_upper_bound : 5
 <2><9bc>: Abbrev Number: 0
 <1><9bd>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9be>   DW_AT_name        : (indirect string, offset: 0xf07): staged_output_data
    <9c2>   DW_AT_declaration : 1
 <1><9c3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9c4>   DW_AT_byte_size   : 4
    <9c5>   DW_AT_type        : <0x9bd>
 <1><9c9>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9ca>   DW_AT_prototyped  : 1
    <9cb>   DW_AT_sibling     : <0x9d5>
 <2><9cf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9d0>   DW_AT_type        : <0xdd>
 <2><9d4>: Abbrev Number: 0
 <1><9d5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9d6>   DW_AT_byte_size   : 4
    <9d7>   DW_AT_type        : <0x9c9>
 <1><9db>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9dc>   DW_AT_byte_size   : 4
    <9dd>   DW_AT_type        : <0x88f>
 <1><9e1>: Abbrev Number: 3 (DW_TAG_const_type)
    <9e2>   DW_AT_type        : <0x9db>
 <1><9e6>: Abbrev Number: 6 (DW_TAG_array_type)
    <9e7>   DW_AT_type        : <0x9f6>
    <9eb>   DW_AT_sibling     : <0x9f6>
 <2><9ef>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <9f0>   DW_AT_type        : <0x2b>
    <9f4>   DW_AT_upper_bound : 2
 <2><9f5>: Abbrev Number: 0
 <1><9f6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9f7>   DW_AT_byte_size   : 4
    <9f8>   DW_AT_type        : <0x963>
 <1><9fc>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9fd>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <a01>   DW_AT_declaration : 1
 <1><a02>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a03>   DW_AT_byte_size   : 4
    <a04>   DW_AT_type        : <0x9fc>
 <1><a08>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a09>   DW_AT_name        : (indirect string, offset: 0x3c5): tcb_wait_data
    <a0d>   DW_AT_declaration : 1
 <1><a0e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a0f>   DW_AT_byte_size   : 4
    <a10>   DW_AT_type        : <0xa08>
 <1><a14>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a15>   DW_AT_name        : (indirect string, offset: 0x16f): vcpu_info
    <a19>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0xa14>
 <1><a20>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a21>   DW_AT_name        : (indirect string, offset: 0xeeb): unwind_queue_t
    <a25>   DW_AT_declaration : 1
 <1><a26>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_type        : <0xa20>
 <1><a2c>: Abbrev Number: 6 (DW_TAG_array_type)
    <a2d>   DW_AT_type        : <0xf6>
    <a31>   DW_AT_sibling     : <0xa3c>
 <2><a35>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a36>   DW_AT_type        : <0x2b>
    <a3a>   DW_AT_upper_bound : 15
 <2><a3b>: Abbrev Number: 0
 <1><a3c>: Abbrev Number: 12 (DW_TAG_variable)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xb7b): stub_sysent
    <a41>   DW_AT_decl_file   : 18
    <a42>   DW_AT_decl_line   : 403
    <a44>   DW_AT_decl_column : 28
    <a45>   DW_AT_type        : <0x88f>
    <a49>   DW_AT_external    : 1
    <a4a>   DW_AT_declaration : 1
 <1><a4b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x10b7): xlat_type
    <a50>   DW_AT_encoding    : 7	(unsigned)
    <a51>   DW_AT_byte_size   : 4
    <a52>   DW_AT_type        : <0x2b>
    <a56>   DW_AT_decl_file   : 19
    <a57>   DW_AT_decl_line   : 13
    <a58>   DW_AT_decl_column : 6
    <a59>   DW_AT_sibling     : <0xa70>
 <2><a5d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x2d9): XT_NORMAL
    <a62>   DW_AT_const_value : 0
 <2><a63>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0xc3e): XT_SORTED
    <a68>   DW_AT_const_value : 1
 <2><a69>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0xdbc): XT_INDEXED
    <a6e>   DW_AT_const_value : 2
 <2><a6f>: Abbrev Number: 0
 <1><a70>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a71>   DW_AT_name        : (indirect string, offset: 0xba7): xlat_style
    <a75>   DW_AT_encoding    : 7	(unsigned)
    <a76>   DW_AT_byte_size   : 4
    <a77>   DW_AT_type        : <0x2b>
    <a7b>   DW_AT_decl_file   : 19
    <a7c>   DW_AT_decl_line   : 19
    <a7d>   DW_AT_decl_column : 6
    <a7e>   DW_AT_sibling     : <0xaad>
 <2><a82>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a87>   DW_AT_const_value : 0
 <2><a88>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0xbda): XLAT_STYLE_RAW
    <a8d>   DW_AT_const_value : 1
 <2><a8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x1082): XLAT_STYLE_ABBREV
    <a93>   DW_AT_const_value : 2
 <2><a94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x2f6): XLAT_STYLE_VERBOSE
    <a99>   DW_AT_const_value : 3
 <2><a9a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a9f>   DW_AT_const_value : 0
 <2><aa0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <aa5>   DW_AT_const_value : 4
 <2><aa6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x10f1): XLAT_STYLE_FMT_D
    <aab>   DW_AT_const_value : 8
 <2><aac>: Abbrev Number: 0
 <1><aad>: Abbrev Number: 10 (DW_TAG_structure_type)
    <aae>   DW_AT_name        : (indirect string, offset: 0x327): xlat_data
    <ab2>   DW_AT_byte_size   : 12
    <ab3>   DW_AT_decl_file   : 19
    <ab4>   DW_AT_decl_line   : 51
    <ab5>   DW_AT_decl_column : 8
    <ab6>   DW_AT_sibling     : <0xad9>
 <2><aba>: Abbrev Number: 19 (DW_TAG_member)
    <abb>   DW_AT_name        : val
    <abf>   DW_AT_decl_file   : 19
    <ac0>   DW_AT_decl_line   : 52
    <ac1>   DW_AT_decl_column : 11
    <ac2>   DW_AT_type        : <0x126>
    <ac6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ac9>: Abbrev Number: 19 (DW_TAG_member)
    <aca>   DW_AT_name        : str
    <ace>   DW_AT_decl_file   : 19
    <acf>   DW_AT_decl_line   : 53
    <ad0>   DW_AT_decl_column : 14
    <ad1>   DW_AT_type        : <0x1d9>
    <ad5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ad8>: Abbrev Number: 0
 <1><ad9>: Abbrev Number: 3 (DW_TAG_const_type)
    <ada>   DW_AT_type        : <0xaad>
 <1><ade>: Abbrev Number: 10 (DW_TAG_structure_type)
    <adf>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ae3>   DW_AT_byte_size   : 24
    <ae4>   DW_AT_decl_file   : 19
    <ae5>   DW_AT_decl_line   : 56
    <ae6>   DW_AT_decl_column : 8
    <ae7>   DW_AT_sibling     : <0xb37>
 <2><aeb>: Abbrev Number: 11 (DW_TAG_member)
    <aec>   DW_AT_name        : (indirect string, offset: 0x10d4): data
    <af0>   DW_AT_decl_file   : 19
    <af1>   DW_AT_decl_line   : 57
    <af2>   DW_AT_decl_column : 26
    <af3>   DW_AT_type        : <0xb3c>
    <af7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><afa>: Abbrev Number: 11 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x86a): flags_strsz
    <aff>   DW_AT_decl_file   : 19
    <b00>   DW_AT_decl_line   : 58
    <b01>   DW_AT_decl_column : 9
    <b02>   DW_AT_type        : <0x132>
    <b06>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b09>: Abbrev Number: 11 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0xb4c): size
    <b0e>   DW_AT_decl_file   : 19
    <b0f>   DW_AT_decl_line   : 59
    <b10>   DW_AT_decl_column : 11
    <b11>   DW_AT_type        : <0x11a>
    <b15>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b18>: Abbrev Number: 11 (DW_TAG_member)
    <b19>   DW_AT_name        : (indirect string, offset: 0x1a0): type
    <b1d>   DW_AT_decl_file   : 19
    <b1e>   DW_AT_decl_line   : 60
    <b1f>   DW_AT_decl_column : 17
    <b20>   DW_AT_type        : <0xa4b>
    <b24>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b27>: Abbrev Number: 11 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0x738): flags_mask
    <b2c>   DW_AT_decl_file   : 19
    <b2d>   DW_AT_decl_line   : 61
    <b2e>   DW_AT_decl_column : 11
    <b2f>   DW_AT_type        : <0x126>
    <b33>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b36>: Abbrev Number: 0
 <1><b37>: Abbrev Number: 3 (DW_TAG_const_type)
    <b38>   DW_AT_type        : <0xade>
 <1><b3c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b3d>   DW_AT_byte_size   : 4
    <b3e>   DW_AT_type        : <0xad9>
 <1><b42>: Abbrev Number: 6 (DW_TAG_array_type)
    <b43>   DW_AT_type        : <0xb37>
    <b47>   DW_AT_sibling     : <0xb4d>
 <2><b4b>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b4c>: Abbrev Number: 0
 <1><b4d>: Abbrev Number: 3 (DW_TAG_const_type)
    <b4e>   DW_AT_type        : <0xb42>
 <1><b52>: Abbrev Number: 12 (DW_TAG_variable)
    <b53>   DW_AT_name        : (indirect string, offset: 0xe2c): addrfams
    <b57>   DW_AT_decl_file   : 18
    <b58>   DW_AT_decl_line   : 409
    <b5a>   DW_AT_decl_column : 26
    <b5b>   DW_AT_type        : <0xb4d>
    <b5f>   DW_AT_external    : 1
    <b60>   DW_AT_declaration : 1
 <1><b61>: Abbrev Number: 12 (DW_TAG_variable)
    <b62>   DW_AT_name        : (indirect string, offset: 0xd09): arp_hardware_types
    <b66>   DW_AT_decl_file   : 18
    <b67>   DW_AT_decl_line   : 410
    <b69>   DW_AT_decl_column : 26
    <b6a>   DW_AT_type        : <0xb4d>
    <b6e>   DW_AT_external    : 1
    <b6f>   DW_AT_declaration : 1
 <1><b70>: Abbrev Number: 12 (DW_TAG_variable)
    <b71>   DW_AT_name        : (indirect string, offset: 0x1008): at_flags
    <b75>   DW_AT_decl_file   : 18
    <b76>   DW_AT_decl_line   : 411
    <b78>   DW_AT_decl_column : 26
    <b79>   DW_AT_type        : <0xb4d>
    <b7d>   DW_AT_external    : 1
    <b7e>   DW_AT_declaration : 1
 <1><b7f>: Abbrev Number: 12 (DW_TAG_variable)
    <b80>   DW_AT_name        : (indirect string, offset: 0x491): clocknames
    <b84>   DW_AT_decl_file   : 18
    <b85>   DW_AT_decl_line   : 412
    <b87>   DW_AT_decl_column : 26
    <b88>   DW_AT_type        : <0xb4d>
    <b8c>   DW_AT_external    : 1
    <b8d>   DW_AT_declaration : 1
 <1><b8e>: Abbrev Number: 12 (DW_TAG_variable)
    <b8f>   DW_AT_name        : (indirect string, offset: 0xfb7): dirent_types
    <b93>   DW_AT_decl_file   : 18
    <b94>   DW_AT_decl_line   : 413
    <b96>   DW_AT_decl_column : 26
    <b97>   DW_AT_type        : <0xb4d>
    <b9b>   DW_AT_external    : 1
    <b9c>   DW_AT_declaration : 1
 <1><b9d>: Abbrev Number: 12 (DW_TAG_variable)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x8bb): ethernet_protocols
    <ba2>   DW_AT_decl_file   : 18
    <ba3>   DW_AT_decl_line   : 414
    <ba5>   DW_AT_decl_column : 26
    <ba6>   DW_AT_type        : <0xb4d>
    <baa>   DW_AT_external    : 1
    <bab>   DW_AT_declaration : 1
 <1><bac>: Abbrev Number: 12 (DW_TAG_variable)
    <bad>   DW_AT_name        : (indirect string, offset: 0x5b5): inet_protocols
    <bb1>   DW_AT_decl_file   : 18
    <bb2>   DW_AT_decl_line   : 415
    <bb4>   DW_AT_decl_column : 26
    <bb5>   DW_AT_type        : <0xb4d>
    <bb9>   DW_AT_external    : 1
    <bba>   DW_AT_declaration : 1
 <1><bbb>: Abbrev Number: 12 (DW_TAG_variable)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x2c6): evdev_abs
    <bc0>   DW_AT_decl_file   : 18
    <bc1>   DW_AT_decl_line   : 416
    <bc3>   DW_AT_decl_column : 26
    <bc4>   DW_AT_type        : <0xb4d>
    <bc8>   DW_AT_external    : 1
    <bc9>   DW_AT_declaration : 1
 <1><bca>: Abbrev Number: 12 (DW_TAG_variable)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x72d): audit_arch
    <bcf>   DW_AT_decl_file   : 18
    <bd0>   DW_AT_decl_line   : 417
    <bd2>   DW_AT_decl_column : 26
    <bd3>   DW_AT_type        : <0xb4d>
    <bd7>   DW_AT_external    : 1
    <bd8>   DW_AT_declaration : 1
 <1><bd9>: Abbrev Number: 12 (DW_TAG_variable)
    <bda>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bde>   DW_AT_decl_file   : 18
    <bdf>   DW_AT_decl_line   : 418
    <be1>   DW_AT_decl_column : 26
    <be2>   DW_AT_type        : <0xb4d>
    <be6>   DW_AT_external    : 1
    <be7>   DW_AT_declaration : 1
 <1><be8>: Abbrev Number: 12 (DW_TAG_variable)
    <be9>   DW_AT_name        : (indirect string, offset: 0x472): iffflags
    <bed>   DW_AT_decl_file   : 18
    <bee>   DW_AT_decl_line   : 419
    <bf0>   DW_AT_decl_column : 26
    <bf1>   DW_AT_type        : <0xb4d>
    <bf5>   DW_AT_external    : 1
    <bf6>   DW_AT_declaration : 1
 <1><bf7>: Abbrev Number: 12 (DW_TAG_variable)
    <bf8>   DW_AT_name        : (indirect string, offset: 0xbe9): ip_type_of_services
    <bfc>   DW_AT_decl_file   : 18
    <bfd>   DW_AT_decl_line   : 420
    <bff>   DW_AT_decl_column : 26
    <c00>   DW_AT_type        : <0xb4d>
    <c04>   DW_AT_external    : 1
    <c05>   DW_AT_declaration : 1
 <1><c06>: Abbrev Number: 12 (DW_TAG_variable)
    <c07>   DW_AT_name        : (indirect string, offset: 0x6c0): ipc_private
    <c0b>   DW_AT_decl_file   : 18
    <c0c>   DW_AT_decl_line   : 421
    <c0e>   DW_AT_decl_column : 26
    <c0f>   DW_AT_type        : <0xb4d>
    <c13>   DW_AT_external    : 1
    <c14>   DW_AT_declaration : 1
 <1><c15>: Abbrev Number: 12 (DW_TAG_variable)
    <c16>   DW_AT_name        : (indirect string, offset: 0x31d): msg_flags
    <c1a>   DW_AT_decl_file   : 18
    <c1b>   DW_AT_decl_line   : 422
    <c1d>   DW_AT_decl_column : 26
    <c1e>   DW_AT_type        : <0xb4d>
    <c22>   DW_AT_external    : 1
    <c23>   DW_AT_declaration : 1
 <1><c24>: Abbrev Number: 12 (DW_TAG_variable)
    <c25>   DW_AT_name        : (indirect string, offset: 0x114): netlink_protocols
    <c29>   DW_AT_decl_file   : 18
    <c2a>   DW_AT_decl_line   : 423
    <c2c>   DW_AT_decl_column : 26
    <c2d>   DW_AT_type        : <0xb4d>
    <c31>   DW_AT_external    : 1
    <c32>   DW_AT_declaration : 1
 <1><c33>: Abbrev Number: 12 (DW_TAG_variable)
    <c34>   DW_AT_name        : (indirect string, offset: 0xf1a): nl_bridge_vlan_flags
    <c38>   DW_AT_decl_file   : 18
    <c39>   DW_AT_decl_line   : 424
    <c3b>   DW_AT_decl_column : 26
    <c3c>   DW_AT_type        : <0xb4d>
    <c40>   DW_AT_external    : 1
    <c41>   DW_AT_declaration : 1
 <1><c42>: Abbrev Number: 12 (DW_TAG_variable)
    <c43>   DW_AT_name        : (indirect string, offset: 0xda5): nl_netfilter_msg_types
    <c47>   DW_AT_decl_file   : 18
    <c48>   DW_AT_decl_line   : 425
    <c4a>   DW_AT_decl_column : 26
    <c4b>   DW_AT_type        : <0xb4d>
    <c4f>   DW_AT_external    : 1
    <c50>   DW_AT_declaration : 1
 <1><c51>: Abbrev Number: 12 (DW_TAG_variable)
    <c52>   DW_AT_name        : (indirect string, offset: 0x454): nl_route_types
    <c56>   DW_AT_decl_file   : 18
    <c57>   DW_AT_decl_line   : 426
    <c59>   DW_AT_decl_column : 26
    <c5a>   DW_AT_type        : <0xb4d>
    <c5e>   DW_AT_external    : 1
    <c5f>   DW_AT_declaration : 1
 <1><c60>: Abbrev Number: 12 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0xe73): open_access_modes
    <c65>   DW_AT_decl_file   : 18
    <c66>   DW_AT_decl_line   : 427
    <c68>   DW_AT_decl_column : 26
    <c69>   DW_AT_type        : <0xb4d>
    <c6d>   DW_AT_external    : 1
    <c6e>   DW_AT_declaration : 1
 <1><c6f>: Abbrev Number: 12 (DW_TAG_variable)
    <c70>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c74>   DW_AT_decl_file   : 18
    <c75>   DW_AT_decl_line   : 428
    <c77>   DW_AT_decl_column : 26
    <c78>   DW_AT_type        : <0xb4d>
    <c7c>   DW_AT_external    : 1
    <c7d>   DW_AT_declaration : 1
 <1><c7e>: Abbrev Number: 12 (DW_TAG_variable)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xc1a): perf_type_id
    <c83>   DW_AT_decl_file   : 18
    <c84>   DW_AT_decl_line   : 429
    <c86>   DW_AT_decl_column : 26
    <c87>   DW_AT_type        : <0xb4d>
    <c8b>   DW_AT_external    : 1
    <c8c>   DW_AT_declaration : 1
 <1><c8d>: Abbrev Number: 12 (DW_TAG_variable)
    <c8e>   DW_AT_name        : (indirect string, offset: 0xe35): pollflags
    <c92>   DW_AT_decl_file   : 18
    <c93>   DW_AT_decl_line   : 430
    <c95>   DW_AT_decl_column : 26
    <c96>   DW_AT_type        : <0xb4d>
    <c9a>   DW_AT_external    : 1
    <c9b>   DW_AT_declaration : 1
 <1><c9c>: Abbrev Number: 12 (DW_TAG_variable)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x556): ptrace_cmds
    <ca1>   DW_AT_decl_file   : 18
    <ca2>   DW_AT_decl_line   : 431
    <ca4>   DW_AT_decl_column : 26
    <ca5>   DW_AT_type        : <0xb4d>
    <ca9>   DW_AT_external    : 1
    <caa>   DW_AT_declaration : 1
 <1><cab>: Abbrev Number: 12 (DW_TAG_variable)
    <cac>   DW_AT_name        : (indirect string, offset: 0x7fd): resource_flags
    <cb0>   DW_AT_decl_file   : 18
    <cb1>   DW_AT_decl_line   : 432
    <cb3>   DW_AT_decl_column : 26
    <cb4>   DW_AT_type        : <0xb4d>
    <cb8>   DW_AT_external    : 1
    <cb9>   DW_AT_declaration : 1
 <1><cba>: Abbrev Number: 12 (DW_TAG_variable)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x29c): route_nexthop_flags
    <cbf>   DW_AT_decl_file   : 18
    <cc0>   DW_AT_decl_line   : 433
    <cc2>   DW_AT_decl_column : 26
    <cc3>   DW_AT_type        : <0xb4d>
    <cc7>   DW_AT_external    : 1
    <cc8>   DW_AT_declaration : 1
 <1><cc9>: Abbrev Number: 12 (DW_TAG_variable)
    <cca>   DW_AT_name        : (indirect string, offset: 0xea5): routing_protocols
    <cce>   DW_AT_decl_file   : 18
    <ccf>   DW_AT_decl_line   : 434
    <cd1>   DW_AT_decl_column : 26
    <cd2>   DW_AT_type        : <0xb4d>
    <cd6>   DW_AT_external    : 1
    <cd7>   DW_AT_declaration : 1
 <1><cd8>: Abbrev Number: 12 (DW_TAG_variable)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x463): routing_scopes
    <cdd>   DW_AT_decl_file   : 18
    <cde>   DW_AT_decl_line   : 435
    <ce0>   DW_AT_decl_column : 26
    <ce1>   DW_AT_type        : <0xb4d>
    <ce5>   DW_AT_external    : 1
    <ce6>   DW_AT_declaration : 1
 <1><ce7>: Abbrev Number: 12 (DW_TAG_variable)
    <ce8>   DW_AT_name        : (indirect string, offset: 0xd93): routing_table_ids
    <cec>   DW_AT_decl_file   : 18
    <ced>   DW_AT_decl_line   : 436
    <cef>   DW_AT_decl_column : 26
    <cf0>   DW_AT_type        : <0xb4d>
    <cf4>   DW_AT_external    : 1
    <cf5>   DW_AT_declaration : 1
 <1><cf6>: Abbrev Number: 12 (DW_TAG_variable)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x69d): routing_types
    <cfb>   DW_AT_decl_file   : 18
    <cfc>   DW_AT_decl_line   : 437
    <cfe>   DW_AT_decl_column : 26
    <cff>   DW_AT_type        : <0xb4d>
    <d03>   DW_AT_external    : 1
    <d04>   DW_AT_declaration : 1
 <1><d05>: Abbrev Number: 12 (DW_TAG_variable)
    <d06>   DW_AT_name        : (indirect string, offset: 0x1cc): rwf_flags
    <d0a>   DW_AT_decl_file   : 18
    <d0b>   DW_AT_decl_line   : 438
    <d0d>   DW_AT_decl_column : 26
    <d0e>   DW_AT_type        : <0xb4d>
    <d12>   DW_AT_external    : 1
    <d13>   DW_AT_declaration : 1
 <1><d14>: Abbrev Number: 12 (DW_TAG_variable)
    <d15>   DW_AT_name        : (indirect string, offset: 0x835): seccomp_filter_flags
    <d19>   DW_AT_decl_file   : 18
    <d1a>   DW_AT_decl_line   : 439
    <d1c>   DW_AT_decl_column : 26
    <d1d>   DW_AT_type        : <0xb4d>
    <d21>   DW_AT_external    : 1
    <d22>   DW_AT_declaration : 1
 <1><d23>: Abbrev Number: 12 (DW_TAG_variable)
    <d24>   DW_AT_name        : (indirect string, offset: 0x2e3): seccomp_ret_action
    <d28>   DW_AT_decl_file   : 18
    <d29>   DW_AT_decl_line   : 440
    <d2b>   DW_AT_decl_column : 26
    <d2c>   DW_AT_type        : <0xb4d>
    <d30>   DW_AT_external    : 1
    <d31>   DW_AT_declaration : 1
 <1><d32>: Abbrev Number: 12 (DW_TAG_variable)
    <d33>   DW_AT_name        : (indirect string, offset: 0x42f): setns_types
    <d37>   DW_AT_decl_file   : 18
    <d38>   DW_AT_decl_line   : 441
    <d3a>   DW_AT_decl_column : 26
    <d3b>   DW_AT_type        : <0xb4d>
    <d3f>   DW_AT_external    : 1
    <d40>   DW_AT_declaration : 1
 <1><d41>: Abbrev Number: 12 (DW_TAG_variable)
    <d42>   DW_AT_name        : (indirect string, offset: 0xe21): sg_io_info
    <d46>   DW_AT_decl_file   : 18
    <d47>   DW_AT_decl_line   : 442
    <d49>   DW_AT_decl_column : 26
    <d4a>   DW_AT_type        : <0xb4d>
    <d4e>   DW_AT_external    : 1
    <d4f>   DW_AT_declaration : 1
 <1><d50>: Abbrev Number: 12 (DW_TAG_variable)
    <d51>   DW_AT_name        : (indirect string, offset: 0xb8f): socketlayers
    <d55>   DW_AT_decl_file   : 18
    <d56>   DW_AT_decl_line   : 443
    <d58>   DW_AT_decl_column : 26
    <d59>   DW_AT_type        : <0xb4d>
    <d5d>   DW_AT_external    : 1
    <d5e>   DW_AT_declaration : 1
 <1><d5f>: Abbrev Number: 12 (DW_TAG_variable)
    <d60>   DW_AT_name        : (indirect string, offset: 0xd7d): socktypes
    <d64>   DW_AT_decl_file   : 18
    <d65>   DW_AT_decl_line   : 444
    <d67>   DW_AT_decl_column : 26
    <d68>   DW_AT_type        : <0xb4d>
    <d6c>   DW_AT_external    : 1
    <d6d>   DW_AT_declaration : 1
 <1><d6e>: Abbrev Number: 12 (DW_TAG_variable)
    <d6f>   DW_AT_name        : (indirect string, offset: 0xa57): tcp_state_flags
    <d73>   DW_AT_decl_file   : 18
    <d74>   DW_AT_decl_line   : 445
    <d76>   DW_AT_decl_column : 26
    <d77>   DW_AT_type        : <0xb4d>
    <d7b>   DW_AT_external    : 1
    <d7c>   DW_AT_declaration : 1
 <1><d7d>: Abbrev Number: 12 (DW_TAG_variable)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x762): tcp_states
    <d82>   DW_AT_decl_file   : 18
    <d83>   DW_AT_decl_line   : 446
    <d85>   DW_AT_decl_column : 26
    <d86>   DW_AT_type        : <0xb4d>
    <d8a>   DW_AT_external    : 1
    <d8b>   DW_AT_declaration : 1
 <1><d8c>: Abbrev Number: 12 (DW_TAG_variable)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x1065): whence_codes
    <d91>   DW_AT_decl_file   : 18
    <d92>   DW_AT_decl_line   : 447
    <d94>   DW_AT_decl_column : 26
    <d95>   DW_AT_type        : <0xb4d>
    <d99>   DW_AT_external    : 1
    <d9a>   DW_AT_declaration : 1
 <1><d9b>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <d9c>   DW_AT_encoding    : 7	(unsigned)
    <d9d>   DW_AT_byte_size   : 4
    <d9e>   DW_AT_type        : <0x2b>
    <da2>   DW_AT_decl_file   : 18
    <da3>   DW_AT_decl_line   : 508
    <da5>   DW_AT_decl_column : 14
    <da6>   DW_AT_sibling     : <0xdbd>
 <2><daa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0x98b): CFLAG_NONE
    <daf>   DW_AT_const_value : 0
 <2><db0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0x8ce): CFLAG_ONLY_STATS
    <db5>   DW_AT_const_value : 1
 <2><db6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db7>   DW_AT_name        : (indirect string, offset: 0xb9c): CFLAG_BOTH
    <dbb>   DW_AT_const_value : 2
 <2><dbc>: Abbrev Number: 0
 <1><dbd>: Abbrev Number: 29 (DW_TAG_typedef)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x1107): cflag_t
    <dc2>   DW_AT_decl_file   : 18
    <dc3>   DW_AT_decl_line   : 512
    <dc5>   DW_AT_decl_column : 3
    <dc6>   DW_AT_type        : <0xd9b>
 <1><dca>: Abbrev Number: 12 (DW_TAG_variable)
    <dcb>   DW_AT_name        : (indirect string, offset: 0xcd0): cflag
    <dcf>   DW_AT_decl_file   : 18
    <dd0>   DW_AT_decl_line   : 513
    <dd2>   DW_AT_decl_column : 16
    <dd3>   DW_AT_type        : <0xdbd>
    <dd7>   DW_AT_external    : 1
    <dd8>   DW_AT_declaration : 1
 <1><dd9>: Abbrev Number: 12 (DW_TAG_variable)
    <dda>   DW_AT_name        : (indirect string, offset: 0x18f): Tflag
    <dde>   DW_AT_decl_file   : 18
    <ddf>   DW_AT_decl_line   : 514
    <de1>   DW_AT_decl_column : 13
    <de2>   DW_AT_type        : <0x525>
    <de6>   DW_AT_external    : 1
    <de7>   DW_AT_declaration : 1
 <1><de8>: Abbrev Number: 12 (DW_TAG_variable)
    <de9>   DW_AT_name        : (indirect string, offset: 0x7b8): Tflag_scale
    <ded>   DW_AT_decl_file   : 18
    <dee>   DW_AT_decl_line   : 515
    <df0>   DW_AT_decl_column : 12
    <df1>   DW_AT_type        : <0x64>
    <df5>   DW_AT_external    : 1
    <df6>   DW_AT_declaration : 1
 <1><df7>: Abbrev Number: 12 (DW_TAG_variable)
    <df8>   DW_AT_name        : (indirect string, offset: 0x84a): Tflag_width
    <dfc>   DW_AT_decl_file   : 18
    <dfd>   DW_AT_decl_line   : 516
    <dff>   DW_AT_decl_column : 12
    <e00>   DW_AT_type        : <0x64>
    <e04>   DW_AT_external    : 1
    <e05>   DW_AT_declaration : 1
 <1><e06>: Abbrev Number: 12 (DW_TAG_variable)
    <e07>   DW_AT_name        : (indirect string, offset: 0xe13): iflag
    <e0b>   DW_AT_decl_file   : 18
    <e0c>   DW_AT_decl_line   : 517
    <e0e>   DW_AT_decl_column : 13
    <e0f>   DW_AT_type        : <0x525>
    <e13>   DW_AT_external    : 1
    <e14>   DW_AT_declaration : 1
 <1><e15>: Abbrev Number: 12 (DW_TAG_variable)
    <e16>   DW_AT_name        : (indirect string, offset: 0x596): count_wallclock
    <e1a>   DW_AT_decl_file   : 18
    <e1b>   DW_AT_decl_line   : 518
    <e1d>   DW_AT_decl_column : 13
    <e1e>   DW_AT_type        : <0x525>
    <e22>   DW_AT_external    : 1
    <e23>   DW_AT_declaration : 1
 <1><e24>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e25>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e29>   DW_AT_byte_size   : 4
    <e2a>   DW_AT_decl_file   : 18
    <e2b>   DW_AT_decl_line   : 520
    <e2d>   DW_AT_decl_column : 8
    <e2e>   DW_AT_sibling     : <0xe43>
 <2><e32>: Abbrev Number: 23 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e37>   DW_AT_decl_file   : 18
    <e38>   DW_AT_decl_line   : 521
    <e3a>   DW_AT_decl_column : 14
    <e3b>   DW_AT_type        : <0x1d9>
    <e3f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e42>: Abbrev Number: 0
 <1><e43>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e44>   DW_AT_name        : (indirect string, offset: 0x76d): path_set
    <e48>   DW_AT_byte_size   : 12
    <e49>   DW_AT_decl_file   : 18
    <e4a>   DW_AT_decl_line   : 525
    <e4c>   DW_AT_decl_column : 15
    <e4d>   DW_AT_sibling     : <0xe82>
 <2><e51>: Abbrev Number: 23 (DW_TAG_member)
    <e52>   DW_AT_name        : (indirect string, offset: 0x6fb): paths_selected
    <e56>   DW_AT_decl_file   : 18
    <e57>   DW_AT_decl_line   : 526
    <e59>   DW_AT_decl_column : 24
    <e5a>   DW_AT_type        : <0xe82>
    <e5e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e61>: Abbrev Number: 23 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x1058): num_selected
    <e66>   DW_AT_decl_file   : 18
    <e67>   DW_AT_decl_line   : 527
    <e69>   DW_AT_decl_column : 9
    <e6a>   DW_AT_type        : <0x132>
    <e6e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e71>: Abbrev Number: 23 (DW_TAG_member)
    <e72>   DW_AT_name        : (indirect string, offset: 0xb4c): size
    <e76>   DW_AT_decl_file   : 18
    <e77>   DW_AT_decl_line   : 528
    <e79>   DW_AT_decl_column : 9
    <e7a>   DW_AT_type        : <0x132>
    <e7e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e81>: Abbrev Number: 0
 <1><e82>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e83>   DW_AT_byte_size   : 4
    <e84>   DW_AT_type        : <0xe24>
 <1><e88>: Abbrev Number: 12 (DW_TAG_variable)
    <e89>   DW_AT_name        : (indirect string, offset: 0x10a7): global_path_set
    <e8d>   DW_AT_decl_file   : 18
    <e8e>   DW_AT_decl_line   : 529
    <e90>   DW_AT_decl_column : 3
    <e91>   DW_AT_type        : <0xe43>
    <e95>   DW_AT_external    : 1
    <e96>   DW_AT_declaration : 1
 <1><e97>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e98>   DW_AT_name        : (indirect string, offset: 0xf92): xflag_opts
    <e9c>   DW_AT_encoding    : 7	(unsigned)
    <e9d>   DW_AT_byte_size   : 4
    <e9e>   DW_AT_type        : <0x2b>
    <ea2>   DW_AT_decl_file   : 18
    <ea3>   DW_AT_decl_line   : 531
    <ea5>   DW_AT_decl_column : 6
    <ea6>   DW_AT_sibling     : <0xec9>
 <2><eaa>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eab>   DW_AT_name        : (indirect string, offset: 0xa0e): HEXSTR_NONE
    <eaf>   DW_AT_const_value : 0
 <2><eb0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xfd9): HEXSTR_NON_ASCII
    <eb5>   DW_AT_const_value : 1
 <2><eb6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x90c): HEXSTR_ALL
    <ebb>   DW_AT_const_value : 2
 <2><ebc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x67d): HEXSTR_NON_ASCII_CHARS
    <ec1>   DW_AT_const_value : 3
 <2><ec2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x1072): NUM_HEXSTR_OPTS
    <ec7>   DW_AT_const_value : 4
 <2><ec8>: Abbrev Number: 0
 <1><ec9>: Abbrev Number: 12 (DW_TAG_variable)
    <eca>   DW_AT_name        : (indirect string, offset: 0xded): xflag
    <ece>   DW_AT_decl_file   : 18
    <ecf>   DW_AT_decl_line   : 544
    <ed1>   DW_AT_decl_column : 17
    <ed2>   DW_AT_type        : <0x2b>
    <ed6>   DW_AT_external    : 1
    <ed7>   DW_AT_declaration : 1
 <1><ed8>: Abbrev Number: 12 (DW_TAG_variable)
    <ed9>   DW_AT_name        : (indirect string, offset: 0xc8b): followfork
    <edd>   DW_AT_decl_file   : 18
    <ede>   DW_AT_decl_line   : 545
    <ee0>   DW_AT_decl_column : 13
    <ee1>   DW_AT_type        : <0x525>
    <ee5>   DW_AT_external    : 1
    <ee6>   DW_AT_declaration : 1
 <1><ee7>: Abbrev Number: 12 (DW_TAG_variable)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x331): output_separately
    <eec>   DW_AT_decl_file   : 18
    <eed>   DW_AT_decl_line   : 546
    <eef>   DW_AT_decl_column : 13
    <ef0>   DW_AT_type        : <0x525>
    <ef4>   DW_AT_external    : 1
    <ef5>   DW_AT_declaration : 1
 <1><ef6>: Abbrev Number: 12 (DW_TAG_variable)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x233): stack_trace_enabled
    <efb>   DW_AT_decl_file   : 18
    <efc>   DW_AT_decl_line   : 549
    <efe>   DW_AT_decl_column : 13
    <eff>   DW_AT_type        : <0x525>
    <f03>   DW_AT_external    : 1
    <f04>   DW_AT_declaration : 1
 <1><f05>: Abbrev Number: 12 (DW_TAG_variable)
    <f06>   DW_AT_name        : (indirect string, offset: 0x65b): ptrace_setoptions
    <f0a>   DW_AT_decl_file   : 18
    <f0b>   DW_AT_decl_line   : 553
    <f0d>   DW_AT_decl_column : 17
    <f0e>   DW_AT_type        : <0x2b>
    <f12>   DW_AT_external    : 1
    <f13>   DW_AT_declaration : 1
 <1><f14>: Abbrev Number: 12 (DW_TAG_variable)
    <f15>   DW_AT_name        : (indirect string, offset: 0xa03): max_strlen
    <f19>   DW_AT_decl_file   : 18
    <f1a>   DW_AT_decl_line   : 554
    <f1c>   DW_AT_decl_column : 17
    <f1d>   DW_AT_type        : <0x2b>
    <f21>   DW_AT_external    : 1
    <f22>   DW_AT_declaration : 1
 <1><f23>: Abbrev Number: 12 (DW_TAG_variable)
    <f24>   DW_AT_name        : (indirect string, offset: 0xa31): os_release
    <f28>   DW_AT_decl_file   : 18
    <f29>   DW_AT_decl_line   : 555
    <f2b>   DW_AT_decl_column : 17
    <f2c>   DW_AT_type        : <0x2b>
    <f30>   DW_AT_external    : 1
    <f31>   DW_AT_declaration : 1
 <1><f32>: Abbrev Number: 12 (DW_TAG_variable)
    <f33>   DW_AT_name        : (indirect string, offset: 0x70a): xlat_verbosity
    <f37>   DW_AT_decl_file   : 18
    <f38>   DW_AT_decl_line   : 917
    <f3a>   DW_AT_decl_column : 24
    <f3b>   DW_AT_type        : <0xa70>
    <f3f>   DW_AT_external    : 1
    <f40>   DW_AT_declaration : 1
 <1><f41>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f42>   DW_AT_name        : (indirect string, offset: 0x579): xlat_style_private_flag_bits
    <f46>   DW_AT_encoding    : 7	(unsigned)
    <f47>   DW_AT_byte_size   : 4
    <f48>   DW_AT_type        : <0x2b>
    <f4c>   DW_AT_decl_file   : 18
    <f4d>   DW_AT_decl_line   : 937
    <f4f>   DW_AT_decl_column : 6
    <f50>   DW_AT_sibling     : <0xf6d>
 <2><f54>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0x2b0): PAF_PRINT_INDICES_BIT
    <f59>   DW_AT_const_value : 5
 <2><f5a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0xaf9): PAF_ARRAY_TRUNCATED_BIT
    <f5f>   DW_AT_const_value : 6
 <2><f60>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0x3ef): PXF_DEFAULT_STR_BIT
    <f65>   DW_AT_const_value : 7
 <2><f66>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f67>   DW_AT_name        : (indirect string, offset: 0xc6d): SPFF_AUXSTR_MODE_BIT
    <f6b>   DW_AT_const_value : 8
 <2><f6c>: Abbrev Number: 0
 <1><f6d>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f6e>   DW_AT_name        : (indirect string, offset: 0xd1c): find_xlat_flag_bits
    <f72>   DW_AT_encoding    : 7	(unsigned)
    <f73>   DW_AT_byte_size   : 4
    <f74>   DW_AT_type        : <0x2b>
    <f78>   DW_AT_decl_file   : 18
    <f79>   DW_AT_decl_line   : 1441
    <f7b>   DW_AT_decl_column : 6
    <f7c>   DW_AT_sibling     : <0xf87>
 <2><f80>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f81>   DW_AT_name        : (indirect string, offset: 0x949): FXL_CASE_SENSITIVE_BIT
    <f85>   DW_AT_const_value : 0
 <2><f86>: Abbrev Number: 0
 <1><f87>: Abbrev Number: 12 (DW_TAG_variable)
    <f88>   DW_AT_name        : (indirect string, offset: 0x9d6): printing_tcp
    <f8c>   DW_AT_decl_file   : 18
    <f8d>   DW_AT_decl_line   : 1687
    <f8f>   DW_AT_decl_column : 20
    <f90>   DW_AT_type        : <0x626>
    <f94>   DW_AT_external    : 1
    <f95>   DW_AT_declaration : 1
 <1><f96>: Abbrev Number: 12 (DW_TAG_variable)
    <f97>   DW_AT_name        : (indirect string, offset: 0x541): errnoent
    <f9b>   DW_AT_decl_file   : 18
    <f9c>   DW_AT_decl_line   : 1885
    <f9e>   DW_AT_decl_column : 26
    <f9f>   DW_AT_type        : <0x459>
    <fa3>   DW_AT_external    : 1
    <fa4>   DW_AT_declaration : 1
 <1><fa5>: Abbrev Number: 12 (DW_TAG_variable)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x856): signalent
    <faa>   DW_AT_decl_file   : 18
    <fab>   DW_AT_decl_line   : 1886
    <fad>   DW_AT_decl_column : 26
    <fae>   DW_AT_type        : <0x459>
    <fb2>   DW_AT_external    : 1
    <fb3>   DW_AT_declaration : 1
 <1><fb4>: Abbrev Number: 12 (DW_TAG_variable)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xe6b): nerrnos
    <fb9>   DW_AT_decl_file   : 18
    <fba>   DW_AT_decl_line   : 1887
    <fbc>   DW_AT_decl_column : 27
    <fbd>   DW_AT_type        : <0x32>
    <fc1>   DW_AT_external    : 1
    <fc2>   DW_AT_declaration : 1
 <1><fc3>: Abbrev Number: 12 (DW_TAG_variable)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x1041): nsignals
    <fc8>   DW_AT_decl_file   : 18
    <fc9>   DW_AT_decl_line   : 1888
    <fcb>   DW_AT_decl_column : 27
    <fcc>   DW_AT_type        : <0x32>
    <fd0>   DW_AT_external    : 1
    <fd1>   DW_AT_declaration : 1
 <1><fd2>: Abbrev Number: 6 (DW_TAG_array_type)
    <fd3>   DW_AT_type        : <0x88f>
    <fd7>   DW_AT_sibling     : <0xfdd>
 <2><fdb>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fdc>: Abbrev Number: 0
 <1><fdd>: Abbrev Number: 3 (DW_TAG_const_type)
    <fde>   DW_AT_type        : <0xfd2>
 <1><fe2>: Abbrev Number: 12 (DW_TAG_variable)
    <fe3>   DW_AT_name        : (indirect string, offset: 0xce7): sysent0
    <fe7>   DW_AT_decl_file   : 18
    <fe8>   DW_AT_decl_line   : 1890
    <fea>   DW_AT_decl_column : 28
    <feb>   DW_AT_type        : <0xfdd>
    <fef>   DW_AT_external    : 1
    <ff0>   DW_AT_declaration : 1
 <1><ff1>: Abbrev Number: 6 (DW_TAG_array_type)
    <ff2>   DW_AT_type        : <0x8f6>
    <ff6>   DW_AT_sibling     : <0xffc>
 <2><ffa>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><ffb>: Abbrev Number: 0
 <1><ffc>: Abbrev Number: 3 (DW_TAG_const_type)
    <ffd>   DW_AT_type        : <0xff1>
 <1><1001>: Abbrev Number: 12 (DW_TAG_variable)
    <1002>   DW_AT_name        : (indirect string, offset: 0x109d): ioctlent0
    <1006>   DW_AT_decl_file   : 18
    <1007>   DW_AT_decl_line   : 1891
    <1009>   DW_AT_decl_column : 30
    <100a>   DW_AT_type        : <0xffc>
    <100e>   DW_AT_external    : 1
    <100f>   DW_AT_declaration : 1
 <1><1010>: Abbrev Number: 12 (DW_TAG_variable)
    <1011>   DW_AT_name        : (indirect string, offset: 0xf9d): personality_names
    <1015>   DW_AT_decl_file   : 18
    <1016>   DW_AT_decl_line   : 1893
    <1018>   DW_AT_decl_column : 26
    <1019>   DW_AT_type        : <0x459>
    <101d>   DW_AT_external    : 1
    <101e>   DW_AT_declaration : 1
 <1><101f>: Abbrev Number: 12 (DW_TAG_variable)
    <1020>   DW_AT_name        : (indirect string, offset: 0x876): sysent
    <1024>   DW_AT_decl_file   : 18
    <1025>   DW_AT_decl_line   : 1896
    <1027>   DW_AT_decl_column : 29
    <1028>   DW_AT_type        : <0x9db>
    <102c>   DW_AT_external    : 1
    <102d>   DW_AT_declaration : 1
 <1><102e>: Abbrev Number: 12 (DW_TAG_variable)
    <102f>   DW_AT_name        : (indirect string, offset: 0xc82): ioctlent
    <1033>   DW_AT_decl_file   : 18
    <1034>   DW_AT_decl_line   : 1897
    <1036>   DW_AT_decl_column : 31
    <1037>   DW_AT_type        : <0x103d>
    <103b>   DW_AT_external    : 1
    <103c>   DW_AT_declaration : 1
 <1><103d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <103e>   DW_AT_byte_size   : 4
    <103f>   DW_AT_type        : <0x8f6>
 <1><1043>: Abbrev Number: 12 (DW_TAG_variable)
    <1044>   DW_AT_name        : (indirect string, offset: 0x860): nsyscalls
    <1048>   DW_AT_decl_file   : 18
    <1049>   DW_AT_decl_line   : 1903
    <104b>   DW_AT_decl_column : 17
    <104c>   DW_AT_type        : <0x2b>
    <1050>   DW_AT_external    : 1
    <1051>   DW_AT_declaration : 1
 <1><1052>: Abbrev Number: 12 (DW_TAG_variable)
    <1053>   DW_AT_name        : (indirect string, offset: 0xe85): nioctlents
    <1057>   DW_AT_decl_file   : 18
    <1058>   DW_AT_decl_line   : 1904
    <105a>   DW_AT_decl_column : 17
    <105b>   DW_AT_type        : <0x2b>
    <105f>   DW_AT_external    : 1
    <1060>   DW_AT_declaration : 1
 <1><1061>: Abbrev Number: 6 (DW_TAG_array_type)
    <1062>   DW_AT_type        : <0x32>
    <1066>   DW_AT_sibling     : <0x1071>
 <2><106a>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <106b>   DW_AT_type        : <0x2b>
    <106f>   DW_AT_upper_bound : 2
 <2><1070>: Abbrev Number: 0
 <1><1071>: Abbrev Number: 3 (DW_TAG_const_type)
    <1072>   DW_AT_type        : <0x1061>
 <1><1076>: Abbrev Number: 12 (DW_TAG_variable)
    <1077>   DW_AT_name        : (indirect string, offset: 0xefa): nsyscall_vec
    <107b>   DW_AT_decl_file   : 18
    <107c>   DW_AT_decl_line   : 1906
    <107e>   DW_AT_decl_column : 27
    <107f>   DW_AT_type        : <0x1071>
    <1083>   DW_AT_external    : 1
    <1084>   DW_AT_declaration : 1
 <1><1085>: Abbrev Number: 6 (DW_TAG_array_type)
    <1086>   DW_AT_type        : <0x9e1>
    <108a>   DW_AT_sibling     : <0x1095>
 <2><108e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <108f>   DW_AT_type        : <0x2b>
    <1093>   DW_AT_upper_bound : 2
 <2><1094>: Abbrev Number: 0
 <1><1095>: Abbrev Number: 3 (DW_TAG_const_type)
    <1096>   DW_AT_type        : <0x1085>
 <1><109a>: Abbrev Number: 12 (DW_TAG_variable)
    <109b>   DW_AT_name        : (indirect string, offset: 0x7a5): sysent_vec
    <109f>   DW_AT_decl_file   : 18
    <10a0>   DW_AT_decl_line   : 1907
    <10a2>   DW_AT_decl_column : 35
    <10a3>   DW_AT_type        : <0x1095>
    <10a7>   DW_AT_external    : 1
    <10a8>   DW_AT_declaration : 1
 <1><10a9>: Abbrev Number: 12 (DW_TAG_variable)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x390): inject_vec
    <10ae>   DW_AT_decl_file   : 18
    <10af>   DW_AT_decl_line   : 1908
    <10b1>   DW_AT_decl_column : 28
    <10b2>   DW_AT_type        : <0x9e6>
    <10b6>   DW_AT_external    : 1
    <10b7>   DW_AT_declaration : 1
 <1><10b8>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10b9>   DW_AT_name        : (indirect string, offset: 0xd70): audit_arch_t
    <10bd>   DW_AT_byte_size   : 8
    <10be>   DW_AT_decl_file   : 18
    <10bf>   DW_AT_decl_line   : 1910
    <10c1>   DW_AT_decl_column : 8
    <10c2>   DW_AT_sibling     : <0x10e7>
 <2><10c6>: Abbrev Number: 23 (DW_TAG_member)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x56b): arch
    <10cb>   DW_AT_decl_file   : 18
    <10cc>   DW_AT_decl_line   : 1911
    <10ce>   DW_AT_decl_column : 15
    <10cf>   DW_AT_type        : <0x2b>
    <10d3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10d6>: Abbrev Number: 23 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x9bc): flag
    <10db>   DW_AT_decl_file   : 18
    <10dc>   DW_AT_decl_line   : 1912
    <10de>   DW_AT_decl_column : 15
    <10df>   DW_AT_type        : <0x2b>
    <10e3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10e6>: Abbrev Number: 0
 <1><10e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e8>   DW_AT_type        : <0x10b8>
 <1><10ec>: Abbrev Number: 6 (DW_TAG_array_type)
    <10ed>   DW_AT_type        : <0x10e7>
    <10f1>   DW_AT_sibling     : <0x10fc>
 <2><10f5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10f6>   DW_AT_type        : <0x2b>
    <10fa>   DW_AT_upper_bound : 2
 <2><10fb>: Abbrev Number: 0
 <1><10fc>: Abbrev Number: 3 (DW_TAG_const_type)
    <10fd>   DW_AT_type        : <0x10ec>
 <1><1101>: Abbrev Number: 12 (DW_TAG_variable)
    <1102>   DW_AT_name        : (indirect string, offset: 0x93a): audit_arch_vec
    <1106>   DW_AT_decl_file   : 18
    <1107>   DW_AT_decl_line   : 1915
    <1109>   DW_AT_decl_column : 34
    <110a>   DW_AT_type        : <0x10fc>
    <110e>   DW_AT_external    : 1
    <110f>   DW_AT_declaration : 1
 <1><1110>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1111>   DW_AT_byte_size   : 180
    <1112>   DW_AT_decl_file   : 20
    <1113>   DW_AT_decl_line   : 2
    <1114>   DW_AT_decl_column : 9
    <1115>   DW_AT_sibling     : <0x13ca>
 <2><1119>: Abbrev Number: 11 (DW_TAG_member)
    <111a>   DW_AT_name        : (indirect string, offset: 0x1e4): block_ioctl
    <111e>   DW_AT_decl_file   : 20
    <111f>   DW_AT_decl_line   : 3
    <1120>   DW_AT_decl_column : 8
    <1121>   DW_AT_type        : <0x13e4>
    <1125>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1128>: Abbrev Number: 11 (DW_TAG_member)
    <1129>   DW_AT_name        : (indirect string, offset: 0xa90): btrfs_ioctl
    <112d>   DW_AT_decl_file   : 20
    <112e>   DW_AT_decl_line   : 6
    <112f>   DW_AT_decl_column : 8
    <1130>   DW_AT_type        : <0x13e4>
    <1134>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1137>: Abbrev Number: 11 (DW_TAG_member)
    <1138>   DW_AT_name        : (indirect string, offset: 0x743): evdev_write_ioctl_mpers
    <113c>   DW_AT_decl_file   : 20
    <113d>   DW_AT_decl_line   : 9
    <113e>   DW_AT_decl_column : 8
    <113f>   DW_AT_type        : <0x13e4>
    <1143>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1146>: Abbrev Number: 11 (DW_TAG_member)
    <1147>   DW_AT_name        : (indirect string, offset: 0x719): get_sock_fprog_size
    <114b>   DW_AT_decl_file   : 20
    <114c>   DW_AT_decl_line   : 12
    <114d>   DW_AT_decl_column : 17
    <114e>   DW_AT_type        : <0x13f0>
    <1152>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1155>: Abbrev Number: 11 (DW_TAG_member)
    <1156>   DW_AT_name        : (indirect string, offset: 0x1ab): fetch_bpf_fprog
    <115a>   DW_AT_decl_file   : 20
