Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1689 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5a6): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3a6): mpers-m32/struct_sigset_addr_size.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe38): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x37c): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfa8): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x940): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 1
    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x31f): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x235): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xd8a): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x46f): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x846): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe89): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x876): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x751): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb1b): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb51): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x29b): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xc9d): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc12): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3ec): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x438): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x32b): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb3c): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf31): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xd9a): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_byte_size   : 128
    <135>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 5
    <137>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x14c>
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe27): __val
    <141>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 7
    <143>   DW_AT_decl_column : 21
    <144>   DW_AT_type        : <0x14c>
    <148>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 10 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0x37>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x2b>
    <15a>   DW_AT_upper_bound : 31
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 4 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0x107e): __sigset_t
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 8
    <163>   DW_AT_decl_column : 3
    <164>   DW_AT_type        : <0x133>
 <1><168>: Abbrev Number: 4 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x124): sigset_t
    <16d>   DW_AT_decl_file   : 5
    <16e>   DW_AT_decl_line   : 7
    <16f>   DW_AT_decl_column : 20
    <170>   DW_AT_type        : <0x15c>
 <1><174>: Abbrev Number: 12 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0xac4): timespec
    <179>   DW_AT_byte_size   : 8
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 10
    <17c>   DW_AT_decl_column : 8
    <17d>   DW_AT_sibling     : <0x1a0>
 <2><181>: Abbrev Number: 9 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x1093): tv_sec
    <186>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 12
    <188>   DW_AT_decl_column : 12
    <189>   DW_AT_type        : <0xc1>
    <18d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><190>: Abbrev Number: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xdcb): tv_nsec
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 16
    <197>   DW_AT_decl_column : 21
    <198>   DW_AT_type        : <0xd4>
    <19c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><19f>: Abbrev Number: 0
 <1><1a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a1>   DW_AT_byte_size   : 12
    <1a2>   DW_AT_encoding    : 4	(float)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xa86): long double
 <1><1a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a8>   DW_AT_byte_size   : 16
    <1a9>   DW_AT_encoding    : 4	(float)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xf6c): _Float128
 <1><1ae>: Abbrev Number: 13 (DW_TAG_variable)
    <1af>   DW_AT_name        : (indirect string, offset: 0x252): __environ
    <1b3>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 543
    <1b6>   DW_AT_decl_column : 15
    <1b7>   DW_AT_type        : <0x1bd>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1be>   DW_AT_byte_size   : 4
    <1bf>   DW_AT_type        : <0xe0>
 <1><1c3>: Abbrev Number: 13 (DW_TAG_variable)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x374): environ
    <1c8>   DW_AT_decl_file   : 7
    <1c9>   DW_AT_decl_line   : 545
    <1cb>   DW_AT_decl_column : 15
    <1cc>   DW_AT_type        : <0x1bd>
    <1d0>   DW_AT_external    : 1
    <1d1>   DW_AT_declaration : 1
 <1><1d2>: Abbrev Number: 14 (DW_TAG_variable)
    <1d3>   DW_AT_name        : (indirect string, offset: 0xf92): optarg
    <1d7>   DW_AT_decl_file   : 8
    <1d8>   DW_AT_decl_line   : 36
    <1d9>   DW_AT_decl_column : 14
    <1da>   DW_AT_type        : <0xe0>
    <1de>   DW_AT_external    : 1
    <1df>   DW_AT_declaration : 1
 <1><1e0>: Abbrev Number: 14 (DW_TAG_variable)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x724): optind
    <1e5>   DW_AT_decl_file   : 8
    <1e6>   DW_AT_decl_line   : 50
    <1e7>   DW_AT_decl_column : 12
    <1e8>   DW_AT_type        : <0x64>
    <1ec>   DW_AT_external    : 1
    <1ed>   DW_AT_declaration : 1
 <1><1ee>: Abbrev Number: 14 (DW_TAG_variable)
    <1ef>   DW_AT_name        : (indirect string, offset: 0xc01): opterr
    <1f3>   DW_AT_decl_file   : 8
    <1f4>   DW_AT_decl_line   : 55
    <1f5>   DW_AT_decl_column : 12
    <1f6>   DW_AT_type        : <0x64>
    <1fa>   DW_AT_external    : 1
    <1fb>   DW_AT_declaration : 1
 <1><1fc>: Abbrev Number: 14 (DW_TAG_variable)
    <1fd>   DW_AT_name        : (indirect string, offset: 0xb01): optopt
    <201>   DW_AT_decl_file   : 8
    <202>   DW_AT_decl_line   : 59
    <203>   DW_AT_decl_column : 12
    <204>   DW_AT_type        : <0x64>
    <208>   DW_AT_external    : 1
    <209>   DW_AT_declaration : 1
 <1><20a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <20b>   DW_AT_byte_size   : 4
    <20c>   DW_AT_type        : <0xed>
 <1><210>: Abbrev Number: 3 (DW_TAG_const_type)
    <211>   DW_AT_type        : <0x20a>
 <1><215>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <216>   DW_AT_byte_size   : 4
    <217>   DW_AT_type        : <0x21b>
 <1><21b>: Abbrev Number: 15 (DW_TAG_const_type)
 <1><21c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <21d>   DW_AT_name        : (indirect string, offset: 0x333): _IO_FILE
    <221>   DW_AT_byte_size   : 148
    <222>   DW_AT_decl_file   : 9
    <223>   DW_AT_decl_line   : 49
    <224>   DW_AT_decl_column : 8
    <225>   DW_AT_sibling     : <0x3dd>
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x9d3): _flags
    <22e>   DW_AT_decl_file   : 9
    <22f>   DW_AT_decl_line   : 51
    <230>   DW_AT_decl_column : 7
    <231>   DW_AT_type        : <0x64>
    <235>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><238>: Abbrev Number: 9 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x4be): _IO_read_ptr
    <23d>   DW_AT_decl_file   : 9
    <23e>   DW_AT_decl_line   : 54
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0xe0>
    <244>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><247>: Abbrev Number: 9 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0xede): _IO_read_end
    <24c>   DW_AT_decl_file   : 9
    <24d>   DW_AT_decl_line   : 55
    <24e>   DW_AT_decl_column : 9
    <24f>   DW_AT_type        : <0xe0>
    <253>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><256>: Abbrev Number: 9 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x78d): _IO_read_base
    <25b>   DW_AT_decl_file   : 9
    <25c>   DW_AT_decl_line   : 56
    <25d>   DW_AT_decl_column : 9
    <25e>   DW_AT_type        : <0xe0>
    <262>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><265>: Abbrev Number: 9 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x9b4): _IO_write_base
    <26a>   DW_AT_decl_file   : 9
    <26b>   DW_AT_decl_line   : 57
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0xe0>
    <271>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><274>: Abbrev Number: 9 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0xfe1): _IO_write_ptr
    <279>   DW_AT_decl_file   : 9
    <27a>   DW_AT_decl_line   : 58
    <27b>   DW_AT_decl_column : 9
    <27c>   DW_AT_type        : <0xe0>
    <280>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><283>: Abbrev Number: 9 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0x8b8): _IO_write_end
    <288>   DW_AT_decl_file   : 9
    <289>   DW_AT_decl_line   : 59
    <28a>   DW_AT_decl_column : 9
    <28b>   DW_AT_type        : <0xe0>
    <28f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><292>: Abbrev Number: 9 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x929): _IO_buf_base
    <297>   DW_AT_decl_file   : 9
    <298>   DW_AT_decl_line   : 60
    <299>   DW_AT_decl_column : 9
    <29a>   DW_AT_type        : <0xe0>
    <29e>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><2a1>: Abbrev Number: 9 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0xd35): _IO_buf_end
    <2a6>   DW_AT_decl_file   : 9
    <2a7>   DW_AT_decl_line   : 61
    <2a8>   DW_AT_decl_column : 9
    <2a9>   DW_AT_type        : <0xe0>
    <2ad>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><2b0>: Abbrev Number: 9 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x1af): _IO_save_base
    <2b5>   DW_AT_decl_file   : 9
    <2b6>   DW_AT_decl_line   : 64
    <2b7>   DW_AT_decl_column : 9
    <2b8>   DW_AT_type        : <0xe0>
    <2bc>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><2bf>: Abbrev Number: 9 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0xc64): _IO_backup_base
    <2c4>   DW_AT_decl_file   : 9
    <2c5>   DW_AT_decl_line   : 65
    <2c6>   DW_AT_decl_column : 9
    <2c7>   DW_AT_type        : <0xe0>
    <2cb>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2ce>: Abbrev Number: 9 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <2d3>   DW_AT_decl_file   : 9
    <2d4>   DW_AT_decl_line   : 66
    <2d5>   DW_AT_decl_column : 9
    <2d6>   DW_AT_type        : <0xe0>
    <2da>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2dd>: Abbrev Number: 9 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x552): _markers
    <2e2>   DW_AT_decl_file   : 9
    <2e3>   DW_AT_decl_line   : 68
    <2e4>   DW_AT_decl_column : 22
    <2e5>   DW_AT_type        : <0x3f7>
    <2e9>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ec>: Abbrev Number: 9 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1f2): _chain
    <2f1>   DW_AT_decl_file   : 9
    <2f2>   DW_AT_decl_line   : 70
    <2f3>   DW_AT_decl_column : 20
    <2f4>   DW_AT_type        : <0x3fd>
    <2f8>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2fb>: Abbrev Number: 9 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0xf57): _fileno
    <300>   DW_AT_decl_file   : 9
    <301>   DW_AT_decl_line   : 72
    <302>   DW_AT_decl_column : 7
    <303>   DW_AT_type        : <0x64>
    <307>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><30a>: Abbrev Number: 9 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x779): _flags2
    <30f>   DW_AT_decl_file   : 9
    <310>   DW_AT_decl_line   : 73
    <311>   DW_AT_decl_column : 7
    <312>   DW_AT_type        : <0x64>
    <316>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><319>: Abbrev Number: 9 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x7f2): _old_offset
    <31e>   DW_AT_decl_file   : 9
    <31f>   DW_AT_decl_line   : 74
    <320>   DW_AT_decl_column : 11
    <321>   DW_AT_type        : <0xa2>
    <325>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><328>: Abbrev Number: 9 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x220): _cur_column
    <32d>   DW_AT_decl_file   : 9
    <32e>   DW_AT_decl_line   : 77
    <32f>   DW_AT_decl_column : 18
    <330>   DW_AT_type        : <0x24>
    <334>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><337>: Abbrev Number: 9 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0xdf1): _vtable_offset
    <33c>   DW_AT_decl_file   : 9
    <33d>   DW_AT_decl_line   : 78
    <33e>   DW_AT_decl_column : 15
    <33f>   DW_AT_type        : <0x3e>
    <343>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><346>: Abbrev Number: 9 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0xc74): _shortbuf
    <34b>   DW_AT_decl_file   : 9
    <34c>   DW_AT_decl_line   : 79
    <34d>   DW_AT_decl_column : 8
    <34e>   DW_AT_type        : <0x403>
    <352>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><355>: Abbrev Number: 9 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x15f): _lock
    <35a>   DW_AT_decl_file   : 9
    <35b>   DW_AT_decl_line   : 81
    <35c>   DW_AT_decl_column : 15
    <35d>   DW_AT_type        : <0x413>
    <361>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><364>: Abbrev Number: 9 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x6bc): _offset
    <369>   DW_AT_decl_file   : 9
    <36a>   DW_AT_decl_line   : 89
    <36b>   DW_AT_decl_column : 13
    <36c>   DW_AT_type        : <0xb5>
    <370>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><373>: Abbrev Number: 9 (DW_TAG_member)
    <374>   DW_AT_name        : (indirect string, offset: 0xa13): _codecvt
    <378>   DW_AT_decl_file   : 9
    <379>   DW_AT_decl_line   : 91
    <37a>   DW_AT_decl_column : 23
    <37b>   DW_AT_type        : <0x41f>
    <37f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><382>: Abbrev Number: 9 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf76): _wide_data
    <387>   DW_AT_decl_file   : 9
    <388>   DW_AT_decl_line   : 92
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0x42b>
    <38e>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><391>: Abbrev Number: 9 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x398): _freeres_list
    <396>   DW_AT_decl_file   : 9
    <397>   DW_AT_decl_line   : 93
    <398>   DW_AT_decl_column : 20
    <399>   DW_AT_type        : <0x3fd>
    <39d>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><3a0>: Abbrev Number: 9 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0xbd7): _freeres_buf
    <3a5>   DW_AT_decl_file   : 9
    <3a6>   DW_AT_decl_line   : 94
    <3a7>   DW_AT_decl_column : 9
    <3a8>   DW_AT_type        : <0xcd>
    <3ac>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><3af>: Abbrev Number: 9 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x986): __pad5
    <3b4>   DW_AT_decl_file   : 9
    <3b5>   DW_AT_decl_line   : 95
    <3b6>   DW_AT_decl_column : 10
    <3b7>   DW_AT_type        : <0x122>
    <3bb>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><3be>: Abbrev Number: 9 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x9f7): _mode
    <3c3>   DW_AT_decl_file   : 9
    <3c4>   DW_AT_decl_line   : 96
    <3c5>   DW_AT_decl_column : 7
    <3c6>   DW_AT_type        : <0x64>
    <3ca>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3cd>: Abbrev Number: 9 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x7a7): _unused2
    <3d2>   DW_AT_decl_file   : 9
    <3d3>   DW_AT_decl_line   : 98
    <3d4>   DW_AT_decl_column : 8
    <3d5>   DW_AT_type        : <0x431>
    <3d9>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3dc>: Abbrev Number: 0
 <1><3dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0xaa6): FILE
    <3e2>   DW_AT_decl_file   : 10
    <3e3>   DW_AT_decl_line   : 7
    <3e4>   DW_AT_decl_column : 25
    <3e5>   DW_AT_type        : <0x21c>
 <1><3e9>: Abbrev Number: 16 (DW_TAG_typedef)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x464): _IO_lock_t
    <3ee>   DW_AT_decl_file   : 9
    <3ef>   DW_AT_decl_line   : 43
    <3f0>   DW_AT_decl_column : 14
 <1><3f1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x2dd): _IO_marker
    <3f6>   DW_AT_declaration : 1
 <1><3f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f8>   DW_AT_byte_size   : 4
    <3f9>   DW_AT_type        : <0x3f1>
 <1><3fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fe>   DW_AT_byte_size   : 4
    <3ff>   DW_AT_type        : <0x21c>
 <1><403>: Abbrev Number: 10 (DW_TAG_array_type)
    <404>   DW_AT_type        : <0xe6>
    <408>   DW_AT_sibling     : <0x413>
 <2><40c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40d>   DW_AT_type        : <0x2b>
    <411>   DW_AT_upper_bound : 0
 <2><412>: Abbrev Number: 0
 <1><413>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_type        : <0x3e9>
 <1><419>: Abbrev Number: 17 (DW_TAG_structure_type)
    <41a>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <41e>   DW_AT_declaration : 1
 <1><41f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <420>   DW_AT_byte_size   : 4
    <421>   DW_AT_type        : <0x419>
 <1><425>: Abbrev Number: 17 (DW_TAG_structure_type)
    <426>   DW_AT_name        : (indirect string, offset: 0x347): _IO_wide_data
    <42a>   DW_AT_declaration : 1
 <1><42b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <42c>   DW_AT_byte_size   : 4
    <42d>   DW_AT_type        : <0x425>
 <1><431>: Abbrev Number: 10 (DW_TAG_array_type)
    <432>   DW_AT_type        : <0xe6>
    <436>   DW_AT_sibling     : <0x441>
 <2><43a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <43b>   DW_AT_type        : <0x2b>
    <43f>   DW_AT_upper_bound : 39
 <2><440>: Abbrev Number: 0
 <1><441>: Abbrev Number: 14 (DW_TAG_variable)
    <442>   DW_AT_name        : (indirect string, offset: 0x51d): stdin
    <446>   DW_AT_decl_file   : 11
    <447>   DW_AT_decl_line   : 137
    <448>   DW_AT_decl_column : 14
    <449>   DW_AT_type        : <0x44f>
    <44d>   DW_AT_external    : 1
    <44e>   DW_AT_declaration : 1
 <1><44f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <450>   DW_AT_byte_size   : 4
    <451>   DW_AT_type        : <0x3dd>
 <1><455>: Abbrev Number: 14 (DW_TAG_variable)
    <456>   DW_AT_name        : (indirect string, offset: 0xfbb): stdout
    <45a>   DW_AT_decl_file   : 11
    <45b>   DW_AT_decl_line   : 138
    <45c>   DW_AT_decl_column : 14
    <45d>   DW_AT_type        : <0x44f>
    <461>   DW_AT_external    : 1
    <462>   DW_AT_declaration : 1
 <1><463>: Abbrev Number: 14 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0xd83): stderr
    <468>   DW_AT_decl_file   : 11
    <469>   DW_AT_decl_line   : 139
    <46a>   DW_AT_decl_column : 14
    <46b>   DW_AT_type        : <0x44f>
    <46f>   DW_AT_external    : 1
    <470>   DW_AT_declaration : 1
 <1><471>: Abbrev Number: 14 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x22c): sys_nerr
    <476>   DW_AT_decl_file   : 12
    <477>   DW_AT_decl_line   : 26
    <478>   DW_AT_decl_column : 12
    <479>   DW_AT_type        : <0x64>
    <47d>   DW_AT_external    : 1
    <47e>   DW_AT_declaration : 1
 <1><47f>: Abbrev Number: 10 (DW_TAG_array_type)
    <480>   DW_AT_type        : <0x210>
    <484>   DW_AT_sibling     : <0x48a>
 <2><488>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><489>: Abbrev Number: 0
 <1><48a>: Abbrev Number: 3 (DW_TAG_const_type)
    <48b>   DW_AT_type        : <0x47f>
 <1><48f>: Abbrev Number: 14 (DW_TAG_variable)
    <490>   DW_AT_name        : (indirect string, offset: 0x52c): sys_errlist
    <494>   DW_AT_decl_file   : 12
    <495>   DW_AT_decl_line   : 27
    <496>   DW_AT_decl_column : 26
    <497>   DW_AT_type        : <0x48a>
    <49b>   DW_AT_external    : 1
    <49c>   DW_AT_declaration : 1
 <1><49d>: Abbrev Number: 14 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x23f): _sys_nerr
    <4a2>   DW_AT_decl_file   : 12
    <4a3>   DW_AT_decl_line   : 30
    <4a4>   DW_AT_decl_column : 12
    <4a5>   DW_AT_type        : <0x64>
    <4a9>   DW_AT_external    : 1
    <4aa>   DW_AT_declaration : 1
 <1><4ab>: Abbrev Number: 14 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xe00): _sys_errlist
    <4b0>   DW_AT_decl_file   : 12
    <4b1>   DW_AT_decl_line   : 31
    <4b2>   DW_AT_decl_column : 26
    <4b3>   DW_AT_type        : <0x48a>
    <4b7>   DW_AT_external    : 1
    <4b8>   DW_AT_declaration : 1
 <1><4b9>: Abbrev Number: 14 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x695): program_invocation_name
    <4be>   DW_AT_decl_file   : 13
    <4bf>   DW_AT_decl_line   : 45
    <4c0>   DW_AT_decl_column : 14
    <4c1>   DW_AT_type        : <0xe0>
    <4c5>   DW_AT_external    : 1
    <4c6>   DW_AT_declaration : 1
 <1><4c7>: Abbrev Number: 14 (DW_TAG_variable)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xb7c): program_invocation_short_name
    <4cc>   DW_AT_decl_file   : 13
    <4cd>   DW_AT_decl_line   : 46
    <4ce>   DW_AT_decl_column : 14
    <4cf>   DW_AT_type        : <0xe0>
    <4d3>   DW_AT_external    : 1
    <4d4>   DW_AT_declaration : 1
 <1><4d5>: Abbrev Number: 10 (DW_TAG_array_type)
    <4d6>   DW_AT_type        : <0xe0>
    <4da>   DW_AT_sibling     : <0x4e5>
 <2><4de>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4df>   DW_AT_type        : <0x2b>
    <4e3>   DW_AT_upper_bound : 1
 <2><4e4>: Abbrev Number: 0
 <1><4e5>: Abbrev Number: 14 (DW_TAG_variable)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x19c): __tzname
    <4ea>   DW_AT_decl_file   : 14
    <4eb>   DW_AT_decl_line   : 159
    <4ec>   DW_AT_decl_column : 14
    <4ed>   DW_AT_type        : <0x4d5>
    <4f1>   DW_AT_external    : 1
    <4f2>   DW_AT_declaration : 1
 <1><4f3>: Abbrev Number: 14 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0xe70): __daylight
    <4f8>   DW_AT_decl_file   : 14
    <4f9>   DW_AT_decl_line   : 160
    <4fa>   DW_AT_decl_column : 12
    <4fb>   DW_AT_type        : <0x64>
    <4ff>   DW_AT_external    : 1
    <500>   DW_AT_declaration : 1
 <1><501>: Abbrev Number: 14 (DW_TAG_variable)
    <502>   DW_AT_name        : (indirect string, offset: 0x33c): __timezone
    <506>   DW_AT_decl_file   : 14
    <507>   DW_AT_decl_line   : 161
    <508>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xae>
    <50d>   DW_AT_external    : 1
    <50e>   DW_AT_declaration : 1
 <1><50f>: Abbrev Number: 14 (DW_TAG_variable)
    <510>   DW_AT_name        : (indirect string, offset: 0x97f): tzname
    <514>   DW_AT_decl_file   : 14
    <515>   DW_AT_decl_line   : 166
    <516>   DW_AT_decl_column : 14
    <517>   DW_AT_type        : <0x4d5>
    <51b>   DW_AT_external    : 1
    <51c>   DW_AT_declaration : 1
 <1><51d>: Abbrev Number: 14 (DW_TAG_variable)
    <51e>   DW_AT_name        : (indirect string, offset: 0x102b): daylight
    <522>   DW_AT_decl_file   : 14
    <523>   DW_AT_decl_line   : 174
    <524>   DW_AT_decl_column : 12
    <525>   DW_AT_type        : <0x64>
    <529>   DW_AT_external    : 1
    <52a>   DW_AT_declaration : 1
 <1><52b>: Abbrev Number: 14 (DW_TAG_variable)
    <52c>   DW_AT_name        : (indirect string, offset: 0x4a9): timezone
    <530>   DW_AT_decl_file   : 14
    <531>   DW_AT_decl_line   : 175
    <532>   DW_AT_decl_column : 17
    <533>   DW_AT_type        : <0xae>
    <537>   DW_AT_external    : 1
    <538>   DW_AT_declaration : 1
 <1><539>: Abbrev Number: 13 (DW_TAG_variable)
    <53a>   DW_AT_name        : (indirect string, offset: 0xf05): getdate_err
    <53e>   DW_AT_decl_file   : 14
    <53f>   DW_AT_decl_line   : 274
    <541>   DW_AT_decl_column : 12
    <542>   DW_AT_type        : <0x64>
    <546>   DW_AT_external    : 1
    <547>   DW_AT_declaration : 1
 <1><548>: Abbrev Number: 14 (DW_TAG_variable)
    <549>   DW_AT_name        : (indirect string, offset: 0x992): debug_flag
    <54d>   DW_AT_decl_file   : 15
    <54e>   DW_AT_decl_line   : 20
    <54f>   DW_AT_decl_column : 13
    <550>   DW_AT_type        : <0x556>
    <554>   DW_AT_external    : 1
    <555>   DW_AT_declaration : 1
 <1><556>: Abbrev Number: 2 (DW_TAG_base_type)
    <557>   DW_AT_byte_size   : 1
    <558>   DW_AT_encoding    : 2	(boolean)
    <559>   DW_AT_name        : (indirect string, offset: 0x3fe): _Bool
 <1><55d>: Abbrev Number: 3 (DW_TAG_const_type)
    <55e>   DW_AT_type        : <0x556>
 <1><562>: Abbrev Number: 4 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0xa57): __kernel_long_t
    <567>   DW_AT_decl_file   : 16
    <568>   DW_AT_decl_line   : 15
    <569>   DW_AT_decl_column : 15
    <56a>   DW_AT_type        : <0xae>
 <1><56e>: Abbrev Number: 4 (DW_TAG_typedef)
    <56f>   DW_AT_name        : (indirect string, offset: 0x50c): __kernel_ulong_t
    <573>   DW_AT_decl_file   : 16
    <574>   DW_AT_decl_line   : 16
    <575>   DW_AT_decl_column : 23
    <576>   DW_AT_type        : <0x37>
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x3ca): kernel_long_t
    <57f>   DW_AT_decl_file   : 17
    <580>   DW_AT_decl_line   : 16
    <581>   DW_AT_decl_column : 25
    <582>   DW_AT_type        : <0x562>
 <1><586>: Abbrev Number: 4 (DW_TAG_typedef)
    <587>   DW_AT_name        : (indirect string, offset: 0x867): kernel_ulong_t
    <58b>   DW_AT_decl_file   : 17
    <58c>   DW_AT_decl_line   : 17
    <58d>   DW_AT_decl_column : 26
    <58e>   DW_AT_type        : <0x56e>
 <1><592>: Abbrev Number: 3 (DW_TAG_const_type)
    <593>   DW_AT_type        : <0x586>
 <1><597>: Abbrev Number: 12 (DW_TAG_structure_type)
    <598>   DW_AT_name        : (indirect string, offset: 0xb9a): list_item
    <59c>   DW_AT_byte_size   : 8
    <59d>   DW_AT_decl_file   : 18
    <59e>   DW_AT_decl_line   : 92
    <59f>   DW_AT_decl_column : 8
    <5a0>   DW_AT_sibling     : <0x5c3>
 <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x108e): prev
    <5a9>   DW_AT_decl_file   : 18
    <5aa>   DW_AT_decl_line   : 93
    <5ab>   DW_AT_decl_column : 20
    <5ac>   DW_AT_type        : <0x5c3>
    <5b0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b3>: Abbrev Number: 9 (DW_TAG_member)
    <5b4>   DW_AT_name        : (indirect string, offset: 0xa67): next
    <5b8>   DW_AT_decl_file   : 18
    <5b9>   DW_AT_decl_line   : 94
    <5ba>   DW_AT_decl_column : 20
    <5bb>   DW_AT_type        : <0x5c3>
    <5bf>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5c4>   DW_AT_byte_size   : 4
    <5c5>   DW_AT_type        : <0x597>
 <1><5c9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x83f): sysent
    <5ce>   DW_AT_byte_size   : 20
    <5cf>   DW_AT_decl_file   : 19
    <5d0>   DW_AT_decl_line   : 13
    <5d1>   DW_AT_decl_column : 16
    <5d2>   DW_AT_sibling     : <0x622>
 <2><5d6>: Abbrev Number: 9 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xfd2): nargs
    <5db>   DW_AT_decl_file   : 19
    <5dc>   DW_AT_decl_line   : 14
    <5dd>   DW_AT_decl_column : 11
    <5de>   DW_AT_type        : <0x2b>
    <5e2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5e5>: Abbrev Number: 9 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x936): sys_flags
    <5ea>   DW_AT_decl_file   : 19
    <5eb>   DW_AT_decl_line   : 15
    <5ec>   DW_AT_decl_column : 6
    <5ed>   DW_AT_type        : <0x64>
    <5f1>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5f4>: Abbrev Number: 19 (DW_TAG_member)
    <5f5>   DW_AT_name        : sen
    <5f9>   DW_AT_decl_file   : 19
    <5fa>   DW_AT_decl_line   : 16
    <5fb>   DW_AT_decl_column : 6
    <5fc>   DW_AT_type        : <0x64>
    <600>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><603>: Abbrev Number: 9 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x2d4): sys_func
    <608>   DW_AT_decl_file   : 19
    <609>   DW_AT_decl_line   : 17
    <60a>   DW_AT_decl_column : 8
    <60b>   DW_AT_type        : <0x889>
    <60f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><612>: Abbrev Number: 9 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x249): sys_name
    <617>   DW_AT_decl_file   : 19
    <618>   DW_AT_decl_line   : 18
    <619>   DW_AT_decl_column : 14
    <61a>   DW_AT_type        : <0x20a>
    <61e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><621>: Abbrev Number: 0
 <1><622>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <623>   DW_AT_prototyped  : 1
    <624>   DW_AT_type        : <0x64>
    <628>   DW_AT_sibling     : <0x632>
 <2><62c>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <62d>   DW_AT_type        : <0x632>
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <633>   DW_AT_byte_size   : 4
    <634>   DW_AT_type        : <0x63d>
 <1><638>: Abbrev Number: 3 (DW_TAG_const_type)
    <639>   DW_AT_type        : <0x632>
 <1><63d>: Abbrev Number: 22 (DW_TAG_structure_type)
    <63e>   DW_AT_name        : tcb
    <642>   DW_AT_byte_size   : 204
    <643>   DW_AT_decl_file   : 20
    <644>   DW_AT_decl_line   : 262
    <646>   DW_AT_decl_column : 8
    <647>   DW_AT_sibling     : <0x889>
 <2><64b>: Abbrev Number: 23 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x4b8): flags
    <650>   DW_AT_decl_file   : 20
    <651>   DW_AT_decl_line   : 263
    <653>   DW_AT_decl_column : 6
    <654>   DW_AT_type        : <0x64>
    <658>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><65b>: Abbrev Number: 24 (DW_TAG_member)
    <65c>   DW_AT_name        : pid
    <660>   DW_AT_decl_file   : 20
    <661>   DW_AT_decl_line   : 264
    <663>   DW_AT_decl_column : 6
    <664>   DW_AT_type        : <0x64>
    <668>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><66b>: Abbrev Number: 23 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <670>   DW_AT_decl_file   : 20
    <671>   DW_AT_decl_line   : 265
    <673>   DW_AT_decl_column : 6
    <674>   DW_AT_type        : <0x64>
    <678>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><67b>: Abbrev Number: 23 (DW_TAG_member)
    <67c>   DW_AT_name        : (indirect string, offset: 0x360): currpers
    <680>   DW_AT_decl_file   : 20
    <681>   DW_AT_decl_line   : 267
    <683>   DW_AT_decl_column : 15
    <684>   DW_AT_type        : <0x2b>
    <688>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><68b>: Abbrev Number: 23 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0xaf9): u_error
    <690>   DW_AT_decl_file   : 20
    <691>   DW_AT_decl_line   : 269
    <693>   DW_AT_decl_column : 16
    <694>   DW_AT_type        : <0x37>
    <698>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><69b>: Abbrev Number: 23 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <6a0>   DW_AT_decl_file   : 20
    <6a1>   DW_AT_decl_line   : 270
    <6a3>   DW_AT_decl_column : 17
    <6a4>   DW_AT_type        : <0x586>
    <6a8>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><6ab>: Abbrev Number: 23 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0xb32): true_scno
    <6b0>   DW_AT_decl_file   : 20
    <6b1>   DW_AT_decl_line   : 271
    <6b3>   DW_AT_decl_column : 17
    <6b4>   DW_AT_type        : <0x586>
    <6b8>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6bb>: Abbrev Number: 23 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x186): u_arg
    <6c0>   DW_AT_decl_file   : 20
    <6c1>   DW_AT_decl_line   : 272
    <6c3>   DW_AT_decl_column : 17
    <6c4>   DW_AT_type        : <0x9b9>
    <6c8>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6cb>: Abbrev Number: 23 (DW_TAG_member)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x94d): u_rval
    <6d0>   DW_AT_decl_file   : 20
    <6d1>   DW_AT_decl_line   : 273
    <6d3>   DW_AT_decl_column : 16
    <6d4>   DW_AT_type        : <0x57a>
    <6d8>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6db>: Abbrev Number: 23 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0xa78): sys_func_rval
    <6e0>   DW_AT_decl_file   : 20
    <6e1>   DW_AT_decl_line   : 274
    <6e3>   DW_AT_decl_column : 6
    <6e4>   DW_AT_type        : <0x64>
    <6e8>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6eb>: Abbrev Number: 23 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0xc8e): curcol
    <6f0>   DW_AT_decl_file   : 20
    <6f1>   DW_AT_decl_line   : 275
    <6f3>   DW_AT_decl_column : 6
    <6f4>   DW_AT_type        : <0x64>
    <6f8>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6fb>: Abbrev Number: 23 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x95f): outf
    <700>   DW_AT_decl_file   : 20
    <701>   DW_AT_decl_line   : 276
    <703>   DW_AT_decl_column : 8
    <704>   DW_AT_type        : <0x44f>
    <708>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><70b>: Abbrev Number: 23 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0xeaf): staged_output_data
    <710>   DW_AT_decl_file   : 20
    <711>   DW_AT_decl_line   : 277
    <713>   DW_AT_decl_column : 29
    <714>   DW_AT_type        : <0x9cf>
    <718>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><71b>: Abbrev Number: 23 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0xa3e): auxstr
    <720>   DW_AT_decl_file   : 20
    <721>   DW_AT_decl_line   : 279
    <723>   DW_AT_decl_column : 14
    <724>   DW_AT_type        : <0x20a>
    <728>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><72b>: Abbrev Number: 23 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x165): _priv_data
    <730>   DW_AT_decl_file   : 20
    <731>   DW_AT_decl_line   : 280
    <733>   DW_AT_decl_column : 8
    <734>   DW_AT_type        : <0xcd>
    <738>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><73b>: Abbrev Number: 23 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0xbc7): _free_priv_data
    <740>   DW_AT_decl_file   : 20
    <741>   DW_AT_decl_line   : 281
    <743>   DW_AT_decl_column : 9
    <744>   DW_AT_type        : <0x9e1>
    <748>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><74b>: Abbrev Number: 23 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0x176): s_ent
    <750>   DW_AT_decl_file   : 20
    <751>   DW_AT_decl_line   : 282
    <753>   DW_AT_decl_column : 23
    <754>   DW_AT_type        : <0x9e7>
    <758>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><75b>: Abbrev Number: 23 (DW_TAG_member)
    <75c>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <760>   DW_AT_decl_file   : 20
    <761>   DW_AT_decl_line   : 285
    <763>   DW_AT_decl_column : 23
    <764>   DW_AT_type        : <0x9e7>
    <768>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><76b>: Abbrev Number: 23 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x355): inject_vec
    <770>   DW_AT_decl_file   : 20
    <771>   DW_AT_decl_line   : 286
    <773>   DW_AT_decl_column : 22
    <774>   DW_AT_type        : <0x9f2>
    <778>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><77b>: Abbrev Number: 23 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x7b0): stime
    <780>   DW_AT_decl_file   : 20
    <781>   DW_AT_decl_line   : 287
    <783>   DW_AT_decl_column : 18
    <784>   DW_AT_type        : <0x174>
    <788>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><78b>: Abbrev Number: 23 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x369): ltime
    <790>   DW_AT_decl_file   : 20
    <791>   DW_AT_decl_line   : 288
    <793>   DW_AT_decl_column : 18
    <794>   DW_AT_type        : <0x174>
    <798>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><79b>: Abbrev Number: 23 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0xf99): atime
    <7a0>   DW_AT_decl_file   : 20
    <7a1>   DW_AT_decl_line   : 289
    <7a3>   DW_AT_decl_column : 18
    <7a4>   DW_AT_type        : <0x174>
    <7a8>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><7ab>: Abbrev Number: 23 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x4b2): etime
    <7b0>   DW_AT_decl_file   : 20
    <7b1>   DW_AT_decl_line   : 290
    <7b3>   DW_AT_decl_column : 18
    <7b4>   DW_AT_type        : <0x174>
    <7b8>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><7bc>: Abbrev Number: 23 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xcf2): delay_expiration_time
    <7c1>   DW_AT_decl_file   : 20
    <7c2>   DW_AT_decl_line   : 291
    <7c4>   DW_AT_decl_column : 18
    <7c5>   DW_AT_type        : <0x174>
    <7c9>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7cd>: Abbrev Number: 23 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7d2>   DW_AT_decl_file   : 20
    <7d3>   DW_AT_decl_line   : 298
    <7d5>   DW_AT_decl_column : 15
    <7d6>   DW_AT_type        : <0x2b>
    <7da>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7de>: Abbrev Number: 23 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0xeeb): last_dirfd
    <7e3>   DW_AT_decl_file   : 20
    <7e4>   DW_AT_decl_line   : 301
    <7e6>   DW_AT_decl_column : 6
    <7e7>   DW_AT_type        : <0x64>
    <7eb>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7ef>: Abbrev Number: 23 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xf11): mmap_cache
    <7f4>   DW_AT_decl_file   : 20
    <7f5>   DW_AT_decl_line   : 304
    <7f7>   DW_AT_decl_column : 23
    <7f8>   DW_AT_type        : <0xa0e>
    <7fc>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><800>: Abbrev Number: 23 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0xb08): wait_data_idx
    <805>   DW_AT_decl_file   : 20
    <806>   DW_AT_decl_line   : 311
    <808>   DW_AT_decl_column : 9
    <809>   DW_AT_type        : <0x122>
    <80d>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><811>: Abbrev Number: 23 (DW_TAG_member)
    <812>   DW_AT_name        : (indirect string, offset: 0xa45): delayed_wait_data
    <816>   DW_AT_decl_file   : 20
    <817>   DW_AT_decl_line   : 313
    <819>   DW_AT_decl_column : 24
    <81a>   DW_AT_type        : <0xa1a>
    <81e>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><822>: Abbrev Number: 23 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0xaba): wait_list
    <827>   DW_AT_decl_file   : 20
    <828>   DW_AT_decl_line   : 314
    <82a>   DW_AT_decl_column : 19
    <82b>   DW_AT_type        : <0x597>
    <82f>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><833>: Abbrev Number: 23 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0x6ad): vcpu_info_list
    <838>   DW_AT_decl_file   : 20
    <839>   DW_AT_decl_line   : 318
    <83b>   DW_AT_decl_column : 20
    <83c>   DW_AT_type        : <0xa26>
    <840>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><844>: Abbrev Number: 23 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0xc59): unwind_ctx
    <849>   DW_AT_decl_file   : 20
    <84a>   DW_AT_decl_line   : 322
    <84c>   DW_AT_decl_column : 8
    <84d>   DW_AT_type        : <0xcd>
    <851>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><855>: Abbrev Number: 23 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x49c): unwind_queue
    <85a>   DW_AT_decl_file   : 20
    <85b>   DW_AT_decl_line   : 323
    <85d>   DW_AT_decl_column : 25
    <85e>   DW_AT_type        : <0xa32>
    <862>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><866>: Abbrev Number: 23 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x15a): comm
    <86b>   DW_AT_decl_file   : 20
    <86c>   DW_AT_decl_line   : 327
    <86e>   DW_AT_decl_column : 7
    <86f>   DW_AT_type        : <0xa38>
    <873>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><877>: Abbrev Number: 23 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0x202): start_prc
    <87c>   DW_AT_decl_file   : 20
    <87d>   DW_AT_decl_line   : 329
    <87f>   DW_AT_decl_column : 16
    <880>   DW_AT_type        : <0x37>
    <884>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><888>: Abbrev Number: 0
 <1><889>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <88a>   DW_AT_byte_size   : 4
    <88b>   DW_AT_type        : <0x622>
 <1><88f>: Abbrev Number: 4 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0x4fe): struct_sysent
    <894>   DW_AT_decl_file   : 19
    <895>   DW_AT_decl_line   : 19
    <896>   DW_AT_decl_column : 3
    <897>   DW_AT_type        : <0x5c9>
 <1><89b>: Abbrev Number: 3 (DW_TAG_const_type)
    <89c>   DW_AT_type        : <0x88f>
 <1><8a0>: Abbrev Number: 14 (DW_TAG_variable)
    <8a1>   DW_AT_name        : (indirect string, offset: 0xcde): current_personality
    <8a5>   DW_AT_decl_file   : 20
    <8a6>   DW_AT_decl_line   : 158
    <8a7>   DW_AT_decl_column : 17
    <8a8>   DW_AT_type        : <0x2b>
    <8ac>   DW_AT_external    : 1
    <8ad>   DW_AT_declaration : 1
 <1><8ae>: Abbrev Number: 14 (DW_TAG_variable)
    <8af>   DW_AT_name        : (indirect string, offset: 0x7e1): current_wordsize
    <8b3>   DW_AT_decl_file   : 20
    <8b4>   DW_AT_decl_line   : 171
    <8b5>   DW_AT_decl_column : 17
    <8b6>   DW_AT_type        : <0x2b>
    <8ba>   DW_AT_external    : 1
    <8bb>   DW_AT_declaration : 1
 <1><8bc>: Abbrev Number: 14 (DW_TAG_variable)
    <8bd>   DW_AT_name        : (indirect string, offset: 0xa1c): current_klongsize
    <8c1>   DW_AT_decl_file   : 20
    <8c2>   DW_AT_decl_line   : 176
    <8c3>   DW_AT_decl_column : 17
    <8c4>   DW_AT_type        : <0x2b>
    <8c8>   DW_AT_external    : 1
    <8c9>   DW_AT_declaration : 1
 <1><8ca>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xc30): ioctlent
    <8cf>   DW_AT_byte_size   : 8
    <8d0>   DW_AT_decl_file   : 20
    <8d1>   DW_AT_decl_line   : 217
    <8d2>   DW_AT_decl_column : 16
    <8d3>   DW_AT_sibling     : <0x8f6>
 <2><8d7>: Abbrev Number: 9 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xed7): symbol
    <8dc>   DW_AT_decl_file   : 20
    <8dd>   DW_AT_decl_line   : 218
    <8de>   DW_AT_decl_column : 14
    <8df>   DW_AT_type        : <0x20a>
    <8e3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e6>: Abbrev Number: 9 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0xca7): code
    <8eb>   DW_AT_decl_file   : 20
    <8ec>   DW_AT_decl_line   : 219
    <8ed>   DW_AT_decl_column : 15
    <8ee>   DW_AT_type        : <0x2b>
    <8f2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8f5>: Abbrev Number: 0
 <1><8f6>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xbf1): struct_ioctlent
    <8fb>   DW_AT_decl_file   : 20
    <8fc>   DW_AT_decl_line   : 220
    <8fd>   DW_AT_decl_column : 3
    <8fe>   DW_AT_type        : <0x8ca>
 <1><902>: Abbrev Number: 3 (DW_TAG_const_type)
    <903>   DW_AT_type        : <0x8f6>
 <1><907>: Abbrev Number: 12 (DW_TAG_structure_type)
    <908>   DW_AT_name        : (indirect string, offset: 0x7d5): inject_data
    <90c>   DW_AT_byte_size   : 10
    <90d>   DW_AT_decl_file   : 20
    <90e>   DW_AT_decl_line   : 241
    <90f>   DW_AT_decl_column : 8
    <910>   DW_AT_sibling     : <0x96f>
 <2><914>: Abbrev Number: 9 (DW_TAG_member)
    <915>   DW_AT_name        : (indirect string, offset: 0x4b8): flags
    <919>   DW_AT_decl_file   : 20
    <91a>   DW_AT_decl_line   : 242
    <91b>   DW_AT_decl_column : 10
    <91c>   DW_AT_type        : <0xf2>
    <920>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><923>: Abbrev Number: 9 (DW_TAG_member)
    <924>   DW_AT_name        : (indirect string, offset: 0x8ea): signo
    <928>   DW_AT_decl_file   : 20
    <929>   DW_AT_decl_line   : 243
    <92a>   DW_AT_decl_column : 10
    <92b>   DW_AT_type        : <0xf2>
    <92f>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><932>: Abbrev Number: 9 (DW_TAG_member)
    <933>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <937>   DW_AT_decl_file   : 20
    <938>   DW_AT_decl_line   : 244
    <939>   DW_AT_decl_column : 11
    <93a>   DW_AT_type        : <0xfe>
    <93e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><941>: Abbrev Number: 9 (DW_TAG_member)
    <942>   DW_AT_name        : (indirect string, offset: 0xc84): delay_idx
    <946>   DW_AT_decl_file   : 20
    <947>   DW_AT_decl_line   : 245
    <948>   DW_AT_decl_column : 11
    <949>   DW_AT_type        : <0xfe>
    <94d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><950>: Abbrev Number: 9 (DW_TAG_member)
    <951>   DW_AT_name        : (indirect string, offset: 0x544): poke_idx
    <955>   DW_AT_decl_file   : 20
    <956>   DW_AT_decl_line   : 246
    <957>   DW_AT_decl_column : 11
    <958>   DW_AT_type        : <0xfe>
    <95c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><95f>: Abbrev Number: 9 (DW_TAG_member)
    <960>   DW_AT_name        : (indirect string, offset: 0x17c): scno
    <964>   DW_AT_decl_file   : 20
    <965>   DW_AT_decl_line   : 247
    <966>   DW_AT_decl_column : 11
    <967>   DW_AT_type        : <0xfe>
    <96b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><96e>: Abbrev Number: 0
 <1><96f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <970>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <974>   DW_AT_byte_size   : 16
    <975>   DW_AT_decl_file   : 20
    <976>   DW_AT_decl_line   : 250
    <977>   DW_AT_decl_column : 8
    <978>   DW_AT_sibling     : <0x9b9>
 <2><97c>: Abbrev Number: 9 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0x9f1): first
    <981>   DW_AT_decl_file   : 20
    <982>   DW_AT_decl_line   : 251
    <983>   DW_AT_decl_column : 11
    <984>   DW_AT_type        : <0xfe>
    <988>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><98b>: Abbrev Number: 9 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x10b7): last
    <990>   DW_AT_decl_file   : 20
    <991>   DW_AT_decl_line   : 252
    <992>   DW_AT_decl_column : 11
    <993>   DW_AT_type        : <0xfe>
    <997>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><99a>: Abbrev Number: 9 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0x36f): step
    <99f>   DW_AT_decl_file   : 20
    <9a0>   DW_AT_decl_line   : 253
    <9a1>   DW_AT_decl_column : 11
    <9a2>   DW_AT_type        : <0xfe>
    <9a6>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><9a9>: Abbrev Number: 9 (DW_TAG_member)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x1089): data
    <9ae>   DW_AT_decl_file   : 20
    <9af>   DW_AT_decl_line   : 254
    <9b0>   DW_AT_decl_column : 21
    <9b1>   DW_AT_type        : <0x907>
    <9b5>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9b8>: Abbrev Number: 0
 <1><9b9>: Abbrev Number: 10 (DW_TAG_array_type)
    <9ba>   DW_AT_type        : <0x586>
    <9be>   DW_AT_sibling     : <0x9c9>
 <2><9c2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9c3>   DW_AT_type        : <0x2b>
    <9c7>   DW_AT_upper_bound : 5
 <2><9c8>: Abbrev Number: 0
 <1><9c9>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9ca>   DW_AT_name        : (indirect string, offset: 0xeaf): staged_output_data
    <9ce>   DW_AT_declaration : 1
 <1><9cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d0>   DW_AT_byte_size   : 4
    <9d1>   DW_AT_type        : <0x9c9>
 <1><9d5>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <9d6>   DW_AT_prototyped  : 1
    <9d7>   DW_AT_sibling     : <0x9e1>
 <2><9db>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9dc>   DW_AT_type        : <0xcd>
 <2><9e0>: Abbrev Number: 0
 <1><9e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e2>   DW_AT_byte_size   : 4
    <9e3>   DW_AT_type        : <0x9d5>
 <1><9e7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e8>   DW_AT_byte_size   : 4
    <9e9>   DW_AT_type        : <0x89b>
 <1><9ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <9ee>   DW_AT_type        : <0x9e7>
 <1><9f2>: Abbrev Number: 10 (DW_TAG_array_type)
    <9f3>   DW_AT_type        : <0xa02>
    <9f7>   DW_AT_sibling     : <0xa02>
 <2><9fb>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9fc>   DW_AT_type        : <0x2b>
    <a00>   DW_AT_upper_bound : 2
 <2><a01>: Abbrev Number: 0
 <1><a02>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a03>   DW_AT_byte_size   : 4
    <a04>   DW_AT_type        : <0x96f>
 <1><a08>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a09>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <a0d>   DW_AT_declaration : 1
 <1><a0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0f>   DW_AT_byte_size   : 4
    <a10>   DW_AT_type        : <0xa08>
 <1><a14>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a15>   DW_AT_name        : (indirect string, offset: 0x38a): tcb_wait_data
    <a19>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0xa14>
 <1><a20>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a21>   DW_AT_name        : (indirect string, offset: 0x150): vcpu_info
    <a25>   DW_AT_declaration : 1
 <1><a26>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_type        : <0xa20>
 <1><a2c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xe93): unwind_queue_t
    <a31>   DW_AT_declaration : 1
 <1><a32>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a33>   DW_AT_byte_size   : 4
    <a34>   DW_AT_type        : <0xa2c>
 <1><a38>: Abbrev Number: 10 (DW_TAG_array_type)
    <a39>   DW_AT_type        : <0xe6>
    <a3d>   DW_AT_sibling     : <0xa48>
 <2><a41>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a42>   DW_AT_type        : <0x2b>
    <a46>   DW_AT_upper_bound : 15
 <2><a47>: Abbrev Number: 0
 <1><a48>: Abbrev Number: 13 (DW_TAG_variable)
    <a49>   DW_AT_name        : (indirect string, offset: 0xb45): stub_sysent
    <a4d>   DW_AT_decl_file   : 20
    <a4e>   DW_AT_decl_line   : 403
    <a50>   DW_AT_decl_column : 28
    <a51>   DW_AT_type        : <0x89b>
    <a55>   DW_AT_external    : 1
    <a56>   DW_AT_declaration : 1
 <1><a57>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a58>   DW_AT_name        : (indirect string, offset: 0x1066): xlat_type
    <a5c>   DW_AT_encoding    : 7	(unsigned)
    <a5d>   DW_AT_byte_size   : 4
    <a5e>   DW_AT_type        : <0x2b>
    <a62>   DW_AT_decl_file   : 21
    <a63>   DW_AT_decl_line   : 13
    <a64>   DW_AT_decl_column : 6
    <a65>   DW_AT_sibling     : <0xa7c>
 <2><a69>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x2a4): XT_NORMAL
    <a6e>   DW_AT_const_value : 0
 <2><a6f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0xc08): XT_SORTED
    <a74>   DW_AT_const_value : 1
 <2><a75>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0xd6a): XT_INDEXED
    <a7a>   DW_AT_const_value : 2
 <2><a7b>: Abbrev Number: 0
 <1><a7c>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a7d>   DW_AT_name        : (indirect string, offset: 0xb71): xlat_style
    <a81>   DW_AT_encoding    : 7	(unsigned)
    <a82>   DW_AT_byte_size   : 4
    <a83>   DW_AT_type        : <0x2b>
    <a87>   DW_AT_decl_file   : 21
    <a88>   DW_AT_decl_line   : 19
    <a89>   DW_AT_decl_column : 6
    <a8a>   DW_AT_sibling     : <0xab9>
 <2><a8e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a93>   DW_AT_const_value : 0
 <2><a94>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0xba4): XLAT_STYLE_RAW
    <a99>   DW_AT_const_value : 1
 <2><a9a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x1019): XLAT_STYLE_ABBREV
    <a9f>   DW_AT_const_value : 2
 <2><aa0>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x2c1): XLAT_STYLE_VERBOSE
    <aa5>   DW_AT_const_value : 3
 <2><aa6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <aab>   DW_AT_const_value : 0
 <2><aac>: Abbrev Number: 27 (DW_TAG_enumerator)
    <aad>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <ab1>   DW_AT_const_value : 4
 <2><ab2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x10a6): XLAT_STYLE_FMT_D
    <ab7>   DW_AT_const_value : 8
 <2><ab8>: Abbrev Number: 0
 <1><ab9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <aba>   DW_AT_name        : (indirect string, offset: 0x2f2): xlat_data
    <abe>   DW_AT_byte_size   : 12
    <abf>   DW_AT_decl_file   : 21
    <ac0>   DW_AT_decl_line   : 51
    <ac1>   DW_AT_decl_column : 8
    <ac2>   DW_AT_sibling     : <0xae5>
 <2><ac6>: Abbrev Number: 19 (DW_TAG_member)
    <ac7>   DW_AT_name        : val
    <acb>   DW_AT_decl_file   : 21
    <acc>   DW_AT_decl_line   : 52
    <acd>   DW_AT_decl_column : 11
    <ace>   DW_AT_type        : <0x116>
    <ad2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ad5>: Abbrev Number: 19 (DW_TAG_member)
    <ad6>   DW_AT_name        : str
    <ada>   DW_AT_decl_file   : 21
    <adb>   DW_AT_decl_line   : 53
    <adc>   DW_AT_decl_column : 14
    <add>   DW_AT_type        : <0x20a>
    <ae1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ae4>: Abbrev Number: 0
 <1><ae5>: Abbrev Number: 3 (DW_TAG_const_type)
    <ae6>   DW_AT_type        : <0xab9>
 <1><aea>: Abbrev Number: 12 (DW_TAG_structure_type)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <aef>   DW_AT_byte_size   : 24
    <af0>   DW_AT_decl_file   : 21
    <af1>   DW_AT_decl_line   : 56
    <af2>   DW_AT_decl_column : 8
    <af3>   DW_AT_sibling     : <0xb43>
 <2><af7>: Abbrev Number: 9 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0x1089): data
    <afc>   DW_AT_decl_file   : 21
    <afd>   DW_AT_decl_line   : 57
    <afe>   DW_AT_decl_column : 26
    <aff>   DW_AT_type        : <0xb48>
    <b03>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b06>: Abbrev Number: 9 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0x833): flags_strsz
    <b0b>   DW_AT_decl_file   : 21
    <b0c>   DW_AT_decl_line   : 58
    <b0d>   DW_AT_decl_column : 9
    <b0e>   DW_AT_type        : <0x122>
    <b12>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><b15>: Abbrev Number: 9 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0xb16): size
    <b1a>   DW_AT_decl_file   : 21
    <b1b>   DW_AT_decl_line   : 59
    <b1c>   DW_AT_decl_column : 11
    <b1d>   DW_AT_type        : <0x10a>
    <b21>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b24>: Abbrev Number: 9 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x181): type
    <b29>   DW_AT_decl_file   : 21
    <b2a>   DW_AT_decl_line   : 60
    <b2b>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0xa57>
    <b30>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b33>: Abbrev Number: 9 (DW_TAG_member)
    <b34>   DW_AT_name        : (indirect string, offset: 0x701): flags_mask
    <b38>   DW_AT_decl_file   : 21
    <b39>   DW_AT_decl_line   : 61
    <b3a>   DW_AT_decl_column : 11
    <b3b>   DW_AT_type        : <0x116>
    <b3f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b42>: Abbrev Number: 0
 <1><b43>: Abbrev Number: 3 (DW_TAG_const_type)
    <b44>   DW_AT_type        : <0xaea>
 <1><b48>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b49>   DW_AT_byte_size   : 4
    <b4a>   DW_AT_type        : <0xae5>
 <1><b4e>: Abbrev Number: 10 (DW_TAG_array_type)
    <b4f>   DW_AT_type        : <0xb43>
    <b53>   DW_AT_sibling     : <0xb59>
 <2><b57>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><b58>: Abbrev Number: 0
 <1><b59>: Abbrev Number: 3 (DW_TAG_const_type)
    <b5a>   DW_AT_type        : <0xb4e>
 <1><b5e>: Abbrev Number: 13 (DW_TAG_variable)
    <b5f>   DW_AT_name        : (indirect string, offset: 0xdde): addrfams
    <b63>   DW_AT_decl_file   : 20
    <b64>   DW_AT_decl_line   : 409
    <b66>   DW_AT_decl_column : 26
    <b67>   DW_AT_type        : <0xb59>
    <b6b>   DW_AT_external    : 1
    <b6c>   DW_AT_declaration : 1
 <1><b6d>: Abbrev Number: 13 (DW_TAG_variable)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xcb7): arp_hardware_types
    <b72>   DW_AT_decl_file   : 20
    <b73>   DW_AT_decl_line   : 410
    <b75>   DW_AT_decl_column : 26
    <b76>   DW_AT_type        : <0xb59>
    <b7a>   DW_AT_external    : 1
    <b7b>   DW_AT_declaration : 1
 <1><b7c>: Abbrev Number: 13 (DW_TAG_variable)
    <b7d>   DW_AT_name        : (indirect string, offset: 0xf9f): at_flags
    <b81>   DW_AT_decl_file   : 20
    <b82>   DW_AT_decl_line   : 411
    <b84>   DW_AT_decl_column : 26
    <b85>   DW_AT_type        : <0xb59>
    <b89>   DW_AT_external    : 1
    <b8a>   DW_AT_declaration : 1
 <1><b8b>: Abbrev Number: 13 (DW_TAG_variable)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x47a): clocknames
    <b90>   DW_AT_decl_file   : 20
    <b91>   DW_AT_decl_line   : 412
    <b93>   DW_AT_decl_column : 26
    <b94>   DW_AT_type        : <0xb59>
    <b98>   DW_AT_external    : 1
    <b99>   DW_AT_declaration : 1
 <1><b9a>: Abbrev Number: 13 (DW_TAG_variable)
    <b9b>   DW_AT_name        : (indirect string, offset: 0xf5f): dirent_types
    <b9f>   DW_AT_decl_file   : 20
    <ba0>   DW_AT_decl_line   : 413
    <ba2>   DW_AT_decl_column : 26
    <ba3>   DW_AT_type        : <0xb59>
    <ba7>   DW_AT_external    : 1
    <ba8>   DW_AT_declaration : 1
 <1><ba9>: Abbrev Number: 13 (DW_TAG_variable)
    <baa>   DW_AT_name        : (indirect string, offset: 0x884): ethernet_protocols
    <bae>   DW_AT_decl_file   : 20
    <baf>   DW_AT_decl_line   : 414
    <bb1>   DW_AT_decl_column : 26
    <bb2>   DW_AT_type        : <0xb59>
    <bb6>   DW_AT_external    : 1
    <bb7>   DW_AT_declaration : 1
 <1><bb8>: Abbrev Number: 13 (DW_TAG_variable)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x597): inet_protocols
    <bbd>   DW_AT_decl_file   : 20
    <bbe>   DW_AT_decl_line   : 415
    <bc0>   DW_AT_decl_column : 26
    <bc1>   DW_AT_type        : <0xb59>
    <bc5>   DW_AT_external    : 1
    <bc6>   DW_AT_declaration : 1
 <1><bc7>: Abbrev Number: 13 (DW_TAG_variable)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x291): evdev_abs
    <bcc>   DW_AT_decl_file   : 20
    <bcd>   DW_AT_decl_line   : 416
    <bcf>   DW_AT_decl_column : 26
    <bd0>   DW_AT_type        : <0xb59>
    <bd4>   DW_AT_external    : 1
    <bd5>   DW_AT_declaration : 1
 <1><bd6>: Abbrev Number: 13 (DW_TAG_variable)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x6f6): audit_arch
    <bdb>   DW_AT_decl_file   : 20
    <bdc>   DW_AT_decl_line   : 417
    <bde>   DW_AT_decl_column : 26
    <bdf>   DW_AT_type        : <0xb59>
    <be3>   DW_AT_external    : 1
    <be4>   DW_AT_declaration : 1
 <1><be5>: Abbrev Number: 13 (DW_TAG_variable)
    <be6>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bea>   DW_AT_decl_file   : 20
    <beb>   DW_AT_decl_line   : 418
    <bed>   DW_AT_decl_column : 26
    <bee>   DW_AT_type        : <0xb59>
    <bf2>   DW_AT_external    : 1
    <bf3>   DW_AT_declaration : 1
 <1><bf4>: Abbrev Number: 13 (DW_TAG_variable)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x45b): iffflags
    <bf9>   DW_AT_decl_file   : 20
    <bfa>   DW_AT_decl_line   : 419
    <bfc>   DW_AT_decl_column : 26
    <bfd>   DW_AT_type        : <0xb59>
    <c01>   DW_AT_external    : 1
    <c02>   DW_AT_declaration : 1
 <1><c03>: Abbrev Number: 13 (DW_TAG_variable)
    <c04>   DW_AT_name        : (indirect string, offset: 0xbb3): ip_type_of_services
    <c08>   DW_AT_decl_file   : 20
    <c09>   DW_AT_decl_line   : 420
    <c0b>   DW_AT_decl_column : 26
    <c0c>   DW_AT_type        : <0xb59>
    <c10>   DW_AT_external    : 1
    <c11>   DW_AT_declaration : 1
 <1><c12>: Abbrev Number: 13 (DW_TAG_variable)
    <c13>   DW_AT_name        : (indirect string, offset: 0x689): ipc_private
    <c17>   DW_AT_decl_file   : 20
    <c18>   DW_AT_decl_line   : 421
    <c1a>   DW_AT_decl_column : 26
    <c1b>   DW_AT_type        : <0xb59>
    <c1f>   DW_AT_external    : 1
    <c20>   DW_AT_declaration : 1
 <1><c21>: Abbrev Number: 13 (DW_TAG_variable)
    <c22>   DW_AT_name        : (indirect string, offset: 0x2e8): msg_flags
    <c26>   DW_AT_decl_file   : 20
    <c27>   DW_AT_decl_line   : 422
    <c29>   DW_AT_decl_column : 26
    <c2a>   DW_AT_type        : <0xb59>
    <c2e>   DW_AT_external    : 1
    <c2f>   DW_AT_declaration : 1
 <1><c30>: Abbrev Number: 13 (DW_TAG_variable)
    <c31>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <c35>   DW_AT_decl_file   : 20
    <c36>   DW_AT_decl_line   : 423
    <c38>   DW_AT_decl_column : 26
    <c39>   DW_AT_type        : <0xb59>
    <c3d>   DW_AT_external    : 1
    <c3e>   DW_AT_declaration : 1
 <1><c3f>: Abbrev Number: 13 (DW_TAG_variable)
    <c40>   DW_AT_name        : (indirect string, offset: 0xec2): nl_bridge_vlan_flags
    <c44>   DW_AT_decl_file   : 20
    <c45>   DW_AT_decl_line   : 424
    <c47>   DW_AT_decl_column : 26
    <c48>   DW_AT_type        : <0xb59>
    <c4c>   DW_AT_external    : 1
    <c4d>   DW_AT_declaration : 1
 <1><c4e>: Abbrev Number: 13 (DW_TAG_variable)
    <c4f>   DW_AT_name        : (indirect string, offset: 0xd53): nl_netfilter_msg_types
    <c53>   DW_AT_decl_file   : 20
    <c54>   DW_AT_decl_line   : 425
    <c56>   DW_AT_decl_column : 26
    <c57>   DW_AT_type        : <0xb59>
    <c5b>   DW_AT_external    : 1
    <c5c>   DW_AT_declaration : 1
 <1><c5d>: Abbrev Number: 13 (DW_TAG_variable)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x43d): nl_route_types
    <c62>   DW_AT_decl_file   : 20
    <c63>   DW_AT_decl_line   : 426
    <c65>   DW_AT_decl_column : 26
    <c66>   DW_AT_type        : <0xb59>
    <c6a>   DW_AT_external    : 1
    <c6b>   DW_AT_declaration : 1
 <1><c6c>: Abbrev Number: 13 (DW_TAG_variable)
    <c6d>   DW_AT_name        : (indirect string, offset: 0xe15): open_access_modes
    <c71>   DW_AT_decl_file   : 20
    <c72>   DW_AT_decl_line   : 427
    <c74>   DW_AT_decl_column : 26
    <c75>   DW_AT_type        : <0xb59>
    <c79>   DW_AT_external    : 1
    <c7a>   DW_AT_declaration : 1
 <1><c7b>: Abbrev Number: 13 (DW_TAG_variable)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c80>   DW_AT_decl_file   : 20
    <c81>   DW_AT_decl_line   : 428
    <c83>   DW_AT_decl_column : 26
    <c84>   DW_AT_type        : <0xb59>
    <c88>   DW_AT_external    : 1
    <c89>   DW_AT_declaration : 1
 <1><c8a>: Abbrev Number: 13 (DW_TAG_variable)
    <c8b>   DW_AT_name        : (indirect string, offset: 0xbe4): perf_type_id
    <c8f>   DW_AT_decl_file   : 20
    <c90>   DW_AT_decl_line   : 429
    <c92>   DW_AT_decl_column : 26
    <c93>   DW_AT_type        : <0xb59>
    <c97>   DW_AT_external    : 1
    <c98>   DW_AT_declaration : 1
 <1><c99>: Abbrev Number: 13 (DW_TAG_variable)
    <c9a>   DW_AT_name        : (indirect string, offset: 0xde7): pollflags
    <c9e>   DW_AT_decl_file   : 20
    <c9f>   DW_AT_decl_line   : 430
    <ca1>   DW_AT_decl_column : 26
    <ca2>   DW_AT_type        : <0xb59>
    <ca6>   DW_AT_external    : 1
    <ca7>   DW_AT_declaration : 1
 <1><ca8>: Abbrev Number: 13 (DW_TAG_variable)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x538): ptrace_cmds
    <cad>   DW_AT_decl_file   : 20
    <cae>   DW_AT_decl_line   : 431
    <cb0>   DW_AT_decl_column : 26
    <cb1>   DW_AT_type        : <0xb59>
    <cb5>   DW_AT_external    : 1
    <cb6>   DW_AT_declaration : 1
 <1><cb7>: Abbrev Number: 13 (DW_TAG_variable)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x7c6): resource_flags
    <cbc>   DW_AT_decl_file   : 20
    <cbd>   DW_AT_decl_line   : 432
    <cbf>   DW_AT_decl_column : 26
    <cc0>   DW_AT_type        : <0xb59>
    <cc4>   DW_AT_external    : 1
    <cc5>   DW_AT_declaration : 1
 <1><cc6>: Abbrev Number: 13 (DW_TAG_variable)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x267): route_nexthop_flags
    <ccb>   DW_AT_decl_file   : 20
    <ccc>   DW_AT_decl_line   : 433
    <cce>   DW_AT_decl_column : 26
    <ccf>   DW_AT_type        : <0xb59>
    <cd3>   DW_AT_external    : 1
    <cd4>   DW_AT_declaration : 1
 <1><cd5>: Abbrev Number: 13 (DW_TAG_variable)
    <cd6>   DW_AT_name        : (indirect string, offset: 0xe4d): routing_protocols
    <cda>   DW_AT_decl_file   : 20
    <cdb>   DW_AT_decl_line   : 434
    <cdd>   DW_AT_decl_column : 26
    <cde>   DW_AT_type        : <0xb59>
    <ce2>   DW_AT_external    : 1
    <ce3>   DW_AT_declaration : 1
 <1><ce4>: Abbrev Number: 13 (DW_TAG_variable)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x44c): routing_scopes
    <ce9>   DW_AT_decl_file   : 20
    <cea>   DW_AT_decl_line   : 435
    <cec>   DW_AT_decl_column : 26
    <ced>   DW_AT_type        : <0xb59>
    <cf1>   DW_AT_external    : 1
    <cf2>   DW_AT_declaration : 1
 <1><cf3>: Abbrev Number: 13 (DW_TAG_variable)
    <cf4>   DW_AT_name        : (indirect string, offset: 0xd41): routing_table_ids
    <cf8>   DW_AT_decl_file   : 20
    <cf9>   DW_AT_decl_line   : 436
    <cfb>   DW_AT_decl_column : 26
    <cfc>   DW_AT_type        : <0xb59>
    <d00>   DW_AT_external    : 1
    <d01>   DW_AT_declaration : 1
 <1><d02>: Abbrev Number: 13 (DW_TAG_variable)
    <d03>   DW_AT_name        : (indirect string, offset: 0x666): routing_types
    <d07>   DW_AT_decl_file   : 20
    <d08>   DW_AT_decl_line   : 437
    <d0a>   DW_AT_decl_column : 26
    <d0b>   DW_AT_type        : <0xb59>
    <d0f>   DW_AT_external    : 1
    <d10>   DW_AT_declaration : 1
 <1><d11>: Abbrev Number: 13 (DW_TAG_variable)
    <d12>   DW_AT_name        : (indirect string, offset: 0x1a5): rwf_flags
    <d16>   DW_AT_decl_file   : 20
    <d17>   DW_AT_decl_line   : 438
    <d19>   DW_AT_decl_column : 26
    <d1a>   DW_AT_type        : <0xb59>
    <d1e>   DW_AT_external    : 1
    <d1f>   DW_AT_declaration : 1
 <1><d20>: Abbrev Number: 13 (DW_TAG_variable)
    <d21>   DW_AT_name        : (indirect string, offset: 0x7fe): seccomp_filter_flags
    <d25>   DW_AT_decl_file   : 20
    <d26>   DW_AT_decl_line   : 439
    <d28>   DW_AT_decl_column : 26
    <d29>   DW_AT_type        : <0xb59>
    <d2d>   DW_AT_external    : 1
    <d2e>   DW_AT_declaration : 1
 <1><d2f>: Abbrev Number: 13 (DW_TAG_variable)
    <d30>   DW_AT_name        : (indirect string, offset: 0x2ae): seccomp_ret_action
    <d34>   DW_AT_decl_file   : 20
    <d35>   DW_AT_decl_line   : 440
    <d37>   DW_AT_decl_column : 26
    <d38>   DW_AT_type        : <0xb59>
    <d3c>   DW_AT_external    : 1
    <d3d>   DW_AT_declaration : 1
 <1><d3e>: Abbrev Number: 13 (DW_TAG_variable)
    <d3f>   DW_AT_name        : (indirect string, offset: 0x418): setns_types
    <d43>   DW_AT_decl_file   : 20
    <d44>   DW_AT_decl_line   : 441
    <d46>   DW_AT_decl_column : 26
    <d47>   DW_AT_type        : <0xb59>
    <d4b>   DW_AT_external    : 1
    <d4c>   DW_AT_declaration : 1
 <1><d4d>: Abbrev Number: 13 (DW_TAG_variable)
    <d4e>   DW_AT_name        : (indirect string, offset: 0xdd3): sg_io_info
    <d52>   DW_AT_decl_file   : 20
    <d53>   DW_AT_decl_line   : 442
    <d55>   DW_AT_decl_column : 26
    <d56>   DW_AT_type        : <0xb59>
    <d5a>   DW_AT_external    : 1
    <d5b>   DW_AT_declaration : 1
 <1><d5c>: Abbrev Number: 13 (DW_TAG_variable)
    <d5d>   DW_AT_name        : (indirect string, offset: 0xb59): socketlayers
    <d61>   DW_AT_decl_file   : 20
    <d62>   DW_AT_decl_line   : 443
    <d64>   DW_AT_decl_column : 26
    <d65>   DW_AT_type        : <0xb59>
    <d69>   DW_AT_external    : 1
    <d6a>   DW_AT_declaration : 1
 <1><d6b>: Abbrev Number: 13 (DW_TAG_variable)
    <d6c>   DW_AT_name        : (indirect string, offset: 0xd2b): socktypes
    <d70>   DW_AT_decl_file   : 20
    <d71>   DW_AT_decl_line   : 444
    <d73>   DW_AT_decl_column : 26
    <d74>   DW_AT_type        : <0xb59>
    <d78>   DW_AT_external    : 1
    <d79>   DW_AT_declaration : 1
 <1><d7a>: Abbrev Number: 13 (DW_TAG_variable)
    <d7b>   DW_AT_name        : (indirect string, offset: 0xa2e): tcp_state_flags
    <d7f>   DW_AT_decl_file   : 20
    <d80>   DW_AT_decl_line   : 445
    <d82>   DW_AT_decl_column : 26
    <d83>   DW_AT_type        : <0xb59>
    <d87>   DW_AT_external    : 1
    <d88>   DW_AT_declaration : 1
 <1><d89>: Abbrev Number: 13 (DW_TAG_variable)
    <d8a>   DW_AT_name        : (indirect string, offset: 0x72b): tcp_states
    <d8e>   DW_AT_decl_file   : 20
    <d8f>   DW_AT_decl_line   : 446
    <d91>   DW_AT_decl_column : 26
    <d92>   DW_AT_type        : <0xb59>
    <d96>   DW_AT_external    : 1
    <d97>   DW_AT_declaration : 1
 <1><d98>: Abbrev Number: 13 (DW_TAG_variable)
    <d99>   DW_AT_name        : (indirect string, offset: 0xffc): whence_codes
    <d9d>   DW_AT_decl_file   : 20
    <d9e>   DW_AT_decl_line   : 447
    <da0>   DW_AT_decl_column : 26
    <da1>   DW_AT_type        : <0xb59>
    <da5>   DW_AT_external    : 1
    <da6>   DW_AT_declaration : 1
 <1><da7>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <da8>   DW_AT_encoding    : 7	(unsigned)
    <da9>   DW_AT_byte_size   : 4
    <daa>   DW_AT_type        : <0x2b>
    <dae>   DW_AT_decl_file   : 20
    <daf>   DW_AT_decl_line   : 508
    <db1>   DW_AT_decl_column : 14
    <db2>   DW_AT_sibling     : <0xdc9>
 <2><db6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <db7>   DW_AT_name        : (indirect string, offset: 0x954): CFLAG_NONE
    <dbb>   DW_AT_const_value : 0
 <2><dbc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x897): CFLAG_ONLY_STATS
    <dc1>   DW_AT_const_value : 1
 <2><dc2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <dc3>   DW_AT_name        : (indirect string, offset: 0xb66): CFLAG_BOTH
    <dc7>   DW_AT_const_value : 2
 <2><dc8>: Abbrev Number: 0
 <1><dc9>: Abbrev Number: 29 (DW_TAG_typedef)
    <dca>   DW_AT_name        : (indirect string, offset: 0x10bc): cflag_t
    <dce>   DW_AT_decl_file   : 20
    <dcf>   DW_AT_decl_line   : 512
    <dd1>   DW_AT_decl_column : 3
    <dd2>   DW_AT_type        : <0xda7>
 <1><dd6>: Abbrev Number: 13 (DW_TAG_variable)
    <dd7>   DW_AT_name        : (indirect string, offset: 0xc7e): cflag
    <ddb>   DW_AT_decl_file   : 20
    <ddc>   DW_AT_decl_line   : 513
    <dde>   DW_AT_decl_column : 16
    <ddf>   DW_AT_type        : <0xdc9>
    <de3>   DW_AT_external    : 1
    <de4>   DW_AT_declaration : 1
 <1><de5>: Abbrev Number: 13 (DW_TAG_variable)
    <de6>   DW_AT_name        : (indirect string, offset: 0x170): Tflag
    <dea>   DW_AT_decl_file   : 20
    <deb>   DW_AT_decl_line   : 514
    <ded>   DW_AT_decl_column : 13
    <dee>   DW_AT_type        : <0x556>
    <df2>   DW_AT_external    : 1
    <df3>   DW_AT_declaration : 1
 <1><df4>: Abbrev Number: 13 (DW_TAG_variable)
    <df5>   DW_AT_name        : (indirect string, offset: 0x781): Tflag_scale
    <df9>   DW_AT_decl_file   : 20
    <dfa>   DW_AT_decl_line   : 515
    <dfc>   DW_AT_decl_column : 12
    <dfd>   DW_AT_type        : <0x64>
    <e01>   DW_AT_external    : 1
    <e02>   DW_AT_declaration : 1
 <1><e03>: Abbrev Number: 13 (DW_TAG_variable)
    <e04>   DW_AT_name        : (indirect string, offset: 0x813): Tflag_width
    <e08>   DW_AT_decl_file   : 20
    <e09>   DW_AT_decl_line   : 516
    <e0b>   DW_AT_decl_column : 12
    <e0c>   DW_AT_type        : <0x64>
    <e10>   DW_AT_external    : 1
    <e11>   DW_AT_declaration : 1
 <1><e12>: Abbrev Number: 13 (DW_TAG_variable)
    <e13>   DW_AT_name        : (indirect string, offset: 0xdc5): iflag
    <e17>   DW_AT_decl_file   : 20
    <e18>   DW_AT_decl_line   : 517
    <e1a>   DW_AT_decl_column : 13
    <e1b>   DW_AT_type        : <0x556>
    <e1f>   DW_AT_external    : 1
    <e20>   DW_AT_declaration : 1
 <1><e21>: Abbrev Number: 13 (DW_TAG_variable)
    <e22>   DW_AT_name        : (indirect string, offset: 0x578): count_wallclock
    <e26>   DW_AT_decl_file   : 20
    <e27>   DW_AT_decl_line   : 518
    <e29>   DW_AT_decl_column : 13
    <e2a>   DW_AT_type        : <0x556>
    <e2e>   DW_AT_external    : 1
    <e2f>   DW_AT_declaration : 1
 <1><e30>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e31>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e35>   DW_AT_byte_size   : 4
    <e36>   DW_AT_decl_file   : 20
    <e37>   DW_AT_decl_line   : 520
    <e39>   DW_AT_decl_column : 8
    <e3a>   DW_AT_sibling     : <0xe4f>
 <2><e3e>: Abbrev Number: 23 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e43>   DW_AT_decl_file   : 20
    <e44>   DW_AT_decl_line   : 521
    <e46>   DW_AT_decl_column : 14
    <e47>   DW_AT_type        : <0x20a>
    <e4b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e4e>: Abbrev Number: 0
 <1><e4f>: Abbrev Number: 30 (DW_TAG_structure_type)
    <e50>   DW_AT_name        : (indirect string, offset: 0x736): path_set
    <e54>   DW_AT_byte_size   : 12
    <e55>   DW_AT_decl_file   : 20
    <e56>   DW_AT_decl_line   : 525
    <e58>   DW_AT_decl_column : 15
    <e59>   DW_AT_sibling     : <0xe8e>
 <2><e5d>: Abbrev Number: 23 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x6c4): paths_selected
    <e62>   DW_AT_decl_file   : 20
    <e63>   DW_AT_decl_line   : 526
    <e65>   DW_AT_decl_column : 24
    <e66>   DW_AT_type        : <0xe8e>
    <e6a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e6d>: Abbrev Number: 23 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0xfef): num_selected
    <e72>   DW_AT_decl_file   : 20
    <e73>   DW_AT_decl_line   : 527
    <e75>   DW_AT_decl_column : 9
    <e76>   DW_AT_type        : <0x122>
    <e7a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e7d>: Abbrev Number: 23 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0xb16): size
    <e82>   DW_AT_decl_file   : 20
    <e83>   DW_AT_decl_line   : 528
    <e85>   DW_AT_decl_column : 9
    <e86>   DW_AT_type        : <0x122>
    <e8a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e8d>: Abbrev Number: 0
 <1><e8e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e8f>   DW_AT_byte_size   : 4
    <e90>   DW_AT_type        : <0xe30>
 <1><e94>: Abbrev Number: 13 (DW_TAG_variable)
    <e95>   DW_AT_name        : (indirect string, offset: 0x103e): global_path_set
    <e99>   DW_AT_decl_file   : 20
    <e9a>   DW_AT_decl_line   : 529
    <e9c>   DW_AT_decl_column : 3
    <e9d>   DW_AT_type        : <0xe4f>
    <ea1>   DW_AT_external    : 1
    <ea2>   DW_AT_declaration : 1
 <1><ea3>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ea4>   DW_AT_name        : (indirect string, offset: 0xf3a): xflag_opts
    <ea8>   DW_AT_encoding    : 7	(unsigned)
    <ea9>   DW_AT_byte_size   : 4
    <eaa>   DW_AT_type        : <0x2b>
    <eae>   DW_AT_decl_file   : 20
    <eaf>   DW_AT_decl_line   : 531
    <eb1>   DW_AT_decl_column : 6
    <eb2>   DW_AT_sibling     : <0xed5>
 <2><eb6>: Abbrev Number: 27 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x9e5): HEXSTR_NONE
    <ebb>   DW_AT_const_value : 0
 <2><ebc>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xf81): HEXSTR_NON_ASCII
    <ec1>   DW_AT_const_value : 1
 <2><ec2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x8d5): HEXSTR_ALL
    <ec7>   DW_AT_const_value : 2
 <2><ec8>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x64f): HEXSTR_NON_ASCII_CHARS
    <ecd>   DW_AT_const_value : 3
 <2><ece>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x1009): NUM_HEXSTR_OPTS
    <ed3>   DW_AT_const_value : 4
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 13 (DW_TAG_variable)
    <ed6>   DW_AT_name        : (indirect string, offset: 0xd94): xflag
    <eda>   DW_AT_decl_file   : 20
    <edb>   DW_AT_decl_line   : 544
    <edd>   DW_AT_decl_column : 17
    <ede>   DW_AT_type        : <0x2b>
    <ee2>   DW_AT_external    : 1
    <ee3>   DW_AT_declaration : 1
 <1><ee4>: Abbrev Number: 13 (DW_TAG_variable)
    <ee5>   DW_AT_name        : (indirect string, offset: 0xc39): followfork
    <ee9>   DW_AT_decl_file   : 20
    <eea>   DW_AT_decl_line   : 545
    <eec>   DW_AT_decl_column : 13
    <eed>   DW_AT_type        : <0x556>
    <ef1>   DW_AT_external    : 1
    <ef2>   DW_AT_declaration : 1
 <1><ef3>: Abbrev Number: 13 (DW_TAG_variable)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x2fc): output_separately
    <ef8>   DW_AT_decl_file   : 20
    <ef9>   DW_AT_decl_line   : 546
    <efb>   DW_AT_decl_column : 13
    <efc>   DW_AT_type        : <0x556>
    <f00>   DW_AT_external    : 1
    <f01>   DW_AT_declaration : 1
 <1><f02>: Abbrev Number: 13 (DW_TAG_variable)
    <f03>   DW_AT_name        : (indirect string, offset: 0x20c): stack_trace_enabled
    <f07>   DW_AT_decl_file   : 20
    <f08>   DW_AT_decl_line   : 549
    <f0a>   DW_AT_decl_column : 13
    <f0b>   DW_AT_type        : <0x556>
    <f0f>   DW_AT_external    : 1
    <f10>   DW_AT_declaration : 1
 <1><f11>: Abbrev Number: 13 (DW_TAG_variable)
    <f12>   DW_AT_name        : (indirect string, offset: 0x63d): ptrace_setoptions
    <f16>   DW_AT_decl_file   : 20
    <f17>   DW_AT_decl_line   : 553
    <f19>   DW_AT_decl_column : 17
    <f1a>   DW_AT_type        : <0x2b>
    <f1e>   DW_AT_external    : 1
    <f1f>   DW_AT_declaration : 1
 <1><f20>: Abbrev Number: 13 (DW_TAG_variable)
    <f21>   DW_AT_name        : (indirect string, offset: 0x9da): max_strlen
    <f25>   DW_AT_decl_file   : 20
    <f26>   DW_AT_decl_line   : 554
    <f28>   DW_AT_decl_column : 17
    <f29>   DW_AT_type        : <0x2b>
    <f2d>   DW_AT_external    : 1
    <f2e>   DW_AT_declaration : 1
 <1><f2f>: Abbrev Number: 13 (DW_TAG_variable)
    <f30>   DW_AT_name        : (indirect string, offset: 0xa08): os_release
    <f34>   DW_AT_decl_file   : 20
    <f35>   DW_AT_decl_line   : 555
    <f37>   DW_AT_decl_column : 17
    <f38>   DW_AT_type        : <0x2b>
    <f3c>   DW_AT_external    : 1
    <f3d>   DW_AT_declaration : 1
 <1><f3e>: Abbrev Number: 13 (DW_TAG_variable)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x6d3): xlat_verbosity
    <f43>   DW_AT_decl_file   : 20
    <f44>   DW_AT_decl_line   : 917
    <f46>   DW_AT_decl_column : 24
    <f47>   DW_AT_type        : <0xa7c>
    <f4b>   DW_AT_external    : 1
    <f4c>   DW_AT_declaration : 1
 <1><f4d>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f4e>   DW_AT_name        : (indirect string, offset: 0x55b): xlat_style_private_flag_bits
    <f52>   DW_AT_encoding    : 7	(unsigned)
    <f53>   DW_AT_byte_size   : 4
    <f54>   DW_AT_type        : <0x2b>
    <f58>   DW_AT_decl_file   : 20
    <f59>   DW_AT_decl_line   : 937
    <f5b>   DW_AT_decl_column : 6
    <f5c>   DW_AT_sibling     : <0xf79>
 <2><f60>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0x27b): PAF_PRINT_INDICES_BIT
    <f65>   DW_AT_const_value : 5
 <2><f66>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f67>   DW_AT_name        : (indirect string, offset: 0xacd): PAF_ARRAY_TRUNCATED_BIT
    <f6b>   DW_AT_const_value : 6
 <2><f6c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x3d8): PXF_DEFAULT_STR_BIT
    <f71>   DW_AT_const_value : 7
 <2><f72>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f73>   DW_AT_name        : (indirect string, offset: 0xc1b): SPFF_AUXSTR_MODE_BIT
    <f77>   DW_AT_const_value : 8
 <2><f78>: Abbrev Number: 0
 <1><f79>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <f7a>   DW_AT_name        : (indirect string, offset: 0xcca): find_xlat_flag_bits
    <f7e>   DW_AT_encoding    : 7	(unsigned)
    <f7f>   DW_AT_byte_size   : 4
    <f80>   DW_AT_type        : <0x2b>
    <f84>   DW_AT_decl_file   : 20
    <f85>   DW_AT_decl_line   : 1441
    <f87>   DW_AT_decl_column : 6
    <f88>   DW_AT_sibling     : <0xf93>
 <2><f8c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x912): FXL_CASE_SENSITIVE_BIT
    <f91>   DW_AT_const_value : 0
 <2><f92>: Abbrev Number: 0
 <1><f93>: Abbrev Number: 13 (DW_TAG_variable)
    <f94>   DW_AT_name        : (indirect string, offset: 0x9a7): printing_tcp
    <f98>   DW_AT_decl_file   : 20
    <f99>   DW_AT_decl_line   : 1687
    <f9b>   DW_AT_decl_column : 20
    <f9c>   DW_AT_type        : <0x632>
    <fa0>   DW_AT_external    : 1
    <fa1>   DW_AT_declaration : 1
 <1><fa2>: Abbrev Number: 13 (DW_TAG_variable)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x523): errnoent
    <fa7>   DW_AT_decl_file   : 20
    <fa8>   DW_AT_decl_line   : 1885
    <faa>   DW_AT_decl_column : 26
    <fab>   DW_AT_type        : <0x48a>
    <faf>   DW_AT_external    : 1
    <fb0>   DW_AT_declaration : 1
 <1><fb1>: Abbrev Number: 13 (DW_TAG_variable)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x81f): signalent
    <fb6>   DW_AT_decl_file   : 20
    <fb7>   DW_AT_decl_line   : 1886
    <fb9>   DW_AT_decl_column : 26
    <fba>   DW_AT_type        : <0x48a>
    <fbe>   DW_AT_external    : 1
    <fbf>   DW_AT_declaration : 1
 <1><fc0>: Abbrev Number: 13 (DW_TAG_variable)
    <fc1>   DW_AT_name        : (indirect string, offset: 0xe0d): nerrnos
    <fc5>   DW_AT_decl_file   : 20
    <fc6>   DW_AT_decl_line   : 1887
    <fc8>   DW_AT_decl_column : 27
    <fc9>   DW_AT_type        : <0x32>
    <fcd>   DW_AT_external    : 1
    <fce>   DW_AT_declaration : 1
 <1><fcf>: Abbrev Number: 13 (DW_TAG_variable)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xfd8): nsignals
    <fd4>   DW_AT_decl_file   : 20
    <fd5>   DW_AT_decl_line   : 1888
    <fd7>   DW_AT_decl_column : 27
    <fd8>   DW_AT_type        : <0x32>
    <fdc>   DW_AT_external    : 1
    <fdd>   DW_AT_declaration : 1
 <1><fde>: Abbrev Number: 10 (DW_TAG_array_type)
    <fdf>   DW_AT_type        : <0x89b>
    <fe3>   DW_AT_sibling     : <0xfe9>
 <2><fe7>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><fe8>: Abbrev Number: 0
 <1><fe9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fea>   DW_AT_type        : <0xfde>
 <1><fee>: Abbrev Number: 13 (DW_TAG_variable)
    <fef>   DW_AT_name        : (indirect string, offset: 0xc95): sysent0
    <ff3>   DW_AT_decl_file   : 20
    <ff4>   DW_AT_decl_line   : 1890
    <ff6>   DW_AT_decl_column : 28
    <ff7>   DW_AT_type        : <0xfe9>
    <ffb>   DW_AT_external    : 1
    <ffc>   DW_AT_declaration : 1
 <1><ffd>: Abbrev Number: 10 (DW_TAG_array_type)
    <ffe>   DW_AT_type        : <0x902>
    <1002>   DW_AT_sibling     : <0x1008>
 <2><1006>: Abbrev Number: 18 (DW_TAG_subrange_type)
 <2><1007>: Abbrev Number: 0
 <1><1008>: Abbrev Number: 3 (DW_TAG_const_type)
    <1009>   DW_AT_type        : <0xffd>
 <1><100d>: Abbrev Number: 13 (DW_TAG_variable)
    <100e>   DW_AT_name        : (indirect string, offset: 0x1034): ioctlent0
    <1012>   DW_AT_decl_file   : 20
    <1013>   DW_AT_decl_line   : 1891
    <1015>   DW_AT_decl_column : 30
    <1016>   DW_AT_type        : <0x1008>
    <101a>   DW_AT_external    : 1
    <101b>   DW_AT_declaration : 1
 <1><101c>: Abbrev Number: 13 (DW_TAG_variable)
    <101d>   DW_AT_name        : (indirect string, offset: 0xf45): personality_names
    <1021>   DW_AT_decl_file   : 20
    <1022>   DW_AT_decl_line   : 1893
    <1024>   DW_AT_decl_column : 26
    <1025>   DW_AT_type        : <0x48a>
    <1029>   DW_AT_external    : 1
    <102a>   DW_AT_declaration : 1
 <1><102b>: Abbrev Number: 13 (DW_TAG_variable)
    <102c>   DW_AT_name        : (indirect string, offset: 0x83f): sysent
    <1030>   DW_AT_decl_file   : 20
    <1031>   DW_AT_decl_line   : 1896
    <1033>   DW_AT_decl_column : 29
    <1034>   DW_AT_type        : <0x9e7>
    <1038>   DW_AT_external    : 1
    <1039>   DW_AT_declaration : 1
 <1><103a>: Abbrev Number: 13 (DW_TAG_variable)
    <103b>   DW_AT_name        : (indirect string, offset: 0xc30): ioctlent
    <103f>   DW_AT_decl_file   : 20
    <1040>   DW_AT_decl_line   : 1897
    <1042>   DW_AT_decl_column : 31
    <1043>   DW_AT_type        : <0x1049>
    <1047>   DW_AT_external    : 1
    <1048>   DW_AT_declaration : 1
 <1><1049>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <104a>   DW_AT_byte_size   : 4
    <104b>   DW_AT_type        : <0x902>
 <1><104f>: Abbrev Number: 13 (DW_TAG_variable)
    <1050>   DW_AT_name        : (indirect string, offset: 0x829): nsyscalls
    <1054>   DW_AT_decl_file   : 20
    <1055>   DW_AT_decl_line   : 1903
    <1057>   DW_AT_decl_column : 17
    <1058>   DW_AT_type        : <0x2b>
    <105c>   DW_AT_external    : 1
    <105d>   DW_AT_declaration : 1
 <1><105e>: Abbrev Number: 13 (DW_TAG_variable)
    <105f>   DW_AT_name        : (indirect string, offset: 0xe2d): nioctlents
    <1063>   DW_AT_decl_file   : 20
    <1064>   DW_AT_decl_line   : 1904
    <1066>   DW_AT_decl_column : 17
    <1067>   DW_AT_type        : <0x2b>
    <106b>   DW_AT_external    : 1
    <106c>   DW_AT_declaration : 1
 <1><106d>: Abbrev Number: 10 (DW_TAG_array_type)
    <106e>   DW_AT_type        : <0x32>
    <1072>   DW_AT_sibling     : <0x107d>
 <2><1076>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1077>   DW_AT_type        : <0x2b>
    <107b>   DW_AT_upper_bound : 2
 <2><107c>: Abbrev Number: 0
 <1><107d>: Abbrev Number: 3 (DW_TAG_const_type)
    <107e>   DW_AT_type        : <0x106d>
 <1><1082>: Abbrev Number: 13 (DW_TAG_variable)
    <1083>   DW_AT_name        : (indirect string, offset: 0xea2): nsyscall_vec
    <1087>   DW_AT_decl_file   : 20
    <1088>   DW_AT_decl_line   : 1906
    <108a>   DW_AT_decl_column : 27
    <108b>   DW_AT_type        : <0x107d>
    <108f>   DW_AT_external    : 1
    <1090>   DW_AT_declaration : 1
 <1><1091>: Abbrev Number: 10 (DW_TAG_array_type)
    <1092>   DW_AT_type        : <0x9ed>
    <1096>   DW_AT_sibling     : <0x10a1>
 <2><109a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <109b>   DW_AT_type        : <0x2b>
    <109f>   DW_AT_upper_bound : 2
 <2><10a0>: Abbrev Number: 0
 <1><10a1>: Abbrev Number: 3 (DW_TAG_const_type)
    <10a2>   DW_AT_type        : <0x1091>
 <1><10a6>: Abbrev Number: 13 (DW_TAG_variable)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x76e): sysent_vec
    <10ab>   DW_AT_decl_file   : 20
    <10ac>   DW_AT_decl_line   : 1907
    <10ae>   DW_AT_decl_column : 35
    <10af>   DW_AT_type        : <0x10a1>
    <10b3>   DW_AT_external    : 1
    <10b4>   DW_AT_declaration : 1
 <1><10b5>: Abbrev Number: 13 (DW_TAG_variable)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x355): inject_vec
    <10ba>   DW_AT_decl_file   : 20
    <10bb>   DW_AT_decl_line   : 1908
    <10bd>   DW_AT_decl_column : 28
    <10be>   DW_AT_type        : <0x9f2>
    <10c2>   DW_AT_external    : 1
    <10c3>   DW_AT_declaration : 1
 <1><10c4>: Abbrev Number: 30 (DW_TAG_structure_type)
    <10c5>   DW_AT_name        : (indirect string, offset: 0xd1e): audit_arch_t
    <10c9>   DW_AT_byte_size   : 8
    <10ca>   DW_AT_decl_file   : 20
    <10cb>   DW_AT_decl_line   : 1910
    <10cd>   DW_AT_decl_column : 8
    <10ce>   DW_AT_sibling     : <0x10f3>
 <2><10d2>: Abbrev Number: 23 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0x54d): arch
    <10d7>   DW_AT_decl_file   : 20
    <10d8>   DW_AT_decl_line   : 1911
    <10da>   DW_AT_decl_column : 15
    <10db>   DW_AT_type        : <0x2b>
    <10df>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10e2>: Abbrev Number: 23 (DW_TAG_member)
    <10e3>   DW_AT_name        : (indirect string, offset: 0x98d): flag
    <10e7>   DW_AT_decl_file   : 20
    <10e8>   DW_AT_decl_line   : 1912
    <10ea>   DW_AT_decl_column : 15
    <10eb>   DW_AT_type        : <0x2b>
    <10ef>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10f2>: Abbrev Number: 0
 <1><10f3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f4>   DW_AT_type        : <0x10c4>
 <1><10f8>: Abbrev Number: 10 (DW_TAG_array_type)
    <10f9>   DW_AT_type        : <0x10f3>
    <10fd>   DW_AT_sibling     : <0x1108>
 <2><1101>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1102>   DW_AT_type        : <0x2b>
    <1106>   DW_AT_upper_bound : 2
 <2><1107>: Abbrev Number: 0
 <1><1108>: Abbrev Number: 3 (DW_TAG_const_type)
    <1109>   DW_AT_type        : <0x10f8>
 <1><110d>: Abbrev Number: 13 (DW_TAG_variable)
    <110e>   DW_AT_name        : (indirect string, offset: 0x903): audit_arch_vec
    <1112>   DW_AT_decl_file   : 20
    <1113>   DW_AT_decl_line   : 1915
    <1115>   DW_AT_decl_column : 34
    <1116>   DW_AT_type        : <0x1108>
    <111a>   DW_AT_external    : 1
    <111b>   DW_AT_declaration : 1
 <1><111c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <111d>   DW_AT_byte_size   : 180
    <111e>   DW_AT_decl_file   : 22
    <111f>   DW_AT_decl_line   : 2
    <1120>   DW_AT_decl_column : 9
    <1121>   DW_AT_sibling     : <0x13d6>
 <2><1125>: Abbrev Number: 9 (DW_TAG_member)
    <1126>   DW_AT_name        : (indirect string, offset: 0x1bd): block_ioctl
    <112a>   DW_AT_decl_file   : 22
    <112b>   DW_AT_decl_line   : 3
    <112c>   DW_AT_decl_column : 8
    <112d>   DW_AT_type        : <0x13f0>
    <1131>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1134>: Abbrev Number: 9 (DW_TAG_member)
    <1135>   DW_AT_name        : (indirect string, offset: 0xa6c): btrfs_ioctl
    <1139>   DW_AT_decl_file   : 22
    <113a>   DW_AT_decl_line   : 6
    <113b>   DW_AT_decl_column : 8
    <113c>   DW_AT_type        : <0x13f0>
    <1140>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1143>: Abbrev Number: 9 (DW_TAG_member)
    <1144>   DW_AT_name        : (indirect string, offset: 0x70c): evdev_write_ioctl_mpers
    <1148>   DW_AT_decl_file   : 22
    <1149>   DW_AT_decl_line   : 9
    <114a>   DW_AT_decl_column : 8
