Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x167a (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5a6): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8b8): mpers-m32/struct_flock64.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb27): /home/femu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x39d): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfc6): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x96b): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x340): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x24f): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdcb): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x46f): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x856): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xea4): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x886): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x761): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb54): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb8a): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2b5): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcde): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc4b): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3e9): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x435): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x34c): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb75): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf5b): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xddb): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xadb): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x1093): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe01): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
    <160>   DW_AT_byte_size   : 12
    <161>   DW_AT_encoding    : 4	(float)
    <162>   DW_AT_name        : (indirect string, offset: 0xa9d): long double
 <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 16
    <168>   DW_AT_encoding    : 4	(float)
    <169>   DW_AT_name        : (indirect string, offset: 0xf84): _Float128
 <1><16d>: Abbrev Number: 10 (DW_TAG_variable)
    <16e>   DW_AT_name        : (indirect string, offset: 0x26c): __environ
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 543
    <175>   DW_AT_decl_column : 15
    <176>   DW_AT_type        : <0x17c>
    <17a>   DW_AT_external    : 1
    <17b>   DW_AT_declaration : 1
 <1><17c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_type        : <0xe0>
 <1><182>: Abbrev Number: 10 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x395): environ
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 545
    <18a>   DW_AT_decl_column : 15
    <18b>   DW_AT_type        : <0x17c>
    <18f>   DW_AT_external    : 1
    <190>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 11 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0xfaa): optarg
    <196>   DW_AT_decl_file   : 6
    <197>   DW_AT_decl_line   : 36
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xe0>
    <19d>   DW_AT_external    : 1
    <19e>   DW_AT_declaration : 1
 <1><19f>: Abbrev Number: 11 (DW_TAG_variable)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x734): optind
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 50
    <1a6>   DW_AT_decl_column : 12
    <1a7>   DW_AT_type        : <0x64>
    <1ab>   DW_AT_external    : 1
    <1ac>   DW_AT_declaration : 1
 <1><1ad>: Abbrev Number: 11 (DW_TAG_variable)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc3a): opterr
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x64>
    <1b9>   DW_AT_external    : 1
    <1ba>   DW_AT_declaration : 1
 <1><1bb>: Abbrev Number: 11 (DW_TAG_variable)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x10a6): optopt
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 12
    <1c3>   DW_AT_type        : <0x64>
    <1c7>   DW_AT_external    : 1
    <1c8>   DW_AT_declaration : 1
 <1><1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ca>   DW_AT_byte_size   : 4
    <1cb>   DW_AT_type        : <0xed>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <1d0>   DW_AT_type        : <0x1c9>
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d6>   DW_AT_type        : <0x1da>
 <1><1da>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x354): _IO_FILE
    <1e0>   DW_AT_byte_size   : 148
    <1e1>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 49
    <1e3>   DW_AT_decl_column : 8
    <1e4>   DW_AT_sibling     : <0x39c>
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x9ef): _flags
    <1ed>   DW_AT_decl_file   : 7
    <1ee>   DW_AT_decl_line   : 51
    <1ef>   DW_AT_decl_column : 7
    <1f0>   DW_AT_type        : <0x64>
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x4be): _IO_read_ptr
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 54
    <1fe>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0xe0>
    <203>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><206>: Abbrev Number: 9 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0xf02): _IO_read_end
    <20b>   DW_AT_decl_file   : 7
    <20c>   DW_AT_decl_line   : 55
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_type        : <0xe0>
    <212>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><215>: Abbrev Number: 9 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x79d): _IO_read_base
    <21a>   DW_AT_decl_file   : 7
    <21b>   DW_AT_decl_line   : 56
    <21c>   DW_AT_decl_column : 9
    <21d>   DW_AT_type        : <0xe0>
    <221>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><224>: Abbrev Number: 9 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x124): _IO_write_base
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0xe0>
    <230>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><233>: Abbrev Number: 9 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0xfff): _IO_write_ptr
    <238>   DW_AT_decl_file   : 7
    <239>   DW_AT_decl_line   : 58
    <23a>   DW_AT_decl_column : 9
    <23b>   DW_AT_type        : <0xe0>
    <23f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x8e3): _IO_write_end
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 59
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0xe0>
    <24e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x954): _IO_buf_base
    <256>   DW_AT_decl_file   : 7
    <257>   DW_AT_decl_line   : 60
    <258>   DW_AT_decl_column : 9
    <259>   DW_AT_type        : <0xe0>
    <25d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0xd76): _IO_buf_end
    <265>   DW_AT_decl_file   : 7
    <266>   DW_AT_decl_line   : 61
    <267>   DW_AT_decl_column : 9
    <268>   DW_AT_type        : <0xe0>
    <26c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><26f>: Abbrev Number: 9 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x1b5): _IO_save_base
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 64
    <276>   DW_AT_decl_column : 9
    <277>   DW_AT_type        : <0xe0>
    <27b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><27e>: Abbrev Number: 9 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xca5): _IO_backup_base
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 65
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0xe0>
    <28a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><28d>: Abbrev Number: 9 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xac): _IO_save_end
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 66
    <294>   DW_AT_decl_column : 9
    <295>   DW_AT_type        : <0xe0>
    <299>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><29c>: Abbrev Number: 9 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x552): _markers
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 68
    <2a3>   DW_AT_decl_column : 22
    <2a4>   DW_AT_type        : <0x3b6>
    <2a8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x1f8): _chain
    <2b0>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 70
    <2b2>   DW_AT_decl_column : 20
    <2b3>   DW_AT_type        : <0x3bc>
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xf6f): _fileno
    <2bf>   DW_AT_decl_file   : 7
    <2c0>   DW_AT_decl_line   : 72
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_type        : <0x64>
    <2c6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2c9>: Abbrev Number: 9 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x789): _flags2
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 73
    <2d0>   DW_AT_decl_column : 7
    <2d1>   DW_AT_type        : <0x64>
    <2d5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2d8>: Abbrev Number: 9 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x802): _old_offset
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 74
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0xa2>
    <2e4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2e7>: Abbrev Number: 9 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x22b): _cur_column
    <2ec>   DW_AT_decl_file   : 7
    <2ed>   DW_AT_decl_line   : 77
    <2ee>   DW_AT_decl_column : 18
    <2ef>   DW_AT_type        : <0x24>
    <2f3>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><2f6>: Abbrev Number: 9 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe27): _vtable_offset
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 78
    <2fd>   DW_AT_decl_column : 15
    <2fe>   DW_AT_type        : <0x3e>
    <302>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><305>: Abbrev Number: 9 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xcb5): _shortbuf
    <30a>   DW_AT_decl_file   : 7
    <30b>   DW_AT_decl_line   : 79
    <30c>   DW_AT_decl_column : 8
    <30d>   DW_AT_type        : <0x3c2>
    <311>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><314>: Abbrev Number: 9 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x165): _lock
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 81
    <31b>   DW_AT_decl_column : 15
    <31c>   DW_AT_type        : <0x3d2>
    <320>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><323>: Abbrev Number: 9 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x6bc): _offset
    <328>   DW_AT_decl_file   : 7
    <329>   DW_AT_decl_line   : 89
    <32a>   DW_AT_decl_column : 13
    <32b>   DW_AT_type        : <0xb5>
    <32f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0xa2f): _codecvt
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 91
    <339>   DW_AT_decl_column : 23
    <33a>   DW_AT_type        : <0x3de>
    <33e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><341>: Abbrev Number: 9 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xf8e): _wide_data
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 92
    <348>   DW_AT_decl_column : 25
    <349>   DW_AT_type        : <0x3ea>
    <34d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><350>: Abbrev Number: 9 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x3b9): _freeres_list
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 93
    <357>   DW_AT_decl_column : 20
    <358>   DW_AT_type        : <0x3bc>
    <35c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><35f>: Abbrev Number: 9 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xc10): _freeres_buf
    <364>   DW_AT_decl_file   : 7
    <365>   DW_AT_decl_line   : 94
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_type        : <0xcd>
    <36b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><36e>: Abbrev Number: 9 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x9a9): __pad5
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 95
    <375>   DW_AT_decl_column : 10
    <376>   DW_AT_type        : <0x122>
    <37a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><37d>: Abbrev Number: 9 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xa13): _mode
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 96
    <384>   DW_AT_decl_column : 7
    <385>   DW_AT_type        : <0x64>
    <389>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><38c>: Abbrev Number: 9 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x7b7): _unused2
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 98
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x3f0>
    <398>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 4 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0xabd): FILE
    <3a1>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 7
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x1db>
 <1><3a8>: Abbrev Number: 13 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x464): _IO_lock_t
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 43
    <3af>   DW_AT_decl_column : 14
 <1><3b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x2fe): _IO_marker
    <3b5>   DW_AT_declaration : 1
 <1><3b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b7>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3b0>
 <1><3bc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3be>   DW_AT_type        : <0x1db>
 <1><3c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <3c3>   DW_AT_type        : <0xe6>
    <3c7>   DW_AT_sibling     : <0x3d2>
 <2><3cb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3cc>   DW_AT_type        : <0x2b>
    <3d0>   DW_AT_upper_bound : 0
 <2><3d1>: Abbrev Number: 0
 <1><3d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d3>   DW_AT_byte_size   : 4
    <3d4>   DW_AT_type        : <0x3a8>
 <1><3d8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3dd>   DW_AT_declaration : 1
 <1><3de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x3d8>
 <1><3e4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x368): _IO_wide_data
    <3e9>   DW_AT_declaration : 1
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3e4>
 <1><3f0>: Abbrev Number: 15 (DW_TAG_array_type)
    <3f1>   DW_AT_type        : <0xe6>
    <3f5>   DW_AT_sibling     : <0x400>
 <2><3f9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3fa>   DW_AT_type        : <0x2b>
    <3fe>   DW_AT_upper_bound : 39
 <2><3ff>: Abbrev Number: 0
 <1><400>: Abbrev Number: 11 (DW_TAG_variable)
    <401>   DW_AT_name        : (indirect string, offset: 0x51d): stdin
    <405>   DW_AT_decl_file   : 9
    <406>   DW_AT_decl_line   : 137
    <407>   DW_AT_decl_column : 14
    <408>   DW_AT_type        : <0x40e>
    <40c>   DW_AT_external    : 1
    <40d>   DW_AT_declaration : 1
 <1><40e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <40f>   DW_AT_byte_size   : 4
    <410>   DW_AT_type        : <0x39c>
 <1><414>: Abbrev Number: 11 (DW_TAG_variable)
    <415>   DW_AT_name        : (indirect string, offset: 0xfd9): stdout
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 138
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_type        : <0x40e>
    <420>   DW_AT_external    : 1
    <421>   DW_AT_declaration : 1
 <1><422>: Abbrev Number: 11 (DW_TAG_variable)
    <423>   DW_AT_name        : (indirect string, offset: 0xdc4): stderr
    <427>   DW_AT_decl_file   : 9
    <428>   DW_AT_decl_line   : 139
    <429>   DW_AT_decl_column : 14
    <42a>   DW_AT_type        : <0x40e>
    <42e>   DW_AT_external    : 1
    <42f>   DW_AT_declaration : 1
 <1><430>: Abbrev Number: 11 (DW_TAG_variable)
    <431>   DW_AT_name        : (indirect string, offset: 0x237): sys_nerr
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 26
    <437>   DW_AT_decl_column : 12
    <438>   DW_AT_type        : <0x64>
    <43c>   DW_AT_external    : 1
    <43d>   DW_AT_declaration : 1
 <1><43e>: Abbrev Number: 15 (DW_TAG_array_type)
    <43f>   DW_AT_type        : <0x1cf>
    <443>   DW_AT_sibling     : <0x449>
 <2><447>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x43e>
 <1><44e>: Abbrev Number: 11 (DW_TAG_variable)
    <44f>   DW_AT_name        : (indirect string, offset: 0x52c): sys_errlist
    <453>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 27
    <455>   DW_AT_decl_column : 26
    <456>   DW_AT_type        : <0x449>
    <45a>   DW_AT_external    : 1
    <45b>   DW_AT_declaration : 1
 <1><45c>: Abbrev Number: 11 (DW_TAG_variable)
    <45d>   DW_AT_name        : (indirect string, offset: 0x259): _sys_nerr
    <461>   DW_AT_decl_file   : 10
    <462>   DW_AT_decl_line   : 30
    <463>   DW_AT_decl_column : 12
    <464>   DW_AT_type        : <0x64>
    <468>   DW_AT_external    : 1
    <469>   DW_AT_declaration : 1
 <1><46a>: Abbrev Number: 11 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0xe36): _sys_errlist
    <46f>   DW_AT_decl_file   : 10
    <470>   DW_AT_decl_line   : 31
    <471>   DW_AT_decl_column : 26
    <472>   DW_AT_type        : <0x449>
    <476>   DW_AT_external    : 1
    <477>   DW_AT_declaration : 1
 <1><478>: Abbrev Number: 11 (DW_TAG_variable)
    <479>   DW_AT_name        : (indirect string, offset: 0x695): program_invocation_name
    <47d>   DW_AT_decl_file   : 11
    <47e>   DW_AT_decl_line   : 45
    <47f>   DW_AT_decl_column : 14
    <480>   DW_AT_type        : <0xe0>
    <484>   DW_AT_external    : 1
    <485>   DW_AT_declaration : 1
 <1><486>: Abbrev Number: 11 (DW_TAG_variable)
    <487>   DW_AT_name        : (indirect string, offset: 0xbb5): program_invocation_short_name
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 46
    <48d>   DW_AT_decl_column : 14
    <48e>   DW_AT_type        : <0xe0>
    <492>   DW_AT_external    : 1
    <493>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 15 (DW_TAG_array_type)
    <495>   DW_AT_type        : <0xe0>
    <499>   DW_AT_sibling     : <0x4a4>
 <2><49d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <49e>   DW_AT_type        : <0x2b>
    <4a2>   DW_AT_upper_bound : 1
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 11 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1a2): __tzname
    <4a9>   DW_AT_decl_file   : 12
    <4aa>   DW_AT_decl_line   : 159
    <4ab>   DW_AT_decl_column : 14
    <4ac>   DW_AT_type        : <0x494>
    <4b0>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b2>: Abbrev Number: 11 (DW_TAG_variable)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xe8b): __daylight
    <4b7>   DW_AT_decl_file   : 12
    <4b8>   DW_AT_decl_line   : 160
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0x64>
    <4be>   DW_AT_external    : 1
    <4bf>   DW_AT_declaration : 1
 <1><4c0>: Abbrev Number: 11 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x35d): __timezone
    <4c5>   DW_AT_decl_file   : 12
    <4c6>   DW_AT_decl_line   : 161
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xae>
    <4cc>   DW_AT_external    : 1
    <4cd>   DW_AT_declaration : 1
 <1><4ce>: Abbrev Number: 11 (DW_TAG_variable)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x9a2): tzname
    <4d3>   DW_AT_decl_file   : 12
    <4d4>   DW_AT_decl_line   : 166
    <4d5>   DW_AT_decl_column : 14
    <4d6>   DW_AT_type        : <0x494>
    <4da>   DW_AT_external    : 1
    <4db>   DW_AT_declaration : 1
 <1><4dc>: Abbrev Number: 11 (DW_TAG_variable)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x1049): daylight
    <4e1>   DW_AT_decl_file   : 12
    <4e2>   DW_AT_decl_line   : 174
    <4e3>   DW_AT_decl_column : 12
    <4e4>   DW_AT_type        : <0x64>
    <4e8>   DW_AT_external    : 1
    <4e9>   DW_AT_declaration : 1
 <1><4ea>: Abbrev Number: 11 (DW_TAG_variable)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x4a9): timezone
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 175
    <4f1>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xae>
    <4f6>   DW_AT_external    : 1
    <4f7>   DW_AT_declaration : 1
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xf2f): getdate_err
    <4fd>   DW_AT_decl_file   : 12
    <4fe>   DW_AT_decl_line   : 274
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x64>
    <505>   DW_AT_external    : 1
    <506>   DW_AT_declaration : 1
 <1><507>: Abbrev Number: 11 (DW_TAG_variable)
    <508>   DW_AT_name        : (indirect string, offset: 0x9bd): debug_flag
    <50c>   DW_AT_decl_file   : 13
    <50d>   DW_AT_decl_line   : 20
    <50e>   DW_AT_decl_column : 13
    <50f>   DW_AT_type        : <0x515>
    <513>   DW_AT_external    : 1
    <514>   DW_AT_declaration : 1
 <1><515>: Abbrev Number: 2 (DW_TAG_base_type)
    <516>   DW_AT_byte_size   : 1
    <517>   DW_AT_encoding    : 2	(boolean)
    <518>   DW_AT_name        : (indirect string, offset: 0x3fb): _Bool
 <1><51c>: Abbrev Number: 3 (DW_TAG_const_type)
    <51d>   DW_AT_type        : <0x515>
 <1><521>: Abbrev Number: 4 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0xa73): __kernel_long_t
    <526>   DW_AT_decl_file   : 14
    <527>   DW_AT_decl_line   : 15
    <528>   DW_AT_decl_column : 15
    <529>   DW_AT_type        : <0xae>
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0x50c): __kernel_ulong_t
    <532>   DW_AT_decl_file   : 14
    <533>   DW_AT_decl_line   : 16
    <534>   DW_AT_decl_column : 23
    <535>   DW_AT_type        : <0x37>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0x240): __kernel_pid_t
    <53e>   DW_AT_decl_file   : 14
    <53f>   DW_AT_decl_line   : 28
    <540>   DW_AT_decl_column : 14
    <541>   DW_AT_type        : <0x64>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x724): __kernel_loff_t
    <54a>   DW_AT_decl_file   : 14
    <54b>   DW_AT_decl_line   : 88
    <54c>   DW_AT_decl_column : 19
    <54d>   DW_AT_type        : <0x88>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x3c7): kernel_long_t
    <556>   DW_AT_decl_file   : 15
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 25
    <559>   DW_AT_type        : <0x521>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x877): kernel_ulong_t
    <562>   DW_AT_decl_file   : 15
    <563>   DW_AT_decl_line   : 17
    <564>   DW_AT_decl_column : 26
    <565>   DW_AT_type        : <0x52d>
 <1><569>: Abbrev Number: 3 (DW_TAG_const_type)
    <56a>   DW_AT_type        : <0x55d>
 <1><56e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56f>   DW_AT_name        : (indirect string, offset: 0xbd3): list_item
    <573>   DW_AT_byte_size   : 8
    <574>   DW_AT_decl_file   : 16
    <575>   DW_AT_decl_line   : 92
    <576>   DW_AT_decl_column : 8
    <577>   DW_AT_sibling     : <0x59a>
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x108e): prev
    <580>   DW_AT_decl_file   : 16
    <581>   DW_AT_decl_line   : 93
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x59a>
    <587>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58a>: Abbrev Number: 9 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x1084): next
    <58f>   DW_AT_decl_file   : 16
    <590>   DW_AT_decl_line   : 94
    <591>   DW_AT_decl_column : 20
    <592>   DW_AT_type        : <0x59a>
    <596>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59b>   DW_AT_byte_size   : 4
    <59c>   DW_AT_type        : <0x56e>
 <1><5a0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x84f): sysent
    <5a5>   DW_AT_byte_size   : 20
    <5a6>   DW_AT_decl_file   : 17
    <5a7>   DW_AT_decl_line   : 13
    <5a8>   DW_AT_decl_column : 16
    <5a9>   DW_AT_sibling     : <0x5f9>
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xff0): nargs
    <5b2>   DW_AT_decl_file   : 17
    <5b3>   DW_AT_decl_line   : 14
    <5b4>   DW_AT_decl_column : 11
    <5b5>   DW_AT_type        : <0x2b>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x961): sys_flags
    <5c1>   DW_AT_decl_file   : 17
    <5c2>   DW_AT_decl_line   : 15
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x64>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cb>: Abbrev Number: 18 (DW_TAG_member)
    <5cc>   DW_AT_name        : sen
    <5d0>   DW_AT_decl_file   : 17
    <5d1>   DW_AT_decl_line   : 16
    <5d2>   DW_AT_decl_column : 6
    <5d3>   DW_AT_type        : <0x64>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x2f5): sys_func
    <5df>   DW_AT_decl_file   : 17
    <5e0>   DW_AT_decl_line   : 17
    <5e1>   DW_AT_decl_column : 8
    <5e2>   DW_AT_type        : <0x84f>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e9>: Abbrev Number: 9 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x263): sys_name
    <5ee>   DW_AT_decl_file   : 17
    <5ef>   DW_AT_decl_line   : 18
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x1c9>
    <5f5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f8>: Abbrev Number: 0
 <1><5f9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fa>   DW_AT_prototyped  : 1
    <5fb>   DW_AT_type        : <0x64>
    <5ff>   DW_AT_sibling     : <0x609>
 <2><603>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x609>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 4
    <60b>   DW_AT_type        : <0x614>
 <1><60f>: Abbrev Number: 3 (DW_TAG_const_type)
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 21 (DW_TAG_structure_type)
    <615>   DW_AT_name        : tcb
    <619>   DW_AT_byte_size   : 200
    <61a>   DW_AT_decl_file   : 18
    <61b>   DW_AT_decl_line   : 262
    <61d>   DW_AT_decl_column : 8
    <61e>   DW_AT_sibling     : <0x84f>
 <2><622>: Abbrev Number: 22 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x4b8): flags
    <627>   DW_AT_decl_file   : 18
    <628>   DW_AT_decl_line   : 263
    <62a>   DW_AT_decl_column : 6
    <62b>   DW_AT_type        : <0x64>
    <62f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><632>: Abbrev Number: 23 (DW_TAG_member)
    <633>   DW_AT_name        : pid
    <637>   DW_AT_decl_file   : 18
    <638>   DW_AT_decl_line   : 264
    <63a>   DW_AT_decl_column : 6
    <63b>   DW_AT_type        : <0x64>
    <63f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><642>: Abbrev Number: 22 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <647>   DW_AT_decl_file   : 18
    <648>   DW_AT_decl_line   : 265
    <64a>   DW_AT_decl_column : 6
    <64b>   DW_AT_type        : <0x64>
    <64f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><652>: Abbrev Number: 22 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x381): currpers
    <657>   DW_AT_decl_file   : 18
    <658>   DW_AT_decl_line   : 267
    <65a>   DW_AT_decl_column : 15
    <65b>   DW_AT_type        : <0x2b>
    <65f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><662>: Abbrev Number: 22 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0xb1f): u_error
    <667>   DW_AT_decl_file   : 18
    <668>   DW_AT_decl_line   : 269
    <66a>   DW_AT_decl_column : 16
    <66b>   DW_AT_type        : <0x37>
    <66f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><672>: Abbrev Number: 22 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <677>   DW_AT_decl_file   : 18
    <678>   DW_AT_decl_line   : 270
    <67a>   DW_AT_decl_column : 17
    <67b>   DW_AT_type        : <0x55d>
    <67f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><682>: Abbrev Number: 22 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0xb6b): true_scno
    <687>   DW_AT_decl_file   : 18
    <688>   DW_AT_decl_line   : 271
    <68a>   DW_AT_decl_column : 17
    <68b>   DW_AT_type        : <0x55d>
    <68f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><692>: Abbrev Number: 22 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x18c): u_arg
    <697>   DW_AT_decl_file   : 18
    <698>   DW_AT_decl_line   : 272
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x97f>
    <69f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a2>: Abbrev Number: 22 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x978): u_rval
    <6a7>   DW_AT_decl_file   : 18
    <6a8>   DW_AT_decl_line   : 273
    <6aa>   DW_AT_decl_column : 16
    <6ab>   DW_AT_type        : <0x551>
    <6af>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b2>: Abbrev Number: 22 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0xa8f): sys_func_rval
    <6b7>   DW_AT_decl_file   : 18
    <6b8>   DW_AT_decl_line   : 274
    <6ba>   DW_AT_decl_column : 6
    <6bb>   DW_AT_type        : <0x64>
    <6bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c2>: Abbrev Number: 22 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0xccf): curcol
    <6c7>   DW_AT_decl_file   : 18
    <6c8>   DW_AT_decl_line   : 275
    <6ca>   DW_AT_decl_column : 6
    <6cb>   DW_AT_type        : <0x64>
    <6cf>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d2>: Abbrev Number: 22 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0x98a): outf
    <6d7>   DW_AT_decl_file   : 18
    <6d8>   DW_AT_decl_line   : 276
    <6da>   DW_AT_decl_column : 8
    <6db>   DW_AT_type        : <0x40e>
    <6df>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e2>: Abbrev Number: 22 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0xeca): staged_output_data
    <6e7>   DW_AT_decl_file   : 18
    <6e8>   DW_AT_decl_line   : 277
    <6ea>   DW_AT_decl_column : 29
    <6eb>   DW_AT_type        : <0x995>
    <6ef>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f2>: Abbrev Number: 22 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xa5a): auxstr
    <6f7>   DW_AT_decl_file   : 18
    <6f8>   DW_AT_decl_line   : 279
    <6fa>   DW_AT_decl_column : 14
    <6fb>   DW_AT_type        : <0x1c9>
    <6ff>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><702>: Abbrev Number: 22 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x16b): _priv_data
    <707>   DW_AT_decl_file   : 18
    <708>   DW_AT_decl_line   : 280
    <70a>   DW_AT_decl_column : 8
    <70b>   DW_AT_type        : <0xcd>
    <70f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><712>: Abbrev Number: 22 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xc00): _free_priv_data
    <717>   DW_AT_decl_file   : 18
    <718>   DW_AT_decl_line   : 281
    <71a>   DW_AT_decl_column : 9
    <71b>   DW_AT_type        : <0x9a7>
    <71f>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><722>: Abbrev Number: 22 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x17c): s_ent
    <727>   DW_AT_decl_file   : 18
    <728>   DW_AT_decl_line   : 282
    <72a>   DW_AT_decl_column : 23
    <72b>   DW_AT_type        : <0x9ad>
    <72f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><732>: Abbrev Number: 22 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <737>   DW_AT_decl_file   : 18
    <738>   DW_AT_decl_line   : 285
    <73a>   DW_AT_decl_column : 23
    <73b>   DW_AT_type        : <0x9ad>
    <73f>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x376): inject_vec
    <747>   DW_AT_decl_file   : 18
    <748>   DW_AT_decl_line   : 286
    <74a>   DW_AT_decl_column : 22
    <74b>   DW_AT_type        : <0x9b8>
    <74f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x7c0): stime
    <757>   DW_AT_decl_file   : 18
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x133>
    <75f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><762>: Abbrev Number: 22 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x38a): ltime
    <767>   DW_AT_decl_file   : 18
    <768>   DW_AT_decl_line   : 288
    <76a>   DW_AT_decl_column : 18
    <76b>   DW_AT_type        : <0x133>
    <76f>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xfb1): atime
    <777>   DW_AT_decl_file   : 18
    <778>   DW_AT_decl_line   : 289
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x133>
    <77f>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><782>: Abbrev Number: 22 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4b2): etime
    <787>   DW_AT_decl_file   : 18
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x133>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><793>: Abbrev Number: 22 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd33): delay_expiration_time
    <798>   DW_AT_decl_file   : 18
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x133>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a4>: Abbrev Number: 22 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a9>   DW_AT_decl_file   : 18
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b5>: Abbrev Number: 22 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xf15): last_dirfd
    <7ba>   DW_AT_decl_file   : 18
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c6>: Abbrev Number: 22 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf3b): mmap_cache
    <7cb>   DW_AT_decl_file   : 18
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9d4>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d7>: Abbrev Number: 22 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb41): wait_data_idx
    <7dc>   DW_AT_decl_file   : 18
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x122>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e8>: Abbrev Number: 22 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa61): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 18
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0x9e0>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7f9>: Abbrev Number: 22 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xad1): wait_list
    <7fe>   DW_AT_decl_file   : 18
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x56e>
    <806>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80a>: Abbrev Number: 22 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6ad): vcpu_info_list
    <80f>   DW_AT_decl_file   : 18
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0x9ec>
    <817>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81b>: Abbrev Number: 22 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xc9a): unwind_ctx
    <820>   DW_AT_decl_file   : 18
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xcd>
    <828>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82c>: Abbrev Number: 22 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x49c): unwind_queue
    <831>   DW_AT_decl_file   : 18
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0x9f8>
    <839>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83d>: Abbrev Number: 22 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x160): comm
    <842>   DW_AT_decl_file   : 18
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0x9fe>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84e>: Abbrev Number: 0
 <1><84f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <850>   DW_AT_byte_size   : 4
    <851>   DW_AT_type        : <0x5f9>
 <1><855>: Abbrev Number: 4 (DW_TAG_typedef)
    <856>   DW_AT_name        : (indirect string, offset: 0x4fe): struct_sysent
    <85a>   DW_AT_decl_file   : 17
    <85b>   DW_AT_decl_line   : 19
    <85c>   DW_AT_decl_column : 3
    <85d>   DW_AT_type        : <0x5a0>
 <1><861>: Abbrev Number: 3 (DW_TAG_const_type)
    <862>   DW_AT_type        : <0x855>
 <1><866>: Abbrev Number: 11 (DW_TAG_variable)
    <867>   DW_AT_name        : (indirect string, offset: 0xd1f): current_personality
    <86b>   DW_AT_decl_file   : 18
    <86c>   DW_AT_decl_line   : 158
    <86d>   DW_AT_decl_column : 17
    <86e>   DW_AT_type        : <0x2b>
    <872>   DW_AT_external    : 1
    <873>   DW_AT_declaration : 1
 <1><874>: Abbrev Number: 11 (DW_TAG_variable)
    <875>   DW_AT_name        : (indirect string, offset: 0x7f1): current_wordsize
    <879>   DW_AT_decl_file   : 18
    <87a>   DW_AT_decl_line   : 171
    <87b>   DW_AT_decl_column : 17
    <87c>   DW_AT_type        : <0x2b>
    <880>   DW_AT_external    : 1
    <881>   DW_AT_declaration : 1
 <1><882>: Abbrev Number: 11 (DW_TAG_variable)
    <883>   DW_AT_name        : (indirect string, offset: 0xa38): current_klongsize
    <887>   DW_AT_decl_file   : 18
    <888>   DW_AT_decl_line   : 176
    <889>   DW_AT_decl_column : 17
    <88a>   DW_AT_type        : <0x2b>
    <88e>   DW_AT_external    : 1
    <88f>   DW_AT_declaration : 1
 <1><890>: Abbrev Number: 8 (DW_TAG_structure_type)
    <891>   DW_AT_name        : (indirect string, offset: 0xc71): ioctlent
    <895>   DW_AT_byte_size   : 8
    <896>   DW_AT_decl_file   : 18
    <897>   DW_AT_decl_line   : 217
    <898>   DW_AT_decl_column : 16
    <899>   DW_AT_sibling     : <0x8bc>
 <2><89d>: Abbrev Number: 9 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0xefb): symbol
    <8a2>   DW_AT_decl_file   : 18
    <8a3>   DW_AT_decl_line   : 218
    <8a4>   DW_AT_decl_column : 14
    <8a5>   DW_AT_type        : <0x1c9>
    <8a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ac>: Abbrev Number: 9 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0xce8): code
    <8b1>   DW_AT_decl_file   : 18
    <8b2>   DW_AT_decl_line   : 219
    <8b3>   DW_AT_decl_column : 15
    <8b4>   DW_AT_type        : <0x2b>
    <8b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8bb>: Abbrev Number: 0
 <1><8bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <8bd>   DW_AT_name        : (indirect string, offset: 0xc2a): struct_ioctlent
    <8c1>   DW_AT_decl_file   : 18
    <8c2>   DW_AT_decl_line   : 220
    <8c3>   DW_AT_decl_column : 3
    <8c4>   DW_AT_type        : <0x890>
 <1><8c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c9>   DW_AT_type        : <0x8bc>
 <1><8cd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x7e5): inject_data
    <8d2>   DW_AT_byte_size   : 10
    <8d3>   DW_AT_decl_file   : 18
    <8d4>   DW_AT_decl_line   : 241
    <8d5>   DW_AT_decl_column : 8
    <8d6>   DW_AT_sibling     : <0x935>
 <2><8da>: Abbrev Number: 9 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x4b8): flags
    <8df>   DW_AT_decl_file   : 18
    <8e0>   DW_AT_decl_line   : 242
    <8e1>   DW_AT_decl_column : 10
    <8e2>   DW_AT_type        : <0xf2>
    <8e6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e9>: Abbrev Number: 9 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x915): signo
    <8ee>   DW_AT_decl_file   : 18
    <8ef>   DW_AT_decl_line   : 243
    <8f0>   DW_AT_decl_column : 10
    <8f1>   DW_AT_type        : <0xf2>
    <8f5>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8f8>: Abbrev Number: 9 (DW_TAG_member)
    <8f9>   DW_AT_name        : (indirect string, offset: 0xf2): rval_idx
    <8fd>   DW_AT_decl_file   : 18
    <8fe>   DW_AT_decl_line   : 244
    <8ff>   DW_AT_decl_column : 11
    <900>   DW_AT_type        : <0xfe>
    <904>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><907>: Abbrev Number: 9 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0xcc5): delay_idx
    <90c>   DW_AT_decl_file   : 18
    <90d>   DW_AT_decl_line   : 245
    <90e>   DW_AT_decl_column : 11
    <90f>   DW_AT_type        : <0xfe>
    <913>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><916>: Abbrev Number: 9 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0x544): poke_idx
    <91b>   DW_AT_decl_file   : 18
    <91c>   DW_AT_decl_line   : 246
    <91d>   DW_AT_decl_column : 11
    <91e>   DW_AT_type        : <0xfe>
    <922>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><925>: Abbrev Number: 9 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x182): scno
    <92a>   DW_AT_decl_file   : 18
    <92b>   DW_AT_decl_line   : 247
    <92c>   DW_AT_decl_column : 11
    <92d>   DW_AT_type        : <0xfe>
    <931>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><934>: Abbrev Number: 0
 <1><935>: Abbrev Number: 8 (DW_TAG_structure_type)
    <936>   DW_AT_name        : (indirect string, offset: 0xd3): inject_opts
    <93a>   DW_AT_byte_size   : 16
    <93b>   DW_AT_decl_file   : 18
    <93c>   DW_AT_decl_line   : 250
    <93d>   DW_AT_decl_column : 8
    <93e>   DW_AT_sibling     : <0x97f>
 <2><942>: Abbrev Number: 9 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0xa0d): first
    <947>   DW_AT_decl_file   : 18
    <948>   DW_AT_decl_line   : 251
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0xfe>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><951>: Abbrev Number: 9 (DW_TAG_member)
    <952>   DW_AT_name        : (indirect string, offset: 0x10be): last
    <956>   DW_AT_decl_file   : 18
    <957>   DW_AT_decl_line   : 252
    <958>   DW_AT_decl_column : 11
    <959>   DW_AT_type        : <0xfe>
    <95d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><960>: Abbrev Number: 9 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x390): step
    <965>   DW_AT_decl_file   : 18
    <966>   DW_AT_decl_line   : 253
    <967>   DW_AT_decl_column : 11
    <968>   DW_AT_type        : <0xfe>
    <96c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><96f>: Abbrev Number: 9 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x1089): data
    <974>   DW_AT_decl_file   : 18
    <975>   DW_AT_decl_line   : 254
    <976>   DW_AT_decl_column : 21
    <977>   DW_AT_type        : <0x8cd>
    <97b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><97e>: Abbrev Number: 0
 <1><97f>: Abbrev Number: 15 (DW_TAG_array_type)
    <980>   DW_AT_type        : <0x55d>
    <984>   DW_AT_sibling     : <0x98f>
 <2><988>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <989>   DW_AT_type        : <0x2b>
    <98d>   DW_AT_upper_bound : 5
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <990>   DW_AT_name        : (indirect string, offset: 0xeca): staged_output_data
    <994>   DW_AT_declaration : 1
 <1><995>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <996>   DW_AT_byte_size   : 4
    <997>   DW_AT_type        : <0x98f>
 <1><99b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <99c>   DW_AT_prototyped  : 1
    <99d>   DW_AT_sibling     : <0x9a7>
 <2><9a1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9a2>   DW_AT_type        : <0xcd>
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a8>   DW_AT_byte_size   : 4
    <9a9>   DW_AT_type        : <0x99b>
 <1><9ad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ae>   DW_AT_byte_size   : 4
    <9af>   DW_AT_type        : <0x861>
 <1><9b3>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b4>   DW_AT_type        : <0x9ad>
 <1><9b8>: Abbrev Number: 15 (DW_TAG_array_type)
    <9b9>   DW_AT_type        : <0x9c8>
    <9bd>   DW_AT_sibling     : <0x9c8>
 <2><9c1>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9c2>   DW_AT_type        : <0x2b>
    <9c6>   DW_AT_upper_bound : 2
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4
    <9ca>   DW_AT_type        : <0x935>
 <1><9ce>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x9f): mmap_cache_t
    <9d3>   DW_AT_declaration : 1
 <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9ce>
 <1><9da>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0x3ab): tcb_wait_data
    <9df>   DW_AT_declaration : 1
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9da>
 <1><9e6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x156): vcpu_info
    <9eb>   DW_AT_declaration : 1
 <1><9ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9e6>
 <1><9f2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xeae): unwind_queue_t
    <9f7>   DW_AT_declaration : 1
 <1><9f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
    <9fa>   DW_AT_type        : <0x9f2>
 <1><9fe>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ff>   DW_AT_type        : <0xe6>
    <a03>   DW_AT_sibling     : <0xa0e>
 <2><a07>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a08>   DW_AT_type        : <0x2b>
    <a0c>   DW_AT_upper_bound : 15
 <2><a0d>: Abbrev Number: 0
 <1><a0e>: Abbrev Number: 10 (DW_TAG_variable)
    <a0f>   DW_AT_name        : (indirect string, offset: 0xb7e): stub_sysent
    <a13>   DW_AT_decl_file   : 18
    <a14>   DW_AT_decl_line   : 400
    <a16>   DW_AT_decl_column : 28
    <a17>   DW_AT_type        : <0x861>
    <a1b>   DW_AT_external    : 1
    <a1c>   DW_AT_declaration : 1
 <1><a1d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x106c): xlat_type
    <a22>   DW_AT_encoding    : 7	(unsigned)
    <a23>   DW_AT_byte_size   : 4
    <a24>   DW_AT_type        : <0x2b>
    <a28>   DW_AT_decl_file   : 19
    <a29>   DW_AT_decl_line   : 13
    <a2a>   DW_AT_decl_column : 6
    <a2b>   DW_AT_sibling     : <0xa42>
 <2><a2f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0x2be): XT_NORMAL
    <a34>   DW_AT_const_value : 0
 <2><a35>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xc41): XT_SORTED
    <a3a>   DW_AT_const_value : 1
 <2><a3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xdab): XT_INDEXED
    <a40>   DW_AT_const_value : 2
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a43>   DW_AT_name        : (indirect string, offset: 0xbaa): xlat_style
    <a47>   DW_AT_encoding    : 7	(unsigned)
    <a48>   DW_AT_byte_size   : 4
    <a49>   DW_AT_type        : <0x2b>
    <a4d>   DW_AT_decl_file   : 19
    <a4e>   DW_AT_decl_line   : 19
    <a4f>   DW_AT_decl_column : 6
    <a50>   DW_AT_sibling     : <0xa7f>
 <2><a54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0xdf): XLAT_STYLE_DEFAULT
    <a59>   DW_AT_const_value : 0
 <2><a5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xbdd): XLAT_STYLE_RAW
    <a5f>   DW_AT_const_value : 1
 <2><a60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x1037): XLAT_STYLE_ABBREV
    <a65>   DW_AT_const_value : 2
 <2><a66>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0x2e2): XLAT_STYLE_VERBOSE
    <a6b>   DW_AT_const_value : 3
 <2><a6c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a71>   DW_AT_const_value : 0
 <2><a72>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a77>   DW_AT_const_value : 4
 <2><a78>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x10ad): XLAT_STYLE_FMT_D
    <a7d>   DW_AT_const_value : 8
 <2><a7e>: Abbrev Number: 0
 <1><a7f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a80>   DW_AT_name        : (indirect string, offset: 0x313): xlat_data
    <a84>   DW_AT_byte_size   : 12
    <a85>   DW_AT_decl_file   : 19
    <a86>   DW_AT_decl_line   : 51
    <a87>   DW_AT_decl_column : 8
    <a88>   DW_AT_sibling     : <0xaab>
 <2><a8c>: Abbrev Number: 18 (DW_TAG_member)
    <a8d>   DW_AT_name        : val
    <a91>   DW_AT_decl_file   : 19
    <a92>   DW_AT_decl_line   : 52
    <a93>   DW_AT_decl_column : 11
    <a94>   DW_AT_type        : <0x116>
    <a98>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a9b>: Abbrev Number: 18 (DW_TAG_member)
    <a9c>   DW_AT_name        : str
    <aa0>   DW_AT_decl_file   : 19
    <aa1>   DW_AT_decl_line   : 53
    <aa2>   DW_AT_decl_column : 14
    <aa3>   DW_AT_type        : <0x1c9>
    <aa7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aaa>: Abbrev Number: 0
 <1><aab>: Abbrev Number: 3 (DW_TAG_const_type)
    <aac>   DW_AT_type        : <0xa7f>
 <1><ab0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ab5>   DW_AT_byte_size   : 24
    <ab6>   DW_AT_decl_file   : 19
    <ab7>   DW_AT_decl_line   : 56
    <ab8>   DW_AT_decl_column : 8
    <ab9>   DW_AT_sibling     : <0xb09>
 <2><abd>: Abbrev Number: 9 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0x1089): data
    <ac2>   DW_AT_decl_file   : 19
    <ac3>   DW_AT_decl_line   : 57
    <ac4>   DW_AT_decl_column : 26
    <ac5>   DW_AT_type        : <0xb0e>
    <ac9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><acc>: Abbrev Number: 9 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0x843): flags_strsz
    <ad1>   DW_AT_decl_file   : 19
    <ad2>   DW_AT_decl_line   : 58
    <ad3>   DW_AT_decl_column : 9
    <ad4>   DW_AT_type        : <0x122>
    <ad8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><adb>: Abbrev Number: 9 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xb4f): size
    <ae0>   DW_AT_decl_file   : 19
    <ae1>   DW_AT_decl_line   : 59
    <ae2>   DW_AT_decl_column : 11
    <ae3>   DW_AT_type        : <0x10a>
    <ae7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aea>: Abbrev Number: 9 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x187): type
    <aef>   DW_AT_decl_file   : 19
    <af0>   DW_AT_decl_line   : 60
    <af1>   DW_AT_decl_column : 17
    <af2>   DW_AT_type        : <0xa1d>
    <af6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><af9>: Abbrev Number: 9 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x701): flags_mask
    <afe>   DW_AT_decl_file   : 19
    <aff>   DW_AT_decl_line   : 61
    <b00>   DW_AT_decl_column : 11
    <b01>   DW_AT_type        : <0x116>
    <b05>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0a>   DW_AT_type        : <0xab0>
 <1><b0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b0f>   DW_AT_byte_size   : 4
    <b10>   DW_AT_type        : <0xaab>
 <1><b14>: Abbrev Number: 15 (DW_TAG_array_type)
    <b15>   DW_AT_type        : <0xb09>
    <b19>   DW_AT_sibling     : <0xb1f>
 <2><b1d>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b1e>: Abbrev Number: 0
 <1><b1f>: Abbrev Number: 3 (DW_TAG_const_type)
    <b20>   DW_AT_type        : <0xb14>
 <1><b24>: Abbrev Number: 10 (DW_TAG_variable)
    <b25>   DW_AT_name        : (indirect string, offset: 0xe14): addrfams
    <b29>   DW_AT_decl_file   : 18
    <b2a>   DW_AT_decl_line   : 406
    <b2c>   DW_AT_decl_column : 26
    <b2d>   DW_AT_type        : <0xb1f>
    <b31>   DW_AT_external    : 1
    <b32>   DW_AT_declaration : 1
 <1><b33>: Abbrev Number: 10 (DW_TAG_variable)
    <b34>   DW_AT_name        : (indirect string, offset: 0xcf8): arp_hardware_types
    <b38>   DW_AT_decl_file   : 18
    <b39>   DW_AT_decl_line   : 407
    <b3b>   DW_AT_decl_column : 26
    <b3c>   DW_AT_type        : <0xb1f>
    <b40>   DW_AT_external    : 1
    <b41>   DW_AT_declaration : 1
 <1><b42>: Abbrev Number: 10 (DW_TAG_variable)
    <b43>   DW_AT_name        : (indirect string, offset: 0xfb7): at_flags
    <b47>   DW_AT_decl_file   : 18
    <b48>   DW_AT_decl_line   : 408
    <b4a>   DW_AT_decl_column : 26
    <b4b>   DW_AT_type        : <0xb1f>
    <b4f>   DW_AT_external    : 1
    <b50>   DW_AT_declaration : 1
 <1><b51>: Abbrev Number: 10 (DW_TAG_variable)
    <b52>   DW_AT_name        : (indirect string, offset: 0x47a): clocknames
    <b56>   DW_AT_decl_file   : 18
    <b57>   DW_AT_decl_line   : 409
    <b59>   DW_AT_decl_column : 26
    <b5a>   DW_AT_type        : <0xb1f>
    <b5e>   DW_AT_external    : 1
    <b5f>   DW_AT_declaration : 1
 <1><b60>: Abbrev Number: 10 (DW_TAG_variable)
    <b61>   DW_AT_name        : (indirect string, offset: 0xf77): dirent_types
    <b65>   DW_AT_decl_file   : 18
    <b66>   DW_AT_decl_line   : 410
    <b68>   DW_AT_decl_column : 26
    <b69>   DW_AT_type        : <0xb1f>
    <b6d>   DW_AT_external    : 1
    <b6e>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 10 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0x894): ethernet_protocols
    <b74>   DW_AT_decl_file   : 18
    <b75>   DW_AT_decl_line   : 411
    <b77>   DW_AT_decl_column : 26
    <b78>   DW_AT_type        : <0xb1f>
    <b7c>   DW_AT_external    : 1
    <b7d>   DW_AT_declaration : 1
 <1><b7e>: Abbrev Number: 10 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x597): inet_protocols
    <b83>   DW_AT_decl_file   : 18
    <b84>   DW_AT_decl_line   : 412
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb1f>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 10 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x2ab): evdev_abs
    <b92>   DW_AT_decl_file   : 18
    <b93>   DW_AT_decl_line   : 413
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb1f>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 10 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x6f6): audit_arch
    <ba1>   DW_AT_decl_file   : 18
    <ba2>   DW_AT_decl_line   : 414
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb1f>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 10 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x8b): evdev_ev
    <bb0>   DW_AT_decl_file   : 18
    <bb1>   DW_AT_decl_line   : 415
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb1f>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 10 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x45b): iffflags
    <bbf>   DW_AT_decl_file   : 18
    <bc0>   DW_AT_decl_line   : 416
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb1f>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 10 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0xbec): ip_type_of_services
    <bce>   DW_AT_decl_file   : 18
    <bcf>   DW_AT_decl_line   : 417
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb1f>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 10 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x689): ipc_private
    <bdd>   DW_AT_decl_file   : 18
    <bde>   DW_AT_decl_line   : 418
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb1f>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 10 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x309): msg_flags
    <bec>   DW_AT_decl_file   : 18
    <bed>   DW_AT_decl_line   : 419
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb1f>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 10 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xfb): netlink_protocols
    <bfb>   DW_AT_decl_file   : 18
    <bfc>   DW_AT_decl_line   : 420
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb1f>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 10 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0xedd): nl_bridge_vlan_flags
    <c0a>   DW_AT_decl_file   : 18
    <c0b>   DW_AT_decl_line   : 421
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb1f>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 10 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0xd94): nl_netfilter_msg_types
    <c19>   DW_AT_decl_file   : 18
    <c1a>   DW_AT_decl_line   : 422
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb1f>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 10 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0x208): nl_route_types
    <c28>   DW_AT_decl_file   : 18
    <c29>   DW_AT_decl_line   : 423
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb1f>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 10 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0xe4b): open_access_modes
    <c37>   DW_AT_decl_file   : 18
    <c38>   DW_AT_decl_line   : 424
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb1f>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 10 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c46>   DW_AT_decl_file   : 18
    <c47>   DW_AT_decl_line   : 425
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb1f>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 10 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0xc1d): perf_type_id
    <c55>   DW_AT_decl_file   : 18
    <c56>   DW_AT_decl_line   : 426
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb1f>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 10 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xe1d): pollflags
    <c64>   DW_AT_decl_file   : 18
    <c65>   DW_AT_decl_line   : 427
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb1f>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 10 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x538): ptrace_cmds
    <c73>   DW_AT_decl_file   : 18
    <c74>   DW_AT_decl_line   : 428
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb1f>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 10 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x7d6): resource_flags
    <c82>   DW_AT_decl_file   : 18
    <c83>   DW_AT_decl_line   : 429
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb1f>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 10 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x281): route_nexthop_flags
    <c91>   DW_AT_decl_file   : 18
    <c92>   DW_AT_decl_line   : 430
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb1f>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 10 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xe68): routing_protocols
    <ca0>   DW_AT_decl_file   : 18
    <ca1>   DW_AT_decl_line   : 431
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb1f>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 10 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0x44c): routing_scopes
    <caf>   DW_AT_decl_file   : 18
    <cb0>   DW_AT_decl_line   : 432
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb1f>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 10 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0xd82): routing_table_ids
    <cbe>   DW_AT_decl_file   : 18
    <cbf>   DW_AT_decl_line   : 433
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb1f>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 10 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x666): routing_types
    <ccd>   DW_AT_decl_file   : 18
    <cce>   DW_AT_decl_line   : 434
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb1f>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 10 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x1ab): rwf_flags
    <cdc>   DW_AT_decl_file   : 18
    <cdd>   DW_AT_decl_line   : 435
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb1f>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 10 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x80e): seccomp_filter_flags
    <ceb>   DW_AT_decl_file   : 18
    <cec>   DW_AT_decl_line   : 436
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb1f>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 10 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x2c8): seccomp_ret_action
    <cfa>   DW_AT_decl_file   : 18
    <cfb>   DW_AT_decl_line   : 437
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb1f>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 10 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x415): setns_types
    <d09>   DW_AT_decl_file   : 18
    <d0a>   DW_AT_decl_line   : 438
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb1f>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 10 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0xe09): sg_io_info
    <d18>   DW_AT_decl_file   : 18
    <d19>   DW_AT_decl_line   : 439
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb1f>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 10 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0xb92): socketlayers
    <d27>   DW_AT_decl_file   : 18
    <d28>   DW_AT_decl_line   : 440
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb1f>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 10 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0xd6c): socktypes
    <d36>   DW_AT_decl_file   : 18
    <d37>   DW_AT_decl_line   : 441
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb1f>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 10 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0xa4a): tcp_state_flags
    <d45>   DW_AT_decl_file   : 18
    <d46>   DW_AT_decl_line   : 442
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb1f>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 10 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0x73b): tcp_states
    <d54>   DW_AT_decl_file   : 18
    <d55>   DW_AT_decl_line   : 443
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb1f>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 10 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x101a): whence_codes
    <d63>   DW_AT_decl_file   : 18
    <d64>   DW_AT_decl_line   : 444
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb1f>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d6e>   DW_AT_encoding    : 7	(unsigned)
    <d6f>   DW_AT_byte_size   : 4
    <d70>   DW_AT_type        : <0x2b>
    <d74>   DW_AT_decl_file   : 18
    <d75>   DW_AT_decl_line   : 505
    <d77>   DW_AT_decl_column : 14
    <d78>   DW_AT_sibling     : <0xd8f>
 <2><d7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x97f): CFLAG_NONE
    <d81>   DW_AT_const_value : 0
 <2><d82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d83>   DW_AT_name        : (indirect string, offset: 0x8a7): CFLAG_ONLY_STATS
    <d87>   DW_AT_const_value : 1
 <2><d88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d89>   DW_AT_name        : (indirect string, offset: 0xb9f): CFLAG_BOTH
    <d8d>   DW_AT_const_value : 2
 <2><d8e>: Abbrev Number: 0
 <1><d8f>: Abbrev Number: 28 (DW_TAG_typedef)
    <d90>   DW_AT_name        : (indirect string, offset: 0x10c3): cflag_t
    <d94>   DW_AT_decl_file   : 18
    <d95>   DW_AT_decl_line   : 509
    <d97>   DW_AT_decl_column : 3
    <d98>   DW_AT_type        : <0xd6d>
 <1><d9c>: Abbrev Number: 10 (DW_TAG_variable)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xcbf): cflag
    <da1>   DW_AT_decl_file   : 18
    <da2>   DW_AT_decl_line   : 510
    <da4>   DW_AT_decl_column : 16
    <da5>   DW_AT_type        : <0xd8f>
    <da9>   DW_AT_external    : 1
    <daa>   DW_AT_declaration : 1
 <1><dab>: Abbrev Number: 10 (DW_TAG_variable)
    <dac>   DW_AT_name        : (indirect string, offset: 0x176): Tflag
    <db0>   DW_AT_decl_file   : 18
    <db1>   DW_AT_decl_line   : 511
    <db3>   DW_AT_decl_column : 13
    <db4>   DW_AT_type        : <0x515>
    <db8>   DW_AT_external    : 1
    <db9>   DW_AT_declaration : 1
 <1><dba>: Abbrev Number: 10 (DW_TAG_variable)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x791): Tflag_scale
    <dbf>   DW_AT_decl_file   : 18
    <dc0>   DW_AT_decl_line   : 512
    <dc2>   DW_AT_decl_column : 12
    <dc3>   DW_AT_type        : <0x64>
    <dc7>   DW_AT_external    : 1
    <dc8>   DW_AT_declaration : 1
 <1><dc9>: Abbrev Number: 10 (DW_TAG_variable)
    <dca>   DW_AT_name        : (indirect string, offset: 0x823): Tflag_width
    <dce>   DW_AT_decl_file   : 18
    <dcf>   DW_AT_decl_line   : 513
    <dd1>   DW_AT_decl_column : 12
    <dd2>   DW_AT_type        : <0x64>
    <dd6>   DW_AT_external    : 1
    <dd7>   DW_AT_declaration : 1
 <1><dd8>: Abbrev Number: 10 (DW_TAG_variable)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xdfb): iflag
    <ddd>   DW_AT_decl_file   : 18
    <dde>   DW_AT_decl_line   : 514
    <de0>   DW_AT_decl_column : 13
    <de1>   DW_AT_type        : <0x515>
    <de5>   DW_AT_external    : 1
    <de6>   DW_AT_declaration : 1
 <1><de7>: Abbrev Number: 10 (DW_TAG_variable)
    <de8>   DW_AT_name        : (indirect string, offset: 0x578): count_wallclock
    <dec>   DW_AT_decl_file   : 18
    <ded>   DW_AT_decl_line   : 515
    <def>   DW_AT_decl_column : 13
    <df0>   DW_AT_type        : <0x515>
    <df4>   DW_AT_external    : 1
    <df5>   DW_AT_declaration : 1
 <1><df6>: Abbrev Number: 29 (DW_TAG_structure_type)
    <df7>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <dfb>   DW_AT_byte_size   : 4
    <dfc>   DW_AT_decl_file   : 18
    <dfd>   DW_AT_decl_line   : 517
    <dff>   DW_AT_decl_column : 8
    <e00>   DW_AT_sibling     : <0xe15>
 <2><e04>: Abbrev Number: 22 (DW_TAG_member)
    <e05>   DW_AT_name        : (indirect string, offset: 0xb9): path
    <e09>   DW_AT_decl_file   : 18
    <e0a>   DW_AT_decl_line   : 518
    <e0c>   DW_AT_decl_column : 14
    <e0d>   DW_AT_type        : <0x1c9>
    <e11>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e14>: Abbrev Number: 0
 <1><e15>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e16>   DW_AT_name        : (indirect string, offset: 0x746): path_set
    <e1a>   DW_AT_byte_size   : 12
    <e1b>   DW_AT_decl_file   : 18
    <e1c>   DW_AT_decl_line   : 522
    <e1e>   DW_AT_decl_column : 15
    <e1f>   DW_AT_sibling     : <0xe54>
 <2><e23>: Abbrev Number: 22 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0x6c4): paths_selected
    <e28>   DW_AT_decl_file   : 18
    <e29>   DW_AT_decl_line   : 523
    <e2b>   DW_AT_decl_column : 24
    <e2c>   DW_AT_type        : <0xe54>
    <e30>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e33>: Abbrev Number: 22 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0x100d): num_selected
    <e38>   DW_AT_decl_file   : 18
    <e39>   DW_AT_decl_line   : 524
    <e3b>   DW_AT_decl_column : 9
    <e3c>   DW_AT_type        : <0x122>
    <e40>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e43>: Abbrev Number: 22 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0xb4f): size
    <e48>   DW_AT_decl_file   : 18
    <e49>   DW_AT_decl_line   : 525
    <e4b>   DW_AT_decl_column : 9
    <e4c>   DW_AT_type        : <0x122>
    <e50>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e55>   DW_AT_byte_size   : 4
    <e56>   DW_AT_type        : <0xdf6>
 <1><e5a>: Abbrev Number: 10 (DW_TAG_variable)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x105c): global_path_set
    <e5f>   DW_AT_decl_file   : 18
    <e60>   DW_AT_decl_line   : 526
    <e62>   DW_AT_decl_column : 3
    <e63>   DW_AT_type        : <0xe15>
    <e67>   DW_AT_external    : 1
    <e68>   DW_AT_declaration : 1
 <1><e69>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xf64): xflag_opts
    <e6e>   DW_AT_encoding    : 7	(unsigned)
    <e6f>   DW_AT_byte_size   : 4
    <e70>   DW_AT_type        : <0x2b>
    <e74>   DW_AT_decl_file   : 18
    <e75>   DW_AT_decl_line   : 528
    <e77>   DW_AT_decl_column : 6
    <e78>   DW_AT_sibling     : <0xe9b>
 <2><e7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0xa01): HEXSTR_NONE
    <e81>   DW_AT_const_value : 0
 <2><e82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e83>   DW_AT_name        : (indirect string, offset: 0xf99): HEXSTR_NON_ASCII
    <e87>   DW_AT_const_value : 1
 <2><e88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e89>   DW_AT_name        : (indirect string, offset: 0x900): HEXSTR_ALL
    <e8d>   DW_AT_const_value : 2
 <2><e8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x64f): HEXSTR_NON_ASCII_CHARS
    <e93>   DW_AT_const_value : 3
 <2><e94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x1027): NUM_HEXSTR_OPTS
    <e99>   DW_AT_const_value : 4
 <2><e9a>: Abbrev Number: 0
 <1><e9b>: Abbrev Number: 10 (DW_TAG_variable)
    <e9c>   DW_AT_name        : (indirect string, offset: 0xdd5): xflag
    <ea0>   DW_AT_decl_file   : 18
    <ea1>   DW_AT_decl_line   : 541
    <ea3>   DW_AT_decl_column : 17
    <ea4>   DW_AT_type        : <0x2b>
    <ea8>   DW_AT_external    : 1
    <ea9>   DW_AT_declaration : 1
 <1><eaa>: Abbrev Number: 10 (DW_TAG_variable)
    <eab>   DW_AT_name        : (indirect string, offset: 0xc7a): followfork
    <eaf>   DW_AT_decl_file   : 18
    <eb0>   DW_AT_decl_line   : 542
    <eb2>   DW_AT_decl_column : 13
    <eb3>   DW_AT_type        : <0x515>
    <eb7>   DW_AT_external    : 1
    <eb8>   DW_AT_declaration : 1
 <1><eb9>: Abbrev Number: 10 (DW_TAG_variable)
    <eba>   DW_AT_name        : (indirect string, offset: 0x31d): output_separately
    <ebe>   DW_AT_decl_file   : 18
    <ebf>   DW_AT_decl_line   : 543
    <ec1>   DW_AT_decl_column : 13
    <ec2>   DW_AT_type        : <0x515>
    <ec6>   DW_AT_external    : 1
    <ec7>   DW_AT_declaration : 1
 <1><ec8>: Abbrev Number: 10 (DW_TAG_variable)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x217): stack_trace_enabled
    <ecd>   DW_AT_decl_file   : 18
    <ece>   DW_AT_decl_line   : 546
    <ed0>   DW_AT_decl_column : 13
    <ed1>   DW_AT_type        : <0x515>
    <ed5>   DW_AT_external    : 1
    <ed6>   DW_AT_declaration : 1
 <1><ed7>: Abbrev Number: 10 (DW_TAG_variable)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x63d): ptrace_setoptions
    <edc>   DW_AT_decl_file   : 18
    <edd>   DW_AT_decl_line   : 550
    <edf>   DW_AT_decl_column : 17
    <ee0>   DW_AT_type        : <0x2b>
    <ee4>   DW_AT_external    : 1
    <ee5>   DW_AT_declaration : 1
 <1><ee6>: Abbrev Number: 10 (DW_TAG_variable)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x9f6): max_strlen
    <eeb>   DW_AT_decl_file   : 18
    <eec>   DW_AT_decl_line   : 551
    <eee>   DW_AT_decl_column : 17
    <eef>   DW_AT_type        : <0x2b>
    <ef3>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef5>: Abbrev Number: 10 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xa24): os_release
    <efa>   DW_AT_decl_file   : 18
    <efb>   DW_AT_decl_line   : 552
    <efd>   DW_AT_decl_column : 17
    <efe>   DW_AT_type        : <0x2b>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 10 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0x6d3): xlat_verbosity
    <f09>   DW_AT_decl_file   : 18
    <f0a>   DW_AT_decl_line   : 914
    <f0c>   DW_AT_decl_column : 24
    <f0d>   DW_AT_type        : <0xa42>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f14>   DW_AT_name        : (indirect string, offset: 0x55b): xlat_style_private_flag_bits
    <f18>   DW_AT_encoding    : 7	(unsigned)
    <f19>   DW_AT_byte_size   : 4
    <f1a>   DW_AT_type        : <0x2b>
    <f1e>   DW_AT_decl_file   : 18
    <f1f>   DW_AT_decl_line   : 934
    <f21>   DW_AT_decl_column : 6
    <f22>   DW_AT_sibling     : <0xf3f>
 <2><f26>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f27>   DW_AT_name        : (indirect string, offset: 0x295): PAF_PRINT_INDICES_BIT
    <f2b>   DW_AT_const_value : 5
 <2><f2c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2d>   DW_AT_name        : (indirect string, offset: 0xaf3): PAF_ARRAY_TRUNCATED_BIT
    <f31>   DW_AT_const_value : 6
 <2><f32>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x3d5): PXF_DEFAULT_STR_BIT
    <f37>   DW_AT_const_value : 7
 <2><f38>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0xc54): SPFF_AUXSTR_MODE_BIT
    <f3d>   DW_AT_const_value : 8
 <2><f3e>: Abbrev Number: 0
 <1><f3f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f40>   DW_AT_name        : (indirect string, offset: 0xd0b): find_xlat_flag_bits
    <f44>   DW_AT_encoding    : 7	(unsigned)
    <f45>   DW_AT_byte_size   : 4
    <f46>   DW_AT_type        : <0x2b>
    <f4a>   DW_AT_decl_file   : 18
    <f4b>   DW_AT_decl_line   : 1438
    <f4d>   DW_AT_decl_column : 6
    <f4e>   DW_AT_sibling     : <0xf59>
 <2><f52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f53>   DW_AT_name        : (indirect string, offset: 0x93d): FXL_CASE_SENSITIVE_BIT
    <f57>   DW_AT_const_value : 0
 <2><f58>: Abbrev Number: 0
 <1><f59>: Abbrev Number: 10 (DW_TAG_variable)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x9d2): printing_tcp
    <f5e>   DW_AT_decl_file   : 18
    <f5f>   DW_AT_decl_line   : 1684
    <f61>   DW_AT_decl_column : 20
    <f62>   DW_AT_type        : <0x609>
    <f66>   DW_AT_external    : 1
    <f67>   DW_AT_declaration : 1
 <1><f68>: Abbrev Number: 10 (DW_TAG_variable)
    <f69>   DW_AT_name        : (indirect string, offset: 0x523): errnoent
    <f6d>   DW_AT_decl_file   : 18
    <f6e>   DW_AT_decl_line   : 1882
    <f70>   DW_AT_decl_column : 26
    <f71>   DW_AT_type        : <0x449>
    <f75>   DW_AT_external    : 1
    <f76>   DW_AT_declaration : 1
 <1><f77>: Abbrev Number: 10 (DW_TAG_variable)
    <f78>   DW_AT_name        : (indirect string, offset: 0x82f): signalent
    <f7c>   DW_AT_decl_file   : 18
    <f7d>   DW_AT_decl_line   : 1883
    <f7f>   DW_AT_decl_column : 26
    <f80>   DW_AT_type        : <0x449>
    <f84>   DW_AT_external    : 1
    <f85>   DW_AT_declaration : 1
 <1><f86>: Abbrev Number: 10 (DW_TAG_variable)
    <f87>   DW_AT_name        : (indirect string, offset: 0xe43): nerrnos
    <f8b>   DW_AT_decl_file   : 18
    <f8c>   DW_AT_decl_line   : 1884
    <f8e>   DW_AT_decl_column : 27
    <f8f>   DW_AT_type        : <0x32>
    <f93>   DW_AT_external    : 1
    <f94>   DW_AT_declaration : 1
 <1><f95>: Abbrev Number: 10 (DW_TAG_variable)
    <f96>   DW_AT_name        : (indirect string, offset: 0xff6): nsignals
    <f9a>   DW_AT_decl_file   : 18
    <f9b>   DW_AT_decl_line   : 1885
    <f9d>   DW_AT_decl_column : 27
    <f9e>   DW_AT_type        : <0x32>
    <fa2>   DW_AT_external    : 1
    <fa3>   DW_AT_declaration : 1
 <1><fa4>: Abbrev Number: 15 (DW_TAG_array_type)
    <fa5>   DW_AT_type        : <0x861>
    <fa9>   DW_AT_sibling     : <0xfaf>
 <2><fad>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fae>: Abbrev Number: 0
 <1><faf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb0>   DW_AT_type        : <0xfa4>
 <1><fb4>: Abbrev Number: 10 (DW_TAG_variable)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xcd6): sysent0
    <fb9>   DW_AT_decl_file   : 18
    <fba>   DW_AT_decl_line   : 1887
    <fbc>   DW_AT_decl_column : 28
    <fbd>   DW_AT_type        : <0xfaf>
    <fc1>   DW_AT_external    : 1
    <fc2>   DW_AT_declaration : 1
 <1><fc3>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc4>   DW_AT_type        : <0x8c8>
    <fc8>   DW_AT_sibling     : <0xfce>
 <2><fcc>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fcd>: Abbrev Number: 0
 <1><fce>: Abbrev Number: 3 (DW_TAG_const_type)
    <fcf>   DW_AT_type        : <0xfc3>
 <1><fd3>: Abbrev Number: 10 (DW_TAG_variable)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x1052): ioctlent0
    <fd8>   DW_AT_decl_file   : 18
    <fd9>   DW_AT_decl_line   : 1888
    <fdb>   DW_AT_decl_column : 30
    <fdc>   DW_AT_type        : <0xfce>
    <fe0>   DW_AT_external    : 1
    <fe1>   DW_AT_declaration : 1
 <1><fe2>: Abbrev Number: 10 (DW_TAG_variable)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x43a): personality_names
    <fe7>   DW_AT_decl_file   : 18
    <fe8>   DW_AT_decl_line   : 1890
    <fea>   DW_AT_decl_column : 26
    <feb>   DW_AT_type        : <0x449>
    <fef>   DW_AT_external    : 1
    <ff0>   DW_AT_declaration : 1
 <1><ff1>: Abbrev Number: 10 (DW_TAG_variable)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x84f): sysent
    <ff6>   DW_AT_decl_file   : 18
    <ff7>   DW_AT_decl_line   : 1893
    <ff9>   DW_AT_decl_column : 29
    <ffa>   DW_AT_type        : <0x9ad>
    <ffe>   DW_AT_external    : 1
    <fff>   DW_AT_declaration : 1
 <1><1000>: Abbrev Number: 10 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0xc71): ioctlent
    <1005>   DW_AT_decl_file   : 18
    <1006>   DW_AT_decl_line   : 1894
    <1008>   DW_AT_decl_column : 31
    <1009>   DW_AT_type        : <0x100f>
    <100d>   DW_AT_external    : 1
    <100e>   DW_AT_declaration : 1
 <1><100f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1010>   DW_AT_byte_size   : 4
    <1011>   DW_AT_type        : <0x8c8>
 <1><1015>: Abbrev Number: 10 (DW_TAG_variable)
    <1016>   DW_AT_name        : (indirect string, offset: 0x839): nsyscalls
    <101a>   DW_AT_decl_file   : 18
    <101b>   DW_AT_decl_line   : 1900
    <101d>   DW_AT_decl_column : 17
    <101e>   DW_AT_type        : <0x2b>
    <1022>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1024>: Abbrev Number: 10 (DW_TAG_variable)
    <1025>   DW_AT_name        : (indirect string, offset: 0xe5d): nioctlents
    <1029>   DW_AT_decl_file   : 18
    <102a>   DW_AT_decl_line   : 1901
    <102c>   DW_AT_decl_column : 17
    <102d>   DW_AT_type        : <0x2b>
    <1031>   DW_AT_external    : 1
    <1032>   DW_AT_declaration : 1
 <1><1033>: Abbrev Number: 15 (DW_TAG_array_type)
    <1034>   DW_AT_type        : <0x32>
    <1038>   DW_AT_sibling     : <0x1043>
 <2><103c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <103d>   DW_AT_type        : <0x2b>
    <1041>   DW_AT_upper_bound : 2
 <2><1042>: Abbrev Number: 0
 <1><1043>: Abbrev Number: 3 (DW_TAG_const_type)
    <1044>   DW_AT_type        : <0x1033>
 <1><1048>: Abbrev Number: 10 (DW_TAG_variable)
    <1049>   DW_AT_name        : (indirect string, offset: 0xebd): nsyscall_vec
    <104d>   DW_AT_decl_file   : 18
    <104e>   DW_AT_decl_line   : 1903
    <1050>   DW_AT_decl_column : 27
    <1051>   DW_AT_type        : <0x1043>
    <1055>   DW_AT_external    : 1
    <1056>   DW_AT_declaration : 1
 <1><1057>: Abbrev Number: 15 (DW_TAG_array_type)
    <1058>   DW_AT_type        : <0x9b3>
    <105c>   DW_AT_sibling     : <0x1067>
 <2><1060>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1061>   DW_AT_type        : <0x2b>
    <1065>   DW_AT_upper_bound : 2
 <2><1066>: Abbrev Number: 0
 <1><1067>: Abbrev Number: 3 (DW_TAG_const_type)
    <1068>   DW_AT_type        : <0x1057>
 <1><106c>: Abbrev Number: 10 (DW_TAG_variable)
    <106d>   DW_AT_name        : (indirect string, offset: 0x77e): sysent_vec
    <1071>   DW_AT_decl_file   : 18
    <1072>   DW_AT_decl_line   : 1904
    <1074>   DW_AT_decl_column : 35
    <1075>   DW_AT_type        : <0x1067>
    <1079>   DW_AT_external    : 1
    <107a>   DW_AT_declaration : 1
 <1><107b>: Abbrev Number: 10 (DW_TAG_variable)
    <107c>   DW_AT_name        : (indirect string, offset: 0x376): inject_vec
    <1080>   DW_AT_decl_file   : 18
    <1081>   DW_AT_decl_line   : 1905
    <1083>   DW_AT_decl_column : 28
    <1084>   DW_AT_type        : <0x9b8>
    <1088>   DW_AT_external    : 1
    <1089>   DW_AT_declaration : 1
 <1><108a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <108b>   DW_AT_name        : (indirect string, offset: 0xd5f): audit_arch_t
    <108f>   DW_AT_byte_size   : 8
    <1090>   DW_AT_decl_file   : 18
    <1091>   DW_AT_decl_line   : 1907
    <1093>   DW_AT_decl_column : 8
    <1094>   DW_AT_sibling     : <0x10b9>
 <2><1098>: Abbrev Number: 22 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0x54d): arch
    <109d>   DW_AT_decl_file   : 18
    <109e>   DW_AT_decl_line   : 1908
    <10a0>   DW_AT_decl_column : 15
    <10a1>   DW_AT_type        : <0x2b>
    <10a5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10a8>: Abbrev Number: 22 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x9b8): flag
    <10ad>   DW_AT_decl_file   : 18
    <10ae>   DW_AT_decl_line   : 1909
    <10b0>   DW_AT_decl_column : 15
    <10b1>   DW_AT_type        : <0x2b>
    <10b5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10b8>: Abbrev Number: 0
 <1><10b9>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ba>   DW_AT_type        : <0x108a>
 <1><10be>: Abbrev Number: 15 (DW_TAG_array_type)
    <10bf>   DW_AT_type        : <0x10b9>
    <10c3>   DW_AT_sibling     : <0x10ce>
 <2><10c7>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10c8>   DW_AT_type        : <0x2b>
    <10cc>   DW_AT_upper_bound : 2
 <2><10cd>: Abbrev Number: 0
 <1><10ce>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cf>   DW_AT_type        : <0x10be>
 <1><10d3>: Abbrev Number: 10 (DW_TAG_variable)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x92e): audit_arch_vec
    <10d8>   DW_AT_decl_file   : 18
    <10d9>   DW_AT_decl_line   : 1912
    <10db>   DW_AT_decl_column : 34
    <10dc>   DW_AT_type        : <0x10ce>
    <10e0>   DW_AT_external    : 1
    <10e1>   DW_AT_declaration : 1
 <1><10e2>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e3>   DW_AT_byte_size   : 180
    <10e4>   DW_AT_decl_file   : 20
    <10e5>   DW_AT_decl_line   : 2
    <10e6>   DW_AT_decl_column : 9
    <10e7>   DW_AT_sibling     : <0x139c>
 <2><10eb>: Abbrev Number: 9 (DW_TAG_member)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x1c3): block_ioctl
    <10f0>   DW_AT_decl_file   : 20
    <10f1>   DW_AT_decl_line   : 3
    <10f2>   DW_AT_decl_column : 8
    <10f3>   DW_AT_type        : <0x13b6>
    <10f7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10fa>: Abbrev Number: 9 (DW_TAG_member)
    <10fb>   DW_AT_name        : (indirect string, offset: 0xa83): btrfs_ioctl
    <10ff>   DW_AT_decl_file   : 20
    <1100>   DW_AT_decl_line   : 6
    <1101>   DW_AT_decl_column : 8
    <1102>   DW_AT_type        : <0x13b6>
    <1106>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1109>: Abbrev Number: 9 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0x70c): evdev_write_ioctl_mpers
    <110e>   DW_AT_decl_file   : 20
    <110f>   DW_AT_decl_line   : 9
    <1110>   DW_AT_decl_column : 8
    <1111>   DW_AT_type        : <0x13b6>
    <1115>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1118>: Abbrev Number: 9 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0x6e2): get_sock_fprog_size
    <111d>   DW_AT_decl_file   : 20
    <111e>   DW_AT_decl_line   : 12
    <111f>   DW_AT_decl_column : 17
    <1120>   DW_AT_type        : <0x13c2>
    <1124>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1127>: Abbrev Number: 9 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0x192): fetch_bpf_fprog
    <112c>   DW_AT_decl_file   : 20
    <112d>   DW_AT_decl_line   : 15
    <112e>   DW_AT_decl_column : 10
    <112f>   DW_AT_type        : <0x13e2>
    <1133>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1136>: Abbrev Number: 9 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0x91b): fetch_struct_flock
    <113b>   DW_AT_decl_file   : 20
    <113c>   DW_AT_decl_line   : 18
    <113d>   DW_AT_decl_column : 10
    <113e>   DW_AT_type        : <0x13e2>
    <1142>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1145>: Abbrev Number: 9 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0xc85): fetch_struct_flock64
