Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1742 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5dd): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x31d): mpers-m32/sysinfo_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa2e): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x3c7): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0x1008): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x98e): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <40>   DW_AT_encoding    : 6	(signed char)
    <41>   DW_AT_name        : (indirect string, offset: 0x360): signed char
 <1><45>: Abbrev Number: 4 (DW_TAG_typedef)
    <46>   DW_AT_name        : (indirect string, offset: 0x25a): __uint8_t
    <4a>   DW_AT_decl_file   : 1
    <4b>   DW_AT_decl_line   : 38
    <4c>   DW_AT_decl_column : 23
    <4d>   DW_AT_type        : <0x1d>
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xdea): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4a6): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x894): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xee0): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x8c4): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x799): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb6d): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xba3): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2c6): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcef): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0xc64): __time_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 160
    <c8>   DW_AT_decl_column : 26
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 3 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xcd>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x41a): __syscall_slong_t
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 196
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xae>
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x466): char
 <1><ed>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee>   DW_AT_type        : <0xe6>
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x36c): uint8_t
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 24
    <f9>   DW_AT_decl_column : 19
    <fa>   DW_AT_type        : <0x45>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0xb8e): uint16_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 25
    <105>   DW_AT_decl_column : 20
    <106>   DW_AT_type        : <0x58>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xf88): uint32_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 26
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x70>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xdfa): uint64_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 27
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x8f>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <127>   DW_AT_decl_file   : 3
    <128>   DW_AT_decl_line   : 209
    <129>   DW_AT_decl_column : 23
    <12a>   DW_AT_type        : <0x2b>
 <1><12e>: Abbrev Number: 3 (DW_TAG_const_type)
    <12f>   DW_AT_type        : <0x122>
 <1><133>: Abbrev Number: 8 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0xb16): timespec
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 10
    <13b>   DW_AT_decl_column : 8
    <13c>   DW_AT_sibling     : <0x15f>
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x10d5): tv_sec
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 12
    <147>   DW_AT_decl_column : 12
    <148>   DW_AT_type        : <0xc1>
    <14c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f>: Abbrev Number: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xe20): tv_nsec
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 16
    <156>   DW_AT_decl_column : 21
    <157>   DW_AT_type        : <0xd4>
    <15b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 10 (DW_TAG_array_type)
    <160>   DW_AT_type        : <0xe6>
    <164>   DW_AT_sibling     : <0x16f>
 <2><168>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <169>   DW_AT_type        : <0x2b>
    <16d>   DW_AT_upper_bound : 7
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 2 (DW_TAG_base_type)
    <170>   DW_AT_byte_size   : 12
    <171>   DW_AT_encoding    : 4	(float)
    <172>   DW_AT_name        : (indirect string, offset: 0xace): long double
 <1><176>: Abbrev Number: 2 (DW_TAG_base_type)
    <177>   DW_AT_byte_size   : 16
    <178>   DW_AT_encoding    : 4	(float)
    <179>   DW_AT_name        : (indirect string, offset: 0xfc3): _Float128
 <1><17d>: Abbrev Number: 12 (DW_TAG_variable)
    <17e>   DW_AT_name        : (indirect string, offset: 0x27d): __environ
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 543
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x18c>
    <18a>   DW_AT_external    : 1
    <18b>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <18d>   DW_AT_byte_size   : 4
    <18e>   DW_AT_type        : <0xe0>
 <1><192>: Abbrev Number: 12 (DW_TAG_variable)
    <193>   DW_AT_name        : (indirect string, offset: 0x3bf): environ
    <197>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 545
    <19a>   DW_AT_decl_column : 15
    <19b>   DW_AT_type        : <0x18c>
    <19f>   DW_AT_external    : 1
    <1a0>   DW_AT_declaration : 1
 <1><1a1>: Abbrev Number: 13 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xff2): optarg
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 36
    <1a8>   DW_AT_decl_column : 14
    <1a9>   DW_AT_type        : <0xe0>
    <1ad>   DW_AT_external    : 1
    <1ae>   DW_AT_declaration : 1
 <1><1af>: Abbrev Number: 13 (DW_TAG_variable)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x76c): optind
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 50
    <1b6>   DW_AT_decl_column : 12
    <1b7>   DW_AT_type        : <0x64>
    <1bb>   DW_AT_external    : 1
    <1bc>   DW_AT_declaration : 1
 <1><1bd>: Abbrev Number: 13 (DW_TAG_variable)
    <1be>   DW_AT_name        : (indirect string, offset: 0xc53): opterr
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 55
    <1c4>   DW_AT_decl_column : 12
    <1c5>   DW_AT_type        : <0x64>
    <1c9>   DW_AT_external    : 1
    <1ca>   DW_AT_declaration : 1
 <1><1cb>: Abbrev Number: 13 (DW_TAG_variable)
    <1cc>   DW_AT_name        : (indirect string, offset: 0xb53): optopt
    <1d0>   DW_AT_decl_file   : 6
    <1d1>   DW_AT_decl_line   : 59
    <1d2>   DW_AT_decl_column : 12
    <1d3>   DW_AT_type        : <0x64>
    <1d7>   DW_AT_external    : 1
    <1d8>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_type        : <0xed>
 <1><1df>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e0>   DW_AT_type        : <0x1d9>
 <1><1e4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e5>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 14 (DW_TAG_const_type)
 <1><1eb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x374): _IO_FILE
    <1f0>   DW_AT_byte_size   : 148
    <1f1>   DW_AT_decl_file   : 7
    <1f2>   DW_AT_decl_line   : 49
    <1f3>   DW_AT_decl_column : 8
    <1f4>   DW_AT_sibling     : <0x3ac>
 <2><1f8>: Abbrev Number: 9 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xa0a): _flags
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 51
    <1ff>   DW_AT_decl_column : 7
    <200>   DW_AT_type        : <0x64>
    <204>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><207>: Abbrev Number: 9 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x4f5): _IO_read_ptr
    <20c>   DW_AT_decl_file   : 7
    <20d>   DW_AT_decl_line   : 54
    <20e>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xe0>
    <213>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><216>: Abbrev Number: 9 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xf35): _IO_read_end
    <21b>   DW_AT_decl_file   : 7
    <21c>   DW_AT_decl_line   : 55
    <21d>   DW_AT_decl_column : 9
    <21e>   DW_AT_type        : <0xe0>
    <222>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><225>: Abbrev Number: 9 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x7d5): _IO_read_base
    <22a>   DW_AT_decl_file   : 7
    <22b>   DW_AT_decl_line   : 56
    <22c>   DW_AT_decl_column : 9
    <22d>   DW_AT_type        : <0xe0>
    <231>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><234>: Abbrev Number: 9 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x13d): _IO_write_base
    <239>   DW_AT_decl_file   : 7
    <23a>   DW_AT_decl_line   : 57
    <23b>   DW_AT_decl_column : 9
    <23c>   DW_AT_type        : <0xe0>
    <240>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><243>: Abbrev Number: 9 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x1041): _IO_write_ptr
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 58
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0xe0>
    <24f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><252>: Abbrev Number: 9 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x906): _IO_write_end
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 59
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0xe0>
    <25e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><261>: Abbrev Number: 9 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x977): _IO_buf_base
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 60
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0xe0>
    <26d>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><270>: Abbrev Number: 9 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xd87): _IO_buf_end
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 61
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0xe0>
    <27c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><27f>: Abbrev Number: 9 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1ce): _IO_save_base
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 64
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0xe0>
    <28b>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><28e>: Abbrev Number: 9 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0xcb6): _IO_backup_base
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 65
    <295>   DW_AT_decl_column : 9
    <296>   DW_AT_type        : <0xe0>
    <29a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><29d>: Abbrev Number: 9 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0xbf): _IO_save_end
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 66
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0xe0>
    <2a9>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2ac>: Abbrev Number: 9 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x589): _markers
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x3c6>
    <2b8>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2bb>: Abbrev Number: 9 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x211): _chain
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 70
    <2c2>   DW_AT_decl_column : 20
    <2c3>   DW_AT_type        : <0x3cc>
    <2c7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2ca>: Abbrev Number: 9 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xfae): _fileno
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 72
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x64>
    <2d6>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2d9>: Abbrev Number: 9 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x7c1): _flags2
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 73
    <2e0>   DW_AT_decl_column : 7
    <2e1>   DW_AT_type        : <0x64>
    <2e5>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2e8>: Abbrev Number: 9 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x83a): _old_offset
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 74
    <2ef>   DW_AT_decl_column : 11
    <2f0>   DW_AT_type        : <0xa2>
    <2f4>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2f7>: Abbrev Number: 9 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x23f): _cur_column
    <2fc>   DW_AT_decl_file   : 7
    <2fd>   DW_AT_decl_line   : 77
    <2fe>   DW_AT_decl_column : 18
    <2ff>   DW_AT_type        : <0x24>
    <303>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><306>: Abbrev Number: 9 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xe46): _vtable_offset
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 78
    <30d>   DW_AT_decl_column : 15
    <30e>   DW_AT_type        : <0x3e>
    <312>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><315>: Abbrev Number: 9 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xcc6): _shortbuf
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 79
    <31c>   DW_AT_decl_column : 8
    <31d>   DW_AT_type        : <0x3d2>
    <321>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><324>: Abbrev Number: 9 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x17e): _lock
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 81
    <32b>   DW_AT_decl_column : 15
    <32c>   DW_AT_type        : <0x3e2>
    <330>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><333>: Abbrev Number: 9 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x704): _offset
    <338>   DW_AT_decl_file   : 7
    <339>   DW_AT_decl_line   : 89
    <33a>   DW_AT_decl_column : 13
    <33b>   DW_AT_type        : <0xb5>
    <33f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><342>: Abbrev Number: 9 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa60): _codecvt
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 91
    <349>   DW_AT_decl_column : 23
    <34a>   DW_AT_type        : <0x3ee>
    <34e>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><351>: Abbrev Number: 9 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xfd6): _wide_data
    <356>   DW_AT_decl_file   : 7
    <357>   DW_AT_decl_line   : 92
    <358>   DW_AT_decl_column : 25
    <359>   DW_AT_type        : <0x3fa>
    <35d>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><360>: Abbrev Number: 9 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x3e3): _freeres_list
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 93
    <367>   DW_AT_decl_column : 20
    <368>   DW_AT_type        : <0x3cc>
    <36c>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><36f>: Abbrev Number: 9 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xc29): _freeres_buf
    <374>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 94
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0xcd>
    <37b>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><37e>: Abbrev Number: 9 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x9cc): __pad5
    <383>   DW_AT_decl_file   : 7
    <384>   DW_AT_decl_line   : 95
    <385>   DW_AT_decl_column : 10
    <386>   DW_AT_type        : <0x122>
    <38a>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><38d>: Abbrev Number: 9 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x264): _mode
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 96
    <394>   DW_AT_decl_column : 7
    <395>   DW_AT_type        : <0x64>
    <399>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><39c>: Abbrev Number: 9 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x7ef): _unused2
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 98
    <3a3>   DW_AT_decl_column : 8
    <3a4>   DW_AT_type        : <0x400>
    <3a8>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xaf8): FILE
    <3b1>   DW_AT_decl_file   : 8
    <3b2>   DW_AT_decl_line   : 7
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0x1eb>
 <1><3b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x49b): _IO_lock_t
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 43
    <3bf>   DW_AT_decl_column : 14
 <1><3c0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x308): _IO_marker
    <3c5>   DW_AT_declaration : 1
 <1><3c6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c8>   DW_AT_type        : <0x3c0>
 <1><3cc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cd>   DW_AT_byte_size   : 4
    <3ce>   DW_AT_type        : <0x1eb>
 <1><3d2>: Abbrev Number: 10 (DW_TAG_array_type)
    <3d3>   DW_AT_type        : <0xe6>
    <3d7>   DW_AT_sibling     : <0x3e2>
 <2><3db>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3dc>   DW_AT_type        : <0x2b>
    <3e0>   DW_AT_upper_bound : 0
 <2><3e1>: Abbrev Number: 0
 <1><3e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3e3>   DW_AT_byte_size   : 4
    <3e4>   DW_AT_type        : <0x3b8>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x6f): _IO_codecvt
    <3ed>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 4
    <3f0>   DW_AT_type        : <0x3e8>
 <1><3f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x388): _IO_wide_data
    <3f9>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x3f4>
 <1><400>: Abbrev Number: 10 (DW_TAG_array_type)
    <401>   DW_AT_type        : <0xe6>
    <405>   DW_AT_sibling     : <0x410>
 <2><409>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <40a>   DW_AT_type        : <0x2b>
    <40e>   DW_AT_upper_bound : 39
 <2><40f>: Abbrev Number: 0
 <1><410>: Abbrev Number: 13 (DW_TAG_variable)
    <411>   DW_AT_name        : (indirect string, offset: 0x554): stdin
    <415>   DW_AT_decl_file   : 9
    <416>   DW_AT_decl_line   : 137
    <417>   DW_AT_decl_column : 14
    <418>   DW_AT_type        : <0x41e>
    <41c>   DW_AT_external    : 1
    <41d>   DW_AT_declaration : 1
 <1><41e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <41f>   DW_AT_byte_size   : 4
    <420>   DW_AT_type        : <0x3ac>
 <1><424>: Abbrev Number: 13 (DW_TAG_variable)
    <425>   DW_AT_name        : (indirect string, offset: 0x101b): stdout
    <429>   DW_AT_decl_file   : 9
    <42a>   DW_AT_decl_line   : 138
    <42b>   DW_AT_decl_column : 14
    <42c>   DW_AT_type        : <0x41e>
    <430>   DW_AT_external    : 1
    <431>   DW_AT_declaration : 1
 <1><432>: Abbrev Number: 13 (DW_TAG_variable)
    <433>   DW_AT_name        : (indirect string, offset: 0xde3): stderr
    <437>   DW_AT_decl_file   : 9
    <438>   DW_AT_decl_line   : 139
    <439>   DW_AT_decl_column : 14
    <43a>   DW_AT_type        : <0x41e>
    <43e>   DW_AT_external    : 1
    <43f>   DW_AT_declaration : 1
 <1><440>: Abbrev Number: 13 (DW_TAG_variable)
    <441>   DW_AT_name        : (indirect string, offset: 0x251): sys_nerr
    <445>   DW_AT_decl_file   : 10
    <446>   DW_AT_decl_line   : 26
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x64>
    <44c>   DW_AT_external    : 1
    <44d>   DW_AT_declaration : 1
 <1><44e>: Abbrev Number: 10 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x1df>
    <453>   DW_AT_sibling     : <0x459>
 <2><457>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 3 (DW_TAG_const_type)
    <45a>   DW_AT_type        : <0x44e>
 <1><45e>: Abbrev Number: 13 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x563): sys_errlist
    <463>   DW_AT_decl_file   : 10
    <464>   DW_AT_decl_line   : 27
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x459>
    <46a>   DW_AT_external    : 1
    <46b>   DW_AT_declaration : 1
 <1><46c>: Abbrev Number: 13 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x26a): _sys_nerr
    <471>   DW_AT_decl_file   : 10
    <472>   DW_AT_decl_line   : 30
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0x64>
    <478>   DW_AT_external    : 1
    <479>   DW_AT_declaration : 1
 <1><47a>: Abbrev Number: 13 (DW_TAG_variable)
    <47b>   DW_AT_name        : (indirect string, offset: 0xe55): _sys_errlist
    <47f>   DW_AT_decl_file   : 10
    <480>   DW_AT_decl_line   : 31
    <481>   DW_AT_decl_column : 26
    <482>   DW_AT_type        : <0x459>
    <486>   DW_AT_external    : 1
    <487>   DW_AT_declaration : 1
 <1><488>: Abbrev Number: 13 (DW_TAG_variable)
    <489>   DW_AT_name        : (indirect string, offset: 0x6dd): program_invocation_name
    <48d>   DW_AT_decl_file   : 11
    <48e>   DW_AT_decl_line   : 45
    <48f>   DW_AT_decl_column : 14
    <490>   DW_AT_type        : <0xe0>
    <494>   DW_AT_external    : 1
    <495>   DW_AT_declaration : 1
 <1><496>: Abbrev Number: 13 (DW_TAG_variable)
    <497>   DW_AT_name        : (indirect string, offset: 0xbce): program_invocation_short_name
    <49b>   DW_AT_decl_file   : 11
    <49c>   DW_AT_decl_line   : 46
    <49d>   DW_AT_decl_column : 14
    <49e>   DW_AT_type        : <0xe0>
    <4a2>   DW_AT_external    : 1
    <4a3>   DW_AT_declaration : 1
 <1><4a4>: Abbrev Number: 10 (DW_TAG_array_type)
    <4a5>   DW_AT_type        : <0xe0>
    <4a9>   DW_AT_sibling     : <0x4b4>
 <2><4ad>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4ae>   DW_AT_type        : <0x2b>
    <4b2>   DW_AT_upper_bound : 1
 <2><4b3>: Abbrev Number: 0
 <1><4b4>: Abbrev Number: 13 (DW_TAG_variable)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x1bb): __tzname
    <4b9>   DW_AT_decl_file   : 12
    <4ba>   DW_AT_decl_line   : 159
    <4bb>   DW_AT_decl_column : 14
    <4bc>   DW_AT_type        : <0x4a4>
    <4c0>   DW_AT_external    : 1
    <4c1>   DW_AT_declaration : 1
 <1><4c2>: Abbrev Number: 13 (DW_TAG_variable)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xec7): __daylight
    <4c7>   DW_AT_decl_file   : 12
    <4c8>   DW_AT_decl_line   : 160
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x64>
    <4ce>   DW_AT_external    : 1
    <4cf>   DW_AT_declaration : 1
 <1><4d0>: Abbrev Number: 13 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x37d): __timezone
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 161
    <4d7>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xae>
    <4dc>   DW_AT_external    : 1
    <4dd>   DW_AT_declaration : 1
 <1><4de>: Abbrev Number: 13 (DW_TAG_variable)
    <4df>   DW_AT_name        : (indirect string, offset: 0x9c5): tzname
    <4e3>   DW_AT_decl_file   : 12
    <4e4>   DW_AT_decl_line   : 166
    <4e5>   DW_AT_decl_column : 14
    <4e6>   DW_AT_type        : <0x4a4>
    <4ea>   DW_AT_external    : 1
    <4eb>   DW_AT_declaration : 1
 <1><4ec>: Abbrev Number: 13 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x108b): daylight
    <4f1>   DW_AT_decl_file   : 12
    <4f2>   DW_AT_decl_line   : 174
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x64>
    <4f8>   DW_AT_external    : 1
    <4f9>   DW_AT_declaration : 1
 <1><4fa>: Abbrev Number: 13 (DW_TAG_variable)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x4e0): timezone
    <4ff>   DW_AT_decl_file   : 12
    <500>   DW_AT_decl_line   : 175
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0xae>
    <506>   DW_AT_external    : 1
    <507>   DW_AT_declaration : 1
 <1><508>: Abbrev Number: 12 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xf5c): getdate_err
    <50d>   DW_AT_decl_file   : 12
    <50e>   DW_AT_decl_line   : 274
    <510>   DW_AT_decl_column : 12
    <511>   DW_AT_type        : <0x64>
    <515>   DW_AT_external    : 1
    <516>   DW_AT_declaration : 1
 <1><517>: Abbrev Number: 13 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0x9d8): debug_flag
    <51c>   DW_AT_decl_file   : 13
    <51d>   DW_AT_decl_line   : 20
    <51e>   DW_AT_decl_column : 13
    <51f>   DW_AT_type        : <0x525>
    <523>   DW_AT_external    : 1
    <524>   DW_AT_declaration : 1
 <1><525>: Abbrev Number: 2 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 2	(boolean)
    <528>   DW_AT_name        : (indirect string, offset: 0x42c): _Bool
 <1><52c>: Abbrev Number: 3 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0xaa4): __kernel_long_t
    <536>   DW_AT_decl_file   : 14
    <537>   DW_AT_decl_line   : 15
    <538>   DW_AT_decl_column : 15
    <539>   DW_AT_type        : <0xae>
 <1><53d>: Abbrev Number: 4 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x543): __kernel_ulong_t
    <542>   DW_AT_decl_file   : 14
    <543>   DW_AT_decl_line   : 16
    <544>   DW_AT_decl_column : 23
    <545>   DW_AT_type        : <0x37>
 <1><549>: Abbrev Number: 4 (DW_TAG_typedef)
    <54a>   DW_AT_name        : (indirect string, offset: 0x3f1): kernel_long_t
    <54e>   DW_AT_decl_file   : 15
    <54f>   DW_AT_decl_line   : 16
    <550>   DW_AT_decl_column : 25
    <551>   DW_AT_type        : <0x531>
 <1><555>: Abbrev Number: 4 (DW_TAG_typedef)
    <556>   DW_AT_name        : (indirect string, offset: 0x8b5): kernel_ulong_t
    <55a>   DW_AT_decl_file   : 15
    <55b>   DW_AT_decl_line   : 17
    <55c>   DW_AT_decl_column : 26
    <55d>   DW_AT_type        : <0x53d>
 <1><561>: Abbrev Number: 3 (DW_TAG_const_type)
    <562>   DW_AT_type        : <0x555>
 <1><566>: Abbrev Number: 8 (DW_TAG_structure_type)
    <567>   DW_AT_name        : (indirect string, offset: 0xbec): list_item
    <56b>   DW_AT_byte_size   : 8
    <56c>   DW_AT_decl_file   : 16
    <56d>   DW_AT_decl_line   : 92
    <56e>   DW_AT_decl_column : 8
    <56f>   DW_AT_sibling     : <0x592>
 <2><573>: Abbrev Number: 9 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0x10d0): prev
    <578>   DW_AT_decl_file   : 16
    <579>   DW_AT_decl_line   : 93
    <57a>   DW_AT_decl_column : 20
    <57b>   DW_AT_type        : <0x592>
    <57f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><582>: Abbrev Number: 9 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0x10c6): next
    <587>   DW_AT_decl_file   : 16
    <588>   DW_AT_decl_line   : 94
    <589>   DW_AT_decl_column : 20
    <58a>   DW_AT_type        : <0x592>
    <58e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><591>: Abbrev Number: 0
 <1><592>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <593>   DW_AT_byte_size   : 4
    <594>   DW_AT_type        : <0x566>
 <1><598>: Abbrev Number: 8 (DW_TAG_structure_type)
    <599>   DW_AT_name        : (indirect string, offset: 0x88d): sysent
    <59d>   DW_AT_byte_size   : 20
    <59e>   DW_AT_decl_file   : 17
    <59f>   DW_AT_decl_line   : 13
    <5a0>   DW_AT_decl_column : 16
    <5a1>   DW_AT_sibling     : <0x5f1>
 <2><5a5>: Abbrev Number: 9 (DW_TAG_member)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x1032): nargs
    <5aa>   DW_AT_decl_file   : 17
    <5ab>   DW_AT_decl_line   : 14
    <5ac>   DW_AT_decl_column : 11
    <5ad>   DW_AT_type        : <0x2b>
    <5b1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5b4>: Abbrev Number: 9 (DW_TAG_member)
    <5b5>   DW_AT_name        : (indirect string, offset: 0x984): sys_flags
    <5b9>   DW_AT_decl_file   : 17
    <5ba>   DW_AT_decl_line   : 15
    <5bb>   DW_AT_decl_column : 6
    <5bc>   DW_AT_type        : <0x64>
    <5c0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5c3>: Abbrev Number: 18 (DW_TAG_member)
    <5c4>   DW_AT_name        : sen
    <5c8>   DW_AT_decl_file   : 17
    <5c9>   DW_AT_decl_line   : 16
    <5ca>   DW_AT_decl_column : 6
    <5cb>   DW_AT_type        : <0x64>
    <5cf>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5d2>: Abbrev Number: 9 (DW_TAG_member)
    <5d3>   DW_AT_name        : (indirect string, offset: 0x2ff): sys_func
    <5d7>   DW_AT_decl_file   : 17
    <5d8>   DW_AT_decl_line   : 17
    <5d9>   DW_AT_decl_column : 8
    <5da>   DW_AT_type        : <0x869>
    <5de>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e1>: Abbrev Number: 9 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x274): sys_name
    <5e6>   DW_AT_decl_file   : 17
    <5e7>   DW_AT_decl_line   : 18
    <5e8>   DW_AT_decl_column : 14
    <5e9>   DW_AT_type        : <0x1d9>
    <5ed>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f0>: Abbrev Number: 0
 <1><5f1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5f2>   DW_AT_prototyped  : 1
    <5f3>   DW_AT_type        : <0x64>
    <5f7>   DW_AT_sibling     : <0x601>
 <2><5fb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5fc>   DW_AT_type        : <0x601>
 <2><600>: Abbrev Number: 0
 <1><601>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <602>   DW_AT_byte_size   : 4
    <603>   DW_AT_type        : <0x60c>
 <1><607>: Abbrev Number: 3 (DW_TAG_const_type)
    <608>   DW_AT_type        : <0x601>
 <1><60c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <60d>   DW_AT_name        : tcb
    <611>   DW_AT_byte_size   : 220
    <612>   DW_AT_decl_file   : 18
    <613>   DW_AT_decl_line   : 262
    <615>   DW_AT_decl_column : 8
    <616>   DW_AT_sibling     : <0x869>
 <2><61a>: Abbrev Number: 22 (DW_TAG_member)
    <61b>   DW_AT_name        : (indirect string, offset: 0x4ef): flags
    <61f>   DW_AT_decl_file   : 18
    <620>   DW_AT_decl_line   : 263
    <622>   DW_AT_decl_column : 6
    <623>   DW_AT_type        : <0x64>
    <627>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><62a>: Abbrev Number: 23 (DW_TAG_member)
    <62b>   DW_AT_name        : pid
    <62f>   DW_AT_decl_file   : 18
    <630>   DW_AT_decl_line   : 264
    <632>   DW_AT_decl_column : 6
    <633>   DW_AT_type        : <0x64>
    <637>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><63a>: Abbrev Number: 22 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x4e): qual_flg
    <63f>   DW_AT_decl_file   : 18
    <640>   DW_AT_decl_line   : 265
    <642>   DW_AT_decl_column : 6
    <643>   DW_AT_type        : <0x64>
    <647>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><64a>: Abbrev Number: 22 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0x3a1): currpers
    <64f>   DW_AT_decl_file   : 18
    <650>   DW_AT_decl_line   : 267
    <652>   DW_AT_decl_column : 15
    <653>   DW_AT_type        : <0x2b>
    <657>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><65a>: Abbrev Number: 22 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0xb4b): u_error
    <65f>   DW_AT_decl_file   : 18
    <660>   DW_AT_decl_line   : 269
    <662>   DW_AT_decl_column : 16
    <663>   DW_AT_type        : <0x37>
    <667>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><66a>: Abbrev Number: 22 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <66f>   DW_AT_decl_file   : 18
    <670>   DW_AT_decl_line   : 270
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x555>
    <677>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><67a>: Abbrev Number: 22 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0xb84): true_scno
    <67f>   DW_AT_decl_file   : 18
    <680>   DW_AT_decl_line   : 271
    <682>   DW_AT_decl_column : 17
    <683>   DW_AT_type        : <0x555>
    <687>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><68a>: Abbrev Number: 22 (DW_TAG_member)
    <68b>   DW_AT_name        : (indirect string, offset: 0x1a5): u_arg
    <68f>   DW_AT_decl_file   : 18
    <690>   DW_AT_decl_line   : 272
    <692>   DW_AT_decl_column : 17
    <693>   DW_AT_type        : <0x999>
    <697>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><69a>: Abbrev Number: 22 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0x99b): u_rval
    <69f>   DW_AT_decl_file   : 18
    <6a0>   DW_AT_decl_line   : 273
    <6a2>   DW_AT_decl_column : 16
    <6a3>   DW_AT_type        : <0x549>
    <6a7>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6aa>: Abbrev Number: 22 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0xac0): sys_func_rval
    <6af>   DW_AT_decl_file   : 18
    <6b0>   DW_AT_decl_line   : 274
    <6b2>   DW_AT_decl_column : 6
    <6b3>   DW_AT_type        : <0x64>
    <6b7>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6ba>: Abbrev Number: 22 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0xce0): curcol
    <6bf>   DW_AT_decl_file   : 18
    <6c0>   DW_AT_decl_line   : 275
    <6c2>   DW_AT_decl_column : 6
    <6c3>   DW_AT_type        : <0x64>
    <6c7>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6ca>: Abbrev Number: 22 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x9ad): outf
    <6cf>   DW_AT_decl_file   : 18
    <6d0>   DW_AT_decl_line   : 276
    <6d2>   DW_AT_decl_column : 8
    <6d3>   DW_AT_type        : <0x41e>
    <6d7>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6da>: Abbrev Number: 22 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xf06): staged_output_data
    <6df>   DW_AT_decl_file   : 18
    <6e0>   DW_AT_decl_line   : 277
    <6e2>   DW_AT_decl_column : 29
    <6e3>   DW_AT_type        : <0x9af>
    <6e7>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6ea>: Abbrev Number: 22 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0xa8b): auxstr
    <6ef>   DW_AT_decl_file   : 18
    <6f0>   DW_AT_decl_line   : 279
    <6f2>   DW_AT_decl_column : 14
    <6f3>   DW_AT_type        : <0x1d9>
    <6f7>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><6fa>: Abbrev Number: 22 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x184): _priv_data
    <6ff>   DW_AT_decl_file   : 18
    <700>   DW_AT_decl_line   : 280
    <702>   DW_AT_decl_column : 8
    <703>   DW_AT_type        : <0xcd>
    <707>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><70a>: Abbrev Number: 22 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0xc19): _free_priv_data
    <70f>   DW_AT_decl_file   : 18
    <710>   DW_AT_decl_line   : 281
    <712>   DW_AT_decl_column : 9
    <713>   DW_AT_type        : <0x9c1>
    <717>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><71a>: Abbrev Number: 22 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x195): s_ent
    <71f>   DW_AT_decl_file   : 18
    <720>   DW_AT_decl_line   : 282
    <722>   DW_AT_decl_column : 23
    <723>   DW_AT_type        : <0x9c7>
    <727>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><72a>: Abbrev Number: 22 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <72f>   DW_AT_decl_file   : 18
    <730>   DW_AT_decl_line   : 285
    <732>   DW_AT_decl_column : 23
    <733>   DW_AT_type        : <0x9c7>
    <737>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><73a>: Abbrev Number: 22 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x396): inject_vec
    <73f>   DW_AT_decl_file   : 18
    <740>   DW_AT_decl_line   : 286
    <742>   DW_AT_decl_column : 22
    <743>   DW_AT_type        : <0x9d2>
    <747>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><74a>: Abbrev Number: 22 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x7f8): stime
    <74f>   DW_AT_decl_file   : 18
    <750>   DW_AT_decl_line   : 287
    <752>   DW_AT_decl_column : 18
    <753>   DW_AT_type        : <0x133>
    <757>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><75a>: Abbrev Number: 22 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x3b4): ltime
    <75f>   DW_AT_decl_file   : 18
    <760>   DW_AT_decl_line   : 288
    <762>   DW_AT_decl_column : 18
    <763>   DW_AT_type        : <0x133>
    <767>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><76a>: Abbrev Number: 22 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0xff9): atime
    <76f>   DW_AT_decl_file   : 18
    <770>   DW_AT_decl_line   : 289
    <772>   DW_AT_decl_column : 18
    <773>   DW_AT_type        : <0x133>
    <777>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><77a>: Abbrev Number: 22 (DW_TAG_member)
    <77b>   DW_AT_name        : (indirect string, offset: 0x4e9): etime
    <77f>   DW_AT_decl_file   : 18
    <780>   DW_AT_decl_line   : 290
    <782>   DW_AT_decl_column : 18
    <783>   DW_AT_type        : <0x133>
    <787>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><78b>: Abbrev Number: 22 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0xd44): delay_expiration_time
    <790>   DW_AT_decl_file   : 18
    <791>   DW_AT_decl_line   : 291
    <793>   DW_AT_decl_column : 18
    <794>   DW_AT_type        : <0x133>
    <798>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><79c>: Abbrev Number: 22 (DW_TAG_member)
    <79d>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a1>   DW_AT_decl_file   : 18
    <7a2>   DW_AT_decl_line   : 298
    <7a4>   DW_AT_decl_column : 15
    <7a5>   DW_AT_type        : <0x2b>
    <7a9>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7ad>: Abbrev Number: 22 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0xf42): last_dirfd
    <7b2>   DW_AT_decl_file   : 18
    <7b3>   DW_AT_decl_line   : 301
    <7b5>   DW_AT_decl_column : 6
    <7b6>   DW_AT_type        : <0x64>
    <7ba>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7be>: Abbrev Number: 22 (DW_TAG_member)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xf68): mmap_cache
    <7c3>   DW_AT_decl_file   : 18
    <7c4>   DW_AT_decl_line   : 304
    <7c6>   DW_AT_decl_column : 23
    <7c7>   DW_AT_type        : <0x9ee>
    <7cb>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7cf>: Abbrev Number: 22 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xb5a): wait_data_idx
    <7d4>   DW_AT_decl_file   : 18
    <7d5>   DW_AT_decl_line   : 311
    <7d7>   DW_AT_decl_column : 9
    <7d8>   DW_AT_type        : <0x122>
    <7dc>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e0>: Abbrev Number: 22 (DW_TAG_member)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xa92): delayed_wait_data
    <7e5>   DW_AT_decl_file   : 18
    <7e6>   DW_AT_decl_line   : 313
    <7e8>   DW_AT_decl_column : 24
    <7e9>   DW_AT_type        : <0x9fa>
    <7ed>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7f1>: Abbrev Number: 22 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xb0c): wait_list
    <7f6>   DW_AT_decl_file   : 18
    <7f7>   DW_AT_decl_line   : 314
    <7f9>   DW_AT_decl_column : 19
    <7fa>   DW_AT_type        : <0x566>
    <7fe>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><802>: Abbrev Number: 22 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x6f5): vcpu_info_list
    <807>   DW_AT_decl_file   : 18
    <808>   DW_AT_decl_line   : 318
    <80a>   DW_AT_decl_column : 20
    <80b>   DW_AT_type        : <0xa06>
    <80f>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><813>: Abbrev Number: 22 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0xcab): unwind_ctx
    <818>   DW_AT_decl_file   : 18
    <819>   DW_AT_decl_line   : 322
    <81b>   DW_AT_decl_column : 8
    <81c>   DW_AT_type        : <0xcd>
    <820>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><824>: Abbrev Number: 22 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x4d3): unwind_queue
    <829>   DW_AT_decl_file   : 18
    <82a>   DW_AT_decl_line   : 323
    <82c>   DW_AT_decl_column : 25
    <82d>   DW_AT_type        : <0xa12>
    <831>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><835>: Abbrev Number: 22 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x179): comm
    <83a>   DW_AT_decl_file   : 18
    <83b>   DW_AT_decl_line   : 327
    <83d>   DW_AT_decl_column : 7
    <83e>   DW_AT_type        : <0xa18>
    <842>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><846>: Abbrev Number: 22 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0x221): start_prc
    <84b>   DW_AT_decl_file   : 18
    <84c>   DW_AT_decl_line   : 329
    <84e>   DW_AT_decl_column : 16
    <84f>   DW_AT_type        : <0x37>
    <853>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><857>: Abbrev Number: 22 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0xfcd): pre_comm
    <85c>   DW_AT_decl_file   : 18
    <85d>   DW_AT_decl_line   : 330
    <85f>   DW_AT_decl_column : 7
    <860>   DW_AT_type        : <0xa18>
    <864>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><868>: Abbrev Number: 0
 <1><869>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <86a>   DW_AT_byte_size   : 4
    <86b>   DW_AT_type        : <0x5f1>
 <1><86f>: Abbrev Number: 4 (DW_TAG_typedef)
    <870>   DW_AT_name        : (indirect string, offset: 0x535): struct_sysent
    <874>   DW_AT_decl_file   : 17
    <875>   DW_AT_decl_line   : 19
    <876>   DW_AT_decl_column : 3
    <877>   DW_AT_type        : <0x598>
 <1><87b>: Abbrev Number: 3 (DW_TAG_const_type)
    <87c>   DW_AT_type        : <0x86f>
 <1><880>: Abbrev Number: 13 (DW_TAG_variable)
    <881>   DW_AT_name        : (indirect string, offset: 0xd30): current_personality
    <885>   DW_AT_decl_file   : 18
    <886>   DW_AT_decl_line   : 158
    <887>   DW_AT_decl_column : 17
    <888>   DW_AT_type        : <0x2b>
    <88c>   DW_AT_external    : 1
    <88d>   DW_AT_declaration : 1
 <1><88e>: Abbrev Number: 13 (DW_TAG_variable)
    <88f>   DW_AT_name        : (indirect string, offset: 0x829): current_wordsize
    <893>   DW_AT_decl_file   : 18
    <894>   DW_AT_decl_line   : 171
    <895>   DW_AT_decl_column : 17
    <896>   DW_AT_type        : <0x2b>
    <89a>   DW_AT_external    : 1
    <89b>   DW_AT_declaration : 1
 <1><89c>: Abbrev Number: 13 (DW_TAG_variable)
    <89d>   DW_AT_name        : (indirect string, offset: 0xa69): current_klongsize
    <8a1>   DW_AT_decl_file   : 18
    <8a2>   DW_AT_decl_line   : 176
    <8a3>   DW_AT_decl_column : 17
    <8a4>   DW_AT_type        : <0x2b>
    <8a8>   DW_AT_external    : 1
    <8a9>   DW_AT_declaration : 1
 <1><8aa>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xc82): ioctlent
    <8af>   DW_AT_byte_size   : 8
    <8b0>   DW_AT_decl_file   : 18
    <8b1>   DW_AT_decl_line   : 217
    <8b2>   DW_AT_decl_column : 16
    <8b3>   DW_AT_sibling     : <0x8d6>
 <2><8b7>: Abbrev Number: 9 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0xf2e): symbol
    <8bc>   DW_AT_decl_file   : 18
    <8bd>   DW_AT_decl_line   : 218
    <8be>   DW_AT_decl_column : 14
    <8bf>   DW_AT_type        : <0x1d9>
    <8c3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8c6>: Abbrev Number: 9 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xcf9): code
    <8cb>   DW_AT_decl_file   : 18
    <8cc>   DW_AT_decl_line   : 219
    <8cd>   DW_AT_decl_column : 15
    <8ce>   DW_AT_type        : <0x2b>
    <8d2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8d5>: Abbrev Number: 0
 <1><8d6>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d7>   DW_AT_name        : (indirect string, offset: 0xc43): struct_ioctlent
    <8db>   DW_AT_decl_file   : 18
    <8dc>   DW_AT_decl_line   : 220
    <8dd>   DW_AT_decl_column : 3
    <8de>   DW_AT_type        : <0x8aa>
 <1><8e2>: Abbrev Number: 3 (DW_TAG_const_type)
    <8e3>   DW_AT_type        : <0x8d6>
 <1><8e7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x81d): inject_data
    <8ec>   DW_AT_byte_size   : 10
    <8ed>   DW_AT_decl_file   : 18
    <8ee>   DW_AT_decl_line   : 241
    <8ef>   DW_AT_decl_column : 8
    <8f0>   DW_AT_sibling     : <0x94f>
 <2><8f4>: Abbrev Number: 9 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x4ef): flags
    <8f9>   DW_AT_decl_file   : 18
    <8fa>   DW_AT_decl_line   : 242
    <8fb>   DW_AT_decl_column : 10
    <8fc>   DW_AT_type        : <0xf2>
    <900>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><903>: Abbrev Number: 9 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x938): signo
    <908>   DW_AT_decl_file   : 18
    <909>   DW_AT_decl_line   : 243
    <90a>   DW_AT_decl_column : 10
    <90b>   DW_AT_type        : <0xf2>
    <90f>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><912>: Abbrev Number: 9 (DW_TAG_member)
    <913>   DW_AT_name        : (indirect string, offset: 0x10b): rval_idx
    <917>   DW_AT_decl_file   : 18
    <918>   DW_AT_decl_line   : 244
    <919>   DW_AT_decl_column : 11
    <91a>   DW_AT_type        : <0xfe>
    <91e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><921>: Abbrev Number: 9 (DW_TAG_member)
    <922>   DW_AT_name        : (indirect string, offset: 0xcd6): delay_idx
    <926>   DW_AT_decl_file   : 18
    <927>   DW_AT_decl_line   : 245
    <928>   DW_AT_decl_column : 11
    <929>   DW_AT_type        : <0xfe>
    <92d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><930>: Abbrev Number: 9 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x57b): poke_idx
    <935>   DW_AT_decl_file   : 18
    <936>   DW_AT_decl_line   : 246
    <937>   DW_AT_decl_column : 11
    <938>   DW_AT_type        : <0xfe>
    <93c>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><93f>: Abbrev Number: 9 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0x19b): scno
    <944>   DW_AT_decl_file   : 18
    <945>   DW_AT_decl_line   : 247
    <946>   DW_AT_decl_column : 11
    <947>   DW_AT_type        : <0xfe>
    <94b>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><94e>: Abbrev Number: 0
 <1><94f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <950>   DW_AT_name        : (indirect string, offset: 0xec): inject_opts
    <954>   DW_AT_byte_size   : 16
    <955>   DW_AT_decl_file   : 18
    <956>   DW_AT_decl_line   : 250
    <957>   DW_AT_decl_column : 8
    <958>   DW_AT_sibling     : <0x999>
 <2><95c>: Abbrev Number: 9 (DW_TAG_member)
    <95d>   DW_AT_name        : (indirect string, offset: 0xa28): first
    <961>   DW_AT_decl_file   : 18
    <962>   DW_AT_decl_line   : 251
    <963>   DW_AT_decl_column : 11
    <964>   DW_AT_type        : <0xfe>
    <968>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><96b>: Abbrev Number: 9 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0x10f9): last
    <970>   DW_AT_decl_file   : 18
    <971>   DW_AT_decl_line   : 252
    <972>   DW_AT_decl_column : 11
    <973>   DW_AT_type        : <0xfe>
    <977>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><97a>: Abbrev Number: 9 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x3ba): step
    <97f>   DW_AT_decl_file   : 18
    <980>   DW_AT_decl_line   : 253
    <981>   DW_AT_decl_column : 11
    <982>   DW_AT_type        : <0xfe>
    <986>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><989>: Abbrev Number: 9 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0x10cb): data
    <98e>   DW_AT_decl_file   : 18
    <98f>   DW_AT_decl_line   : 254
    <990>   DW_AT_decl_column : 21
    <991>   DW_AT_type        : <0x8e7>
    <995>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><998>: Abbrev Number: 0
 <1><999>: Abbrev Number: 10 (DW_TAG_array_type)
    <99a>   DW_AT_type        : <0x555>
    <99e>   DW_AT_sibling     : <0x9a9>
 <2><9a2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9a3>   DW_AT_type        : <0x2b>
    <9a7>   DW_AT_upper_bound : 5
 <2><9a8>: Abbrev Number: 0
 <1><9a9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9aa>   DW_AT_name        : (indirect string, offset: 0xf06): staged_output_data
    <9ae>   DW_AT_declaration : 1
 <1><9af>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b0>   DW_AT_byte_size   : 4
    <9b1>   DW_AT_type        : <0x9a9>
 <1><9b5>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9b6>   DW_AT_prototyped  : 1
    <9b7>   DW_AT_sibling     : <0x9c1>
 <2><9bb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9bc>   DW_AT_type        : <0xcd>
 <2><9c0>: Abbrev Number: 0
 <1><9c1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c2>   DW_AT_byte_size   : 4
    <9c3>   DW_AT_type        : <0x9b5>
 <1><9c7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c8>   DW_AT_byte_size   : 4
    <9c9>   DW_AT_type        : <0x87b>
 <1><9cd>: Abbrev Number: 3 (DW_TAG_const_type)
    <9ce>   DW_AT_type        : <0x9c7>
 <1><9d2>: Abbrev Number: 10 (DW_TAG_array_type)
    <9d3>   DW_AT_type        : <0x9e2>
    <9d7>   DW_AT_sibling     : <0x9e2>
 <2><9db>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9dc>   DW_AT_type        : <0x2b>
    <9e0>   DW_AT_upper_bound : 2
 <2><9e1>: Abbrev Number: 0
 <1><9e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e3>   DW_AT_byte_size   : 4
    <9e4>   DW_AT_type        : <0x94f>
 <1><9e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9e9>   DW_AT_name        : (indirect string, offset: 0xb2): mmap_cache_t
    <9ed>   DW_AT_declaration : 1
 <1><9ee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ef>   DW_AT_byte_size   : 4
    <9f0>   DW_AT_type        : <0x9e8>
 <1><9f4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x3d5): tcb_wait_data
    <9f9>   DW_AT_declaration : 1
 <1><9fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9fb>   DW_AT_byte_size   : 4
    <9fc>   DW_AT_type        : <0x9f4>
 <1><a00>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a01>   DW_AT_name        : (indirect string, offset: 0x16f): vcpu_info
    <a05>   DW_AT_declaration : 1
 <1><a06>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a07>   DW_AT_byte_size   : 4
    <a08>   DW_AT_type        : <0xa00>
 <1><a0c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a0d>   DW_AT_name        : (indirect string, offset: 0xeea): unwind_queue_t
    <a11>   DW_AT_declaration : 1
 <1><a12>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a13>   DW_AT_byte_size   : 4
    <a14>   DW_AT_type        : <0xa0c>
 <1><a18>: Abbrev Number: 10 (DW_TAG_array_type)
    <a19>   DW_AT_type        : <0xe6>
    <a1d>   DW_AT_sibling     : <0xa28>
 <2><a21>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a22>   DW_AT_type        : <0x2b>
    <a26>   DW_AT_upper_bound : 15
 <2><a27>: Abbrev Number: 0
 <1><a28>: Abbrev Number: 12 (DW_TAG_variable)
    <a29>   DW_AT_name        : (indirect string, offset: 0xb97): stub_sysent
    <a2d>   DW_AT_decl_file   : 18
    <a2e>   DW_AT_decl_line   : 405
    <a30>   DW_AT_decl_column : 28
    <a31>   DW_AT_type        : <0x87b>
    <a35>   DW_AT_external    : 1
    <a36>   DW_AT_declaration : 1
 <1><a37>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a38>   DW_AT_name        : (indirect string, offset: 0x10ae): xlat_type
    <a3c>   DW_AT_encoding    : 7	(unsigned)
    <a3d>   DW_AT_byte_size   : 4
    <a3e>   DW_AT_type        : <0x2b>
    <a42>   DW_AT_decl_file   : 19
    <a43>   DW_AT_decl_line   : 13
    <a44>   DW_AT_decl_column : 6
    <a45>   DW_AT_sibling     : <0xa5c>
 <2><a49>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x2cf): XT_NORMAL
    <a4e>   DW_AT_const_value : 0
 <2><a4f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a50>   DW_AT_name        : (indirect string, offset: 0xc5a): XT_SORTED
    <a54>   DW_AT_const_value : 1
 <2><a55>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a56>   DW_AT_name        : (indirect string, offset: 0xdc2): XT_INDEXED
    <a5a>   DW_AT_const_value : 2
 <2><a5b>: Abbrev Number: 0
 <1><a5c>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xbc3): xlat_style
    <a61>   DW_AT_encoding    : 7	(unsigned)
    <a62>   DW_AT_byte_size   : 4
    <a63>   DW_AT_type        : <0x2b>
    <a67>   DW_AT_decl_file   : 19
    <a68>   DW_AT_decl_line   : 19
    <a69>   DW_AT_decl_column : 6
    <a6a>   DW_AT_sibling     : <0xa99>
 <2><a6e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6f>   DW_AT_name        : (indirect string, offset: 0xf8): XLAT_STYLE_DEFAULT
    <a73>   DW_AT_const_value : 0
 <2><a74>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a75>   DW_AT_name        : (indirect string, offset: 0xbf6): XLAT_STYLE_RAW
    <a79>   DW_AT_const_value : 1
 <2><a7a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x1079): XLAT_STYLE_ABBREV
    <a7f>   DW_AT_const_value : 2
 <2><a80>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0x2ec): XLAT_STYLE_VERBOSE
    <a85>   DW_AT_const_value : 3
 <2><a86>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a87>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a8b>   DW_AT_const_value : 0
 <2><a8c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a91>   DW_AT_const_value : 4
 <2><a92>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a93>   DW_AT_name        : (indirect string, offset: 0x10e8): XLAT_STYLE_FMT_D
    <a97>   DW_AT_const_value : 8
 <2><a98>: Abbrev Number: 0
 <1><a99>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x333): xlat_data
    <a9e>   DW_AT_byte_size   : 12
    <a9f>   DW_AT_decl_file   : 19
    <aa0>   DW_AT_decl_line   : 51
    <aa1>   DW_AT_decl_column : 8
    <aa2>   DW_AT_sibling     : <0xac5>
 <2><aa6>: Abbrev Number: 18 (DW_TAG_member)
    <aa7>   DW_AT_name        : val
    <aab>   DW_AT_decl_file   : 19
    <aac>   DW_AT_decl_line   : 52
    <aad>   DW_AT_decl_column : 11
    <aae>   DW_AT_type        : <0x116>
    <ab2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ab5>: Abbrev Number: 18 (DW_TAG_member)
    <ab6>   DW_AT_name        : str
    <aba>   DW_AT_decl_file   : 19
    <abb>   DW_AT_decl_line   : 53
    <abc>   DW_AT_decl_column : 14
    <abd>   DW_AT_type        : <0x1d9>
    <ac1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><ac4>: Abbrev Number: 0
 <1><ac5>: Abbrev Number: 3 (DW_TAG_const_type)
    <ac6>   DW_AT_type        : <0xa99>
 <1><aca>: Abbrev Number: 8 (DW_TAG_structure_type)
    <acb>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <acf>   DW_AT_byte_size   : 24
    <ad0>   DW_AT_decl_file   : 19
    <ad1>   DW_AT_decl_line   : 56
    <ad2>   DW_AT_decl_column : 8
    <ad3>   DW_AT_sibling     : <0xb23>
 <2><ad7>: Abbrev Number: 9 (DW_TAG_member)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x10cb): data
    <adc>   DW_AT_decl_file   : 19
    <add>   DW_AT_decl_line   : 57
    <ade>   DW_AT_decl_column : 26
    <adf>   DW_AT_type        : <0xb28>
    <ae3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ae6>: Abbrev Number: 9 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x881): flags_strsz
    <aeb>   DW_AT_decl_file   : 19
    <aec>   DW_AT_decl_line   : 58
    <aed>   DW_AT_decl_column : 9
    <aee>   DW_AT_type        : <0x122>
    <af2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><af5>: Abbrev Number: 9 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0xb68): size
    <afa>   DW_AT_decl_file   : 19
    <afb>   DW_AT_decl_line   : 59
    <afc>   DW_AT_decl_column : 11
    <afd>   DW_AT_type        : <0x10a>
    <b01>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b04>: Abbrev Number: 9 (DW_TAG_member)
    <b05>   DW_AT_name        : (indirect string, offset: 0x1a0): type
    <b09>   DW_AT_decl_file   : 19
    <b0a>   DW_AT_decl_line   : 60
    <b0b>   DW_AT_decl_column : 17
    <b0c>   DW_AT_type        : <0xa37>
    <b10>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b13>: Abbrev Number: 9 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0x749): flags_mask
    <b18>   DW_AT_decl_file   : 19
    <b19>   DW_AT_decl_line   : 61
    <b1a>   DW_AT_decl_column : 11
    <b1b>   DW_AT_type        : <0x116>
    <b1f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b22>: Abbrev Number: 0
 <1><b23>: Abbrev Number: 3 (DW_TAG_const_type)
    <b24>   DW_AT_type        : <0xaca>
 <1><b28>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b29>   DW_AT_byte_size   : 4
    <b2a>   DW_AT_type        : <0xac5>
 <1><b2e>: Abbrev Number: 10 (DW_TAG_array_type)
    <b2f>   DW_AT_type        : <0xb23>
    <b33>   DW_AT_sibling     : <0xb39>
 <2><b37>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b38>: Abbrev Number: 0
 <1><b39>: Abbrev Number: 3 (DW_TAG_const_type)
    <b3a>   DW_AT_type        : <0xb2e>
 <1><b3e>: Abbrev Number: 12 (DW_TAG_variable)
    <b3f>   DW_AT_name        : (indirect string, offset: 0xe33): addrfams
    <b43>   DW_AT_decl_file   : 18
    <b44>   DW_AT_decl_line   : 411
    <b46>   DW_AT_decl_column : 26
    <b47>   DW_AT_type        : <0xb39>
    <b4b>   DW_AT_external    : 1
    <b4c>   DW_AT_declaration : 1
 <1><b4d>: Abbrev Number: 12 (DW_TAG_variable)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xd09): arp_hardware_types
    <b52>   DW_AT_decl_file   : 18
    <b53>   DW_AT_decl_line   : 412
    <b55>   DW_AT_decl_column : 26
    <b56>   DW_AT_type        : <0xb39>
    <b5a>   DW_AT_external    : 1
    <b5b>   DW_AT_declaration : 1
 <1><b5c>: Abbrev Number: 12 (DW_TAG_variable)
    <b5d>   DW_AT_name        : (indirect string, offset: 0xfff): at_flags
    <b61>   DW_AT_decl_file   : 18
    <b62>   DW_AT_decl_line   : 413
    <b64>   DW_AT_decl_column : 26
    <b65>   DW_AT_type        : <0xb39>
    <b69>   DW_AT_external    : 1
    <b6a>   DW_AT_declaration : 1
 <1><b6b>: Abbrev Number: 12 (DW_TAG_variable)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x4b1): clocknames
    <b70>   DW_AT_decl_file   : 18
    <b71>   DW_AT_decl_line   : 414
    <b73>   DW_AT_decl_column : 26
    <b74>   DW_AT_type        : <0xb39>
    <b78>   DW_AT_external    : 1
    <b79>   DW_AT_declaration : 1
 <1><b7a>: Abbrev Number: 12 (DW_TAG_variable)
    <b7b>   DW_AT_name        : (indirect string, offset: 0xfb6): dirent_types
    <b7f>   DW_AT_decl_file   : 18
    <b80>   DW_AT_decl_line   : 415
    <b82>   DW_AT_decl_column : 26
    <b83>   DW_AT_type        : <0xb39>
    <b87>   DW_AT_external    : 1
    <b88>   DW_AT_declaration : 1
 <1><b89>: Abbrev Number: 12 (DW_TAG_variable)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8d2): ethernet_protocols
    <b8e>   DW_AT_decl_file   : 18
    <b8f>   DW_AT_decl_line   : 416
    <b91>   DW_AT_decl_column : 26
    <b92>   DW_AT_type        : <0xb39>
    <b96>   DW_AT_external    : 1
    <b97>   DW_AT_declaration : 1
 <1><b98>: Abbrev Number: 12 (DW_TAG_variable)
    <b99>   DW_AT_name        : (indirect string, offset: 0x5ce): inet_protocols
    <b9d>   DW_AT_decl_file   : 18
    <b9e>   DW_AT_decl_line   : 417
    <ba0>   DW_AT_decl_column : 26
    <ba1>   DW_AT_type        : <0xb39>
    <ba5>   DW_AT_external    : 1
    <ba6>   DW_AT_declaration : 1
 <1><ba7>: Abbrev Number: 12 (DW_TAG_variable)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x2bc): evdev_abs
    <bac>   DW_AT_decl_file   : 18
    <bad>   DW_AT_decl_line   : 418
    <baf>   DW_AT_decl_column : 26
    <bb0>   DW_AT_type        : <0xb39>
    <bb4>   DW_AT_external    : 1
    <bb5>   DW_AT_declaration : 1
 <1><bb6>: Abbrev Number: 12 (DW_TAG_variable)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x73e): audit_arch
    <bbb>   DW_AT_decl_file   : 18
    <bbc>   DW_AT_decl_line   : 419
    <bbe>   DW_AT_decl_column : 26
    <bbf>   DW_AT_type        : <0xb39>
    <bc3>   DW_AT_external    : 1
    <bc4>   DW_AT_declaration : 1
 <1><bc5>: Abbrev Number: 12 (DW_TAG_variable)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x95): evdev_ev
    <bca>   DW_AT_decl_file   : 18
    <bcb>   DW_AT_decl_line   : 420
    <bcd>   DW_AT_decl_column : 26
    <bce>   DW_AT_type        : <0xb39>
    <bd2>   DW_AT_external    : 1
    <bd3>   DW_AT_declaration : 1
 <1><bd4>: Abbrev Number: 12 (DW_TAG_variable)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x489): iffflags
    <bd9>   DW_AT_decl_file   : 18
    <bda>   DW_AT_decl_line   : 421
    <bdc>   DW_AT_decl_column : 26
    <bdd>   DW_AT_type        : <0xb39>
    <be1>   DW_AT_external    : 1
    <be2>   DW_AT_declaration : 1
 <1><be3>: Abbrev Number: 12 (DW_TAG_variable)
    <be4>   DW_AT_name        : (indirect string, offset: 0xc05): ip_type_of_services
    <be8>   DW_AT_decl_file   : 18
    <be9>   DW_AT_decl_line   : 422
    <beb>   DW_AT_decl_column : 26
    <bec>   DW_AT_type        : <0xb39>
    <bf0>   DW_AT_external    : 1
    <bf1>   DW_AT_declaration : 1
 <1><bf2>: Abbrev Number: 12 (DW_TAG_variable)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x6d1): ipc_private
    <bf7>   DW_AT_decl_file   : 18
    <bf8>   DW_AT_decl_line   : 423
    <bfa>   DW_AT_decl_column : 26
    <bfb>   DW_AT_type        : <0xb39>
    <bff>   DW_AT_external    : 1
    <c00>   DW_AT_declaration : 1
 <1><c01>: Abbrev Number: 12 (DW_TAG_variable)
    <c02>   DW_AT_name        : (indirect string, offset: 0x313): msg_flags
    <c06>   DW_AT_decl_file   : 18
    <c07>   DW_AT_decl_line   : 424
    <c09>   DW_AT_decl_column : 26
    <c0a>   DW_AT_type        : <0xb39>
    <c0e>   DW_AT_external    : 1
    <c0f>   DW_AT_declaration : 1
 <1><c10>: Abbrev Number: 12 (DW_TAG_variable)
    <c11>   DW_AT_name        : (indirect string, offset: 0x114): netlink_protocols
    <c15>   DW_AT_decl_file   : 18
    <c16>   DW_AT_decl_line   : 425
    <c18>   DW_AT_decl_column : 26
    <c19>   DW_AT_type        : <0xb39>
    <c1d>   DW_AT_external    : 1
    <c1e>   DW_AT_declaration : 1
 <1><c1f>: Abbrev Number: 12 (DW_TAG_variable)
    <c20>   DW_AT_name        : (indirect string, offset: 0xf19): nl_bridge_vlan_flags
    <c24>   DW_AT_decl_file   : 18
    <c25>   DW_AT_decl_line   : 426
    <c27>   DW_AT_decl_column : 26
    <c28>   DW_AT_type        : <0xb39>
    <c2c>   DW_AT_external    : 1
    <c2d>   DW_AT_declaration : 1
 <1><c2e>: Abbrev Number: 12 (DW_TAG_variable)
    <c2f>   DW_AT_name        : (indirect string, offset: 0xdab): nl_netfilter_msg_types
    <c33>   DW_AT_decl_file   : 18
    <c34>   DW_AT_decl_line   : 427
    <c36>   DW_AT_decl_column : 26
    <c37>   DW_AT_type        : <0xb39>
    <c3b>   DW_AT_external    : 1
    <c3c>   DW_AT_declaration : 1
 <1><c3d>: Abbrev Number: 12 (DW_TAG_variable)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x46b): nl_route_types
    <c42>   DW_AT_decl_file   : 18
    <c43>   DW_AT_decl_line   : 428
    <c45>   DW_AT_decl_column : 26
    <c46>   DW_AT_type        : <0xb39>
    <c4a>   DW_AT_external    : 1
    <c4b>   DW_AT_declaration : 1
 <1><c4c>: Abbrev Number: 12 (DW_TAG_variable)
    <c4d>   DW_AT_name        : (indirect string, offset: 0xe6a): open_access_modes
    <c51>   DW_AT_decl_file   : 18
    <c52>   DW_AT_decl_line   : 429
    <c54>   DW_AT_decl_column : 26
    <c55>   DW_AT_type        : <0xb39>
    <c59>   DW_AT_external    : 1
    <c5a>   DW_AT_declaration : 1
 <1><c5b>: Abbrev Number: 12 (DW_TAG_variable)
    <c5c>   DW_AT_name        : (indirect string, offset: 0x7b): open_mode_flags
    <c60>   DW_AT_decl_file   : 18
    <c61>   DW_AT_decl_line   : 430
    <c63>   DW_AT_decl_column : 26
    <c64>   DW_AT_type        : <0xb39>
    <c68>   DW_AT_external    : 1
    <c69>   DW_AT_declaration : 1
 <1><c6a>: Abbrev Number: 12 (DW_TAG_variable)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xc36): perf_type_id
    <c6f>   DW_AT_decl_file   : 18
    <c70>   DW_AT_decl_line   : 431
    <c72>   DW_AT_decl_column : 26
    <c73>   DW_AT_type        : <0xb39>
    <c77>   DW_AT_external    : 1
    <c78>   DW_AT_declaration : 1
 <1><c79>: Abbrev Number: 12 (DW_TAG_variable)
    <c7a>   DW_AT_name        : (indirect string, offset: 0xe3c): pollflags
    <c7e>   DW_AT_decl_file   : 18
    <c7f>   DW_AT_decl_line   : 432
    <c81>   DW_AT_decl_column : 26
    <c82>   DW_AT_type        : <0xb39>
    <c86>   DW_AT_external    : 1
    <c87>   DW_AT_declaration : 1
 <1><c88>: Abbrev Number: 12 (DW_TAG_variable)
    <c89>   DW_AT_name        : (indirect string, offset: 0x56f): ptrace_cmds
    <c8d>   DW_AT_decl_file   : 18
    <c8e>   DW_AT_decl_line   : 433
    <c90>   DW_AT_decl_column : 26
    <c91>   DW_AT_type        : <0xb39>
    <c95>   DW_AT_external    : 1
    <c96>   DW_AT_declaration : 1
 <1><c97>: Abbrev Number: 12 (DW_TAG_variable)
    <c98>   DW_AT_name        : (indirect string, offset: 0x80e): resource_flags
    <c9c>   DW_AT_decl_file   : 18
    <c9d>   DW_AT_decl_line   : 434
    <c9f>   DW_AT_decl_column : 26
    <ca0>   DW_AT_type        : <0xb39>
    <ca4>   DW_AT_external    : 1
    <ca5>   DW_AT_declaration : 1
 <1><ca6>: Abbrev Number: 12 (DW_TAG_variable)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x292): route_nexthop_flags
    <cab>   DW_AT_decl_file   : 18
    <cac>   DW_AT_decl_line   : 435
    <cae>   DW_AT_decl_column : 26
    <caf>   DW_AT_type        : <0xb39>
    <cb3>   DW_AT_external    : 1
    <cb4>   DW_AT_declaration : 1
 <1><cb5>: Abbrev Number: 12 (DW_TAG_variable)
    <cb6>   DW_AT_name        : (indirect string, offset: 0xea4): routing_protocols
    <cba>   DW_AT_decl_file   : 18
    <cbb>   DW_AT_decl_line   : 436
    <cbd>   DW_AT_decl_column : 26
    <cbe>   DW_AT_type        : <0xb39>
    <cc2>   DW_AT_external    : 1
    <cc3>   DW_AT_declaration : 1
 <1><cc4>: Abbrev Number: 12 (DW_TAG_variable)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x47a): routing_scopes
    <cc9>   DW_AT_decl_file   : 18
    <cca>   DW_AT_decl_line   : 437
    <ccc>   DW_AT_decl_column : 26
    <ccd>   DW_AT_type        : <0xb39>
    <cd1>   DW_AT_external    : 1
    <cd2>   DW_AT_declaration : 1
 <1><cd3>: Abbrev Number: 12 (DW_TAG_variable)
    <cd4>   DW_AT_name        : (indirect string, offset: 0xd99): routing_table_ids
    <cd8>   DW_AT_decl_file   : 18
    <cd9>   DW_AT_decl_line   : 438
    <cdb>   DW_AT_decl_column : 26
    <cdc>   DW_AT_type        : <0xb39>
    <ce0>   DW_AT_external    : 1
    <ce1>   DW_AT_declaration : 1
 <1><ce2>: Abbrev Number: 12 (DW_TAG_variable)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x6a5): routing_types
    <ce7>   DW_AT_decl_file   : 18
    <ce8>   DW_AT_decl_line   : 439
    <cea>   DW_AT_decl_column : 26
    <ceb>   DW_AT_type        : <0xb39>
    <cef>   DW_AT_external    : 1
    <cf0>   DW_AT_declaration : 1
 <1><cf1>: Abbrev Number: 12 (DW_TAG_variable)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x1c4): rwf_flags
    <cf6>   DW_AT_decl_file   : 18
    <cf7>   DW_AT_decl_line   : 440
    <cf9>   DW_AT_decl_column : 26
    <cfa>   DW_AT_type        : <0xb39>
    <cfe>   DW_AT_external    : 1
    <cff>   DW_AT_declaration : 1
 <1><d00>: Abbrev Number: 12 (DW_TAG_variable)
    <d01>   DW_AT_name        : (indirect string, offset: 0x846): seccomp_filter_flags
    <d05>   DW_AT_decl_file   : 18
    <d06>   DW_AT_decl_line   : 441
    <d08>   DW_AT_decl_column : 26
    <d09>   DW_AT_type        : <0xb39>
    <d0d>   DW_AT_external    : 1
    <d0e>   DW_AT_declaration : 1
 <1><d0f>: Abbrev Number: 12 (DW_TAG_variable)
    <d10>   DW_AT_name        : (indirect string, offset: 0x2d9): seccomp_ret_action
    <d14>   DW_AT_decl_file   : 18
    <d15>   DW_AT_decl_line   : 442
    <d17>   DW_AT_decl_column : 26
    <d18>   DW_AT_type        : <0xb39>
    <d1c>   DW_AT_external    : 1
    <d1d>   DW_AT_declaration : 1
 <1><d1e>: Abbrev Number: 12 (DW_TAG_variable)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x446): setns_types
    <d23>   DW_AT_decl_file   : 18
    <d24>   DW_AT_decl_line   : 443
    <d26>   DW_AT_decl_column : 26
    <d27>   DW_AT_type        : <0xb39>
    <d2b>   DW_AT_external    : 1
    <d2c>   DW_AT_declaration : 1
 <1><d2d>: Abbrev Number: 12 (DW_TAG_variable)
    <d2e>   DW_AT_name        : (indirect string, offset: 0xe28): sg_io_info
    <d32>   DW_AT_decl_file   : 18
    <d33>   DW_AT_decl_line   : 444
    <d35>   DW_AT_decl_column : 26
    <d36>   DW_AT_type        : <0xb39>
    <d3a>   DW_AT_external    : 1
    <d3b>   DW_AT_declaration : 1
 <1><d3c>: Abbrev Number: 12 (DW_TAG_variable)
    <d3d>   DW_AT_name        : (indirect string, offset: 0xbab): socketlayers
    <d41>   DW_AT_decl_file   : 18
    <d42>   DW_AT_decl_line   : 445
    <d44>   DW_AT_decl_column : 26
    <d45>   DW_AT_type        : <0xb39>
    <d49>   DW_AT_external    : 1
    <d4a>   DW_AT_declaration : 1
 <1><d4b>: Abbrev Number: 12 (DW_TAG_variable)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xd7d): socktypes
    <d50>   DW_AT_decl_file   : 18
    <d51>   DW_AT_decl_line   : 446
    <d53>   DW_AT_decl_column : 26
    <d54>   DW_AT_type        : <0xb39>
    <d58>   DW_AT_external    : 1
    <d59>   DW_AT_declaration : 1
 <1><d5a>: Abbrev Number: 12 (DW_TAG_variable)
    <d5b>   DW_AT_name        : (indirect string, offset: 0xa7b): tcp_state_flags
    <d5f>   DW_AT_decl_file   : 18
    <d60>   DW_AT_decl_line   : 447
    <d62>   DW_AT_decl_column : 26
    <d63>   DW_AT_type        : <0xb39>
    <d67>   DW_AT_external    : 1
    <d68>   DW_AT_declaration : 1
 <1><d69>: Abbrev Number: 12 (DW_TAG_variable)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x773): tcp_states
    <d6e>   DW_AT_decl_file   : 18
    <d6f>   DW_AT_decl_line   : 448
    <d71>   DW_AT_decl_column : 26
    <d72>   DW_AT_type        : <0xb39>
    <d76>   DW_AT_external    : 1
    <d77>   DW_AT_declaration : 1
 <1><d78>: Abbrev Number: 12 (DW_TAG_variable)
    <d79>   DW_AT_name        : (indirect string, offset: 0x105c): whence_codes
    <d7d>   DW_AT_decl_file   : 18
    <d7e>   DW_AT_decl_line   : 449
    <d80>   DW_AT_decl_column : 26
    <d81>   DW_AT_type        : <0xb39>
    <d85>   DW_AT_external    : 1
    <d86>   DW_AT_declaration : 1
 <1><d87>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d88>   DW_AT_encoding    : 7	(unsigned)
    <d89>   DW_AT_byte_size   : 4
    <d8a>   DW_AT_type        : <0x2b>
    <d8e>   DW_AT_decl_file   : 18
    <d8f>   DW_AT_decl_line   : 510
    <d91>   DW_AT_decl_column : 14
    <d92>   DW_AT_sibling     : <0xda9>
 <2><d96>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d97>   DW_AT_name        : (indirect string, offset: 0x9a2): CFLAG_NONE
    <d9b>   DW_AT_const_value : 0
 <2><d9c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x8e5): CFLAG_ONLY_STATS
    <da1>   DW_AT_const_value : 1
 <2><da2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da3>   DW_AT_name        : (indirect string, offset: 0xbb8): CFLAG_BOTH
    <da7>   DW_AT_const_value : 2
 <2><da8>: Abbrev Number: 0
 <1><da9>: Abbrev Number: 28 (DW_TAG_typedef)
    <daa>   DW_AT_name        : (indirect string, offset: 0x10fe): cflag_t
    <dae>   DW_AT_decl_file   : 18
    <daf>   DW_AT_decl_line   : 514
    <db1>   DW_AT_decl_column : 3
    <db2>   DW_AT_type        : <0xd87>
 <1><db6>: Abbrev Number: 12 (DW_TAG_variable)
    <db7>   DW_AT_name        : (indirect string, offset: 0xcd0): cflag
    <dbb>   DW_AT_decl_file   : 18
    <dbc>   DW_AT_decl_line   : 515
    <dbe>   DW_AT_decl_column : 16
    <dbf>   DW_AT_type        : <0xda9>
    <dc3>   DW_AT_external    : 1
    <dc4>   DW_AT_declaration : 1
 <1><dc5>: Abbrev Number: 12 (DW_TAG_variable)
    <dc6>   DW_AT_name        : (indirect string, offset: 0x18f): Tflag
    <dca>   DW_AT_decl_file   : 18
    <dcb>   DW_AT_decl_line   : 516
    <dcd>   DW_AT_decl_column : 13
    <dce>   DW_AT_type        : <0x525>
    <dd2>   DW_AT_external    : 1
    <dd3>   DW_AT_declaration : 1
 <1><dd4>: Abbrev Number: 12 (DW_TAG_variable)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x7c9): Tflag_scale
    <dd9>   DW_AT_decl_file   : 18
    <dda>   DW_AT_decl_line   : 517
    <ddc>   DW_AT_decl_column : 12
    <ddd>   DW_AT_type        : <0x64>
    <de1>   DW_AT_external    : 1
    <de2>   DW_AT_declaration : 1
 <1><de3>: Abbrev Number: 12 (DW_TAG_variable)
    <de4>   DW_AT_name        : (indirect string, offset: 0x85b): Tflag_width
    <de8>   DW_AT_decl_file   : 18
    <de9>   DW_AT_decl_line   : 518
    <deb>   DW_AT_decl_column : 12
    <dec>   DW_AT_type        : <0x64>
    <df0>   DW_AT_external    : 1
    <df1>   DW_AT_declaration : 1
 <1><df2>: Abbrev Number: 12 (DW_TAG_variable)
    <df3>   DW_AT_name        : (indirect string, offset: 0xe1a): iflag
    <df7>   DW_AT_decl_file   : 18
    <df8>   DW_AT_decl_line   : 519
    <dfa>   DW_AT_decl_column : 13
    <dfb>   DW_AT_type        : <0x525>
    <dff>   DW_AT_external    : 1
    <e00>   DW_AT_declaration : 1
 <1><e01>: Abbrev Number: 12 (DW_TAG_variable)
    <e02>   DW_AT_name        : (indirect string, offset: 0x5af): count_wallclock
    <e06>   DW_AT_decl_file   : 18
    <e07>   DW_AT_decl_line   : 520
    <e09>   DW_AT_decl_column : 13
    <e0a>   DW_AT_type        : <0x525>
    <e0e>   DW_AT_external    : 1
    <e0f>   DW_AT_declaration : 1
 <1><e10>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e11>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e15>   DW_AT_byte_size   : 4
    <e16>   DW_AT_decl_file   : 18
    <e17>   DW_AT_decl_line   : 522
    <e19>   DW_AT_decl_column : 8
    <e1a>   DW_AT_sibling     : <0xe2f>
 <2><e1e>: Abbrev Number: 22 (DW_TAG_member)
    <e1f>   DW_AT_name        : (indirect string, offset: 0xcc): path
    <e23>   DW_AT_decl_file   : 18
    <e24>   DW_AT_decl_line   : 523
    <e26>   DW_AT_decl_column : 14
    <e27>   DW_AT_type        : <0x1d9>
    <e2b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e2e>: Abbrev Number: 0
 <1><e2f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e30>   DW_AT_name        : (indirect string, offset: 0x77e): path_set
    <e34>   DW_AT_byte_size   : 12
    <e35>   DW_AT_decl_file   : 18
    <e36>   DW_AT_decl_line   : 527
    <e38>   DW_AT_decl_column : 15
    <e39>   DW_AT_sibling     : <0xe6e>
 <2><e3d>: Abbrev Number: 22 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x70c): paths_selected
    <e42>   DW_AT_decl_file   : 18
    <e43>   DW_AT_decl_line   : 528
    <e45>   DW_AT_decl_column : 24
    <e46>   DW_AT_type        : <0xe6e>
    <e4a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e4d>: Abbrev Number: 22 (DW_TAG_member)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x104f): num_selected
    <e52>   DW_AT_decl_file   : 18
    <e53>   DW_AT_decl_line   : 529
    <e55>   DW_AT_decl_column : 9
    <e56>   DW_AT_type        : <0x122>
    <e5a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e5d>: Abbrev Number: 22 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0xb68): size
    <e62>   DW_AT_decl_file   : 18
    <e63>   DW_AT_decl_line   : 530
    <e65>   DW_AT_decl_column : 9
    <e66>   DW_AT_type        : <0x122>
    <e6a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e6d>: Abbrev Number: 0
 <1><e6e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6f>   DW_AT_byte_size   : 4
    <e70>   DW_AT_type        : <0xe10>
 <1><e74>: Abbrev Number: 12 (DW_TAG_variable)
    <e75>   DW_AT_name        : (indirect string, offset: 0x109e): global_path_set
    <e79>   DW_AT_decl_file   : 18
    <e7a>   DW_AT_decl_line   : 531
    <e7c>   DW_AT_decl_column : 3
    <e7d>   DW_AT_type        : <0xe2f>
    <e81>   DW_AT_external    : 1
    <e82>   DW_AT_declaration : 1
 <1><e83>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e84>   DW_AT_name        : (indirect string, offset: 0xf91): xflag_opts
    <e88>   DW_AT_encoding    : 7	(unsigned)
    <e89>   DW_AT_byte_size   : 4
    <e8a>   DW_AT_type        : <0x2b>
    <e8e>   DW_AT_decl_file   : 18
    <e8f>   DW_AT_decl_line   : 533
    <e91>   DW_AT_decl_column : 6
    <e92>   DW_AT_sibling     : <0xeb5>
 <2><e96>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0xa1c): HEXSTR_NONE
    <e9b>   DW_AT_const_value : 0
 <2><e9c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9d>   DW_AT_name        : (indirect string, offset: 0xfe1): HEXSTR_NON_ASCII
    <ea1>   DW_AT_const_value : 1
 <2><ea2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x923): HEXSTR_ALL
    <ea7>   DW_AT_const_value : 2
 <2><ea8>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x68e): HEXSTR_NON_ASCII_CHARS
    <ead>   DW_AT_const_value : 3
 <2><eae>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x1069): NUM_HEXSTR_OPTS
    <eb3>   DW_AT_const_value : 4
 <2><eb4>: Abbrev Number: 0
 <1><eb5>: Abbrev Number: 12 (DW_TAG_variable)
    <eb6>   DW_AT_name        : (indirect string, offset: 0xdf4): xflag
    <eba>   DW_AT_decl_file   : 18
    <ebb>   DW_AT_decl_line   : 546
    <ebd>   DW_AT_decl_column : 17
    <ebe>   DW_AT_type        : <0x2b>
    <ec2>   DW_AT_external    : 1
    <ec3>   DW_AT_declaration : 1
 <1><ec4>: Abbrev Number: 12 (DW_TAG_variable)
    <ec5>   DW_AT_name        : (indirect string, offset: 0xc8b): followfork
    <ec9>   DW_AT_decl_file   : 18
    <eca>   DW_AT_decl_line   : 547
    <ecc>   DW_AT_decl_column : 13
    <ecd>   DW_AT_type        : <0x525>
    <ed1>   DW_AT_external    : 1
    <ed2>   DW_AT_declaration : 1
 <1><ed3>: Abbrev Number: 12 (DW_TAG_variable)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x33d): output_separately
    <ed8>   DW_AT_decl_file   : 18
    <ed9>   DW_AT_decl_line   : 548
    <edb>   DW_AT_decl_column : 13
    <edc>   DW_AT_type        : <0x525>
    <ee0>   DW_AT_external    : 1
    <ee1>   DW_AT_declaration : 1
 <1><ee2>: Abbrev Number: 12 (DW_TAG_variable)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x22b): stack_trace_enabled
    <ee7>   DW_AT_decl_file   : 18
    <ee8>   DW_AT_decl_line   : 551
    <eea>   DW_AT_decl_column : 13
    <eeb>   DW_AT_type        : <0x525>
    <eef>   DW_AT_external    : 1
    <ef0>   DW_AT_declaration : 1
 <1><ef1>: Abbrev Number: 12 (DW_TAG_variable)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x674): ptrace_setoptions
    <ef6>   DW_AT_decl_file   : 18
    <ef7>   DW_AT_decl_line   : 555
    <ef9>   DW_AT_decl_column : 17
    <efa>   DW_AT_type        : <0x2b>
    <efe>   DW_AT_external    : 1
    <eff>   DW_AT_declaration : 1
 <1><f00>: Abbrev Number: 12 (DW_TAG_variable)
    <f01>   DW_AT_name        : (indirect string, offset: 0xa11): max_strlen
    <f05>   DW_AT_decl_file   : 18
    <f06>   DW_AT_decl_line   : 556
    <f08>   DW_AT_decl_column : 17
    <f09>   DW_AT_type        : <0x2b>
    <f0d>   DW_AT_external    : 1
    <f0e>   DW_AT_declaration : 1
 <1><f0f>: Abbrev Number: 12 (DW_TAG_variable)
    <f10>   DW_AT_name        : (indirect string, offset: 0xa55): os_release
    <f14>   DW_AT_decl_file   : 18
    <f15>   DW_AT_decl_line   : 557
    <f17>   DW_AT_decl_column : 17
    <f18>   DW_AT_type        : <0x2b>
    <f1c>   DW_AT_external    : 1
    <f1d>   DW_AT_declaration : 1
 <1><f1e>: Abbrev Number: 12 (DW_TAG_variable)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x71b): xlat_verbosity
    <f23>   DW_AT_decl_file   : 18
    <f24>   DW_AT_decl_line   : 919
    <f26>   DW_AT_decl_column : 24
    <f27>   DW_AT_type        : <0xa5c>
    <f2b>   DW_AT_external    : 1
    <f2c>   DW_AT_declaration : 1
 <1><f2d>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x592): xlat_style_private_flag_bits
    <f32>   DW_AT_encoding    : 7	(unsigned)
    <f33>   DW_AT_byte_size   : 4
    <f34>   DW_AT_type        : <0x2b>
    <f38>   DW_AT_decl_file   : 18
    <f39>   DW_AT_decl_line   : 939
    <f3b>   DW_AT_decl_column : 6
    <f3c>   DW_AT_sibling     : <0xf59>
 <2><f40>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f41>   DW_AT_name        : (indirect string, offset: 0x2a6): PAF_PRINT_INDICES_BIT
    <f45>   DW_AT_const_value : 5
 <2><f46>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f47>   DW_AT_name        : (indirect string, offset: 0xb1f): PAF_ARRAY_TRUNCATED_BIT
    <f4b>   DW_AT_const_value : 6
 <2><f4c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x406): PXF_DEFAULT_STR_BIT
    <f51>   DW_AT_const_value : 7
 <2><f52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f53>   DW_AT_name        : (indirect string, offset: 0xc6d): SPFF_AUXSTR_MODE_BIT
    <f57>   DW_AT_const_value : 8
 <2><f58>: Abbrev Number: 0
 <1><f59>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xd1c): find_xlat_flag_bits
    <f5e>   DW_AT_encoding    : 7	(unsigned)
    <f5f>   DW_AT_byte_size   : 4
    <f60>   DW_AT_type        : <0x2b>
    <f64>   DW_AT_decl_file   : 18
    <f65>   DW_AT_decl_line   : 1443
    <f67>   DW_AT_decl_column : 6
    <f68>   DW_AT_sibling     : <0xf73>
 <2><f6c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x960): FXL_CASE_SENSITIVE_BIT
    <f71>   DW_AT_const_value : 0
 <2><f72>: Abbrev Number: 0
 <1><f73>: Abbrev Number: 12 (DW_TAG_variable)
    <f74>   DW_AT_name        : (indirect string, offset: 0x9ed): printing_tcp
    <f78>   DW_AT_decl_file   : 18
    <f79>   DW_AT_decl_line   : 1689
    <f7b>   DW_AT_decl_column : 20
    <f7c>   DW_AT_type        : <0x601>
    <f80>   DW_AT_external    : 1
    <f81>   DW_AT_declaration : 1
 <1><f82>: Abbrev Number: 12 (DW_TAG_variable)
    <f83>   DW_AT_name        : (indirect string, offset: 0x55a): errnoent
    <f87>   DW_AT_decl_file   : 18
    <f88>   DW_AT_decl_line   : 1887
    <f8a>   DW_AT_decl_column : 26
    <f8b>   DW_AT_type        : <0x459>
    <f8f>   DW_AT_external    : 1
    <f90>   DW_AT_declaration : 1
 <1><f91>: Abbrev Number: 12 (DW_TAG_variable)
    <f92>   DW_AT_name        : (indirect string, offset: 0x867): signalent
    <f96>   DW_AT_decl_file   : 18
    <f97>   DW_AT_decl_line   : 1888
    <f99>   DW_AT_decl_column : 26
    <f9a>   DW_AT_type        : <0x459>
    <f9e>   DW_AT_external    : 1
    <f9f>   DW_AT_declaration : 1
 <1><fa0>: Abbrev Number: 12 (DW_TAG_variable)
    <fa1>   DW_AT_name        : (indirect string, offset: 0xe62): nerrnos
    <fa5>   DW_AT_decl_file   : 18
    <fa6>   DW_AT_decl_line   : 1889
    <fa8>   DW_AT_decl_column : 27
    <fa9>   DW_AT_type        : <0x32>
    <fad>   DW_AT_external    : 1
    <fae>   DW_AT_declaration : 1
 <1><faf>: Abbrev Number: 12 (DW_TAG_variable)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x1038): nsignals
    <fb4>   DW_AT_decl_file   : 18
    <fb5>   DW_AT_decl_line   : 1890
    <fb7>   DW_AT_decl_column : 27
    <fb8>   DW_AT_type        : <0x32>
    <fbc>   DW_AT_external    : 1
    <fbd>   DW_AT_declaration : 1
 <1><fbe>: Abbrev Number: 10 (DW_TAG_array_type)
    <fbf>   DW_AT_type        : <0x87b>
    <fc3>   DW_AT_sibling     : <0xfc9>
 <2><fc7>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fca>   DW_AT_type        : <0xfbe>
 <1><fce>: Abbrev Number: 12 (DW_TAG_variable)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xce7): sysent0
    <fd3>   DW_AT_decl_file   : 18
    <fd4>   DW_AT_decl_line   : 1892
    <fd6>   DW_AT_decl_column : 28
    <fd7>   DW_AT_type        : <0xfc9>
    <fdb>   DW_AT_external    : 1
    <fdc>   DW_AT_declaration : 1
 <1><fdd>: Abbrev Number: 10 (DW_TAG_array_type)
    <fde>   DW_AT_type        : <0x8e2>
    <fe2>   DW_AT_sibling     : <0xfe8>
 <2><fe6>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fe7>: Abbrev Number: 0
 <1><fe8>: Abbrev Number: 3 (DW_TAG_const_type)
    <fe9>   DW_AT_type        : <0xfdd>
 <1><fed>: Abbrev Number: 12 (DW_TAG_variable)
    <fee>   DW_AT_name        : (indirect string, offset: 0x1094): ioctlent0
    <ff2>   DW_AT_decl_file   : 18
    <ff3>   DW_AT_decl_line   : 1893
    <ff5>   DW_AT_decl_column : 30
    <ff6>   DW_AT_type        : <0xfe8>
    <ffa>   DW_AT_external    : 1
    <ffb>   DW_AT_declaration : 1
 <1><ffc>: Abbrev Number: 12 (DW_TAG_variable)
    <ffd>   DW_AT_name        : (indirect string, offset: 0xf9c): personality_names
    <1001>   DW_AT_decl_file   : 18
    <1002>   DW_AT_decl_line   : 1895
    <1004>   DW_AT_decl_column : 26
    <1005>   DW_AT_type        : <0x459>
    <1009>   DW_AT_external    : 1
    <100a>   DW_AT_declaration : 1
 <1><100b>: Abbrev Number: 12 (DW_TAG_variable)
    <100c>   DW_AT_name        : (indirect string, offset: 0x88d): sysent
    <1010>   DW_AT_decl_file   : 18
    <1011>   DW_AT_decl_line   : 1898
    <1013>   DW_AT_decl_column : 29
    <1014>   DW_AT_type        : <0x9c7>
    <1018>   DW_AT_external    : 1
    <1019>   DW_AT_declaration : 1
 <1><101a>: Abbrev Number: 12 (DW_TAG_variable)
    <101b>   DW_AT_name        : (indirect string, offset: 0xc82): ioctlent
    <101f>   DW_AT_decl_file   : 18
    <1020>   DW_AT_decl_line   : 1899
    <1022>   DW_AT_decl_column : 31
    <1023>   DW_AT_type        : <0x1029>
    <1027>   DW_AT_external    : 1
    <1028>   DW_AT_declaration : 1
 <1><1029>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <102a>   DW_AT_byte_size   : 4
    <102b>   DW_AT_type        : <0x8e2>
 <1><102f>: Abbrev Number: 12 (DW_TAG_variable)
    <1030>   DW_AT_name        : (indirect string, offset: 0x877): nsyscalls
    <1034>   DW_AT_decl_file   : 18
    <1035>   DW_AT_decl_line   : 1905
    <1037>   DW_AT_decl_column : 17
    <1038>   DW_AT_type        : <0x2b>
    <103c>   DW_AT_external    : 1
    <103d>   DW_AT_declaration : 1
 <1><103e>: Abbrev Number: 12 (DW_TAG_variable)
    <103f>   DW_AT_name        : (indirect string, offset: 0xe90): nioctlents
    <1043>   DW_AT_decl_file   : 18
    <1044>   DW_AT_decl_line   : 1906
    <1046>   DW_AT_decl_column : 17
    <1047>   DW_AT_type        : <0x2b>
    <104b>   DW_AT_external    : 1
    <104c>   DW_AT_declaration : 1
 <1><104d>: Abbrev Number: 10 (DW_TAG_array_type)
    <104e>   DW_AT_type        : <0x32>
    <1052>   DW_AT_sibling     : <0x105d>
 <2><1056>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1057>   DW_AT_type        : <0x2b>
    <105b>   DW_AT_upper_bound : 2
 <2><105c>: Abbrev Number: 0
 <1><105d>: Abbrev Number: 3 (DW_TAG_const_type)
    <105e>   DW_AT_type        : <0x104d>
 <1><1062>: Abbrev Number: 12 (DW_TAG_variable)
    <1063>   DW_AT_name        : (indirect string, offset: 0xef9): nsyscall_vec
    <1067>   DW_AT_decl_file   : 18
    <1068>   DW_AT_decl_line   : 1908
    <106a>   DW_AT_decl_column : 27
    <106b>   DW_AT_type        : <0x105d>
    <106f>   DW_AT_external    : 1
    <1070>   DW_AT_declaration : 1
 <1><1071>: Abbrev Number: 10 (DW_TAG_array_type)
    <1072>   DW_AT_type        : <0x9cd>
    <1076>   DW_AT_sibling     : <0x1081>
 <2><107a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <107b>   DW_AT_type        : <0x2b>
    <107f>   DW_AT_upper_bound : 2
 <2><1080>: Abbrev Number: 0
 <1><1081>: Abbrev Number: 3 (DW_TAG_const_type)
    <1082>   DW_AT_type        : <0x1071>
 <1><1086>: Abbrev Number: 12 (DW_TAG_variable)
    <1087>   DW_AT_name        : (indirect string, offset: 0x7b6): sysent_vec
    <108b>   DW_AT_decl_file   : 18
    <108c>   DW_AT_decl_line   : 1909
    <108e>   DW_AT_decl_column : 35
    <108f>   DW_AT_type        : <0x1081>
    <1093>   DW_AT_external    : 1
    <1094>   DW_AT_declaration : 1
 <1><1095>: Abbrev Number: 12 (DW_TAG_variable)
    <1096>   DW_AT_name        : (indirect string, offset: 0x396): inject_vec
    <109a>   DW_AT_decl_file   : 18
    <109b>   DW_AT_decl_line   : 1910
    <109d>   DW_AT_decl_column : 28
    <109e>   DW_AT_type        : <0x9d2>
    <10a2>   DW_AT_external    : 1
    <10a3>   DW_AT_declaration : 1
 <1><10a4>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10a5>   DW_AT_name        : (indirect string, offset: 0xd70): audit_arch_t
    <10a9>   DW_AT_byte_size   : 8
    <10aa>   DW_AT_decl_file   : 18
    <10ab>   DW_AT_decl_line   : 1912
    <10ad>   DW_AT_decl_column : 8
    <10ae>   DW_AT_sibling     : <0x10d3>
 <2><10b2>: Abbrev Number: 22 (DW_TAG_member)
    <10b3>   DW_AT_name        : (indirect string, offset: 0x584): arch
    <10b7>   DW_AT_decl_file   : 18
    <10b8>   DW_AT_decl_line   : 1913
    <10ba>   DW_AT_decl_column : 15
    <10bb>   DW_AT_type        : <0x2b>
    <10bf>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c2>: Abbrev Number: 22 (DW_TAG_member)
    <10c3>   DW_AT_name        : (indirect string, offset: 0x9d3): flag
    <10c7>   DW_AT_decl_file   : 18
    <10c8>   DW_AT_decl_line   : 1914
    <10ca>   DW_AT_decl_column : 15
    <10cb>   DW_AT_type        : <0x2b>
    <10cf>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10d2>: Abbrev Number: 0
 <1><10d3>: Abbrev Number: 3 (DW_TAG_const_type)
    <10d4>   DW_AT_type        : <0x10a4>
 <1><10d8>: Abbrev Number: 10 (DW_TAG_array_type)
    <10d9>   DW_AT_type        : <0x10d3>
    <10dd>   DW_AT_sibling     : <0x10e8>
 <2><10e1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <10e2>   DW_AT_type        : <0x2b>
    <10e6>   DW_AT_upper_bound : 2
 <2><10e7>: Abbrev Number: 0
 <1><10e8>: Abbrev Number: 3 (DW_TAG_const_type)
    <10e9>   DW_AT_type        : <0x10d8>
 <1><10ed>: Abbrev Number: 12 (DW_TAG_variable)
    <10ee>   DW_AT_name        : (indirect string, offset: 0x951): audit_arch_vec
    <10f2>   DW_AT_decl_file   : 18
    <10f3>   DW_AT_decl_line   : 1917
    <10f5>   DW_AT_decl_column : 34
    <10f6>   DW_AT_type        : <0x10e8>
    <10fa>   DW_AT_external    : 1
    <10fb>   DW_AT_declaration : 1
 <1><10fc>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10fd>   DW_AT_byte_size   : 180
    <10fe>   DW_AT_decl_file   : 20
    <10ff>   DW_AT_decl_line   : 2
    <1100>   DW_AT_decl_column : 9
    <1101>   DW_AT_sibling     : <0x13b6>
 <2><1105>: Abbrev Number: 9 (DW_TAG_member)
    <1106>   DW_AT_name        : (indirect string, offset: 0x1dc): block_ioctl
    <110a>   DW_AT_decl_file   : 20
    <110b>   DW_AT_decl_line   : 3
    <110c>   DW_AT_decl_column : 8
    <110d>   DW_AT_type        : <0x13d0>
    <1111>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1114>: Abbrev Number: 9 (DW_TAG_member)
    <1115>   DW_AT_name        : (indirect string, offset: 0xab4): btrfs_ioctl
    <1119>   DW_AT_decl_file   : 20
    <111a>   DW_AT_decl_line   : 6
    <111b>   DW_AT_decl_column : 8
    <111c>   DW_AT_type        : <0x13d0>
    <1120>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1123>: Abbrev Number: 9 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0x754): evdev_write_ioctl_mpers
    <1128>   DW_AT_decl_file   : 20
    <1129>   DW_AT_decl_line   : 9
    <112a>   DW_AT_decl_column : 8
    <112b>   DW_AT_type        : <0x13d0>
    <112f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1132>: Abbrev Number: 9 (DW_TAG_member)
    <1133>   DW_AT_name        : (indirect string, offset: 0x72a): get_sock_fprog_size
    <1137>   DW_AT_decl_file   : 20
    <1138>   DW_AT_decl_line   : 12
    <1139>   DW_AT_decl_column : 17
    <113a>   DW_AT_type        : <0x13dc>
    <113e>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1141>: Abbrev Number: 9 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0x1ab): fetch_bpf_fprog
    <1146>   DW_AT_decl_file   : 20
    <1147>   DW_AT_decl_line   : 15
    <1148>   DW_AT_decl_column : 10
    <1149>   DW_AT_type        : <0x13fc>
    <114d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1150>: Abbrev Number: 9 (DW_TAG_member)
