Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x168d (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5ba): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x4e): mpers-m32/tms_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa09): /home/sanggu/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x397): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfc1): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x95f): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <54>   DW_AT_name        : (indirect string, offset: 0xdb5): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x466): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x85a): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe99): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x88a): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x765): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb3e): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb7c): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2b0): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcc8): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x9ed): __clock_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 156
    <c8>   DW_AT_decl_column : 27
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xc3d): __time_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 160
    <d4>   DW_AT_decl_column : 26
    <d5>   DW_AT_type        : <0xae>
 <1><d9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
 <1><db>: Abbrev Number: 3 (DW_TAG_const_type)
    <dc>   DW_AT_type        : <0xd9>
 <1><e0>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1>   DW_AT_name        : (indirect string, offset: 0x3e3): __syscall_slong_t
    <e5>   DW_AT_decl_file   : 1
    <e6>   DW_AT_decl_line   : 196
    <e7>   DW_AT_decl_column : 33
    <e8>   DW_AT_type        : <0xae>
 <1><ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed>   DW_AT_byte_size   : 4
    <ee>   DW_AT_type        : <0xf2>
 <1><f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3>   DW_AT_byte_size   : 1
    <f4>   DW_AT_encoding    : 6	(signed char)
    <f5>   DW_AT_name        : (indirect string, offset: 0x42f): char
 <1><f9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fa>   DW_AT_type        : <0xf2>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x346): uint8_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 24
    <105>   DW_AT_decl_column : 19
    <106>   DW_AT_type        : <0x45>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xb67): uint16_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 25
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x58>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xf41): uint32_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 26
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x70>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xdc5): uint64_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 27
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x8f>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0xb55): clock_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 7
    <135>   DW_AT_decl_column : 19
    <136>   DW_AT_type        : <0xc1>
 <1><13a>: Abbrev Number: 4 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <13f>   DW_AT_decl_file   : 4
    <140>   DW_AT_decl_line   : 209
    <141>   DW_AT_decl_column : 23
    <142>   DW_AT_type        : <0x2b>
 <1><146>: Abbrev Number: 3 (DW_TAG_const_type)
    <147>   DW_AT_type        : <0x13a>
 <1><14b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <14c>   DW_AT_name        : (indirect string, offset: 0xae7): timespec
    <150>   DW_AT_byte_size   : 8
    <151>   DW_AT_decl_file   : 5
    <152>   DW_AT_decl_line   : 10
    <153>   DW_AT_decl_column : 8
    <154>   DW_AT_sibling     : <0x177>
 <2><158>: Abbrev Number: 9 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x108e): tv_sec
    <15d>   DW_AT_decl_file   : 5
    <15e>   DW_AT_decl_line   : 12
    <15f>   DW_AT_decl_column : 12
    <160>   DW_AT_type        : <0xcd>
    <164>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><167>: Abbrev Number: 9 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0xdeb): tv_nsec
    <16c>   DW_AT_decl_file   : 5
    <16d>   DW_AT_decl_line   : 16
    <16e>   DW_AT_decl_column : 21
    <16f>   DW_AT_type        : <0xe0>
    <173>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><176>: Abbrev Number: 0
 <1><177>: Abbrev Number: 2 (DW_TAG_base_type)
    <178>   DW_AT_byte_size   : 12
    <179>   DW_AT_encoding    : 4	(float)
    <17a>   DW_AT_name        : (indirect string, offset: 0xaa9): long double
 <1><17e>: Abbrev Number: 2 (DW_TAG_base_type)
    <17f>   DW_AT_byte_size   : 16
    <180>   DW_AT_encoding    : 4	(float)
    <181>   DW_AT_name        : (indirect string, offset: 0xf7c): _Float128
 <1><185>: Abbrev Number: 10 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0x267): __environ
    <18a>   DW_AT_decl_file   : 6
    <18b>   DW_AT_decl_line   : 543
    <18d>   DW_AT_decl_column : 15
    <18e>   DW_AT_type        : <0x194>
    <192>   DW_AT_external    : 1
    <193>   DW_AT_declaration : 1
 <1><194>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <195>   DW_AT_byte_size   : 4
    <196>   DW_AT_type        : <0xec>
 <1><19a>: Abbrev Number: 10 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0x38f): environ
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 545
    <1a2>   DW_AT_decl_column : 15
    <1a3>   DW_AT_type        : <0x194>
    <1a7>   DW_AT_external    : 1
    <1a8>   DW_AT_declaration : 1
 <1><1a9>: Abbrev Number: 11 (DW_TAG_variable)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xfab): optarg
    <1ae>   DW_AT_decl_file   : 7
    <1af>   DW_AT_decl_line   : 36
    <1b0>   DW_AT_decl_column : 14
    <1b1>   DW_AT_type        : <0xec>
    <1b5>   DW_AT_external    : 1
    <1b6>   DW_AT_declaration : 1
 <1><1b7>: Abbrev Number: 11 (DW_TAG_variable)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x738): optind
    <1bc>   DW_AT_decl_file   : 7
    <1bd>   DW_AT_decl_line   : 50
    <1be>   DW_AT_decl_column : 12
    <1bf>   DW_AT_type        : <0x64>
    <1c3>   DW_AT_external    : 1
    <1c4>   DW_AT_declaration : 1
 <1><1c5>: Abbrev Number: 11 (DW_TAG_variable)
    <1c6>   DW_AT_name        : (indirect string, offset: 0xc2c): opterr
    <1ca>   DW_AT_decl_file   : 7
    <1cb>   DW_AT_decl_line   : 55
    <1cc>   DW_AT_decl_column : 12
    <1cd>   DW_AT_type        : <0x64>
    <1d1>   DW_AT_external    : 1
    <1d2>   DW_AT_declaration : 1
 <1><1d3>: Abbrev Number: 11 (DW_TAG_variable)
    <1d4>   DW_AT_name        : (indirect string, offset: 0xb24): optopt
    <1d8>   DW_AT_decl_file   : 7
    <1d9>   DW_AT_decl_line   : 59
    <1da>   DW_AT_decl_column : 12
    <1db>   DW_AT_type        : <0x64>
    <1df>   DW_AT_external    : 1
    <1e0>   DW_AT_declaration : 1
 <1><1e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e2>   DW_AT_byte_size   : 4
    <1e3>   DW_AT_type        : <0xf9>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e8>   DW_AT_type        : <0x1e1>
 <1><1ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ed>   DW_AT_byte_size   : 4
    <1ee>   DW_AT_type        : <0x1f2>
 <1><1f2>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1f3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x34e): _IO_FILE
    <1f8>   DW_AT_byte_size   : 148
    <1f9>   DW_AT_decl_file   : 8
    <1fa>   DW_AT_decl_line   : 49
    <1fb>   DW_AT_decl_column : 8
    <1fc>   DW_AT_sibling     : <0x3b4>
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x9db): _flags
    <205>   DW_AT_decl_file   : 8
    <206>   DW_AT_decl_line   : 51
    <207>   DW_AT_decl_column : 7
    <208>   DW_AT_type        : <0x64>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x4be): _IO_read_ptr
    <214>   DW_AT_decl_file   : 8
    <215>   DW_AT_decl_line   : 54
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xec>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0xeee): _IO_read_end
    <223>   DW_AT_decl_file   : 8
    <224>   DW_AT_decl_line   : 55
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xec>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x7a1): _IO_read_base
    <232>   DW_AT_decl_file   : 8
    <233>   DW_AT_decl_line   : 56
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xec>
    <239>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x12d): _IO_write_base
    <241>   DW_AT_decl_file   : 8
    <242>   DW_AT_decl_line   : 57
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xec>
    <248>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0xffa): _IO_write_ptr
    <250>   DW_AT_decl_file   : 8
    <251>   DW_AT_decl_line   : 58
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xec>
    <257>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x8cc): _IO_write_end
    <25f>   DW_AT_decl_file   : 8
    <260>   DW_AT_decl_line   : 59
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xec>
    <266>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x948): _IO_buf_base
    <26e>   DW_AT_decl_file   : 8
    <26f>   DW_AT_decl_line   : 60
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xec>
    <275>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0xd60): _IO_buf_end
    <27d>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 61
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xec>
    <284>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x1be): _IO_save_base
    <28c>   DW_AT_decl_file   : 8
    <28d>   DW_AT_decl_line   : 64
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xec>
    <293>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xc8f): _IO_backup_base
    <29b>   DW_AT_decl_file   : 8
    <29c>   DW_AT_decl_line   : 65
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xec>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <2aa>   DW_AT_decl_file   : 8
    <2ab>   DW_AT_decl_line   : 66
    <2ac>   DW_AT_decl_column : 9
    <2ad>   DW_AT_type        : <0xec>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x55c): _markers
    <2b9>   DW_AT_decl_file   : 8
    <2ba>   DW_AT_decl_line   : 68
    <2bb>   DW_AT_decl_column : 22
    <2bc>   DW_AT_type        : <0x3ce>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x201): _chain
    <2c8>   DW_AT_decl_file   : 8
    <2c9>   DW_AT_decl_line   : 70
    <2ca>   DW_AT_decl_column : 20
    <2cb>   DW_AT_type        : <0x3d4>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xf67): _fileno
    <2d7>   DW_AT_decl_file   : 8
    <2d8>   DW_AT_decl_line   : 72
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x78d): _flags2
    <2e6>   DW_AT_decl_file   : 8
    <2e7>   DW_AT_decl_line   : 73
    <2e8>   DW_AT_decl_column : 7
    <2e9>   DW_AT_type        : <0x64>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x806): _old_offset
    <2f5>   DW_AT_decl_file   : 8
    <2f6>   DW_AT_decl_line   : 74
    <2f7>   DW_AT_decl_column : 11
    <2f8>   DW_AT_type        : <0xa2>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x22f): _cur_column
    <304>   DW_AT_decl_file   : 8
    <305>   DW_AT_decl_line   : 77
    <306>   DW_AT_decl_column : 18
    <307>   DW_AT_type        : <0x24>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xe11): _vtable_offset
    <313>   DW_AT_decl_file   : 8
    <314>   DW_AT_decl_line   : 78
    <315>   DW_AT_decl_column : 15
    <316>   DW_AT_type        : <0x3e>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0xc9f): _shortbuf
    <322>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 79
    <324>   DW_AT_decl_column : 8
    <325>   DW_AT_type        : <0x3da>
    <329>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x16e): _lock
    <331>   DW_AT_decl_file   : 8
    <332>   DW_AT_decl_line   : 81
    <333>   DW_AT_decl_column : 15
    <334>   DW_AT_type        : <0x3ea>
    <338>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x6d0): _offset
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 89
    <342>   DW_AT_decl_column : 13
    <343>   DW_AT_type        : <0xb5>
    <347>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xa3b): _codecvt
    <34f>   DW_AT_decl_file   : 8
    <350>   DW_AT_decl_line   : 91
    <351>   DW_AT_decl_column : 23
    <352>   DW_AT_type        : <0x3f6>
    <356>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xf8f): _wide_data
    <35e>   DW_AT_decl_file   : 8
    <35f>   DW_AT_decl_line   : 92
    <360>   DW_AT_decl_column : 25
    <361>   DW_AT_type        : <0x402>
    <365>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x3b3): _freeres_list
    <36d>   DW_AT_decl_file   : 8
    <36e>   DW_AT_decl_line   : 93
    <36f>   DW_AT_decl_column : 20
    <370>   DW_AT_type        : <0x3d4>
    <374>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0xc02): _freeres_buf
    <37c>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 94
    <37e>   DW_AT_decl_column : 9
    <37f>   DW_AT_type        : <0xd9>
    <383>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x99d): __pad5
    <38b>   DW_AT_decl_file   : 8
    <38c>   DW_AT_decl_line   : 95
    <38d>   DW_AT_decl_column : 10
    <38e>   DW_AT_type        : <0x13a>
    <392>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x24e): _mode
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 96
    <39c>   DW_AT_decl_column : 7
    <39d>   DW_AT_type        : <0x64>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
    <3a5>   DW_AT_name        : (indirect string, offset: 0x7bb): _unused2
    <3a9>   DW_AT_decl_file   : 8
    <3aa>   DW_AT_decl_line   : 98
    <3ab>   DW_AT_decl_column : 8
    <3ac>   DW_AT_type        : <0x408>
    <3b0>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3b3>: Abbrev Number: 0
 <1><3b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xac9): FILE
    <3b9>   DW_AT_decl_file   : 9
    <3ba>   DW_AT_decl_line   : 7
    <3bb>   DW_AT_decl_column : 25
    <3bc>   DW_AT_type        : <0x1f3>
 <1><3c0>: Abbrev Number: 13 (DW_TAG_typedef)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x45b): _IO_lock_t
    <3c5>   DW_AT_decl_file   : 8
    <3c6>   DW_AT_decl_line   : 43
    <3c7>   DW_AT_decl_column : 14
 <1><3c8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x2f2): _IO_marker
    <3cd>   DW_AT_declaration : 1
 <1><3ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 4
    <3d0>   DW_AT_type        : <0x3c8>
 <1><3d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d5>   DW_AT_byte_size   : 4
    <3d6>   DW_AT_type        : <0x1f3>
 <1><3da>: Abbrev Number: 15 (DW_TAG_array_type)
    <3db>   DW_AT_type        : <0xf2>
    <3df>   DW_AT_sibling     : <0x3ea>
 <2><3e3>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3e4>   DW_AT_type        : <0x2b>
    <3e8>   DW_AT_upper_bound : 0
 <2><3e9>: Abbrev Number: 0
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3c0>
 <1><3f0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3f5>   DW_AT_declaration : 1
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x3f0>
 <1><3fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3fd>   DW_AT_name        : (indirect string, offset: 0x362): _IO_wide_data
    <401>   DW_AT_declaration : 1
 <1><402>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <403>   DW_AT_byte_size   : 4
    <404>   DW_AT_type        : <0x3fc>
 <1><408>: Abbrev Number: 15 (DW_TAG_array_type)
    <409>   DW_AT_type        : <0xf2>
    <40d>   DW_AT_sibling     : <0x418>
 <2><411>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <412>   DW_AT_type        : <0x2b>
    <416>   DW_AT_upper_bound : 39
 <2><417>: Abbrev Number: 0
 <1><418>: Abbrev Number: 11 (DW_TAG_variable)
    <419>   DW_AT_name        : (indirect string, offset: 0x51d): stdin
    <41d>   DW_AT_decl_file   : 10
    <41e>   DW_AT_decl_line   : 137
    <41f>   DW_AT_decl_column : 14
    <420>   DW_AT_type        : <0x426>
    <424>   DW_AT_external    : 1
    <425>   DW_AT_declaration : 1
 <1><426>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <427>   DW_AT_byte_size   : 4
    <428>   DW_AT_type        : <0x3b4>
 <1><42c>: Abbrev Number: 11 (DW_TAG_variable)
    <42d>   DW_AT_name        : (indirect string, offset: 0xfd4): stdout
    <431>   DW_AT_decl_file   : 10
    <432>   DW_AT_decl_line   : 138
    <433>   DW_AT_decl_column : 14
    <434>   DW_AT_type        : <0x426>
    <438>   DW_AT_external    : 1
    <439>   DW_AT_declaration : 1
 <1><43a>: Abbrev Number: 11 (DW_TAG_variable)
    <43b>   DW_AT_name        : (indirect string, offset: 0xdae): stderr
    <43f>   DW_AT_decl_file   : 10
    <440>   DW_AT_decl_line   : 139
    <441>   DW_AT_decl_column : 14
    <442>   DW_AT_type        : <0x426>
    <446>   DW_AT_external    : 1
    <447>   DW_AT_declaration : 1
 <1><448>: Abbrev Number: 11 (DW_TAG_variable)
    <449>   DW_AT_name        : (indirect string, offset: 0x23b): sys_nerr
    <44d>   DW_AT_decl_file   : 11
    <44e>   DW_AT_decl_line   : 26
    <44f>   DW_AT_decl_column : 12
    <450>   DW_AT_type        : <0x64>
    <454>   DW_AT_external    : 1
    <455>   DW_AT_declaration : 1
 <1><456>: Abbrev Number: 15 (DW_TAG_array_type)
    <457>   DW_AT_type        : <0x1e7>
    <45b>   DW_AT_sibling     : <0x461>
 <2><45f>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 3 (DW_TAG_const_type)
    <462>   DW_AT_type        : <0x456>
 <1><466>: Abbrev Number: 11 (DW_TAG_variable)
    <467>   DW_AT_name        : (indirect string, offset: 0x52c): sys_errlist
    <46b>   DW_AT_decl_file   : 11
    <46c>   DW_AT_decl_line   : 27
    <46d>   DW_AT_decl_column : 26
    <46e>   DW_AT_type        : <0x461>
    <472>   DW_AT_external    : 1
    <473>   DW_AT_declaration : 1
 <1><474>: Abbrev Number: 11 (DW_TAG_variable)
    <475>   DW_AT_name        : (indirect string, offset: 0x254): _sys_nerr
    <479>   DW_AT_decl_file   : 11
    <47a>   DW_AT_decl_line   : 30
    <47b>   DW_AT_decl_column : 12
    <47c>   DW_AT_type        : <0x64>
    <480>   DW_AT_external    : 1
    <481>   DW_AT_declaration : 1
 <1><482>: Abbrev Number: 11 (DW_TAG_variable)
    <483>   DW_AT_name        : (indirect string, offset: 0xe20): _sys_errlist
    <487>   DW_AT_decl_file   : 11
    <488>   DW_AT_decl_line   : 31
    <489>   DW_AT_decl_column : 26
    <48a>   DW_AT_type        : <0x461>
    <48e>   DW_AT_external    : 1
    <48f>   DW_AT_declaration : 1
 <1><490>: Abbrev Number: 11 (DW_TAG_variable)
    <491>   DW_AT_name        : (indirect string, offset: 0x6a9): program_invocation_name
    <495>   DW_AT_decl_file   : 12
    <496>   DW_AT_decl_line   : 45
    <497>   DW_AT_decl_column : 14
    <498>   DW_AT_type        : <0xec>
    <49c>   DW_AT_external    : 1
    <49d>   DW_AT_declaration : 1
 <1><49e>: Abbrev Number: 11 (DW_TAG_variable)
    <49f>   DW_AT_name        : (indirect string, offset: 0xba7): program_invocation_short_name
    <4a3>   DW_AT_decl_file   : 12
    <4a4>   DW_AT_decl_line   : 46
    <4a5>   DW_AT_decl_column : 14
    <4a6>   DW_AT_type        : <0xec>
    <4aa>   DW_AT_external    : 1
    <4ab>   DW_AT_declaration : 1
 <1><4ac>: Abbrev Number: 15 (DW_TAG_array_type)
    <4ad>   DW_AT_type        : <0xec>
    <4b1>   DW_AT_sibling     : <0x4bc>
 <2><4b5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4b6>   DW_AT_type        : <0x2b>
    <4ba>   DW_AT_upper_bound : 1
 <2><4bb>: Abbrev Number: 0
 <1><4bc>: Abbrev Number: 11 (DW_TAG_variable)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x1ab): __tzname
    <4c1>   DW_AT_decl_file   : 13
    <4c2>   DW_AT_decl_line   : 159
    <4c3>   DW_AT_decl_column : 14
    <4c4>   DW_AT_type        : <0x4ac>
    <4c8>   DW_AT_external    : 1
    <4c9>   DW_AT_declaration : 1
 <1><4ca>: Abbrev Number: 11 (DW_TAG_variable)
    <4cb>   DW_AT_name        : (indirect string, offset: 0xe80): __daylight
    <4cf>   DW_AT_decl_file   : 13
    <4d0>   DW_AT_decl_line   : 160
    <4d1>   DW_AT_decl_column : 12
    <4d2>   DW_AT_type        : <0x64>
    <4d6>   DW_AT_external    : 1
    <4d7>   DW_AT_declaration : 1
 <1><4d8>: Abbrev Number: 11 (DW_TAG_variable)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x357): __timezone
    <4dd>   DW_AT_decl_file   : 13
    <4de>   DW_AT_decl_line   : 161
    <4df>   DW_AT_decl_column : 17
    <4e0>   DW_AT_type        : <0xae>
    <4e4>   DW_AT_external    : 1
    <4e5>   DW_AT_declaration : 1
 <1><4e6>: Abbrev Number: 11 (DW_TAG_variable)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x996): tzname
    <4eb>   DW_AT_decl_file   : 13
    <4ec>   DW_AT_decl_line   : 166
    <4ed>   DW_AT_decl_column : 14
    <4ee>   DW_AT_type        : <0x4ac>
    <4f2>   DW_AT_external    : 1
    <4f3>   DW_AT_declaration : 1
 <1><4f4>: Abbrev Number: 11 (DW_TAG_variable)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x1044): daylight
    <4f9>   DW_AT_decl_file   : 13
    <4fa>   DW_AT_decl_line   : 174
    <4fb>   DW_AT_decl_column : 12
    <4fc>   DW_AT_type        : <0x64>
    <500>   DW_AT_external    : 1
    <501>   DW_AT_declaration : 1
 <1><502>: Abbrev Number: 11 (DW_TAG_variable)
    <503>   DW_AT_name        : (indirect string, offset: 0x4a9): timezone
    <507>   DW_AT_decl_file   : 13
    <508>   DW_AT_decl_line   : 175
    <509>   DW_AT_decl_column : 17
    <50a>   DW_AT_type        : <0xae>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 10 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0xf15): getdate_err
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 274
    <518>   DW_AT_decl_column : 12
    <519>   DW_AT_type        : <0x64>
    <51d>   DW_AT_external    : 1
    <51e>   DW_AT_declaration : 1
 <1><51f>: Abbrev Number: 11 (DW_TAG_variable)
    <520>   DW_AT_name        : (indirect string, offset: 0x9a9): debug_flag
    <524>   DW_AT_decl_file   : 14
    <525>   DW_AT_decl_line   : 20
    <526>   DW_AT_decl_column : 13
    <527>   DW_AT_type        : <0x52d>
    <52b>   DW_AT_external    : 1
    <52c>   DW_AT_declaration : 1
 <1><52d>: Abbrev Number: 2 (DW_TAG_base_type)
    <52e>   DW_AT_byte_size   : 1
    <52f>   DW_AT_encoding    : 2	(boolean)
    <530>   DW_AT_name        : (indirect string, offset: 0x3f5): _Bool
 <1><534>: Abbrev Number: 3 (DW_TAG_const_type)
    <535>   DW_AT_type        : <0x52d>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0xa7f): __kernel_long_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 15
    <540>   DW_AT_decl_column : 15
    <541>   DW_AT_type        : <0xae>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x50c): __kernel_ulong_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 16
    <54c>   DW_AT_decl_column : 23
    <54d>   DW_AT_type        : <0x37>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x3c1): kernel_long_t
    <556>   DW_AT_decl_file   : 16
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 25
    <559>   DW_AT_type        : <0x539>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x87b): kernel_ulong_t
    <562>   DW_AT_decl_file   : 16
    <563>   DW_AT_decl_line   : 17
    <564>   DW_AT_decl_column : 26
    <565>   DW_AT_type        : <0x545>
 <1><569>: Abbrev Number: 3 (DW_TAG_const_type)
    <56a>   DW_AT_type        : <0x55d>
 <1><56e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56f>   DW_AT_name        : (indirect string, offset: 0xbc5): list_item
    <573>   DW_AT_byte_size   : 8
    <574>   DW_AT_decl_file   : 17
    <575>   DW_AT_decl_line   : 92
    <576>   DW_AT_decl_column : 8
    <577>   DW_AT_sibling     : <0x59a>
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x1089): prev
    <580>   DW_AT_decl_file   : 17
    <581>   DW_AT_decl_line   : 93
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x59a>
    <587>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58a>: Abbrev Number: 9 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x107f): next
    <58f>   DW_AT_decl_file   : 17
    <590>   DW_AT_decl_line   : 94
    <591>   DW_AT_decl_column : 20
    <592>   DW_AT_type        : <0x59a>
    <596>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59b>   DW_AT_byte_size   : 4
    <59c>   DW_AT_type        : <0x56e>
 <1><5a0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x853): sysent
    <5a5>   DW_AT_byte_size   : 20
    <5a6>   DW_AT_decl_file   : 18
    <5a7>   DW_AT_decl_line   : 13
    <5a8>   DW_AT_decl_column : 16
    <5a9>   DW_AT_sibling     : <0x5f9>
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xfeb): nargs
    <5b2>   DW_AT_decl_file   : 18
    <5b3>   DW_AT_decl_line   : 14
    <5b4>   DW_AT_decl_column : 11
    <5b5>   DW_AT_type        : <0x2b>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x955): sys_flags
    <5c1>   DW_AT_decl_file   : 18
    <5c2>   DW_AT_decl_line   : 15
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x64>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cb>: Abbrev Number: 18 (DW_TAG_member)
    <5cc>   DW_AT_name        : sen
    <5d0>   DW_AT_decl_file   : 18
    <5d1>   DW_AT_decl_line   : 16
    <5d2>   DW_AT_decl_column : 6
    <5d3>   DW_AT_type        : <0x64>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x2e9): sys_func
    <5df>   DW_AT_decl_file   : 18
    <5e0>   DW_AT_decl_line   : 17
    <5e1>   DW_AT_decl_column : 8
    <5e2>   DW_AT_type        : <0x871>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e9>: Abbrev Number: 9 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x25e): sys_name
    <5ee>   DW_AT_decl_file   : 18
    <5ef>   DW_AT_decl_line   : 18
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x1e1>
    <5f5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f8>: Abbrev Number: 0
 <1><5f9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fa>   DW_AT_prototyped  : 1
    <5fb>   DW_AT_type        : <0x64>
    <5ff>   DW_AT_sibling     : <0x609>
 <2><603>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x609>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 4
    <60b>   DW_AT_type        : <0x614>
 <1><60f>: Abbrev Number: 3 (DW_TAG_const_type)
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 21 (DW_TAG_structure_type)
    <615>   DW_AT_name        : tcb
    <619>   DW_AT_byte_size   : 220
    <61a>   DW_AT_decl_file   : 19
    <61b>   DW_AT_decl_line   : 262
    <61d>   DW_AT_decl_column : 8
    <61e>   DW_AT_sibling     : <0x871>
 <2><622>: Abbrev Number: 22 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x4b8): flags
    <627>   DW_AT_decl_file   : 19
    <628>   DW_AT_decl_line   : 263
    <62a>   DW_AT_decl_column : 6
    <62b>   DW_AT_type        : <0x64>
    <62f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><632>: Abbrev Number: 23 (DW_TAG_member)
    <633>   DW_AT_name        : pid
    <637>   DW_AT_decl_file   : 19
    <638>   DW_AT_decl_line   : 264
    <63a>   DW_AT_decl_column : 6
    <63b>   DW_AT_type        : <0x64>
    <63f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><642>: Abbrev Number: 22 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x4a0): qual_flg
    <647>   DW_AT_decl_file   : 19
    <648>   DW_AT_decl_line   : 265
    <64a>   DW_AT_decl_column : 6
    <64b>   DW_AT_type        : <0x64>
    <64f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><652>: Abbrev Number: 22 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x37b): currpers
    <657>   DW_AT_decl_file   : 19
    <658>   DW_AT_decl_line   : 267
    <65a>   DW_AT_decl_column : 15
    <65b>   DW_AT_type        : <0x2b>
    <65f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><662>: Abbrev Number: 22 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0xb1c): u_error
    <667>   DW_AT_decl_file   : 19
    <668>   DW_AT_decl_line   : 269
    <66a>   DW_AT_decl_column : 16
    <66b>   DW_AT_type        : <0x37>
    <66f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><672>: Abbrev Number: 22 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <677>   DW_AT_decl_file   : 19
    <678>   DW_AT_decl_line   : 270
    <67a>   DW_AT_decl_column : 17
    <67b>   DW_AT_type        : <0x55d>
    <67f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><682>: Abbrev Number: 22 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0xb5d): true_scno
    <687>   DW_AT_decl_file   : 19
    <688>   DW_AT_decl_line   : 271
    <68a>   DW_AT_decl_column : 17
    <68b>   DW_AT_type        : <0x55d>
    <68f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><692>: Abbrev Number: 22 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x195): u_arg
    <697>   DW_AT_decl_file   : 19
    <698>   DW_AT_decl_line   : 272
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x9a1>
    <69f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a2>: Abbrev Number: 22 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x96c): u_rval
    <6a7>   DW_AT_decl_file   : 19
    <6a8>   DW_AT_decl_line   : 273
    <6aa>   DW_AT_decl_column : 16
    <6ab>   DW_AT_type        : <0x551>
    <6af>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b2>: Abbrev Number: 22 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0xa9b): sys_func_rval
    <6b7>   DW_AT_decl_file   : 19
    <6b8>   DW_AT_decl_line   : 274
    <6ba>   DW_AT_decl_column : 6
    <6bb>   DW_AT_type        : <0x64>
    <6bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c2>: Abbrev Number: 22 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0xcb9): curcol
    <6c7>   DW_AT_decl_file   : 19
    <6c8>   DW_AT_decl_line   : 275
    <6ca>   DW_AT_decl_column : 6
    <6cb>   DW_AT_type        : <0x64>
    <6cf>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d2>: Abbrev Number: 22 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0x97e): outf
    <6d7>   DW_AT_decl_file   : 19
    <6d8>   DW_AT_decl_line   : 276
    <6da>   DW_AT_decl_column : 8
    <6db>   DW_AT_type        : <0x426>
    <6df>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e2>: Abbrev Number: 22 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0xebf): staged_output_data
    <6e7>   DW_AT_decl_file   : 19
    <6e8>   DW_AT_decl_line   : 277
    <6ea>   DW_AT_decl_column : 29
    <6eb>   DW_AT_type        : <0x9b7>
    <6ef>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f2>: Abbrev Number: 22 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xa66): auxstr
    <6f7>   DW_AT_decl_file   : 19
    <6f8>   DW_AT_decl_line   : 279
    <6fa>   DW_AT_decl_column : 14
    <6fb>   DW_AT_type        : <0x1e1>
    <6ff>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><702>: Abbrev Number: 22 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x174): _priv_data
    <707>   DW_AT_decl_file   : 19
    <708>   DW_AT_decl_line   : 280
    <70a>   DW_AT_decl_column : 8
    <70b>   DW_AT_type        : <0xd9>
    <70f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><712>: Abbrev Number: 22 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xbf2): _free_priv_data
    <717>   DW_AT_decl_file   : 19
    <718>   DW_AT_decl_line   : 281
    <71a>   DW_AT_decl_column : 9
    <71b>   DW_AT_type        : <0x9c9>
    <71f>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><722>: Abbrev Number: 22 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x185): s_ent
    <727>   DW_AT_decl_file   : 19
    <728>   DW_AT_decl_line   : 282
    <72a>   DW_AT_decl_column : 23
    <72b>   DW_AT_type        : <0x9cf>
    <72f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><732>: Abbrev Number: 22 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <737>   DW_AT_decl_file   : 19
    <738>   DW_AT_decl_line   : 285
    <73a>   DW_AT_decl_column : 23
    <73b>   DW_AT_type        : <0x9cf>
    <73f>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x370): inject_vec
    <747>   DW_AT_decl_file   : 19
    <748>   DW_AT_decl_line   : 286
    <74a>   DW_AT_decl_column : 22
    <74b>   DW_AT_type        : <0x9da>
    <74f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x7c4): stime
    <757>   DW_AT_decl_file   : 19
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x14b>
    <75f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><762>: Abbrev Number: 22 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x384): ltime
    <767>   DW_AT_decl_file   : 19
    <768>   DW_AT_decl_line   : 288
    <76a>   DW_AT_decl_column : 18
    <76b>   DW_AT_type        : <0x14b>
    <76f>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xfb2): atime
    <777>   DW_AT_decl_file   : 19
    <778>   DW_AT_decl_line   : 289
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x14b>
    <77f>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><782>: Abbrev Number: 22 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4b2): etime
    <787>   DW_AT_decl_file   : 19
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x14b>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><793>: Abbrev Number: 22 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd1d): delay_expiration_time
    <798>   DW_AT_decl_file   : 19
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x14b>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a4>: Abbrev Number: 22 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a9>   DW_AT_decl_file   : 19
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b5>: Abbrev Number: 22 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xefb): last_dirfd
    <7ba>   DW_AT_decl_file   : 19
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c6>: Abbrev Number: 22 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf21): mmap_cache
    <7cb>   DW_AT_decl_file   : 19
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9f6>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d7>: Abbrev Number: 22 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb2b): wait_data_idx
    <7dc>   DW_AT_decl_file   : 19
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x13a>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e8>: Abbrev Number: 22 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa6d): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 19
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0xa02>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7f9>: Abbrev Number: 22 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xadd): wait_list
    <7fe>   DW_AT_decl_file   : 19
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x56e>
    <806>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80a>: Abbrev Number: 22 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6c1): vcpu_info_list
    <80f>   DW_AT_decl_file   : 19
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0xa0e>
    <817>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81b>: Abbrev Number: 22 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xc84): unwind_ctx
    <820>   DW_AT_decl_file   : 19
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xd9>
    <828>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82c>: Abbrev Number: 22 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x493): unwind_queue
    <831>   DW_AT_decl_file   : 19
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0xa1a>
    <839>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83d>: Abbrev Number: 22 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x169): comm
    <842>   DW_AT_decl_file   : 19
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0xa20>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84e>: Abbrev Number: 22 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x211): start_prc
    <853>   DW_AT_decl_file   : 19
    <854>   DW_AT_decl_line   : 329
    <856>   DW_AT_decl_column : 16
    <857>   DW_AT_type        : <0x37>
    <85b>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><85f>: Abbrev Number: 22 (DW_TAG_member)
    <860>   DW_AT_name        : (indirect string, offset: 0xf86): pre_comm
    <864>   DW_AT_decl_file   : 19
    <865>   DW_AT_decl_line   : 330
    <867>   DW_AT_decl_column : 7
    <868>   DW_AT_type        : <0xa20>
    <86c>   DW_AT_data_member_location: 3 byte block: 23 cc 1 	(DW_OP_plus_uconst: 204)
 <2><870>: Abbrev Number: 0
 <1><871>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <872>   DW_AT_byte_size   : 4
    <873>   DW_AT_type        : <0x5f9>
 <1><877>: Abbrev Number: 4 (DW_TAG_typedef)
    <878>   DW_AT_name        : (indirect string, offset: 0x4fe): struct_sysent
    <87c>   DW_AT_decl_file   : 18
    <87d>   DW_AT_decl_line   : 19
    <87e>   DW_AT_decl_column : 3
    <87f>   DW_AT_type        : <0x5a0>
 <1><883>: Abbrev Number: 3 (DW_TAG_const_type)
    <884>   DW_AT_type        : <0x877>
 <1><888>: Abbrev Number: 11 (DW_TAG_variable)
    <889>   DW_AT_name        : (indirect string, offset: 0xd09): current_personality
    <88d>   DW_AT_decl_file   : 19
    <88e>   DW_AT_decl_line   : 158
    <88f>   DW_AT_decl_column : 17
    <890>   DW_AT_type        : <0x2b>
    <894>   DW_AT_external    : 1
    <895>   DW_AT_declaration : 1
 <1><896>: Abbrev Number: 11 (DW_TAG_variable)
    <897>   DW_AT_name        : (indirect string, offset: 0x7f5): current_wordsize
    <89b>   DW_AT_decl_file   : 19
    <89c>   DW_AT_decl_line   : 171
    <89d>   DW_AT_decl_column : 17
    <89e>   DW_AT_type        : <0x2b>
    <8a2>   DW_AT_external    : 1
    <8a3>   DW_AT_declaration : 1
 <1><8a4>: Abbrev Number: 11 (DW_TAG_variable)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xa44): current_klongsize
    <8a9>   DW_AT_decl_file   : 19
    <8aa>   DW_AT_decl_line   : 176
    <8ab>   DW_AT_decl_column : 17
    <8ac>   DW_AT_type        : <0x2b>
    <8b0>   DW_AT_external    : 1
    <8b1>   DW_AT_declaration : 1
 <1><8b2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xc5b): ioctlent
    <8b7>   DW_AT_byte_size   : 8
    <8b8>   DW_AT_decl_file   : 19
    <8b9>   DW_AT_decl_line   : 217
    <8ba>   DW_AT_decl_column : 16
    <8bb>   DW_AT_sibling     : <0x8de>
 <2><8bf>: Abbrev Number: 9 (DW_TAG_member)
    <8c0>   DW_AT_name        : (indirect string, offset: 0xee7): symbol
    <8c4>   DW_AT_decl_file   : 19
    <8c5>   DW_AT_decl_line   : 218
    <8c6>   DW_AT_decl_column : 14
    <8c7>   DW_AT_type        : <0x1e1>
    <8cb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ce>: Abbrev Number: 9 (DW_TAG_member)
    <8cf>   DW_AT_name        : (indirect string, offset: 0xcd2): code
    <8d3>   DW_AT_decl_file   : 19
    <8d4>   DW_AT_decl_line   : 219
    <8d5>   DW_AT_decl_column : 15
    <8d6>   DW_AT_type        : <0x2b>
    <8da>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8dd>: Abbrev Number: 0
 <1><8de>: Abbrev Number: 4 (DW_TAG_typedef)
    <8df>   DW_AT_name        : (indirect string, offset: 0xc1c): struct_ioctlent
    <8e3>   DW_AT_decl_file   : 19
    <8e4>   DW_AT_decl_line   : 220
    <8e5>   DW_AT_decl_column : 3
    <8e6>   DW_AT_type        : <0x8b2>
 <1><8ea>: Abbrev Number: 3 (DW_TAG_const_type)
    <8eb>   DW_AT_type        : <0x8de>
 <1><8ef>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x7e9): inject_data
    <8f4>   DW_AT_byte_size   : 10
    <8f5>   DW_AT_decl_file   : 19
    <8f6>   DW_AT_decl_line   : 241
    <8f7>   DW_AT_decl_column : 8
    <8f8>   DW_AT_sibling     : <0x957>
 <2><8fc>: Abbrev Number: 9 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x4b8): flags
    <901>   DW_AT_decl_file   : 19
    <902>   DW_AT_decl_line   : 242
    <903>   DW_AT_decl_column : 10
    <904>   DW_AT_type        : <0xfe>
    <908>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><90b>: Abbrev Number: 9 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0x8fe): signo
    <910>   DW_AT_decl_file   : 19
    <911>   DW_AT_decl_line   : 243
    <912>   DW_AT_decl_column : 10
    <913>   DW_AT_type        : <0xfe>
    <917>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><91a>: Abbrev Number: 9 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0xfb): rval_idx
    <91f>   DW_AT_decl_file   : 19
    <920>   DW_AT_decl_line   : 244
    <921>   DW_AT_decl_column : 11
    <922>   DW_AT_type        : <0x10a>
    <926>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><929>: Abbrev Number: 9 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0xcaf): delay_idx
    <92e>   DW_AT_decl_file   : 19
    <92f>   DW_AT_decl_line   : 245
    <930>   DW_AT_decl_column : 11
    <931>   DW_AT_type        : <0x10a>
    <935>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><938>: Abbrev Number: 9 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x54e): poke_idx
    <93d>   DW_AT_decl_file   : 19
    <93e>   DW_AT_decl_line   : 246
    <93f>   DW_AT_decl_column : 11
    <940>   DW_AT_type        : <0x10a>
    <944>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><947>: Abbrev Number: 9 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <94c>   DW_AT_decl_file   : 19
    <94d>   DW_AT_decl_line   : 247
    <94e>   DW_AT_decl_column : 11
    <94f>   DW_AT_type        : <0x10a>
    <953>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><956>: Abbrev Number: 0
 <1><957>: Abbrev Number: 8 (DW_TAG_structure_type)
    <958>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <95c>   DW_AT_byte_size   : 16
    <95d>   DW_AT_decl_file   : 19
    <95e>   DW_AT_decl_line   : 250
    <95f>   DW_AT_decl_column : 8
    <960>   DW_AT_sibling     : <0x9a1>
 <2><964>: Abbrev Number: 9 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0xa03): first
    <969>   DW_AT_decl_file   : 19
    <96a>   DW_AT_decl_line   : 251
    <96b>   DW_AT_decl_column : 11
    <96c>   DW_AT_type        : <0x10a>
    <970>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><973>: Abbrev Number: 9 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x10b2): last
    <978>   DW_AT_decl_file   : 19
    <979>   DW_AT_decl_line   : 252
    <97a>   DW_AT_decl_column : 11
    <97b>   DW_AT_type        : <0x10a>
    <97f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><982>: Abbrev Number: 9 (DW_TAG_member)
    <983>   DW_AT_name        : (indirect string, offset: 0x38a): step
    <987>   DW_AT_decl_file   : 19
    <988>   DW_AT_decl_line   : 253
    <989>   DW_AT_decl_column : 11
    <98a>   DW_AT_type        : <0x10a>
    <98e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><991>: Abbrev Number: 9 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x1084): data
    <996>   DW_AT_decl_file   : 19
    <997>   DW_AT_decl_line   : 254
    <998>   DW_AT_decl_column : 21
    <999>   DW_AT_type        : <0x8ef>
    <99d>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><9a0>: Abbrev Number: 0
 <1><9a1>: Abbrev Number: 15 (DW_TAG_array_type)
    <9a2>   DW_AT_type        : <0x55d>
    <9a6>   DW_AT_sibling     : <0x9b1>
 <2><9aa>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9ab>   DW_AT_type        : <0x2b>
    <9af>   DW_AT_upper_bound : 5
 <2><9b0>: Abbrev Number: 0
 <1><9b1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9b2>   DW_AT_name        : (indirect string, offset: 0xebf): staged_output_data
    <9b6>   DW_AT_declaration : 1
 <1><9b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9b8>   DW_AT_byte_size   : 4
    <9b9>   DW_AT_type        : <0x9b1>
 <1><9bd>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <9be>   DW_AT_prototyped  : 1
    <9bf>   DW_AT_sibling     : <0x9c9>
 <2><9c3>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9c4>   DW_AT_type        : <0xd9>
 <2><9c8>: Abbrev Number: 0
 <1><9c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ca>   DW_AT_byte_size   : 4
    <9cb>   DW_AT_type        : <0x9bd>
 <1><9cf>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d0>   DW_AT_byte_size   : 4
    <9d1>   DW_AT_type        : <0x883>
 <1><9d5>: Abbrev Number: 3 (DW_TAG_const_type)
    <9d6>   DW_AT_type        : <0x9cf>
 <1><9da>: Abbrev Number: 15 (DW_TAG_array_type)
    <9db>   DW_AT_type        : <0x9ea>
    <9df>   DW_AT_sibling     : <0x9ea>
 <2><9e3>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9e4>   DW_AT_type        : <0x2b>
    <9e8>   DW_AT_upper_bound : 2
 <2><9e9>: Abbrev Number: 0
 <1><9ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9eb>   DW_AT_byte_size   : 4
    <9ec>   DW_AT_type        : <0x957>
 <1><9f0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <9f5>   DW_AT_declaration : 1
 <1><9f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f7>   DW_AT_byte_size   : 4
    <9f8>   DW_AT_type        : <0x9f0>
 <1><9fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x3a5): tcb_wait_data
    <a01>   DW_AT_declaration : 1
 <1><a02>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a03>   DW_AT_byte_size   : 4
    <a04>   DW_AT_type        : <0x9fc>
 <1><a08>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a09>   DW_AT_name        : (indirect string, offset: 0x15f): vcpu_info
    <a0d>   DW_AT_declaration : 1
 <1><a0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a0f>   DW_AT_byte_size   : 4
    <a10>   DW_AT_type        : <0xa08>
 <1><a14>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a15>   DW_AT_name        : (indirect string, offset: 0xea3): unwind_queue_t
    <a19>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0xa14>
 <1><a20>: Abbrev Number: 15 (DW_TAG_array_type)
    <a21>   DW_AT_type        : <0xf2>
    <a25>   DW_AT_sibling     : <0xa30>
 <2><a29>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a2a>   DW_AT_type        : <0x2b>
    <a2e>   DW_AT_upper_bound : 15
 <2><a2f>: Abbrev Number: 0
 <1><a30>: Abbrev Number: 10 (DW_TAG_variable)
    <a31>   DW_AT_name        : (indirect string, offset: 0xb70): stub_sysent
    <a35>   DW_AT_decl_file   : 19
    <a36>   DW_AT_decl_line   : 405
    <a38>   DW_AT_decl_column : 28
    <a39>   DW_AT_type        : <0x883>
    <a3d>   DW_AT_external    : 1
    <a3e>   DW_AT_declaration : 1
 <1><a3f>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a40>   DW_AT_name        : (indirect string, offset: 0x1067): xlat_type
    <a44>   DW_AT_encoding    : 7	(unsigned)
    <a45>   DW_AT_byte_size   : 4
    <a46>   DW_AT_type        : <0x2b>
    <a4a>   DW_AT_decl_file   : 20
    <a4b>   DW_AT_decl_line   : 13
    <a4c>   DW_AT_decl_column : 6
    <a4d>   DW_AT_sibling     : <0xa64>
 <2><a51>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a52>   DW_AT_name        : (indirect string, offset: 0x2b9): XT_NORMAL
    <a56>   DW_AT_const_value : 0
 <2><a57>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0xc33): XT_SORTED
    <a5c>   DW_AT_const_value : 1
 <2><a5d>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0xd95): XT_INDEXED
    <a62>   DW_AT_const_value : 2
 <2><a63>: Abbrev Number: 0
 <1><a64>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a65>   DW_AT_name        : (indirect string, offset: 0xb9c): xlat_style
    <a69>   DW_AT_encoding    : 7	(unsigned)
    <a6a>   DW_AT_byte_size   : 4
    <a6b>   DW_AT_type        : <0x2b>
    <a6f>   DW_AT_decl_file   : 20
    <a70>   DW_AT_decl_line   : 19
    <a71>   DW_AT_decl_column : 6
    <a72>   DW_AT_sibling     : <0xaa1>
 <2><a76>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a77>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a7b>   DW_AT_const_value : 0
 <2><a7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0xbcf): XLAT_STYLE_RAW
    <a81>   DW_AT_const_value : 1
 <2><a82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a83>   DW_AT_name        : (indirect string, offset: 0x1032): XLAT_STYLE_ABBREV
    <a87>   DW_AT_const_value : 2
 <2><a88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a89>   DW_AT_name        : (indirect string, offset: 0x2d6): XLAT_STYLE_VERBOSE
    <a8d>   DW_AT_const_value : 3
 <2><a8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a93>   DW_AT_const_value : 0
 <2><a94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a95>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a99>   DW_AT_const_value : 4
 <2><a9a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x10a1): XLAT_STYLE_FMT_D
    <a9f>   DW_AT_const_value : 8
 <2><aa0>: Abbrev Number: 0
 <1><aa1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x307): xlat_data
    <aa6>   DW_AT_byte_size   : 12
    <aa7>   DW_AT_decl_file   : 20
    <aa8>   DW_AT_decl_line   : 51
    <aa9>   DW_AT_decl_column : 8
    <aaa>   DW_AT_sibling     : <0xacd>
 <2><aae>: Abbrev Number: 18 (DW_TAG_member)
    <aaf>   DW_AT_name        : val
    <ab3>   DW_AT_decl_file   : 20
    <ab4>   DW_AT_decl_line   : 52
    <ab5>   DW_AT_decl_column : 11
    <ab6>   DW_AT_type        : <0x122>
    <aba>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><abd>: Abbrev Number: 18 (DW_TAG_member)
    <abe>   DW_AT_name        : str
    <ac2>   DW_AT_decl_file   : 20
    <ac3>   DW_AT_decl_line   : 53
    <ac4>   DW_AT_decl_column : 14
    <ac5>   DW_AT_type        : <0x1e1>
    <ac9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><acc>: Abbrev Number: 0
 <1><acd>: Abbrev Number: 3 (DW_TAG_const_type)
    <ace>   DW_AT_type        : <0xaa1>
 <1><ad2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ad7>   DW_AT_byte_size   : 24
    <ad8>   DW_AT_decl_file   : 20
    <ad9>   DW_AT_decl_line   : 56
    <ada>   DW_AT_decl_column : 8
    <adb>   DW_AT_sibling     : <0xb2b>
 <2><adf>: Abbrev Number: 9 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x1084): data
    <ae4>   DW_AT_decl_file   : 20
    <ae5>   DW_AT_decl_line   : 57
    <ae6>   DW_AT_decl_column : 26
    <ae7>   DW_AT_type        : <0xb30>
    <aeb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><aee>: Abbrev Number: 9 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x847): flags_strsz
    <af3>   DW_AT_decl_file   : 20
    <af4>   DW_AT_decl_line   : 58
    <af5>   DW_AT_decl_column : 9
    <af6>   DW_AT_type        : <0x13a>
    <afa>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><afd>: Abbrev Number: 9 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0xb39): size
    <b02>   DW_AT_decl_file   : 20
    <b03>   DW_AT_decl_line   : 59
    <b04>   DW_AT_decl_column : 11
    <b05>   DW_AT_type        : <0x116>
    <b09>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><b0c>: Abbrev Number: 9 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x190): type
    <b11>   DW_AT_decl_file   : 20
    <b12>   DW_AT_decl_line   : 60
    <b13>   DW_AT_decl_column : 17
    <b14>   DW_AT_type        : <0xa3f>
    <b18>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><b1b>: Abbrev Number: 9 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x715): flags_mask
    <b20>   DW_AT_decl_file   : 20
    <b21>   DW_AT_decl_line   : 61
    <b22>   DW_AT_decl_column : 11
    <b23>   DW_AT_type        : <0x122>
    <b27>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b2a>: Abbrev Number: 0
 <1><b2b>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2c>   DW_AT_type        : <0xad2>
 <1><b30>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b31>   DW_AT_byte_size   : 4
    <b32>   DW_AT_type        : <0xacd>
 <1><b36>: Abbrev Number: 15 (DW_TAG_array_type)
    <b37>   DW_AT_type        : <0xb2b>
    <b3b>   DW_AT_sibling     : <0xb41>
 <2><b3f>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b40>: Abbrev Number: 0
 <1><b41>: Abbrev Number: 3 (DW_TAG_const_type)
    <b42>   DW_AT_type        : <0xb36>
 <1><b46>: Abbrev Number: 10 (DW_TAG_variable)
    <b47>   DW_AT_name        : (indirect string, offset: 0xdfe): addrfams
    <b4b>   DW_AT_decl_file   : 19
    <b4c>   DW_AT_decl_line   : 411
    <b4e>   DW_AT_decl_column : 26
    <b4f>   DW_AT_type        : <0xb41>
    <b53>   DW_AT_external    : 1
    <b54>   DW_AT_declaration : 1
 <1><b55>: Abbrev Number: 10 (DW_TAG_variable)
    <b56>   DW_AT_name        : (indirect string, offset: 0xce2): arp_hardware_types
    <b5a>   DW_AT_decl_file   : 19
    <b5b>   DW_AT_decl_line   : 412
    <b5d>   DW_AT_decl_column : 26
    <b5e>   DW_AT_type        : <0xb41>
    <b62>   DW_AT_external    : 1
    <b63>   DW_AT_declaration : 1
 <1><b64>: Abbrev Number: 10 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0xfb8): at_flags
    <b69>   DW_AT_decl_file   : 19
    <b6a>   DW_AT_decl_line   : 413
    <b6c>   DW_AT_decl_column : 26
    <b6d>   DW_AT_type        : <0xb41>
    <b71>   DW_AT_external    : 1
    <b72>   DW_AT_declaration : 1
 <1><b73>: Abbrev Number: 10 (DW_TAG_variable)
    <b74>   DW_AT_name        : (indirect string, offset: 0x471): clocknames
    <b78>   DW_AT_decl_file   : 19
    <b79>   DW_AT_decl_line   : 414
    <b7b>   DW_AT_decl_column : 26
    <b7c>   DW_AT_type        : <0xb41>
    <b80>   DW_AT_external    : 1
    <b81>   DW_AT_declaration : 1
 <1><b82>: Abbrev Number: 10 (DW_TAG_variable)
    <b83>   DW_AT_name        : (indirect string, offset: 0xf6f): dirent_types
    <b87>   DW_AT_decl_file   : 19
    <b88>   DW_AT_decl_line   : 415
    <b8a>   DW_AT_decl_column : 26
    <b8b>   DW_AT_type        : <0xb41>
    <b8f>   DW_AT_external    : 1
    <b90>   DW_AT_declaration : 1
 <1><b91>: Abbrev Number: 10 (DW_TAG_variable)
    <b92>   DW_AT_name        : (indirect string, offset: 0x898): ethernet_protocols
    <b96>   DW_AT_decl_file   : 19
    <b97>   DW_AT_decl_line   : 416
    <b99>   DW_AT_decl_column : 26
    <b9a>   DW_AT_type        : <0xb41>
    <b9e>   DW_AT_external    : 1
    <b9f>   DW_AT_declaration : 1
 <1><ba0>: Abbrev Number: 10 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x5ab): inet_protocols
    <ba5>   DW_AT_decl_file   : 19
    <ba6>   DW_AT_decl_line   : 417
    <ba8>   DW_AT_decl_column : 26
    <ba9>   DW_AT_type        : <0xb41>
    <bad>   DW_AT_external    : 1
    <bae>   DW_AT_declaration : 1
 <1><baf>: Abbrev Number: 10 (DW_TAG_variable)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x2a6): evdev_abs
    <bb4>   DW_AT_decl_file   : 19
    <bb5>   DW_AT_decl_line   : 418
    <bb7>   DW_AT_decl_column : 26
    <bb8>   DW_AT_type        : <0xb41>
    <bbc>   DW_AT_external    : 1
    <bbd>   DW_AT_declaration : 1
 <1><bbe>: Abbrev Number: 10 (DW_TAG_variable)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x70a): audit_arch
    <bc3>   DW_AT_decl_file   : 19
    <bc4>   DW_AT_decl_line   : 419
    <bc6>   DW_AT_decl_column : 26
    <bc7>   DW_AT_type        : <0xb41>
    <bcb>   DW_AT_external    : 1
    <bcc>   DW_AT_declaration : 1
 <1><bcd>: Abbrev Number: 10 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bd2>   DW_AT_decl_file   : 19
    <bd3>   DW_AT_decl_line   : 420
    <bd5>   DW_AT_decl_column : 26
    <bd6>   DW_AT_type        : <0xb41>
    <bda>   DW_AT_external    : 1
    <bdb>   DW_AT_declaration : 1
 <1><bdc>: Abbrev Number: 10 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x452): iffflags
    <be1>   DW_AT_decl_file   : 19
    <be2>   DW_AT_decl_line   : 421
    <be4>   DW_AT_decl_column : 26
    <be5>   DW_AT_type        : <0xb41>
    <be9>   DW_AT_external    : 1
    <bea>   DW_AT_declaration : 1
 <1><beb>: Abbrev Number: 10 (DW_TAG_variable)
    <bec>   DW_AT_name        : (indirect string, offset: 0xbde): ip_type_of_services
    <bf0>   DW_AT_decl_file   : 19
    <bf1>   DW_AT_decl_line   : 422
    <bf3>   DW_AT_decl_column : 26
    <bf4>   DW_AT_type        : <0xb41>
    <bf8>   DW_AT_external    : 1
    <bf9>   DW_AT_declaration : 1
 <1><bfa>: Abbrev Number: 10 (DW_TAG_variable)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x69d): ipc_private
    <bff>   DW_AT_decl_file   : 19
    <c00>   DW_AT_decl_line   : 423
    <c02>   DW_AT_decl_column : 26
    <c03>   DW_AT_type        : <0xb41>
    <c07>   DW_AT_external    : 1
    <c08>   DW_AT_declaration : 1
 <1><c09>: Abbrev Number: 10 (DW_TAG_variable)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x2fd): msg_flags
    <c0e>   DW_AT_decl_file   : 19
    <c0f>   DW_AT_decl_line   : 424
    <c11>   DW_AT_decl_column : 26
    <c12>   DW_AT_type        : <0xb41>
    <c16>   DW_AT_external    : 1
    <c17>   DW_AT_declaration : 1
 <1><c18>: Abbrev Number: 10 (DW_TAG_variable)
    <c19>   DW_AT_name        : (indirect string, offset: 0x104): netlink_protocols
    <c1d>   DW_AT_decl_file   : 19
    <c1e>   DW_AT_decl_line   : 425
    <c20>   DW_AT_decl_column : 26
    <c21>   DW_AT_type        : <0xb41>
    <c25>   DW_AT_external    : 1
    <c26>   DW_AT_declaration : 1
 <1><c27>: Abbrev Number: 10 (DW_TAG_variable)
    <c28>   DW_AT_name        : (indirect string, offset: 0xed2): nl_bridge_vlan_flags
    <c2c>   DW_AT_decl_file   : 19
    <c2d>   DW_AT_decl_line   : 426
    <c2f>   DW_AT_decl_column : 26
    <c30>   DW_AT_type        : <0xb41>
    <c34>   DW_AT_external    : 1
    <c35>   DW_AT_declaration : 1
 <1><c36>: Abbrev Number: 10 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0xd7e): nl_netfilter_msg_types
    <c3b>   DW_AT_decl_file   : 19
    <c3c>   DW_AT_decl_line   : 427
    <c3e>   DW_AT_decl_column : 26
    <c3f>   DW_AT_type        : <0xb41>
    <c43>   DW_AT_external    : 1
    <c44>   DW_AT_declaration : 1
 <1><c45>: Abbrev Number: 10 (DW_TAG_variable)
    <c46>   DW_AT_name        : (indirect string, offset: 0x434): nl_route_types
    <c4a>   DW_AT_decl_file   : 19
    <c4b>   DW_AT_decl_line   : 428
    <c4d>   DW_AT_decl_column : 26
    <c4e>   DW_AT_type        : <0xb41>
    <c52>   DW_AT_external    : 1
    <c53>   DW_AT_declaration : 1
 <1><c54>: Abbrev Number: 10 (DW_TAG_variable)
    <c55>   DW_AT_name        : (indirect string, offset: 0xe40): open_access_modes
    <c59>   DW_AT_decl_file   : 19
    <c5a>   DW_AT_decl_line   : 429
    <c5c>   DW_AT_decl_column : 26
    <c5d>   DW_AT_type        : <0xb41>
    <c61>   DW_AT_external    : 1
    <c62>   DW_AT_declaration : 1
 <1><c63>: Abbrev Number: 10 (DW_TAG_variable)
    <c64>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c68>   DW_AT_decl_file   : 19
    <c69>   DW_AT_decl_line   : 430
    <c6b>   DW_AT_decl_column : 26
    <c6c>   DW_AT_type        : <0xb41>
    <c70>   DW_AT_external    : 1
    <c71>   DW_AT_declaration : 1
 <1><c72>: Abbrev Number: 10 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0xc0f): perf_type_id
    <c77>   DW_AT_decl_file   : 19
    <c78>   DW_AT_decl_line   : 431
    <c7a>   DW_AT_decl_column : 26
    <c7b>   DW_AT_type        : <0xb41>
    <c7f>   DW_AT_external    : 1
    <c80>   DW_AT_declaration : 1
 <1><c81>: Abbrev Number: 10 (DW_TAG_variable)
    <c82>   DW_AT_name        : (indirect string, offset: 0xe07): pollflags
    <c86>   DW_AT_decl_file   : 19
    <c87>   DW_AT_decl_line   : 432
    <c89>   DW_AT_decl_column : 26
    <c8a>   DW_AT_type        : <0xb41>
    <c8e>   DW_AT_external    : 1
    <c8f>   DW_AT_declaration : 1
 <1><c90>: Abbrev Number: 10 (DW_TAG_variable)
    <c91>   DW_AT_name        : (indirect string, offset: 0x542): ptrace_cmds
    <c95>   DW_AT_decl_file   : 19
    <c96>   DW_AT_decl_line   : 433
    <c98>   DW_AT_decl_column : 26
    <c99>   DW_AT_type        : <0xb41>
    <c9d>   DW_AT_external    : 1
    <c9e>   DW_AT_declaration : 1
 <1><c9f>: Abbrev Number: 10 (DW_TAG_variable)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x7da): resource_flags
    <ca4>   DW_AT_decl_file   : 19
    <ca5>   DW_AT_decl_line   : 434
    <ca7>   DW_AT_decl_column : 26
    <ca8>   DW_AT_type        : <0xb41>
    <cac>   DW_AT_external    : 1
    <cad>   DW_AT_declaration : 1
 <1><cae>: Abbrev Number: 10 (DW_TAG_variable)
    <caf>   DW_AT_name        : (indirect string, offset: 0x27c): route_nexthop_flags
    <cb3>   DW_AT_decl_file   : 19
    <cb4>   DW_AT_decl_line   : 435
    <cb6>   DW_AT_decl_column : 26
    <cb7>   DW_AT_type        : <0xb41>
    <cbb>   DW_AT_external    : 1
    <cbc>   DW_AT_declaration : 1
 <1><cbd>: Abbrev Number: 10 (DW_TAG_variable)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xe5d): routing_protocols
    <cc2>   DW_AT_decl_file   : 19
    <cc3>   DW_AT_decl_line   : 436
    <cc5>   DW_AT_decl_column : 26
    <cc6>   DW_AT_type        : <0xb41>
    <cca>   DW_AT_external    : 1
    <ccb>   DW_AT_declaration : 1
 <1><ccc>: Abbrev Number: 10 (DW_TAG_variable)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x443): routing_scopes
    <cd1>   DW_AT_decl_file   : 19
    <cd2>   DW_AT_decl_line   : 437
    <cd4>   DW_AT_decl_column : 26
    <cd5>   DW_AT_type        : <0xb41>
    <cd9>   DW_AT_external    : 1
    <cda>   DW_AT_declaration : 1
 <1><cdb>: Abbrev Number: 10 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xd6c): routing_table_ids
    <ce0>   DW_AT_decl_file   : 19
    <ce1>   DW_AT_decl_line   : 438
    <ce3>   DW_AT_decl_column : 26
    <ce4>   DW_AT_type        : <0xb41>
    <ce8>   DW_AT_external    : 1
    <ce9>   DW_AT_declaration : 1
 <1><cea>: Abbrev Number: 10 (DW_TAG_variable)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x67a): routing_types
    <cef>   DW_AT_decl_file   : 19
    <cf0>   DW_AT_decl_line   : 439
    <cf2>   DW_AT_decl_column : 26
    <cf3>   DW_AT_type        : <0xb41>
    <cf7>   DW_AT_external    : 1
    <cf8>   DW_AT_declaration : 1
 <1><cf9>: Abbrev Number: 10 (DW_TAG_variable)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x1b4): rwf_flags
    <cfe>   DW_AT_decl_file   : 19
    <cff>   DW_AT_decl_line   : 440
    <d01>   DW_AT_decl_column : 26
    <d02>   DW_AT_type        : <0xb41>
    <d06>   DW_AT_external    : 1
    <d07>   DW_AT_declaration : 1
 <1><d08>: Abbrev Number: 10 (DW_TAG_variable)
    <d09>   DW_AT_name        : (indirect string, offset: 0x812): seccomp_filter_flags
    <d0d>   DW_AT_decl_file   : 19
    <d0e>   DW_AT_decl_line   : 441
    <d10>   DW_AT_decl_column : 26
    <d11>   DW_AT_type        : <0xb41>
    <d15>   DW_AT_external    : 1
    <d16>   DW_AT_declaration : 1
 <1><d17>: Abbrev Number: 10 (DW_TAG_variable)
    <d18>   DW_AT_name        : (indirect string, offset: 0x2c3): seccomp_ret_action
    <d1c>   DW_AT_decl_file   : 19
    <d1d>   DW_AT_decl_line   : 442
    <d1f>   DW_AT_decl_column : 26
    <d20>   DW_AT_type        : <0xb41>
    <d24>   DW_AT_external    : 1
    <d25>   DW_AT_declaration : 1
 <1><d26>: Abbrev Number: 10 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0x40f): setns_types
    <d2b>   DW_AT_decl_file   : 19
    <d2c>   DW_AT_decl_line   : 443
    <d2e>   DW_AT_decl_column : 26
    <d2f>   DW_AT_type        : <0xb41>
    <d33>   DW_AT_external    : 1
    <d34>   DW_AT_declaration : 1
 <1><d35>: Abbrev Number: 10 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0xdf3): sg_io_info
    <d3a>   DW_AT_decl_file   : 19
    <d3b>   DW_AT_decl_line   : 444
    <d3d>   DW_AT_decl_column : 26
    <d3e>   DW_AT_type        : <0xb41>
    <d42>   DW_AT_external    : 1
    <d43>   DW_AT_declaration : 1
 <1><d44>: Abbrev Number: 10 (DW_TAG_variable)
    <d45>   DW_AT_name        : (indirect string, offset: 0xb84): socketlayers
    <d49>   DW_AT_decl_file   : 19
    <d4a>   DW_AT_decl_line   : 445
    <d4c>   DW_AT_decl_column : 26
    <d4d>   DW_AT_type        : <0xb41>
    <d51>   DW_AT_external    : 1
    <d52>   DW_AT_declaration : 1
 <1><d53>: Abbrev Number: 10 (DW_TAG_variable)
    <d54>   DW_AT_name        : (indirect string, offset: 0xd56): socktypes
    <d58>   DW_AT_decl_file   : 19
    <d59>   DW_AT_decl_line   : 446
    <d5b>   DW_AT_decl_column : 26
    <d5c>   DW_AT_type        : <0xb41>
    <d60>   DW_AT_external    : 1
    <d61>   DW_AT_declaration : 1
 <1><d62>: Abbrev Number: 10 (DW_TAG_variable)
    <d63>   DW_AT_name        : (indirect string, offset: 0xa56): tcp_state_flags
    <d67>   DW_AT_decl_file   : 19
    <d68>   DW_AT_decl_line   : 447
    <d6a>   DW_AT_decl_column : 26
    <d6b>   DW_AT_type        : <0xb41>
    <d6f>   DW_AT_external    : 1
    <d70>   DW_AT_declaration : 1
 <1><d71>: Abbrev Number: 10 (DW_TAG_variable)
    <d72>   DW_AT_name        : (indirect string, offset: 0x73f): tcp_states
    <d76>   DW_AT_decl_file   : 19
    <d77>   DW_AT_decl_line   : 448
    <d79>   DW_AT_decl_column : 26
    <d7a>   DW_AT_type        : <0xb41>
    <d7e>   DW_AT_external    : 1
    <d7f>   DW_AT_declaration : 1
 <1><d80>: Abbrev Number: 10 (DW_TAG_variable)
    <d81>   DW_AT_name        : (indirect string, offset: 0x1015): whence_codes
    <d85>   DW_AT_decl_file   : 19
    <d86>   DW_AT_decl_line   : 449
    <d88>   DW_AT_decl_column : 26
    <d89>   DW_AT_type        : <0xb41>
    <d8d>   DW_AT_external    : 1
    <d8e>   DW_AT_declaration : 1
 <1><d8f>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d90>   DW_AT_encoding    : 7	(unsigned)
    <d91>   DW_AT_byte_size   : 4
    <d92>   DW_AT_type        : <0x2b>
    <d96>   DW_AT_decl_file   : 19
    <d97>   DW_AT_decl_line   : 510
    <d99>   DW_AT_decl_column : 14
    <d9a>   DW_AT_sibling     : <0xdb1>
 <2><d9e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d9f>   DW_AT_name        : (indirect string, offset: 0x973): CFLAG_NONE
    <da3>   DW_AT_const_value : 0
 <2><da4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0x8ab): CFLAG_ONLY_STATS
    <da9>   DW_AT_const_value : 1
 <2><daa>: Abbrev Number: 26 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0xb91): CFLAG_BOTH
    <daf>   DW_AT_const_value : 2
 <2><db0>: Abbrev Number: 0
 <1><db1>: Abbrev Number: 28 (DW_TAG_typedef)
    <db2>   DW_AT_name        : (indirect string, offset: 0x10b7): cflag_t
    <db6>   DW_AT_decl_file   : 19
    <db7>   DW_AT_decl_line   : 514
    <db9>   DW_AT_decl_column : 3
    <dba>   DW_AT_type        : <0xd8f>
 <1><dbe>: Abbrev Number: 10 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xca9): cflag
    <dc3>   DW_AT_decl_file   : 19
    <dc4>   DW_AT_decl_line   : 515
    <dc6>   DW_AT_decl_column : 16
    <dc7>   DW_AT_type        : <0xdb1>
    <dcb>   DW_AT_external    : 1
    <dcc>   DW_AT_declaration : 1
 <1><dcd>: Abbrev Number: 10 (DW_TAG_variable)
    <dce>   DW_AT_name        : (indirect string, offset: 0x17f): Tflag
    <dd2>   DW_AT_decl_file   : 19
    <dd3>   DW_AT_decl_line   : 516
    <dd5>   DW_AT_decl_column : 13
    <dd6>   DW_AT_type        : <0x52d>
    <dda>   DW_AT_external    : 1
    <ddb>   DW_AT_declaration : 1
 <1><ddc>: Abbrev Number: 10 (DW_TAG_variable)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x795): Tflag_scale
    <de1>   DW_AT_decl_file   : 19
    <de2>   DW_AT_decl_line   : 517
    <de4>   DW_AT_decl_column : 12
    <de5>   DW_AT_type        : <0x64>
    <de9>   DW_AT_external    : 1
    <dea>   DW_AT_declaration : 1
 <1><deb>: Abbrev Number: 10 (DW_TAG_variable)
    <dec>   DW_AT_name        : (indirect string, offset: 0x827): Tflag_width
    <df0>   DW_AT_decl_file   : 19
    <df1>   DW_AT_decl_line   : 518
    <df3>   DW_AT_decl_column : 12
    <df4>   DW_AT_type        : <0x64>
    <df8>   DW_AT_external    : 1
    <df9>   DW_AT_declaration : 1
 <1><dfa>: Abbrev Number: 10 (DW_TAG_variable)
    <dfb>   DW_AT_name        : (indirect string, offset: 0xde5): iflag
    <dff>   DW_AT_decl_file   : 19
    <e00>   DW_AT_decl_line   : 519
    <e02>   DW_AT_decl_column : 13
    <e03>   DW_AT_type        : <0x52d>
    <e07>   DW_AT_external    : 1
    <e08>   DW_AT_declaration : 1
 <1><e09>: Abbrev Number: 10 (DW_TAG_variable)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x58c): count_wallclock
    <e0e>   DW_AT_decl_file   : 19
    <e0f>   DW_AT_decl_line   : 520
    <e11>   DW_AT_decl_column : 13
    <e12>   DW_AT_type        : <0x52d>
    <e16>   DW_AT_external    : 1
    <e17>   DW_AT_declaration : 1
 <1><e18>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e19>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <e1d>   DW_AT_byte_size   : 4
    <e1e>   DW_AT_decl_file   : 19
    <e1f>   DW_AT_decl_line   : 522
    <e21>   DW_AT_decl_column : 8
    <e22>   DW_AT_sibling     : <0xe37>
 <2><e26>: Abbrev Number: 22 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e2b>   DW_AT_decl_file   : 19
    <e2c>   DW_AT_decl_line   : 523
    <e2e>   DW_AT_decl_column : 14
    <e2f>   DW_AT_type        : <0x1e1>
    <e33>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e36>: Abbrev Number: 0
 <1><e37>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e38>   DW_AT_name        : (indirect string, offset: 0x74a): path_set
    <e3c>   DW_AT_byte_size   : 12
    <e3d>   DW_AT_decl_file   : 19
    <e3e>   DW_AT_decl_line   : 527
    <e40>   DW_AT_decl_column : 15
    <e41>   DW_AT_sibling     : <0xe76>
 <2><e45>: Abbrev Number: 22 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x6d8): paths_selected
    <e4a>   DW_AT_decl_file   : 19
    <e4b>   DW_AT_decl_line   : 528
    <e4d>   DW_AT_decl_column : 24
    <e4e>   DW_AT_type        : <0xe76>
    <e52>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e55>: Abbrev Number: 22 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0x1008): num_selected
    <e5a>   DW_AT_decl_file   : 19
    <e5b>   DW_AT_decl_line   : 529
    <e5d>   DW_AT_decl_column : 9
    <e5e>   DW_AT_type        : <0x13a>
    <e62>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e65>: Abbrev Number: 22 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0xb39): size
    <e6a>   DW_AT_decl_file   : 19
    <e6b>   DW_AT_decl_line   : 530
    <e6d>   DW_AT_decl_column : 9
    <e6e>   DW_AT_type        : <0x13a>
    <e72>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e75>: Abbrev Number: 0
 <1><e76>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e77>   DW_AT_byte_size   : 4
    <e78>   DW_AT_type        : <0xe18>
 <1><e7c>: Abbrev Number: 10 (DW_TAG_variable)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x1057): global_path_set
    <e81>   DW_AT_decl_file   : 19
    <e82>   DW_AT_decl_line   : 531
    <e84>   DW_AT_decl_column : 3
    <e85>   DW_AT_type        : <0xe37>
    <e89>   DW_AT_external    : 1
    <e8a>   DW_AT_declaration : 1
 <1><e8b>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e8c>   DW_AT_name        : (indirect string, offset: 0xf4a): xflag_opts
    <e90>   DW_AT_encoding    : 7	(unsigned)
    <e91>   DW_AT_byte_size   : 4
    <e92>   DW_AT_type        : <0x2b>
    <e96>   DW_AT_decl_file   : 19
    <e97>   DW_AT_decl_line   : 533
    <e99>   DW_AT_decl_column : 6
    <e9a>   DW_AT_sibling     : <0xebd>
 <2><e9e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x9f7): HEXSTR_NONE
    <ea3>   DW_AT_const_value : 0
 <2><ea4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xf9a): HEXSTR_NON_ASCII
    <ea9>   DW_AT_const_value : 1
 <2><eaa>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eab>   DW_AT_name        : (indirect string, offset: 0x8e9): HEXSTR_ALL
    <eaf>   DW_AT_const_value : 2
 <2><eb0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x663): HEXSTR_NON_ASCII_CHARS
    <eb5>   DW_AT_const_value : 3
 <2><eb6>: Abbrev Number: 26 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x1022): NUM_HEXSTR_OPTS
    <ebb>   DW_AT_const_value : 4
 <2><ebc>: Abbrev Number: 0
 <1><ebd>: Abbrev Number: 10 (DW_TAG_variable)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xdbf): xflag
    <ec2>   DW_AT_decl_file   : 19
    <ec3>   DW_AT_decl_line   : 546
    <ec5>   DW_AT_decl_column : 17
    <ec6>   DW_AT_type        : <0x2b>
    <eca>   DW_AT_external    : 1
    <ecb>   DW_AT_declaration : 1
 <1><ecc>: Abbrev Number: 10 (DW_TAG_variable)
    <ecd>   DW_AT_name        : (indirect string, offset: 0xc64): followfork
    <ed1>   DW_AT_decl_file   : 19
    <ed2>   DW_AT_decl_line   : 547
    <ed4>   DW_AT_decl_column : 13
    <ed5>   DW_AT_type        : <0x52d>
    <ed9>   DW_AT_external    : 1
    <eda>   DW_AT_declaration : 1
 <1><edb>: Abbrev Number: 10 (DW_TAG_variable)
    <edc>   DW_AT_name        : (indirect string, offset: 0x311): output_separately
    <ee0>   DW_AT_decl_file   : 19
    <ee1>   DW_AT_decl_line   : 548
    <ee3>   DW_AT_decl_column : 13
    <ee4>   DW_AT_type        : <0x52d>
    <ee8>   DW_AT_external    : 1
    <ee9>   DW_AT_declaration : 1
 <1><eea>: Abbrev Number: 10 (DW_TAG_variable)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x21b): stack_trace_enabled
    <eef>   DW_AT_decl_file   : 19
    <ef0>   DW_AT_decl_line   : 551
    <ef2>   DW_AT_decl_column : 13
    <ef3>   DW_AT_type        : <0x52d>
    <ef7>   DW_AT_external    : 1
    <ef8>   DW_AT_declaration : 1
 <1><ef9>: Abbrev Number: 10 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0x651): ptrace_setoptions
    <efe>   DW_AT_decl_file   : 19
    <eff>   DW_AT_decl_line   : 555
    <f01>   DW_AT_decl_column : 17
    <f02>   DW_AT_type        : <0x2b>
    <f06>   DW_AT_external    : 1
    <f07>   DW_AT_declaration : 1
 <1><f08>: Abbrev Number: 10 (DW_TAG_variable)
    <f09>   DW_AT_name        : (indirect string, offset: 0x9e2): max_strlen
    <f0d>   DW_AT_decl_file   : 19
    <f0e>   DW_AT_decl_line   : 556
    <f10>   DW_AT_decl_column : 17
    <f11>   DW_AT_type        : <0x2b>
    <f15>   DW_AT_external    : 1
    <f16>   DW_AT_declaration : 1
 <1><f17>: Abbrev Number: 10 (DW_TAG_variable)
    <f18>   DW_AT_name        : (indirect string, offset: 0xa30): os_release
    <f1c>   DW_AT_decl_file   : 19
    <f1d>   DW_AT_decl_line   : 557
    <f1f>   DW_AT_decl_column : 17
    <f20>   DW_AT_type        : <0x2b>
    <f24>   DW_AT_external    : 1
    <f25>   DW_AT_declaration : 1
 <1><f26>: Abbrev Number: 10 (DW_TAG_variable)
    <f27>   DW_AT_name        : (indirect string, offset: 0x6e7): xlat_verbosity
    <f2b>   DW_AT_decl_file   : 19
    <f2c>   DW_AT_decl_line   : 919
    <f2e>   DW_AT_decl_column : 24
    <f2f>   DW_AT_type        : <0xa64>
    <f33>   DW_AT_external    : 1
    <f34>   DW_AT_declaration : 1
 <1><f35>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f36>   DW_AT_name        : (indirect string, offset: 0x56f): xlat_style_private_flag_bits
    <f3a>   DW_AT_encoding    : 7	(unsigned)
    <f3b>   DW_AT_byte_size   : 4
    <f3c>   DW_AT_type        : <0x2b>
    <f40>   DW_AT_decl_file   : 19
    <f41>   DW_AT_decl_line   : 939
    <f43>   DW_AT_decl_column : 6
    <f44>   DW_AT_sibling     : <0xf61>
 <2><f48>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x290): PAF_PRINT_INDICES_BIT
    <f4d>   DW_AT_const_value : 5
 <2><f4e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xaf0): PAF_ARRAY_TRUNCATED_BIT
    <f53>   DW_AT_const_value : 6
 <2><f54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0x3cf): PXF_DEFAULT_STR_BIT
    <f59>   DW_AT_const_value : 7
 <2><f5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0xc46): SPFF_AUXSTR_MODE_BIT
    <f5f>   DW_AT_const_value : 8
 <2><f60>: Abbrev Number: 0
 <1><f61>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f62>   DW_AT_name        : (indirect string, offset: 0xcf5): find_xlat_flag_bits
    <f66>   DW_AT_encoding    : 7	(unsigned)
    <f67>   DW_AT_byte_size   : 4
    <f68>   DW_AT_type        : <0x2b>
    <f6c>   DW_AT_decl_file   : 19
    <f6d>   DW_AT_decl_line   : 1443
    <f6f>   DW_AT_decl_column : 6
    <f70>   DW_AT_sibling     : <0xf7b>
 <2><f74>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f75>   DW_AT_name        : (indirect string, offset: 0x931): FXL_CASE_SENSITIVE_BIT
    <f79>   DW_AT_const_value : 0
 <2><f7a>: Abbrev Number: 0
 <1><f7b>: Abbrev Number: 10 (DW_TAG_variable)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x9be): printing_tcp
    <f80>   DW_AT_decl_file   : 19
    <f81>   DW_AT_decl_line   : 1689
    <f83>   DW_AT_decl_column : 20
    <f84>   DW_AT_type        : <0x609>
    <f88>   DW_AT_external    : 1
    <f89>   DW_AT_declaration : 1
 <1><f8a>: Abbrev Number: 10 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x523): errnoent
    <f8f>   DW_AT_decl_file   : 19
    <f90>   DW_AT_decl_line   : 1887
    <f92>   DW_AT_decl_column : 26
    <f93>   DW_AT_type        : <0x461>
    <f97>   DW_AT_external    : 1
    <f98>   DW_AT_declaration : 1
 <1><f99>: Abbrev Number: 10 (DW_TAG_variable)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x833): signalent
    <f9e>   DW_AT_decl_file   : 19
    <f9f>   DW_AT_decl_line   : 1888
    <fa1>   DW_AT_decl_column : 26
    <fa2>   DW_AT_type        : <0x461>
    <fa6>   DW_AT_external    : 1
    <fa7>   DW_AT_declaration : 1
 <1><fa8>: Abbrev Number: 10 (DW_TAG_variable)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xe38): nerrnos
    <fad>   DW_AT_decl_file   : 19
    <fae>   DW_AT_decl_line   : 1889
    <fb0>   DW_AT_decl_column : 27
    <fb1>   DW_AT_type        : <0x32>
    <fb5>   DW_AT_external    : 1
    <fb6>   DW_AT_declaration : 1
 <1><fb7>: Abbrev Number: 10 (DW_TAG_variable)
    <fb8>   DW_AT_name        : (indirect string, offset: 0xff1): nsignals
    <fbc>   DW_AT_decl_file   : 19
    <fbd>   DW_AT_decl_line   : 1890
    <fbf>   DW_AT_decl_column : 27
    <fc0>   DW_AT_type        : <0x32>
    <fc4>   DW_AT_external    : 1
    <fc5>   DW_AT_declaration : 1
 <1><fc6>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc7>   DW_AT_type        : <0x883>
    <fcb>   DW_AT_sibling     : <0xfd1>
 <2><fcf>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fd0>: Abbrev Number: 0
 <1><fd1>: Abbrev Number: 3 (DW_TAG_const_type)
    <fd2>   DW_AT_type        : <0xfc6>
 <1><fd6>: Abbrev Number: 10 (DW_TAG_variable)
    <fd7>   DW_AT_name        : (indirect string, offset: 0xcc0): sysent0
    <fdb>   DW_AT_decl_file   : 19
    <fdc>   DW_AT_decl_line   : 1892
    <fde>   DW_AT_decl_column : 28
    <fdf>   DW_AT_type        : <0xfd1>
    <fe3>   DW_AT_external    : 1
    <fe4>   DW_AT_declaration : 1
 <1><fe5>: Abbrev Number: 15 (DW_TAG_array_type)
    <fe6>   DW_AT_type        : <0x8ea>
    <fea>   DW_AT_sibling     : <0xff0>
 <2><fee>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fef>: Abbrev Number: 0
 <1><ff0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ff1>   DW_AT_type        : <0xfe5>
 <1><ff5>: Abbrev Number: 10 (DW_TAG_variable)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x104d): ioctlent0
    <ffa>   DW_AT_decl_file   : 19
    <ffb>   DW_AT_decl_line   : 1893
    <ffd>   DW_AT_decl_column : 30
    <ffe>   DW_AT_type        : <0xff0>
    <1002>   DW_AT_external    : 1
    <1003>   DW_AT_declaration : 1
 <1><1004>: Abbrev Number: 10 (DW_TAG_variable)
    <1005>   DW_AT_name        : (indirect string, offset: 0xf55): personality_names
    <1009>   DW_AT_decl_file   : 19
    <100a>   DW_AT_decl_line   : 1895
    <100c>   DW_AT_decl_column : 26
    <100d>   DW_AT_type        : <0x461>
    <1011>   DW_AT_external    : 1
    <1012>   DW_AT_declaration : 1
 <1><1013>: Abbrev Number: 10 (DW_TAG_variable)
    <1014>   DW_AT_name        : (indirect string, offset: 0x853): sysent
    <1018>   DW_AT_decl_file   : 19
    <1019>   DW_AT_decl_line   : 1898
    <101b>   DW_AT_decl_column : 29
    <101c>   DW_AT_type        : <0x9cf>
    <1020>   DW_AT_external    : 1
    <1021>   DW_AT_declaration : 1
 <1><1022>: Abbrev Number: 10 (DW_TAG_variable)
    <1023>   DW_AT_name        : (indirect string, offset: 0xc5b): ioctlent
    <1027>   DW_AT_decl_file   : 19
    <1028>   DW_AT_decl_line   : 1899
    <102a>   DW_AT_decl_column : 31
    <102b>   DW_AT_type        : <0x1031>
    <102f>   DW_AT_external    : 1
    <1030>   DW_AT_declaration : 1
 <1><1031>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1032>   DW_AT_byte_size   : 4
    <1033>   DW_AT_type        : <0x8ea>
 <1><1037>: Abbrev Number: 10 (DW_TAG_variable)
    <1038>   DW_AT_name        : (indirect string, offset: 0x83d): nsyscalls
    <103c>   DW_AT_decl_file   : 19
    <103d>   DW_AT_decl_line   : 1905
    <103f>   DW_AT_decl_column : 17
    <1040>   DW_AT_type        : <0x2b>
    <1044>   DW_AT_external    : 1
    <1045>   DW_AT_declaration : 1
 <1><1046>: Abbrev Number: 10 (DW_TAG_variable)
    <1047>   DW_AT_name        : (indirect string, offset: 0xe52): nioctlents
    <104b>   DW_AT_decl_file   : 19
    <104c>   DW_AT_decl_line   : 1906
    <104e>   DW_AT_decl_column : 17
    <104f>   DW_AT_type        : <0x2b>
    <1053>   DW_AT_external    : 1
    <1054>   DW_AT_declaration : 1
 <1><1055>: Abbrev Number: 15 (DW_TAG_array_type)
    <1056>   DW_AT_type        : <0x32>
    <105a>   DW_AT_sibling     : <0x1065>
 <2><105e>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <105f>   DW_AT_type        : <0x2b>
    <1063>   DW_AT_upper_bound : 2
 <2><1064>: Abbrev Number: 0
 <1><1065>: Abbrev Number: 3 (DW_TAG_const_type)
    <1066>   DW_AT_type        : <0x1055>
 <1><106a>: Abbrev Number: 10 (DW_TAG_variable)
    <106b>   DW_AT_name        : (indirect string, offset: 0xeb2): nsyscall_vec
    <106f>   DW_AT_decl_file   : 19
    <1070>   DW_AT_decl_line   : 1908
    <1072>   DW_AT_decl_column : 27
    <1073>   DW_AT_type        : <0x1065>
    <1077>   DW_AT_external    : 1
    <1078>   DW_AT_declaration : 1
 <1><1079>: Abbrev Number: 15 (DW_TAG_array_type)
    <107a>   DW_AT_type        : <0x9d5>
    <107e>   DW_AT_sibling     : <0x1089>
 <2><1082>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1083>   DW_AT_type        : <0x2b>
    <1087>   DW_AT_upper_bound : 2
 <2><1088>: Abbrev Number: 0
 <1><1089>: Abbrev Number: 3 (DW_TAG_const_type)
    <108a>   DW_AT_type        : <0x1079>
 <1><108e>: Abbrev Number: 10 (DW_TAG_variable)
    <108f>   DW_AT_name        : (indirect string, offset: 0x782): sysent_vec
    <1093>   DW_AT_decl_file   : 19
    <1094>   DW_AT_decl_line   : 1909
    <1096>   DW_AT_decl_column : 35
    <1097>   DW_AT_type        : <0x1089>
    <109b>   DW_AT_external    : 1
    <109c>   DW_AT_declaration : 1
 <1><109d>: Abbrev Number: 10 (DW_TAG_variable)
    <109e>   DW_AT_name        : (indirect string, offset: 0x370): inject_vec
    <10a2>   DW_AT_decl_file   : 19
    <10a3>   DW_AT_decl_line   : 1910
    <10a5>   DW_AT_decl_column : 28
    <10a6>   DW_AT_type        : <0x9da>
    <10aa>   DW_AT_external    : 1
    <10ab>   DW_AT_declaration : 1
 <1><10ac>: Abbrev Number: 29 (DW_TAG_structure_type)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xd49): audit_arch_t
    <10b1>   DW_AT_byte_size   : 8
    <10b2>   DW_AT_decl_file   : 19
    <10b3>   DW_AT_decl_line   : 1912
    <10b5>   DW_AT_decl_column : 8
    <10b6>   DW_AT_sibling     : <0x10db>
 <2><10ba>: Abbrev Number: 22 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x557): arch
    <10bf>   DW_AT_decl_file   : 19
    <10c0>   DW_AT_decl_line   : 1913
    <10c2>   DW_AT_decl_column : 15
    <10c3>   DW_AT_type        : <0x2b>
    <10c7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ca>: Abbrev Number: 22 (DW_TAG_member)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x9a4): flag
    <10cf>   DW_AT_decl_file   : 19
    <10d0>   DW_AT_decl_line   : 1914
    <10d2>   DW_AT_decl_column : 15
    <10d3>   DW_AT_type        : <0x2b>
    <10d7>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10da>: Abbrev Number: 0
 <1><10db>: Abbrev Number: 3 (DW_TAG_const_type)
    <10dc>   DW_AT_type        : <0x10ac>
 <1><10e0>: Abbrev Number: 15 (DW_TAG_array_type)
    <10e1>   DW_AT_type        : <0x10db>
    <10e5>   DW_AT_sibling     : <0x10f0>
 <2><10e9>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10ea>   DW_AT_type        : <0x2b>
    <10ee>   DW_AT_upper_bound : 2
 <2><10ef>: Abbrev Number: 0
 <1><10f0>: Abbrev Number: 3 (DW_TAG_const_type)
    <10f1>   DW_AT_type        : <0x10e0>
 <1><10f5>: Abbrev Number: 10 (DW_TAG_variable)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x922): audit_arch_vec
    <10fa>   DW_AT_decl_file   : 19
    <10fb>   DW_AT_decl_line   : 1917
    <10fd>   DW_AT_decl_column : 34
    <10fe>   DW_AT_type        : <0x10f0>
    <1102>   DW_AT_external    : 1
    <1103>   DW_AT_declaration : 1
 <1><1104>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1105>   DW_AT_byte_size   : 180
    <1106>   DW_AT_decl_file   : 21
    <1107>   DW_AT_decl_line   : 2
    <1108>   DW_AT_decl_column : 9
    <1109>   DW_AT_sibling     : <0x13be>
 <2><110d>: Abbrev Number: 9 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x1cc): block_ioctl
    <1112>   DW_AT_decl_file   : 21
    <1113>   DW_AT_decl_line   : 3
    <1114>   DW_AT_decl_column : 8
    <1115>   DW_AT_type        : <0x13d8>
    <1119>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><111c>: Abbrev Number: 9 (DW_TAG_member)
    <111d>   DW_AT_name        : (indirect string, offset: 0xa8f): btrfs_ioctl
    <1121>   DW_AT_decl_file   : 21
    <1122>   DW_AT_decl_line   : 6
    <1123>   DW_AT_decl_column : 8
    <1124>   DW_AT_type        : <0x13d8>
    <1128>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><112b>: Abbrev Number: 9 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x720): evdev_write_ioctl_mpers
    <1130>   DW_AT_decl_file   : 21
    <1131>   DW_AT_decl_line   : 9
    <1132>   DW_AT_decl_column : 8
    <1133>   DW_AT_type        : <0x13d8>
    <1137>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><113a>: Abbrev Number: 9 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x6f6): get_sock_fprog_size
    <113f>   DW_AT_decl_file   : 21
    <1140>   DW_AT_decl_line   : 12
    <1141>   DW_AT_decl_column : 17
    <1142>   DW_AT_type        : <0x13e4>
    <1146>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1149>: Abbrev Number: 9 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0x19b): fetch_bpf_fprog
    <114e>   DW_AT_decl_file   : 21
    <114f>   DW_AT_decl_line   : 15
    <1150>   DW_AT_decl_column : 10
    <1151>   DW_AT_type        : <0x1404>
    <1155>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1158>: Abbrev Number: 9 (DW_TAG_member)
    <1159>   DW_AT_name        : (indirect string, offset: 0x90f): fetch_struct_flock
    <115d>   DW_AT_decl_file   : 21
    <115e>   DW_AT_decl_line   : 18
    <115f>   DW_AT_decl_column : 10
    <1160>   DW_AT_type        : <0x1404>
