Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x166b (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5bc): GNU C17 9.4.0 -m32 -mtune=generic -march=i686 -gdwarf-2 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x4e): mpers-m32/tms_t.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe49): /root/strace-prc/src
    <19>   DW_AT_stmt_list   : 0x0
 <1><1d>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e>   DW_AT_byte_size   : 1
    <1f>   DW_AT_encoding    : 8	(unsigned char)
    <20>   DW_AT_name        : (indirect string, offset: 0x396): unsigned char
 <1><24>: Abbrev Number: 2 (DW_TAG_base_type)
    <25>   DW_AT_byte_size   : 2
    <26>   DW_AT_encoding    : 7	(unsigned)
    <27>   DW_AT_name        : (indirect string, offset: 0xfa7): short unsigned int
 <1><2b>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c>   DW_AT_byte_size   : 4
    <2d>   DW_AT_encoding    : 7	(unsigned)
    <2e>   DW_AT_name        : (indirect string, offset: 0x961): unsigned int
 <1><32>: Abbrev Number: 3 (DW_TAG_const_type)
    <33>   DW_AT_type        : <0x2b>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4

    <54>   DW_AT_name        : (indirect string, offset: 0xda1): short int
 <1><58>: Abbrev Number: 4 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x468): __uint16_t
    <5d>   DW_AT_decl_file   : 1
    <5e>   DW_AT_decl_line   : 40
    <5f>   DW_AT_decl_column : 28
    <60>   DW_AT_type        : <0x24>
 <1><64>: Abbrev Number: 5 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : int
 <1><6b>: Abbrev Number: 3 (DW_TAG_const_type)
    <6c>   DW_AT_type        : <0x64>
 <1><70>: Abbrev Number: 4 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x85c): __uint32_t
    <75>   DW_AT_decl_file   : 1
    <76>   DW_AT_decl_line   : 42
    <77>   DW_AT_decl_column : 22
    <78>   DW_AT_type        : <0x2b>
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0xe9a): __int64_t
    <81>   DW_AT_decl_file   : 1
    <82>   DW_AT_decl_line   : 47
    <83>   DW_AT_decl_column : 44
    <84>   DW_AT_type        : <0x88>
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 5	(signed)
    <8b>   DW_AT_name        : (indirect string, offset: 0x88c): long long int
 <1><8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x767): __uint64_t
    <94>   DW_AT_decl_file   : 1
    <95>   DW_AT_decl_line   : 48
    <96>   DW_AT_decl_column : 46
    <97>   DW_AT_type        : <0x9b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 8
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0xb2a): long long unsigned int
 <1><a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3>   DW_AT_name        : (indirect string, offset: 0xb68): __off_t
    <a7>   DW_AT_decl_file   : 1
    <a8>   DW_AT_decl_line   : 152
    <a9>   DW_AT_decl_column : 25
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_encoding    : 5	(signed)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2af): long int
 <1><b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xcb4): __off64_t
    <ba>   DW_AT_decl_file   : 1
    <bb>   DW_AT_decl_line   : 153
    <bc>   DW_AT_decl_column : 27
    <bd>   DW_AT_type        : <0x7c>
 <1><c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x9ef): __clock_t
    <c6>   DW_AT_decl_file   : 1
    <c7>   DW_AT_decl_line   : 156
    <c8>   DW_AT_decl_column : 27
    <c9>   DW_AT_type        : <0xae>
 <1><cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xc29): __time_t
    <d2>   DW_AT_decl_file   : 1
    <d3>   DW_AT_decl_line   : 160
    <d4>   DW_AT_decl_column : 26
    <d5>   DW_AT_type        : <0xae>
 <1><d9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
 <1><db>: Abbrev Number: 3 (DW_TAG_const_type)
    <dc>   DW_AT_type        : <0xd9>
 <1><e0>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1>   DW_AT_name        : (indirect string, offset: 0x3e2): __syscall_slong_t
    <e5>   DW_AT_decl_file   : 1
    <e6>   DW_AT_decl_line   : 196
    <e7>   DW_AT_decl_column : 33
    <e8>   DW_AT_type        : <0xae>
 <1><ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed>   DW_AT_byte_size   : 4
    <ee>   DW_AT_type        : <0xf2>
 <1><f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3>   DW_AT_byte_size   : 1
    <f4>   DW_AT_encoding    : 6	(signed char)
    <f5>   DW_AT_name        : (indirect string, offset: 0x42e): char
 <1><f9>: Abbrev Number: 3 (DW_TAG_const_type)
    <fa>   DW_AT_type        : <0xf2>
 <1><fe>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x345): uint8_t
    <103>   DW_AT_decl_file   : 2
    <104>   DW_AT_decl_line   : 24
    <105>   DW_AT_decl_column : 19
    <106>   DW_AT_type        : <0x45>
 <1><10a>: Abbrev Number: 4 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xb53): uint16_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 25
    <111>   DW_AT_decl_column : 20
    <112>   DW_AT_type        : <0x58>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xf42): uint32_t
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 26
    <11d>   DW_AT_decl_column : 20
    <11e>   DW_AT_type        : <0x70>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0xdb1): uint64_t
    <127>   DW_AT_decl_file   : 2
    <128>   DW_AT_decl_line   : 27
    <129>   DW_AT_decl_column : 20
    <12a>   DW_AT_type        : <0x8f>
 <1><12e>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0xb41): clock_t
    <133>   DW_AT_decl_file   : 3
    <134>   DW_AT_decl_line   : 7
    <135>   DW_AT_decl_column : 19
    <136>   DW_AT_type        : <0xc1>
 <1><13a>: Abbrev Number: 4 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0x39): size_t
    <13f>   DW_AT_decl_file   : 4
    <140>   DW_AT_decl_line   : 209
    <141>   DW_AT_decl_column : 23
    <142>   DW_AT_type        : <0x2b>
 <1><146>: Abbrev Number: 3 (DW_TAG_const_type)
    <147>   DW_AT_type        : <0x13a>
 <1><14b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <14c>   DW_AT_name        : (indirect string, offset: 0xad3): timespec
    <150>   DW_AT_byte_size   : 8
    <151>   DW_AT_decl_file   : 5
    <152>   DW_AT_decl_line   : 10
    <153>   DW_AT_decl_column : 8
    <154>   DW_AT_sibling     : <0x177>
 <2><158>: Abbrev Number: 9 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x1074): tv_sec
    <15d>   DW_AT_decl_file   : 5
    <15e>   DW_AT_decl_line   : 12
    <15f>   DW_AT_decl_column : 12
    <160>   DW_AT_type        : <0xcd>
    <164>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><167>: Abbrev Number: 9 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0xdd7): tv_nsec
    <16c>   DW_AT_decl_file   : 5
    <16d>   DW_AT_decl_line   : 16
    <16e>   DW_AT_decl_column : 21
    <16f>   DW_AT_type        : <0xe0>
    <173>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><176>: Abbrev Number: 0
 <1><177>: Abbrev Number: 2 (DW_TAG_base_type)
    <178>   DW_AT_byte_size   : 12
    <179>   DW_AT_encoding    : 4	(float)
    <17a>   DW_AT_name        : (indirect string, offset: 0xa95): long double
 <1><17e>: Abbrev Number: 2 (DW_TAG_base_type)
    <17f>   DW_AT_byte_size   : 16
    <180>   DW_AT_encoding    : 4	(float)
    <181>   DW_AT_name        : (indirect string, offset: 0xf6b): _Float128
 <1><185>: Abbrev Number: 10 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0x266): __environ
    <18a>   DW_AT_decl_file   : 6
    <18b>   DW_AT_decl_line   : 543
    <18d>   DW_AT_decl_column : 15
    <18e>   DW_AT_type        : <0x194>
    <192>   DW_AT_external    : 1
    <193>   DW_AT_declaration : 1
 <1><194>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <195>   DW_AT_byte_size   : 4
    <196>   DW_AT_type        : <0xec>
 <1><19a>: Abbrev Number: 10 (DW_TAG_variable)
    <19b>   DW_AT_name        : (indirect string, offset: 0x38e): environ
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 545
    <1a2>   DW_AT_decl_column : 15
    <1a3>   DW_AT_type        : <0x194>
    <1a7>   DW_AT_external    : 1
    <1a8>   DW_AT_declaration : 1
 <1><1a9>: Abbrev Number: 11 (DW_TAG_variable)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xf91): optarg
    <1ae>   DW_AT_decl_file   : 7
    <1af>   DW_AT_decl_line   : 36
    <1b0>   DW_AT_decl_column : 14
    <1b1>   DW_AT_type        : <0xec>
    <1b5>   DW_AT_external    : 1
    <1b6>   DW_AT_declaration : 1
 <1><1b7>: Abbrev Number: 11 (DW_TAG_variable)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x73a): optind
    <1bc>   DW_AT_decl_file   : 7
    <1bd>   DW_AT_decl_line   : 50
    <1be>   DW_AT_decl_column : 12
    <1bf>   DW_AT_type        : <0x64>
    <1c3>   DW_AT_external    : 1
    <1c4>   DW_AT_declaration : 1
 <1><1c5>: Abbrev Number: 11 (DW_TAG_variable)
    <1c6>   DW_AT_name        : (indirect string, offset: 0xc18): opterr
    <1ca>   DW_AT_decl_file   : 7
    <1cb>   DW_AT_decl_line   : 55
    <1cc>   DW_AT_decl_column : 12
    <1cd>   DW_AT_type        : <0x64>
    <1d1>   DW_AT_external    : 1
    <1d2>   DW_AT_declaration : 1
 <1><1d3>: Abbrev Number: 11 (DW_TAG_variable)
    <1d4>   DW_AT_name        : (indirect string, offset: 0xb10): optopt
    <1d8>   DW_AT_decl_file   : 7
    <1d9>   DW_AT_decl_line   : 59
    <1da>   DW_AT_decl_column : 12
    <1db>   DW_AT_type        : <0x64>
    <1df>   DW_AT_external    : 1
    <1e0>   DW_AT_declaration : 1
 <1><1e1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e2>   DW_AT_byte_size   : 4
    <1e3>   DW_AT_type        : <0xf9>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_const_type)
    <1e8>   DW_AT_type        : <0x1e1>
 <1><1ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ed>   DW_AT_byte_size   : 4
    <1ee>   DW_AT_type        : <0x1f2>
 <1><1f2>: Abbrev Number: 12 (DW_TAG_const_type)
 <1><1f3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x34d): _IO_FILE
    <1f8>   DW_AT_byte_size   : 148
    <1f9>   DW_AT_decl_file   : 8
    <1fa>   DW_AT_decl_line   : 49
    <1fb>   DW_AT_decl_column : 8
    <1fc>   DW_AT_sibling     : <0x3b4>
 <2><200>: Abbrev Number: 9 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x9dd): _flags
    <205>   DW_AT_decl_file   : 8
    <206>   DW_AT_decl_line   : 51
    <207>   DW_AT_decl_column : 7
    <208>   DW_AT_type        : <0x64>
    <20c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x4c0): _IO_read_ptr
    <214>   DW_AT_decl_file   : 8
    <215>   DW_AT_decl_line   : 54
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0xec>
    <21b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0xeef): _IO_read_end
    <223>   DW_AT_decl_file   : 8
    <224>   DW_AT_decl_line   : 55
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0xec>
    <22a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><22d>: Abbrev Number: 9 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x7a3): _IO_read_base
    <232>   DW_AT_decl_file   : 8
    <233>   DW_AT_decl_line   : 56
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0xec>
    <239>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><23c>: Abbrev Number: 9 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x12d): _IO_write_base
    <241>   DW_AT_decl_file   : 8
    <242>   DW_AT_decl_line   : 57
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0xec>
    <248>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><24b>: Abbrev Number: 9 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0xfe0): _IO_write_ptr
    <250>   DW_AT_decl_file   : 8
    <251>   DW_AT_decl_line   : 58
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0xec>
    <257>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x8ce): _IO_write_end
    <25f>   DW_AT_decl_file   : 8
    <260>   DW_AT_decl_line   : 59
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_type        : <0xec>
    <266>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><269>: Abbrev Number: 9 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x94a): _IO_buf_base
    <26e>   DW_AT_decl_file   : 8
    <26f>   DW_AT_decl_line   : 60
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0xec>
    <275>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0xd4c): _IO_buf_end
    <27d>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 61
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xec>
    <284>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><287>: Abbrev Number: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x1be): _IO_save_base
    <28c>   DW_AT_decl_file   : 8
    <28d>   DW_AT_decl_line   : 64
    <28e>   DW_AT_decl_column : 9
    <28f>   DW_AT_type        : <0xec>
    <293>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><296>: Abbrev Number: 9 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xc7b): _IO_backup_base
    <29b>   DW_AT_decl_file   : 8
    <29c>   DW_AT_decl_line   : 65
    <29d>   DW_AT_decl_column : 9
    <29e>   DW_AT_type        : <0xec>
    <2a2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><2a5>: Abbrev Number: 9 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0xb5): _IO_save_end
    <2aa>   DW_AT_decl_file   : 8
    <2ab>   DW_AT_decl_line   : 66
    <2ac>   DW_AT_decl_column : 9
    <2ad>   DW_AT_type        : <0xec>
    <2b1>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x55e): _markers
    <2b9>   DW_AT_decl_file   : 8
    <2ba>   DW_AT_decl_line   : 68
    <2bb>   DW_AT_decl_column : 22
    <2bc>   DW_AT_type        : <0x3ce>
    <2c0>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><2c3>: Abbrev Number: 9 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x201): _chain
    <2c8>   DW_AT_decl_file   : 8
    <2c9>   DW_AT_decl_line   : 70
    <2ca>   DW_AT_decl_column : 20
    <2cb>   DW_AT_type        : <0x3d4>
    <2cf>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><2d2>: Abbrev Number: 9 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xf56): _fileno
    <2d7>   DW_AT_decl_file   : 8
    <2d8>   DW_AT_decl_line   : 72
    <2d9>   DW_AT_decl_column : 7
    <2da>   DW_AT_type        : <0x64>
    <2de>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><2e1>: Abbrev Number: 9 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x78f): _flags2
    <2e6>   DW_AT_decl_file   : 8
    <2e7>   DW_AT_decl_line   : 73
    <2e8>   DW_AT_decl_column : 7
    <2e9>   DW_AT_type        : <0x64>
    <2ed>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x808): _old_offset
    <2f5>   DW_AT_decl_file   : 8
    <2f6>   DW_AT_decl_line   : 74
    <2f7>   DW_AT_decl_column : 11
    <2f8>   DW_AT_type        : <0xa2>
    <2fc>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><2ff>: Abbrev Number: 9 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x234): _cur_column
    <304>   DW_AT_decl_file   : 8
    <305>   DW_AT_decl_line   : 77
    <306>   DW_AT_decl_column : 18
    <307>   DW_AT_type        : <0x24>
    <30b>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><30e>: Abbrev Number: 9 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xdfd): _vtable_offset
    <313>   DW_AT_decl_file   : 8
    <314>   DW_AT_decl_line   : 78
    <315>   DW_AT_decl_column : 15
    <316>   DW_AT_type        : <0x3e>
    <31a>   DW_AT_data_member_location: 2 byte block: 23 46 	(DW_OP_plus_uconst: 70)
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0xc8b): _shortbuf
    <322>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 79
    <324>   DW_AT_decl_column : 8
    <325>   DW_AT_type        : <0x3da>
    <329>   DW_AT_data_member_location: 2 byte block: 23 47 	(DW_OP_plus_uconst: 71)
 <2><32c>: Abbrev Number: 9 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x16e): _lock
    <331>   DW_AT_decl_file   : 8
    <332>   DW_AT_decl_line   : 81
    <333>   DW_AT_decl_column : 15
    <334>   DW_AT_type        : <0x3ea>
    <338>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><33b>: Abbrev Number: 9 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x6d2): _offset
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 89
    <342>   DW_AT_decl_column : 13
    <343>   DW_AT_type        : <0xb5>
    <347>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><34a>: Abbrev Number: 9 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xa27): _codecvt
    <34f>   DW_AT_decl_file   : 8
    <350>   DW_AT_decl_line   : 91
    <351>   DW_AT_decl_column : 23
    <352>   DW_AT_type        : <0x3f6>
    <356>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><359>: Abbrev Number: 9 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xf75): _wide_data
    <35e>   DW_AT_decl_file   : 8
    <35f>   DW_AT_decl_line   : 92
    <360>   DW_AT_decl_column : 25
    <361>   DW_AT_type        : <0x402>
    <365>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x3b2): _freeres_list
    <36d>   DW_AT_decl_file   : 8
    <36e>   DW_AT_decl_line   : 93
    <36f>   DW_AT_decl_column : 20
    <370>   DW_AT_type        : <0x3d4>
    <374>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><377>: Abbrev Number: 9 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0xbee): _freeres_buf
    <37c>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 94
    <37e>   DW_AT_decl_column : 9
    <37f>   DW_AT_type        : <0xd9>
    <383>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x99f): __pad5
    <38b>   DW_AT_decl_file   : 8
    <38c>   DW_AT_decl_line   : 95
    <38d>   DW_AT_decl_column : 10
    <38e>   DW_AT_type        : <0x13a>
    <392>   DW_AT_data_member_location: 2 byte block: 23 64 	(DW_OP_plus_uconst: 100)
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0xa0b): _mode
    <39a>   DW_AT_decl_file   : 8
    <39b>   DW_AT_decl_line   : 96
    <39c>   DW_AT_decl_column : 7
    <39d>   DW_AT_type        : <0x64>
    <3a1>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
    <3a5>   DW_AT_name        : (indirect string, offset: 0x7bd): _unused2
    <3a9>   DW_AT_decl_file   : 8
    <3aa>   DW_AT_decl_line   : 98
    <3ab>   DW_AT_decl_column : 8
    <3ac>   DW_AT_type        : <0x408>
    <3b0>   DW_AT_data_member_location: 2 byte block: 23 6c 	(DW_OP_plus_uconst: 108)
 <2><3b3>: Abbrev Number: 0
 <1><3b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xab5): FILE
    <3b9>   DW_AT_decl_file   : 9
    <3ba>   DW_AT_decl_line   : 7
    <3bb>   DW_AT_decl_column : 25
    <3bc>   DW_AT_type        : <0x1f3>
 <1><3c0>: Abbrev Number: 13 (DW_TAG_typedef)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x45d): _IO_lock_t
    <3c5>   DW_AT_decl_file   : 8
    <3c6>   DW_AT_decl_line   : 43
    <3c7>   DW_AT_decl_column : 14
 <1><3c8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x2f1): _IO_marker
    <3cd>   DW_AT_declaration : 1
 <1><3ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 4
    <3d0>   DW_AT_type        : <0x3c8>
 <1><3d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3d5>   DW_AT_byte_size   : 4
    <3d6>   DW_AT_type        : <0x1f3>
 <1><3da>: Abbrev Number: 15 (DW_TAG_array_type)
    <3db>   DW_AT_type        : <0xf2>
    <3df>   DW_AT_sibling     : <0x3ea>
 <2><3e3>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3e4>   DW_AT_type        : <0x2b>
    <3e8>   DW_AT_upper_bound : 0
 <2><3e9>: Abbrev Number: 0
 <1><3ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3eb>   DW_AT_byte_size   : 4
    <3ec>   DW_AT_type        : <0x3c0>
 <1><3f0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x78): _IO_codecvt
    <3f5>   DW_AT_declaration : 1
 <1><3f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3f7>   DW_AT_byte_size   : 4
    <3f8>   DW_AT_type        : <0x3f0>
 <1><3fc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3fd>   DW_AT_name        : (indirect string, offset: 0x361): _IO_wide_data
    <401>   DW_AT_declaration : 1
 <1><402>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <403>   DW_AT_byte_size   : 4
    <404>   DW_AT_type        : <0x3fc>
 <1><408>: Abbrev Number: 15 (DW_TAG_array_type)
    <409>   DW_AT_type        : <0xf2>
    <40d>   DW_AT_sibling     : <0x418>
 <2><411>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <412>   DW_AT_type        : <0x2b>
    <416>   DW_AT_upper_bound : 39
 <2><417>: Abbrev Number: 0
 <1><418>: Abbrev Number: 11 (DW_TAG_variable)
    <419>   DW_AT_name        : (indirect string, offset: 0x51f): stdin
    <41d>   DW_AT_decl_file   : 10
    <41e>   DW_AT_decl_line   : 137
    <41f>   DW_AT_decl_column : 14
    <420>   DW_AT_type        : <0x426>
    <424>   DW_AT_external    : 1
    <425>   DW_AT_declaration : 1
 <1><426>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <427>   DW_AT_byte_size   : 4
    <428>   DW_AT_type        : <0x3b4>
 <1><42c>: Abbrev Number: 11 (DW_TAG_variable)
    <42d>   DW_AT_name        : (indirect string, offset: 0xfba): stdout
    <431>   DW_AT_decl_file   : 10
    <432>   DW_AT_decl_line   : 138
    <433>   DW_AT_decl_column : 14
    <434>   DW_AT_type        : <0x426>
    <438>   DW_AT_external    : 1
    <439>   DW_AT_declaration : 1
 <1><43a>: Abbrev Number: 11 (DW_TAG_variable)
    <43b>   DW_AT_name        : (indirect string, offset: 0xd9a): stderr
    <43f>   DW_AT_decl_file   : 10
    <440>   DW_AT_decl_line   : 139
    <441>   DW_AT_decl_column : 14
    <442>   DW_AT_type        : <0x426>
    <446>   DW_AT_external    : 1
    <447>   DW_AT_declaration : 1
 <1><448>: Abbrev Number: 11 (DW_TAG_variable)
    <449>   DW_AT_name        : (indirect string, offset: 0x240): sys_nerr
    <44d>   DW_AT_decl_file   : 11
    <44e>   DW_AT_decl_line   : 26
    <44f>   DW_AT_decl_column : 12
    <450>   DW_AT_type        : <0x64>
    <454>   DW_AT_external    : 1
    <455>   DW_AT_declaration : 1
 <1><456>: Abbrev Number: 15 (DW_TAG_array_type)
    <457>   DW_AT_type        : <0x1e7>
    <45b>   DW_AT_sibling     : <0x461>
 <2><45f>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 3 (DW_TAG_const_type)
    <462>   DW_AT_type        : <0x456>
 <1><466>: Abbrev Number: 11 (DW_TAG_variable)
    <467>   DW_AT_name        : (indirect string, offset: 0x52e): sys_errlist
    <46b>   DW_AT_decl_file   : 11
    <46c>   DW_AT_decl_line   : 27
    <46d>   DW_AT_decl_column : 26
    <46e>   DW_AT_type        : <0x461>
    <472>   DW_AT_external    : 1
    <473>   DW_AT_declaration : 1
 <1><474>: Abbrev Number: 11 (DW_TAG_variable)
    <475>   DW_AT_name        : (indirect string, offset: 0x253): _sys_nerr
    <479>   DW_AT_decl_file   : 11
    <47a>   DW_AT_decl_line   : 30
    <47b>   DW_AT_decl_column : 12
    <47c>   DW_AT_type        : <0x64>
    <480>   DW_AT_external    : 1
    <481>   DW_AT_declaration : 1
 <1><482>: Abbrev Number: 11 (DW_TAG_variable)
    <483>   DW_AT_name        : (indirect string, offset: 0xe0c): _sys_errlist
    <487>   DW_AT_decl_file   : 11
    <488>   DW_AT_decl_line   : 31
    <489>   DW_AT_decl_column : 26
    <48a>   DW_AT_type        : <0x461>
    <48e>   DW_AT_external    : 1
    <48f>   DW_AT_declaration : 1
 <1><490>: Abbrev Number: 11 (DW_TAG_variable)
    <491>   DW_AT_name        : (indirect string, offset: 0x6ab): program_invocation_name
    <495>   DW_AT_decl_file   : 12
    <496>   DW_AT_decl_line   : 45
    <497>   DW_AT_decl_column : 14
    <498>   DW_AT_type        : <0xec>
    <49c>   DW_AT_external    : 1
    <49d>   DW_AT_declaration : 1
 <1><49e>: Abbrev Number: 11 (DW_TAG_variable)
    <49f>   DW_AT_name        : (indirect string, offset: 0xb93): program_invocation_short_name
    <4a3>   DW_AT_decl_file   : 12
    <4a4>   DW_AT_decl_line   : 46
    <4a5>   DW_AT_decl_column : 14
    <4a6>   DW_AT_type        : <0xec>
    <4aa>   DW_AT_external    : 1
    <4ab>   DW_AT_declaration : 1
 <1><4ac>: Abbrev Number: 15 (DW_TAG_array_type)
    <4ad>   DW_AT_type        : <0xec>
    <4b1>   DW_AT_sibling     : <0x4bc>
 <2><4b5>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <4b6>   DW_AT_type        : <0x2b>
    <4ba>   DW_AT_upper_bound : 1
 <2><4bb>: Abbrev Number: 0
 <1><4bc>: Abbrev Number: 11 (DW_TAG_variable)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x1ab): __tzname
    <4c1>   DW_AT_decl_file   : 13
    <4c2>   DW_AT_decl_line   : 159
    <4c3>   DW_AT_decl_column : 14
    <4c4>   DW_AT_type        : <0x4ac>
    <4c8>   DW_AT_external    : 1
    <4c9>   DW_AT_declaration : 1
 <1><4ca>: Abbrev Number: 11 (DW_TAG_variable)
    <4cb>   DW_AT_name        : (indirect string, offset: 0xe81): __daylight
    <4cf>   DW_AT_decl_file   : 13
    <4d0>   DW_AT_decl_line   : 160
    <4d1>   DW_AT_decl_column : 12
    <4d2>   DW_AT_type        : <0x64>
    <4d6>   DW_AT_external    : 1
    <4d7>   DW_AT_declaration : 1
 <1><4d8>: Abbrev Number: 11 (DW_TAG_variable)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x356): __timezone
    <4dd>   DW_AT_decl_file   : 13
    <4de>   DW_AT_decl_line   : 161
    <4df>   DW_AT_decl_column : 17
    <4e0>   DW_AT_type        : <0xae>
    <4e4>   DW_AT_external    : 1
    <4e5>   DW_AT_declaration : 1
 <1><4e6>: Abbrev Number: 11 (DW_TAG_variable)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x998): tzname
    <4eb>   DW_AT_decl_file   : 13
    <4ec>   DW_AT_decl_line   : 166
    <4ed>   DW_AT_decl_column : 14
    <4ee>   DW_AT_type        : <0x4ac>
    <4f2>   DW_AT_external    : 1
    <4f3>   DW_AT_declaration : 1
 <1><4f4>: Abbrev Number: 11 (DW_TAG_variable)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x102a): daylight
    <4f9>   DW_AT_decl_file   : 13
    <4fa>   DW_AT_decl_line   : 174
    <4fb>   DW_AT_decl_column : 12
    <4fc>   DW_AT_type        : <0x64>
    <500>   DW_AT_external    : 1
    <501>   DW_AT_declaration : 1
 <1><502>: Abbrev Number: 11 (DW_TAG_variable)
    <503>   DW_AT_name        : (indirect string, offset: 0x4ab): timezone
    <507>   DW_AT_decl_file   : 13
    <508>   DW_AT_decl_line   : 175
    <509>   DW_AT_decl_column : 17
    <50a>   DW_AT_type        : <0xae>
    <50e>   DW_AT_external    : 1
    <50f>   DW_AT_declaration : 1
 <1><510>: Abbrev Number: 10 (DW_TAG_variable)
    <511>   DW_AT_name        : (indirect string, offset: 0xf16): getdate_err
    <515>   DW_AT_decl_file   : 13
    <516>   DW_AT_decl_line   : 274
    <518>   DW_AT_decl_column : 12
    <519>   DW_AT_type        : <0x64>
    <51d>   DW_AT_external    : 1
    <51e>   DW_AT_declaration : 1
 <1><51f>: Abbrev Number: 11 (DW_TAG_variable)
    <520>   DW_AT_name        : (indirect string, offset: 0x9ab): debug_flag
    <524>   DW_AT_decl_file   : 14
    <525>   DW_AT_decl_line   : 20
    <526>   DW_AT_decl_column : 13
    <527>   DW_AT_type        : <0x52d>
    <52b>   DW_AT_external    : 1
    <52c>   DW_AT_declaration : 1
 <1><52d>: Abbrev Number: 2 (DW_TAG_base_type)
    <52e>   DW_AT_byte_size   : 1
    <52f>   DW_AT_encoding    : 2	(boolean)
    <530>   DW_AT_name        : (indirect string, offset: 0x3f4): _Bool
 <1><534>: Abbrev Number: 3 (DW_TAG_const_type)
    <535>   DW_AT_type        : <0x52d>
 <1><539>: Abbrev Number: 4 (DW_TAG_typedef)
    <53a>   DW_AT_name        : (indirect string, offset: 0xa6b): __kernel_long_t
    <53e>   DW_AT_decl_file   : 15
    <53f>   DW_AT_decl_line   : 15
    <540>   DW_AT_decl_column : 15
    <541>   DW_AT_type        : <0xae>
 <1><545>: Abbrev Number: 4 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indirect string, offset: 0x50e): __kernel_ulong_t
    <54a>   DW_AT_decl_file   : 15
    <54b>   DW_AT_decl_line   : 16
    <54c>   DW_AT_decl_column : 23
    <54d>   DW_AT_type        : <0x37>
 <1><551>: Abbrev Number: 4 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x3c0): kernel_long_t
    <556>   DW_AT_decl_file   : 16
    <557>   DW_AT_decl_line   : 16
    <558>   DW_AT_decl_column : 25
    <559>   DW_AT_type        : <0x539>
 <1><55d>: Abbrev Number: 4 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x87d): kernel_ulong_t
    <562>   DW_AT_decl_file   : 16
    <563>   DW_AT_decl_line   : 17
    <564>   DW_AT_decl_column : 26
    <565>   DW_AT_type        : <0x545>
 <1><569>: Abbrev Number: 3 (DW_TAG_const_type)
    <56a>   DW_AT_type        : <0x55d>
 <1><56e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <56f>   DW_AT_name        : (indirect string, offset: 0xbb1): list_item
    <573>   DW_AT_byte_size   : 8
    <574>   DW_AT_decl_file   : 17
    <575>   DW_AT_decl_line   : 92
    <576>   DW_AT_decl_column : 8
    <577>   DW_AT_sibling     : <0x59a>
 <2><57b>: Abbrev Number: 9 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x106f): prev
    <580>   DW_AT_decl_file   : 17
    <581>   DW_AT_decl_line   : 93
    <582>   DW_AT_decl_column : 20
    <583>   DW_AT_type        : <0x59a>
    <587>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><58a>: Abbrev Number: 9 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x1065): next
    <58f>   DW_AT_decl_file   : 17
    <590>   DW_AT_decl_line   : 94
    <591>   DW_AT_decl_column : 20
    <592>   DW_AT_type        : <0x59a>
    <596>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <59b>   DW_AT_byte_size   : 4
    <59c>   DW_AT_type        : <0x56e>
 <1><5a0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x855): sysent
    <5a5>   DW_AT_byte_size   : 20
    <5a6>   DW_AT_decl_file   : 18
    <5a7>   DW_AT_decl_line   : 13
    <5a8>   DW_AT_decl_column : 16
    <5a9>   DW_AT_sibling     : <0x5f9>
 <2><5ad>: Abbrev Number: 9 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xfd1): nargs
    <5b2>   DW_AT_decl_file   : 18
    <5b3>   DW_AT_decl_line   : 14
    <5b4>   DW_AT_decl_column : 11
    <5b5>   DW_AT_type        : <0x2b>
    <5b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x957): sys_flags
    <5c1>   DW_AT_decl_file   : 18
    <5c2>   DW_AT_decl_line   : 15
    <5c3>   DW_AT_decl_column : 6
    <5c4>   DW_AT_type        : <0x64>
    <5c8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><5cb>: Abbrev Number: 18 (DW_TAG_member)
    <5cc>   DW_AT_name        : sen
    <5d0>   DW_AT_decl_file   : 18
    <5d1>   DW_AT_decl_line   : 16
    <5d2>   DW_AT_decl_column : 6
    <5d3>   DW_AT_type        : <0x64>
    <5d7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><5da>: Abbrev Number: 9 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x2e8): sys_func
    <5df>   DW_AT_decl_file   : 18
    <5e0>   DW_AT_decl_line   : 17
    <5e1>   DW_AT_decl_column : 8
    <5e2>   DW_AT_type        : <0x84f>
    <5e6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><5e9>: Abbrev Number: 9 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x25d): sys_name
    <5ee>   DW_AT_decl_file   : 18
    <5ef>   DW_AT_decl_line   : 18
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x1e1>
    <5f5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><5f8>: Abbrev Number: 0
 <1><5f9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5fa>   DW_AT_prototyped  : 1
    <5fb>   DW_AT_type        : <0x64>
    <5ff>   DW_AT_sibling     : <0x609>
 <2><603>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x609>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 4
    <60b>   DW_AT_type        : <0x614>
 <1><60f>: Abbrev Number: 3 (DW_TAG_const_type)
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 21 (DW_TAG_structure_type)
    <615>   DW_AT_name        : tcb
    <619>   DW_AT_byte_size   : 200
    <61a>   DW_AT_decl_file   : 19
    <61b>   DW_AT_decl_line   : 262
    <61d>   DW_AT_decl_column : 8
    <61e>   DW_AT_sibling     : <0x84f>
 <2><622>: Abbrev Number: 22 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x4ba): flags
    <627>   DW_AT_decl_file   : 19
    <628>   DW_AT_decl_line   : 263
    <62a>   DW_AT_decl_column : 6
    <62b>   DW_AT_type        : <0x64>
    <62f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><632>: Abbrev Number: 23 (DW_TAG_member)
    <633>   DW_AT_name        : pid
    <637>   DW_AT_decl_file   : 19
    <638>   DW_AT_decl_line   : 264
    <63a>   DW_AT_decl_column : 6
    <63b>   DW_AT_type        : <0x64>
    <63f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><642>: Abbrev Number: 22 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x4a2): qual_flg
    <647>   DW_AT_decl_file   : 19
    <648>   DW_AT_decl_line   : 265
    <64a>   DW_AT_decl_column : 6
    <64b>   DW_AT_type        : <0x64>
    <64f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><652>: Abbrev Number: 22 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x37a): currpers
    <657>   DW_AT_decl_file   : 19
    <658>   DW_AT_decl_line   : 267
    <65a>   DW_AT_decl_column : 15
    <65b>   DW_AT_type        : <0x2b>
    <65f>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><662>: Abbrev Number: 22 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0xb08): u_error
    <667>   DW_AT_decl_file   : 19
    <668>   DW_AT_decl_line   : 269
    <66a>   DW_AT_decl_column : 16
    <66b>   DW_AT_type        : <0x37>
    <66f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><672>: Abbrev Number: 22 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <677>   DW_AT_decl_file   : 19
    <678>   DW_AT_decl_line   : 270
    <67a>   DW_AT_decl_column : 17
    <67b>   DW_AT_type        : <0x55d>
    <67f>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><682>: Abbrev Number: 22 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0xb49): true_scno
    <687>   DW_AT_decl_file   : 19
    <688>   DW_AT_decl_line   : 271
    <68a>   DW_AT_decl_column : 17
    <68b>   DW_AT_type        : <0x55d>
    <68f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><692>: Abbrev Number: 22 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x195): u_arg
    <697>   DW_AT_decl_file   : 19
    <698>   DW_AT_decl_line   : 272
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x97f>
    <69f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6a2>: Abbrev Number: 22 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x96e): u_rval
    <6a7>   DW_AT_decl_file   : 19
    <6a8>   DW_AT_decl_line   : 273
    <6aa>   DW_AT_decl_column : 16
    <6ab>   DW_AT_type        : <0x551>
    <6af>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><6b2>: Abbrev Number: 22 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0xa87): sys_func_rval
    <6b7>   DW_AT_decl_file   : 19
    <6b8>   DW_AT_decl_line   : 274
    <6ba>   DW_AT_decl_column : 6
    <6bb>   DW_AT_type        : <0x64>
    <6bf>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><6c2>: Abbrev Number: 22 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0xca5): curcol
    <6c7>   DW_AT_decl_file   : 19
    <6c8>   DW_AT_decl_line   : 275
    <6ca>   DW_AT_decl_column : 6
    <6cb>   DW_AT_type        : <0x64>
    <6cf>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><6d2>: Abbrev Number: 22 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0x980): outf
    <6d7>   DW_AT_decl_file   : 19
    <6d8>   DW_AT_decl_line   : 276
    <6da>   DW_AT_decl_column : 8
    <6db>   DW_AT_type        : <0x426>
    <6df>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><6e2>: Abbrev Number: 22 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0xec0): staged_output_data
    <6e7>   DW_AT_decl_file   : 19
    <6e8>   DW_AT_decl_line   : 277
    <6ea>   DW_AT_decl_column : 29
    <6eb>   DW_AT_type        : <0x995>
    <6ef>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><6f2>: Abbrev Number: 22 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xa52): auxstr
    <6f7>   DW_AT_decl_file   : 19
    <6f8>   DW_AT_decl_line   : 279
    <6fa>   DW_AT_decl_column : 14
    <6fb>   DW_AT_type        : <0x1e1>
    <6ff>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><702>: Abbrev Number: 22 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x174): _priv_data
    <707>   DW_AT_decl_file   : 19
    <708>   DW_AT_decl_line   : 280
    <70a>   DW_AT_decl_column : 8
    <70b>   DW_AT_type        : <0xd9>
    <70f>   DW_AT_data_member_location: 2 byte block: 23 4c 	(DW_OP_plus_uconst: 76)
 <2><712>: Abbrev Number: 22 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xbde): _free_priv_data
    <717>   DW_AT_decl_file   : 19
    <718>   DW_AT_decl_line   : 281
    <71a>   DW_AT_decl_column : 9
    <71b>   DW_AT_type        : <0x9a7>
    <71f>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><722>: Abbrev Number: 22 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x185): s_ent
    <727>   DW_AT_decl_file   : 19
    <728>   DW_AT_decl_line   : 282
    <72a>   DW_AT_decl_column : 23
    <72b>   DW_AT_type        : <0x9ad>
    <72f>   DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><732>: Abbrev Number: 22 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x27): s_prev_ent
    <737>   DW_AT_decl_file   : 19
    <738>   DW_AT_decl_line   : 285
    <73a>   DW_AT_decl_column : 23
    <73b>   DW_AT_type        : <0x9ad>
    <73f>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><742>: Abbrev Number: 22 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x36f): inject_vec
    <747>   DW_AT_decl_file   : 19
    <748>   DW_AT_decl_line   : 286
    <74a>   DW_AT_decl_column : 22
    <74b>   DW_AT_type        : <0x9b8>
    <74f>   DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><752>: Abbrev Number: 22 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x7c6): stime
    <757>   DW_AT_decl_file   : 19
    <758>   DW_AT_decl_line   : 287
    <75a>   DW_AT_decl_column : 18
    <75b>   DW_AT_type        : <0x14b>
    <75f>   DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><762>: Abbrev Number: 22 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x383): ltime
    <767>   DW_AT_decl_file   : 19
    <768>   DW_AT_decl_line   : 288
    <76a>   DW_AT_decl_column : 18
    <76b>   DW_AT_type        : <0x14b>
    <76f>   DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><772>: Abbrev Number: 22 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xf98): atime
    <777>   DW_AT_decl_file   : 19
    <778>   DW_AT_decl_line   : 289
    <77a>   DW_AT_decl_column : 18
    <77b>   DW_AT_type        : <0x14b>
    <77f>   DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><782>: Abbrev Number: 22 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x4b4): etime
    <787>   DW_AT_decl_file   : 19
    <788>   DW_AT_decl_line   : 290
    <78a>   DW_AT_decl_column : 18
    <78b>   DW_AT_type        : <0x14b>
    <78f>   DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><793>: Abbrev Number: 22 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xd09): delay_expiration_time
    <798>   DW_AT_decl_file   : 19
    <799>   DW_AT_decl_line   : 291
    <79b>   DW_AT_decl_column : 18
    <79c>   DW_AT_type        : <0x14b>
    <7a0>   DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><7a4>: Abbrev Number: 22 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x32): pid_ns
    <7a9>   DW_AT_decl_file   : 19
    <7aa>   DW_AT_decl_line   : 298
    <7ac>   DW_AT_decl_column : 15
    <7ad>   DW_AT_type        : <0x2b>
    <7b1>   DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><7b5>: Abbrev Number: 22 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xefc): last_dirfd
    <7ba>   DW_AT_decl_file   : 19
    <7bb>   DW_AT_decl_line   : 301
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_type        : <0x64>
    <7c2>   DW_AT_data_member_location: 3 byte block: 23 94 1 	(DW_OP_plus_uconst: 148)
 <2><7c6>: Abbrev Number: 22 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xf22): mmap_cache
    <7cb>   DW_AT_decl_file   : 19
    <7cc>   DW_AT_decl_line   : 304
    <7ce>   DW_AT_decl_column : 23
    <7cf>   DW_AT_type        : <0x9d4>
    <7d3>   DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><7d7>: Abbrev Number: 22 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xb17): wait_data_idx
    <7dc>   DW_AT_decl_file   : 19
    <7dd>   DW_AT_decl_line   : 311
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x13a>
    <7e4>   DW_AT_data_member_location: 3 byte block: 23 9c 1 	(DW_OP_plus_uconst: 156)
 <2><7e8>: Abbrev Number: 22 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xa59): delayed_wait_data
    <7ed>   DW_AT_decl_file   : 19
    <7ee>   DW_AT_decl_line   : 313
    <7f0>   DW_AT_decl_column : 24
    <7f1>   DW_AT_type        : <0x9e0>
    <7f5>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><7f9>: Abbrev Number: 22 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xac9): wait_list
    <7fe>   DW_AT_decl_file   : 19
    <7ff>   DW_AT_decl_line   : 314
    <801>   DW_AT_decl_column : 19
    <802>   DW_AT_type        : <0x56e>
    <806>   DW_AT_data_member_location: 3 byte block: 23 a4 1 	(DW_OP_plus_uconst: 164)
 <2><80a>: Abbrev Number: 22 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x6c3): vcpu_info_list
    <80f>   DW_AT_decl_file   : 19
    <810>   DW_AT_decl_line   : 318
    <812>   DW_AT_decl_column : 20
    <813>   DW_AT_type        : <0x9ec>
    <817>   DW_AT_data_member_location: 3 byte block: 23 ac 1 	(DW_OP_plus_uconst: 172)
 <2><81b>: Abbrev Number: 22 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xc70): unwind_ctx
    <820>   DW_AT_decl_file   : 19
    <821>   DW_AT_decl_line   : 322
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0xd9>
    <828>   DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><82c>: Abbrev Number: 22 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x495): unwind_queue
    <831>   DW_AT_decl_file   : 19
    <832>   DW_AT_decl_line   : 323
    <834>   DW_AT_decl_column : 25
    <835>   DW_AT_type        : <0x9f8>
    <839>   DW_AT_data_member_location: 3 byte block: 23 b4 1 	(DW_OP_plus_uconst: 180)
 <2><83d>: Abbrev Number: 22 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x169): comm
    <842>   DW_AT_decl_file   : 19
    <843>   DW_AT_decl_line   : 327
    <845>   DW_AT_decl_column : 7
    <846>   DW_AT_type        : <0x9fe>
    <84a>   DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><84e>: Abbrev Number: 0
 <1><84f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <850>   DW_AT_byte_size   : 4
    <851>   DW_AT_type        : <0x5f9>
 <1><855>: Abbrev Number: 4 (DW_TAG_typedef)
    <856>   DW_AT_name        : (indirect string, offset: 0x500): struct_sysent
    <85a>   DW_AT_decl_file   : 18
    <85b>   DW_AT_decl_line   : 19
    <85c>   DW_AT_decl_column : 3
    <85d>   DW_AT_type        : <0x5a0>
 <1><861>: Abbrev Number: 3 (DW_TAG_const_type)
    <862>   DW_AT_type        : <0x855>
 <1><866>: Abbrev Number: 11 (DW_TAG_variable)
    <867>   DW_AT_name        : (indirect string, offset: 0xcf5): current_personality
    <86b>   DW_AT_decl_file   : 19
    <86c>   DW_AT_decl_line   : 158
    <86d>   DW_AT_decl_column : 17
    <86e>   DW_AT_type        : <0x2b>
    <872>   DW_AT_external    : 1
    <873>   DW_AT_declaration : 1
 <1><874>: Abbrev Number: 11 (DW_TAG_variable)
    <875>   DW_AT_name        : (indirect string, offset: 0x7f7): current_wordsize
    <879>   DW_AT_decl_file   : 19
    <87a>   DW_AT_decl_line   : 171
    <87b>   DW_AT_decl_column : 17
    <87c>   DW_AT_type        : <0x2b>
    <880>   DW_AT_external    : 1
    <881>   DW_AT_declaration : 1
 <1><882>: Abbrev Number: 11 (DW_TAG_variable)
    <883>   DW_AT_name        : (indirect string, offset: 0xa30): current_klongsize
    <887>   DW_AT_decl_file   : 19
    <888>   DW_AT_decl_line   : 176
    <889>   DW_AT_decl_column : 17
    <88a>   DW_AT_type        : <0x2b>
    <88e>   DW_AT_external    : 1
    <88f>   DW_AT_declaration : 1
 <1><890>: Abbrev Number: 8 (DW_TAG_structure_type)
    <891>   DW_AT_name        : (indirect string, offset: 0xc47): ioctlent
    <895>   DW_AT_byte_size   : 8
    <896>   DW_AT_decl_file   : 19
    <897>   DW_AT_decl_line   : 217
    <898>   DW_AT_decl_column : 16
    <899>   DW_AT_sibling     : <0x8bc>
 <2><89d>: Abbrev Number: 9 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0xee8): symbol
    <8a2>   DW_AT_decl_file   : 19
    <8a3>   DW_AT_decl_line   : 218
    <8a4>   DW_AT_decl_column : 14
    <8a5>   DW_AT_type        : <0x1e1>
    <8a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8ac>: Abbrev Number: 9 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0xcbe): code
    <8b1>   DW_AT_decl_file   : 19
    <8b2>   DW_AT_decl_line   : 219
    <8b3>   DW_AT_decl_column : 15
    <8b4>   DW_AT_type        : <0x2b>
    <8b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><8bb>: Abbrev Number: 0
 <1><8bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <8bd>   DW_AT_name        : (indirect string, offset: 0xc08): struct_ioctlent
    <8c1>   DW_AT_decl_file   : 19
    <8c2>   DW_AT_decl_line   : 220
    <8c3>   DW_AT_decl_column : 3
    <8c4>   DW_AT_type        : <0x890>
 <1><8c8>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c9>   DW_AT_type        : <0x8bc>
 <1><8cd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x7eb): inject_data
    <8d2>   DW_AT_byte_size   : 10
    <8d3>   DW_AT_decl_file   : 19
    <8d4>   DW_AT_decl_line   : 241
    <8d5>   DW_AT_decl_column : 8
    <8d6>   DW_AT_sibling     : <0x935>
 <2><8da>: Abbrev Number: 9 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x4ba): flags
    <8df>   DW_AT_decl_file   : 19
    <8e0>   DW_AT_decl_line   : 242
    <8e1>   DW_AT_decl_column : 10
    <8e2>   DW_AT_type        : <0xfe>
    <8e6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8e9>: Abbrev Number: 9 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x900): signo
    <8ee>   DW_AT_decl_file   : 19
    <8ef>   DW_AT_decl_line   : 243
    <8f0>   DW_AT_decl_column : 10
    <8f1>   DW_AT_type        : <0xfe>
    <8f5>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><8f8>: Abbrev Number: 9 (DW_TAG_member)
    <8f9>   DW_AT_name        : (indirect string, offset: 0xfb): rval_idx
    <8fd>   DW_AT_decl_file   : 19
    <8fe>   DW_AT_decl_line   : 244
    <8ff>   DW_AT_decl_column : 11
    <900>   DW_AT_type        : <0x10a>
    <904>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><907>: Abbrev Number: 9 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0xc9b): delay_idx
    <90c>   DW_AT_decl_file   : 19
    <90d>   DW_AT_decl_line   : 245
    <90e>   DW_AT_decl_column : 11
    <90f>   DW_AT_type        : <0x10a>
    <913>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><916>: Abbrev Number: 9 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0x550): poke_idx
    <91b>   DW_AT_decl_file   : 19
    <91c>   DW_AT_decl_line   : 246
    <91d>   DW_AT_decl_column : 11
    <91e>   DW_AT_type        : <0x10a>
    <922>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><925>: Abbrev Number: 9 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x18b): scno
    <92a>   DW_AT_decl_file   : 19
    <92b>   DW_AT_decl_line   : 247
    <92c>   DW_AT_decl_column : 11
    <92d>   DW_AT_type        : <0x10a>
    <931>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><934>: Abbrev Number: 0
 <1><935>: Abbrev Number: 8 (DW_TAG_structure_type)
    <936>   DW_AT_name        : (indirect string, offset: 0xdc): inject_opts
    <93a>   DW_AT_byte_size   : 16
    <93b>   DW_AT_decl_file   : 19
    <93c>   DW_AT_decl_line   : 250
    <93d>   DW_AT_decl_column : 8
    <93e>   DW_AT_sibling     : <0x97f>
 <2><942>: Abbrev Number: 9 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0xa05): first
    <947>   DW_AT_decl_file   : 19
    <948>   DW_AT_decl_line   : 251
    <949>   DW_AT_decl_column : 11
    <94a>   DW_AT_type        : <0x10a>
    <94e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><951>: Abbrev Number: 9 (DW_TAG_member)
    <952>   DW_AT_name        : (indirect string, offset: 0x1098): last
    <956>   DW_AT_decl_file   : 19
    <957>   DW_AT_decl_line   : 252
    <958>   DW_AT_decl_column : 11
    <959>   DW_AT_type        : <0x10a>
    <95d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><960>: Abbrev Number: 9 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x389): step
    <965>   DW_AT_decl_file   : 19
    <966>   DW_AT_decl_line   : 253
    <967>   DW_AT_decl_column : 11
    <968>   DW_AT_type        : <0x10a>
    <96c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><96f>: Abbrev Number: 9 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x106a): data
    <974>   DW_AT_decl_file   : 19
    <975>   DW_AT_decl_line   : 254
    <976>   DW_AT_decl_column : 21
    <977>   DW_AT_type        : <0x8cd>
    <97b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><97e>: Abbrev Number: 0
 <1><97f>: Abbrev Number: 15 (DW_TAG_array_type)
    <980>   DW_AT_type        : <0x55d>
    <984>   DW_AT_sibling     : <0x98f>
 <2><988>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <989>   DW_AT_type        : <0x2b>
    <98d>   DW_AT_upper_bound : 5
 <2><98e>: Abbrev Number: 0
 <1><98f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <990>   DW_AT_name        : (indirect string, offset: 0xec0): staged_output_data
    <994>   DW_AT_declaration : 1
 <1><995>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <996>   DW_AT_byte_size   : 4
    <997>   DW_AT_type        : <0x98f>
 <1><99b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <99c>   DW_AT_prototyped  : 1
    <99d>   DW_AT_sibling     : <0x9a7>
 <2><9a1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9a2>   DW_AT_type        : <0xd9>
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9a8>   DW_AT_byte_size   : 4
    <9a9>   DW_AT_type        : <0x99b>
 <1><9ad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ae>   DW_AT_byte_size   : 4
    <9af>   DW_AT_type        : <0x861>
 <1><9b3>: Abbrev Number: 3 (DW_TAG_const_type)
    <9b4>   DW_AT_type        : <0x9ad>
 <1><9b8>: Abbrev Number: 15 (DW_TAG_array_type)
    <9b9>   DW_AT_type        : <0x9c8>
    <9bd>   DW_AT_sibling     : <0x9c8>
 <2><9c1>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <9c2>   DW_AT_type        : <0x2b>
    <9c6>   DW_AT_upper_bound : 2
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4
    <9ca>   DW_AT_type        : <0x935>
 <1><9ce>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9cf>   DW_AT_name        : (indirect string, offset: 0xa8): mmap_cache_t
    <9d3>   DW_AT_declaration : 1
 <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 4
    <9d6>   DW_AT_type        : <0x9ce>
 <1><9da>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0x3a4): tcb_wait_data
    <9df>   DW_AT_declaration : 1
 <1><9e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x9da>
 <1><9e6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x15f): vcpu_info
    <9eb>   DW_AT_declaration : 1
 <1><9ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9e6>
 <1><9f2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xea4): unwind_queue_t
    <9f7>   DW_AT_declaration : 1
 <1><9f8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
    <9fa>   DW_AT_type        : <0x9f2>
 <1><9fe>: Abbrev Number: 15 (DW_TAG_array_type)
    <9ff>   DW_AT_type        : <0xf2>
    <a03>   DW_AT_sibling     : <0xa0e>
 <2><a07>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a08>   DW_AT_type        : <0x2b>
    <a0c>   DW_AT_upper_bound : 15
 <2><a0d>: Abbrev Number: 0
 <1><a0e>: Abbrev Number: 10 (DW_TAG_variable)
    <a0f>   DW_AT_name        : (indirect string, offset: 0xb5c): stub_sysent
    <a13>   DW_AT_decl_file   : 19
    <a14>   DW_AT_decl_line   : 400
    <a16>   DW_AT_decl_column : 28
    <a17>   DW_AT_type        : <0x861>
    <a1b>   DW_AT_external    : 1
    <a1c>   DW_AT_declaration : 1
 <1><a1d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x104d): xlat_type
    <a22>   DW_AT_encoding    : 7	(unsigned)
    <a23>   DW_AT_byte_size   : 4
    <a24>   DW_AT_type        : <0x2b>
    <a28>   DW_AT_decl_file   : 20
    <a29>   DW_AT_decl_line   : 13
    <a2a>   DW_AT_decl_column : 6
    <a2b>   DW_AT_sibling     : <0xa42>
 <2><a2f>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0x2b8): XT_NORMAL
    <a34>   DW_AT_const_value : 0
 <2><a35>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xc1f): XT_SORTED
    <a3a>   DW_AT_const_value : 1
 <2><a3b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xd81): XT_INDEXED
    <a40>   DW_AT_const_value : 2
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <a43>   DW_AT_name        : (indirect string, offset: 0xb88): xlat_style
    <a47>   DW_AT_encoding    : 7	(unsigned)
    <a48>   DW_AT_byte_size   : 4
    <a49>   DW_AT_type        : <0x2b>
    <a4d>   DW_AT_decl_file   : 20
    <a4e>   DW_AT_decl_line   : 19
    <a4f>   DW_AT_decl_column : 6
    <a50>   DW_AT_sibling     : <0xa7f>
 <2><a54>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0xe8): XLAT_STYLE_DEFAULT
    <a59>   DW_AT_const_value : 0
 <2><a5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xbbb): XLAT_STYLE_RAW
    <a5f>   DW_AT_const_value : 1
 <2><a60>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x1018): XLAT_STYLE_ABBREV
    <a65>   DW_AT_const_value : 2
 <2><a66>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0x2d5): XLAT_STYLE_VERBOSE
    <a6b>   DW_AT_const_value : 3
 <2><a6c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x11): XLAT_STYLE_FMT_X
    <a71>   DW_AT_const_value : 0
 <2><a72>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x0): XLAT_STYLE_FMT_U
    <a77>   DW_AT_const_value : 4
 <2><a78>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x1087): XLAT_STYLE_FMT_D
    <a7d>   DW_AT_const_value : 8
 <2><a7e>: Abbrev Number: 0
 <1><a7f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a80>   DW_AT_name        : (indirect string, offset: 0x306): xlat_data
    <a84>   DW_AT_byte_size   : 12
    <a85>   DW_AT_decl_file   : 20
    <a86>   DW_AT_decl_line   : 51
    <a87>   DW_AT_decl_column : 8
    <a88>   DW_AT_sibling     : <0xaab>
 <2><a8c>: Abbrev Number: 18 (DW_TAG_member)
    <a8d>   DW_AT_name        : val
    <a91>   DW_AT_decl_file   : 20
    <a92>   DW_AT_decl_line   : 52
    <a93>   DW_AT_decl_column : 11
    <a94>   DW_AT_type        : <0x122>
    <a98>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a9b>: Abbrev Number: 18 (DW_TAG_member)
    <a9c>   DW_AT_name        : str
    <aa0>   DW_AT_decl_file   : 20
    <aa1>   DW_AT_decl_line   : 53
    <aa2>   DW_AT_decl_column : 14
    <aa3>   DW_AT_type        : <0x1e1>
    <aa7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aaa>: Abbrev Number: 0
 <1><aab>: Abbrev Number: 3 (DW_TAG_const_type)
    <aac>   DW_AT_type        : <0xa7f>
 <1><ab0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x22): xlat
    <ab5>   DW_AT_byte_size   : 24
    <ab6>   DW_AT_decl_file   : 20
    <ab7>   DW_AT_decl_line   : 56
    <ab8>   DW_AT_decl_column : 8
    <ab9>   DW_AT_sibling     : <0xb09>
 <2><abd>: Abbrev Number: 9 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0x106a): data
    <ac2>   DW_AT_decl_file   : 20
    <ac3>   DW_AT_decl_line   : 57
    <ac4>   DW_AT_decl_column : 26
    <ac5>   DW_AT_type        : <0xb0e>
    <ac9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><acc>: Abbrev Number: 9 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0x849): flags_strsz
    <ad1>   DW_AT_decl_file   : 20
    <ad2>   DW_AT_decl_line   : 58
    <ad3>   DW_AT_decl_column : 9
    <ad4>   DW_AT_type        : <0x13a>
    <ad8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><adb>: Abbrev Number: 9 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xb25): size
    <ae0>   DW_AT_decl_file   : 20
    <ae1>   DW_AT_decl_line   : 59
    <ae2>   DW_AT_decl_column : 11
    <ae3>   DW_AT_type        : <0x116>
    <ae7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><aea>: Abbrev Number: 9 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x190): type
    <aef>   DW_AT_decl_file   : 20
    <af0>   DW_AT_decl_line   : 60
    <af1>   DW_AT_decl_column : 17
    <af2>   DW_AT_type        : <0xa1d>
    <af6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><af9>: Abbrev Number: 9 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x717): flags_mask
    <afe>   DW_AT_decl_file   : 20
    <aff>   DW_AT_decl_line   : 61
    <b00>   DW_AT_decl_column : 11
    <b01>   DW_AT_type        : <0x122>
    <b05>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 3 (DW_TAG_const_type)
    <b0a>   DW_AT_type        : <0xab0>
 <1><b0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b0f>   DW_AT_byte_size   : 4
    <b10>   DW_AT_type        : <0xaab>
 <1><b14>: Abbrev Number: 15 (DW_TAG_array_type)
    <b15>   DW_AT_type        : <0xb09>
    <b19>   DW_AT_sibling     : <0xb1f>
 <2><b1d>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><b1e>: Abbrev Number: 0
 <1><b1f>: Abbrev Number: 3 (DW_TAG_const_type)
    <b20>   DW_AT_type        : <0xb14>
 <1><b24>: Abbrev Number: 10 (DW_TAG_variable)
    <b25>   DW_AT_name        : (indirect string, offset: 0xdea): addrfams
    <b29>   DW_AT_decl_file   : 19
    <b2a>   DW_AT_decl_line   : 406
    <b2c>   DW_AT_decl_column : 26
    <b2d>   DW_AT_type        : <0xb1f>
    <b31>   DW_AT_external    : 1
    <b32>   DW_AT_declaration : 1
 <1><b33>: Abbrev Number: 10 (DW_TAG_variable)
    <b34>   DW_AT_name        : (indirect string, offset: 0xcce): arp_hardware_types
    <b38>   DW_AT_decl_file   : 19
    <b39>   DW_AT_decl_line   : 407
    <b3b>   DW_AT_decl_column : 26
    <b3c>   DW_AT_type        : <0xb1f>
    <b40>   DW_AT_external    : 1
    <b41>   DW_AT_declaration : 1
 <1><b42>: Abbrev Number: 10 (DW_TAG_variable)
    <b43>   DW_AT_name        : (indirect string, offset: 0xf9e): at_flags
    <b47>   DW_AT_decl_file   : 19
    <b48>   DW_AT_decl_line   : 408
    <b4a>   DW_AT_decl_column : 26
    <b4b>   DW_AT_type        : <0xb1f>
    <b4f>   DW_AT_external    : 1
    <b50>   DW_AT_declaration : 1
 <1><b51>: Abbrev Number: 10 (DW_TAG_variable)
    <b52>   DW_AT_name        : (indirect string, offset: 0x473): clocknames
    <b56>   DW_AT_decl_file   : 19
    <b57>   DW_AT_decl_line   : 409
    <b59>   DW_AT_decl_column : 26
    <b5a>   DW_AT_type        : <0xb1f>
    <b5e>   DW_AT_external    : 1
    <b5f>   DW_AT_declaration : 1
 <1><b60>: Abbrev Number: 10 (DW_TAG_variable)
    <b61>   DW_AT_name        : (indirect string, offset: 0xf5e): dirent_types
    <b65>   DW_AT_decl_file   : 19
    <b66>   DW_AT_decl_line   : 410
    <b68>   DW_AT_decl_column : 26
    <b69>   DW_AT_type        : <0xb1f>
    <b6d>   DW_AT_external    : 1
    <b6e>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 10 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0x89a): ethernet_protocols
    <b74>   DW_AT_decl_file   : 19
    <b75>   DW_AT_decl_line   : 411
    <b77>   DW_AT_decl_column : 26
    <b78>   DW_AT_type        : <0xb1f>
    <b7c>   DW_AT_external    : 1
    <b7d>   DW_AT_declaration : 1
 <1><b7e>: Abbrev Number: 10 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x5ad): inet_protocols
    <b83>   DW_AT_decl_file   : 19
    <b84>   DW_AT_decl_line   : 412
    <b86>   DW_AT_decl_column : 26
    <b87>   DW_AT_type        : <0xb1f>
    <b8b>   DW_AT_external    : 1
    <b8c>   DW_AT_declaration : 1
 <1><b8d>: Abbrev Number: 10 (DW_TAG_variable)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x2a5): evdev_abs
    <b92>   DW_AT_decl_file   : 19
    <b93>   DW_AT_decl_line   : 413
    <b95>   DW_AT_decl_column : 26
    <b96>   DW_AT_type        : <0xb1f>
    <b9a>   DW_AT_external    : 1
    <b9b>   DW_AT_declaration : 1
 <1><b9c>: Abbrev Number: 10 (DW_TAG_variable)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x70c): audit_arch
    <ba1>   DW_AT_decl_file   : 19
    <ba2>   DW_AT_decl_line   : 414
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xb1f>
    <ba9>   DW_AT_external    : 1
    <baa>   DW_AT_declaration : 1
 <1><bab>: Abbrev Number: 10 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x94): evdev_ev
    <bb0>   DW_AT_decl_file   : 19
    <bb1>   DW_AT_decl_line   : 415
    <bb3>   DW_AT_decl_column : 26
    <bb4>   DW_AT_type        : <0xb1f>
    <bb8>   DW_AT_external    : 1
    <bb9>   DW_AT_declaration : 1
 <1><bba>: Abbrev Number: 10 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x454): iffflags
    <bbf>   DW_AT_decl_file   : 19
    <bc0>   DW_AT_decl_line   : 416
    <bc2>   DW_AT_decl_column : 26
    <bc3>   DW_AT_type        : <0xb1f>
    <bc7>   DW_AT_external    : 1
    <bc8>   DW_AT_declaration : 1
 <1><bc9>: Abbrev Number: 10 (DW_TAG_variable)
    <bca>   DW_AT_name        : (indirect string, offset: 0xbca): ip_type_of_services
    <bce>   DW_AT_decl_file   : 19
    <bcf>   DW_AT_decl_line   : 417
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb1f>
    <bd6>   DW_AT_external    : 1
    <bd7>   DW_AT_declaration : 1
 <1><bd8>: Abbrev Number: 10 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x69f): ipc_private
    <bdd>   DW_AT_decl_file   : 19
    <bde>   DW_AT_decl_line   : 418
    <be0>   DW_AT_decl_column : 26
    <be1>   DW_AT_type        : <0xb1f>
    <be5>   DW_AT_external    : 1
    <be6>   DW_AT_declaration : 1
 <1><be7>: Abbrev Number: 10 (DW_TAG_variable)
    <be8>   DW_AT_name        : (indirect string, offset: 0x2fc): msg_flags
    <bec>   DW_AT_decl_file   : 19
    <bed>   DW_AT_decl_line   : 419
    <bef>   DW_AT_decl_column : 26
    <bf0>   DW_AT_type        : <0xb1f>
    <bf4>   DW_AT_external    : 1
    <bf5>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 10 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x104): netlink_protocols
    <bfb>   DW_AT_decl_file   : 19
    <bfc>   DW_AT_decl_line   : 420
    <bfe>   DW_AT_decl_column : 26
    <bff>   DW_AT_type        : <0xb1f>
    <c03>   DW_AT_external    : 1
    <c04>   DW_AT_declaration : 1
 <1><c05>: Abbrev Number: 10 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0xed3): nl_bridge_vlan_flags
    <c0a>   DW_AT_decl_file   : 19
    <c0b>   DW_AT_decl_line   : 421
    <c0d>   DW_AT_decl_column : 26
    <c0e>   DW_AT_type        : <0xb1f>
    <c12>   DW_AT_external    : 1
    <c13>   DW_AT_declaration : 1
 <1><c14>: Abbrev Number: 10 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0xd6a): nl_netfilter_msg_types
    <c19>   DW_AT_decl_file   : 19
    <c1a>   DW_AT_decl_line   : 422
    <c1c>   DW_AT_decl_column : 26
    <c1d>   DW_AT_type        : <0xb1f>
    <c21>   DW_AT_external    : 1
    <c22>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 10 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0x211): nl_route_types
    <c28>   DW_AT_decl_file   : 19
    <c29>   DW_AT_decl_line   : 423
    <c2b>   DW_AT_decl_column : 26
    <c2c>   DW_AT_type        : <0xb1f>
    <c30>   DW_AT_external    : 1
    <c31>   DW_AT_declaration : 1
 <1><c32>: Abbrev Number: 10 (DW_TAG_variable)
    <c33>   DW_AT_name        : (indirect string, offset: 0xe2c): open_access_modes
    <c37>   DW_AT_decl_file   : 19
    <c38>   DW_AT_decl_line   : 424
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xb1f>
    <c3f>   DW_AT_external    : 1
    <c40>   DW_AT_declaration : 1
 <1><c41>: Abbrev Number: 10 (DW_TAG_variable)
    <c42>   DW_AT_name        : (indirect string, offset: 0x84): open_mode_flags
    <c46>   DW_AT_decl_file   : 19
    <c47>   DW_AT_decl_line   : 425
    <c49>   DW_AT_decl_column : 26
    <c4a>   DW_AT_type        : <0xb1f>
    <c4e>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c50>: Abbrev Number: 10 (DW_TAG_variable)
    <c51>   DW_AT_name        : (indirect string, offset: 0xbfb): perf_type_id
    <c55>   DW_AT_decl_file   : 19
    <c56>   DW_AT_decl_line   : 426
    <c58>   DW_AT_decl_column : 26
    <c59>   DW_AT_type        : <0xb1f>
    <c5d>   DW_AT_external    : 1
    <c5e>   DW_AT_declaration : 1
 <1><c5f>: Abbrev Number: 10 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0xdf3): pollflags
    <c64>   DW_AT_decl_file   : 19
    <c65>   DW_AT_decl_line   : 427
    <c67>   DW_AT_decl_column : 26
    <c68>   DW_AT_type        : <0xb1f>
    <c6c>   DW_AT_external    : 1
    <c6d>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 10 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x544): ptrace_cmds
    <c73>   DW_AT_decl_file   : 19
    <c74>   DW_AT_decl_line   : 428
    <c76>   DW_AT_decl_column : 26
    <c77>   DW_AT_type        : <0xb1f>
    <c7b>   DW_AT_external    : 1
    <c7c>   DW_AT_declaration : 1
 <1><c7d>: Abbrev Number: 10 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x7dc): resource_flags
    <c82>   DW_AT_decl_file   : 19
    <c83>   DW_AT_decl_line   : 429
    <c85>   DW_AT_decl_column : 26
    <c86>   DW_AT_type        : <0xb1f>
    <c8a>   DW_AT_external    : 1
    <c8b>   DW_AT_declaration : 1
 <1><c8c>: Abbrev Number: 10 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x27b): route_nexthop_flags
    <c91>   DW_AT_decl_file   : 19
    <c92>   DW_AT_decl_line   : 430
    <c94>   DW_AT_decl_column : 26
    <c95>   DW_AT_type        : <0xb1f>
    <c99>   DW_AT_external    : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9b>: Abbrev Number: 10 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xe5e): routing_protocols
    <ca0>   DW_AT_decl_file   : 19
    <ca1>   DW_AT_decl_line   : 431
    <ca3>   DW_AT_decl_column : 26
    <ca4>   DW_AT_type        : <0xb1f>
    <ca8>   DW_AT_external    : 1
    <ca9>   DW_AT_declaration : 1
 <1><caa>: Abbrev Number: 10 (DW_TAG_variable)
    <cab>   DW_AT_name        : (indirect string, offset: 0x445): routing_scopes
    <caf>   DW_AT_decl_file   : 19
    <cb0>   DW_AT_decl_line   : 432
    <cb2>   DW_AT_decl_column : 26
    <cb3>   DW_AT_type        : <0xb1f>
    <cb7>   DW_AT_external    : 1
    <cb8>   DW_AT_declaration : 1
 <1><cb9>: Abbrev Number: 10 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0xd58): routing_table_ids
    <cbe>   DW_AT_decl_file   : 19
    <cbf>   DW_AT_decl_line   : 433
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0xb1f>
    <cc6>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc8>: Abbrev Number: 10 (DW_TAG_variable)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x67c): routing_types
    <ccd>   DW_AT_decl_file   : 19
    <cce>   DW_AT_decl_line   : 434
    <cd0>   DW_AT_decl_column : 26
    <cd1>   DW_AT_type        : <0xb1f>
    <cd5>   DW_AT_external    : 1
    <cd6>   DW_AT_declaration : 1
 <1><cd7>: Abbrev Number: 10 (DW_TAG_variable)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x1b4): rwf_flags
    <cdc>   DW_AT_decl_file   : 19
    <cdd>   DW_AT_decl_line   : 435
    <cdf>   DW_AT_decl_column : 26
    <ce0>   DW_AT_type        : <0xb1f>
    <ce4>   DW_AT_external    : 1
    <ce5>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 10 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x814): seccomp_filter_flags
    <ceb>   DW_AT_decl_file   : 19
    <cec>   DW_AT_decl_line   : 436
    <cee>   DW_AT_decl_column : 26
    <cef>   DW_AT_type        : <0xb1f>
    <cf3>   DW_AT_external    : 1
    <cf4>   DW_AT_declaration : 1
 <1><cf5>: Abbrev Number: 10 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x2c2): seccomp_ret_action
    <cfa>   DW_AT_decl_file   : 19
    <cfb>   DW_AT_decl_line   : 437
    <cfd>   DW_AT_decl_column : 26
    <cfe>   DW_AT_type        : <0xb1f>
    <d02>   DW_AT_external    : 1
    <d03>   DW_AT_declaration : 1
 <1><d04>: Abbrev Number: 10 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x40e): setns_types
    <d09>   DW_AT_decl_file   : 19
    <d0a>   DW_AT_decl_line   : 438
    <d0c>   DW_AT_decl_column : 26
    <d0d>   DW_AT_type        : <0xb1f>
    <d11>   DW_AT_external    : 1
    <d12>   DW_AT_declaration : 1
 <1><d13>: Abbrev Number: 10 (DW_TAG_variable)
    <d14>   DW_AT_name        : (indirect string, offset: 0xddf): sg_io_info
    <d18>   DW_AT_decl_file   : 19
    <d19>   DW_AT_decl_line   : 439
    <d1b>   DW_AT_decl_column : 26
    <d1c>   DW_AT_type        : <0xb1f>
    <d20>   DW_AT_external    : 1
    <d21>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 10 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0xb70): socketlayers
    <d27>   DW_AT_decl_file   : 19
    <d28>   DW_AT_decl_line   : 440
    <d2a>   DW_AT_decl_column : 26
    <d2b>   DW_AT_type        : <0xb1f>
    <d2f>   DW_AT_external    : 1
    <d30>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 10 (DW_TAG_variable)
    <d32>   DW_AT_name        : (indirect string, offset: 0xd42): socktypes
    <d36>   DW_AT_decl_file   : 19
    <d37>   DW_AT_decl_line   : 441
    <d39>   DW_AT_decl_column : 26
    <d3a>   DW_AT_type        : <0xb1f>
    <d3e>   DW_AT_external    : 1
    <d3f>   DW_AT_declaration : 1
 <1><d40>: Abbrev Number: 10 (DW_TAG_variable)
    <d41>   DW_AT_name        : (indirect string, offset: 0xa42): tcp_state_flags
    <d45>   DW_AT_decl_file   : 19
    <d46>   DW_AT_decl_line   : 442
    <d48>   DW_AT_decl_column : 26
    <d49>   DW_AT_type        : <0xb1f>
    <d4d>   DW_AT_external    : 1
    <d4e>   DW_AT_declaration : 1
 <1><d4f>: Abbrev Number: 10 (DW_TAG_variable)
    <d50>   DW_AT_name        : (indirect string, offset: 0x741): tcp_states
    <d54>   DW_AT_decl_file   : 19
    <d55>   DW_AT_decl_line   : 443
    <d57>   DW_AT_decl_column : 26
    <d58>   DW_AT_type        : <0xb1f>
    <d5c>   DW_AT_external    : 1
    <d5d>   DW_AT_declaration : 1
 <1><d5e>: Abbrev Number: 10 (DW_TAG_variable)
    <d5f>   DW_AT_name        : (indirect string, offset: 0xffb): whence_codes
    <d63>   DW_AT_decl_file   : 19
    <d64>   DW_AT_decl_line   : 444
    <d66>   DW_AT_decl_column : 26
    <d67>   DW_AT_type        : <0xb1f>
    <d6b>   DW_AT_external    : 1
    <d6c>   DW_AT_declaration : 1
 <1><d6d>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <d6e>   DW_AT_encoding    : 7	(unsigned)
    <d6f>   DW_AT_byte_size   : 4
    <d70>   DW_AT_type        : <0x2b>
    <d74>   DW_AT_decl_file   : 19
    <d75>   DW_AT_decl_line   : 505
    <d77>   DW_AT_decl_column : 14
    <d78>   DW_AT_sibling     : <0xd8f>
 <2><d7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x975): CFLAG_NONE
    <d81>   DW_AT_const_value : 0
 <2><d82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d83>   DW_AT_name        : (indirect string, offset: 0x8ad): CFLAG_ONLY_STATS
    <d87>   DW_AT_const_value : 1
 <2><d88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <d89>   DW_AT_name        : (indirect string, offset: 0xb7d): CFLAG_BOTH
    <d8d>   DW_AT_const_value : 2
 <2><d8e>: Abbrev Number: 0
 <1><d8f>: Abbrev Number: 28 (DW_TAG_typedef)
    <d90>   DW_AT_name        : (indirect string, offset: 0x109d): cflag_t
    <d94>   DW_AT_decl_file   : 19
    <d95>   DW_AT_decl_line   : 509
    <d97>   DW_AT_decl_column : 3
    <d98>   DW_AT_type        : <0xd6d>
 <1><d9c>: Abbrev Number: 10 (DW_TAG_variable)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xc95): cflag
    <da1>   DW_AT_decl_file   : 19
    <da2>   DW_AT_decl_line   : 510
    <da4>   DW_AT_decl_column : 16
    <da5>   DW_AT_type        : <0xd8f>
    <da9>   DW_AT_external    : 1
    <daa>   DW_AT_declaration : 1
 <1><dab>: Abbrev Number: 10 (DW_TAG_variable)
    <dac>   DW_AT_name        : (indirect string, offset: 0x17f): Tflag
    <db0>   DW_AT_decl_file   : 19
    <db1>   DW_AT_decl_line   : 511
    <db3>   DW_AT_decl_column : 13
    <db4>   DW_AT_type        : <0x52d>
    <db8>   DW_AT_external    : 1
    <db9>   DW_AT_declaration : 1
 <1><dba>: Abbrev Number: 10 (DW_TAG_variable)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x797): Tflag_scale
    <dbf>   DW_AT_decl_file   : 19
    <dc0>   DW_AT_decl_line   : 512
    <dc2>   DW_AT_decl_column : 12
    <dc3>   DW_AT_type        : <0x64>
    <dc7>   DW_AT_external    : 1
    <dc8>   DW_AT_declaration : 1
 <1><dc9>: Abbrev Number: 10 (DW_TAG_variable)
    <dca>   DW_AT_name        : (indirect string, offset: 0x829): Tflag_width
    <dce>   DW_AT_decl_file   : 19
    <dcf>   DW_AT_decl_line   : 513
    <dd1>   DW_AT_decl_column : 12
    <dd2>   DW_AT_type        : <0x64>
    <dd6>   DW_AT_external    : 1
    <dd7>   DW_AT_declaration : 1
 <1><dd8>: Abbrev Number: 10 (DW_TAG_variable)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xdd1): iflag
    <ddd>   DW_AT_decl_file   : 19
    <dde>   DW_AT_decl_line   : 514
    <de0>   DW_AT_decl_column : 13
    <de1>   DW_AT_type        : <0x52d>
    <de5>   DW_AT_external    : 1
    <de6>   DW_AT_declaration : 1
 <1><de7>: Abbrev Number: 10 (DW_TAG_variable)
    <de8>   DW_AT_name        : (indirect string, offset: 0x58e): count_wallclock
    <dec>   DW_AT_decl_file   : 19
    <ded>   DW_AT_decl_line   : 515
    <def>   DW_AT_decl_column : 13
    <df0>   DW_AT_type        : <0x52d>
    <df4>   DW_AT_external    : 1
    <df5>   DW_AT_declaration : 1
 <1><df6>: Abbrev Number: 29 (DW_TAG_structure_type)
    <df7>   DW_AT_name        : (indirect string, offset: 0x40): path_set_item
    <dfb>   DW_AT_byte_size   : 4
    <dfc>   DW_AT_decl_file   : 19
    <dfd>   DW_AT_decl_line   : 517
    <dff>   DW_AT_decl_column : 8
    <e00>   DW_AT_sibling     : <0xe15>
 <2><e04>: Abbrev Number: 22 (DW_TAG_member)
    <e05>   DW_AT_name        : (indirect string, offset: 0xc2): path
    <e09>   DW_AT_decl_file   : 19
    <e0a>   DW_AT_decl_line   : 518
    <e0c>   DW_AT_decl_column : 14
    <e0d>   DW_AT_type        : <0x1e1>
    <e11>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e14>: Abbrev Number: 0
 <1><e15>: Abbrev Number: 29 (DW_TAG_structure_type)
    <e16>   DW_AT_name        : (indirect string, offset: 0x74c): path_set
    <e1a>   DW_AT_byte_size   : 12
    <e1b>   DW_AT_decl_file   : 19
    <e1c>   DW_AT_decl_line   : 522
    <e1e>   DW_AT_decl_column : 15
    <e1f>   DW_AT_sibling     : <0xe54>
 <2><e23>: Abbrev Number: 22 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0x6da): paths_selected
    <e28>   DW_AT_decl_file   : 19
    <e29>   DW_AT_decl_line   : 523
    <e2b>   DW_AT_decl_column : 24
    <e2c>   DW_AT_type        : <0xe54>
    <e30>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e33>: Abbrev Number: 22 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0xfee): num_selected
    <e38>   DW_AT_decl_file   : 19
    <e39>   DW_AT_decl_line   : 524
    <e3b>   DW_AT_decl_column : 9
    <e3c>   DW_AT_type        : <0x13a>
    <e40>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><e43>: Abbrev Number: 22 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0xb25): size
    <e48>   DW_AT_decl_file   : 19
    <e49>   DW_AT_decl_line   : 525
    <e4b>   DW_AT_decl_column : 9
    <e4c>   DW_AT_type        : <0x13a>
    <e50>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e55>   DW_AT_byte_size   : 4
    <e56>   DW_AT_type        : <0xdf6>
 <1><e5a>: Abbrev Number: 10 (DW_TAG_variable)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x103d): global_path_set
    <e5f>   DW_AT_decl_file   : 19
    <e60>   DW_AT_decl_line   : 526
    <e62>   DW_AT_decl_column : 3
    <e63>   DW_AT_type        : <0xe15>
    <e67>   DW_AT_external    : 1
    <e68>   DW_AT_declaration : 1
 <1><e69>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xf4b): xflag_opts
    <e6e>   DW_AT_encoding    : 7	(unsigned)
    <e6f>   DW_AT_byte_size   : 4
    <e70>   DW_AT_type        : <0x2b>
    <e74>   DW_AT_decl_file   : 19
    <e75>   DW_AT_decl_line   : 528
    <e77>   DW_AT_decl_column : 6
    <e78>   DW_AT_sibling     : <0xe9b>
 <2><e7c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x9f9): HEXSTR_NONE
    <e81>   DW_AT_const_value : 0
 <2><e82>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e83>   DW_AT_name        : (indirect string, offset: 0xf80): HEXSTR_NON_ASCII
    <e87>   DW_AT_const_value : 1
 <2><e88>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e89>   DW_AT_name        : (indirect string, offset: 0x8eb): HEXSTR_ALL
    <e8d>   DW_AT_const_value : 2
 <2><e8e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x665): HEXSTR_NON_ASCII_CHARS
    <e93>   DW_AT_const_value : 3
 <2><e94>: Abbrev Number: 26 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x1008): NUM_HEXSTR_OPTS
    <e99>   DW_AT_const_value : 4
 <2><e9a>: Abbrev Number: 0
 <1><e9b>: Abbrev Number: 10 (DW_TAG_variable)
    <e9c>   DW_AT_name        : (indirect string, offset: 0xdab): xflag
    <ea0>   DW_AT_decl_file   : 19
    <ea1>   DW_AT_decl_line   : 541
    <ea3>   DW_AT_decl_column : 17
    <ea4>   DW_AT_type        : <0x2b>
    <ea8>   DW_AT_external    : 1
    <ea9>   DW_AT_declaration : 1
 <1><eaa>: Abbrev Number: 10 (DW_TAG_variable)
    <eab>   DW_AT_name        : (indirect string, offset: 0xc50): followfork
    <eaf>   DW_AT_decl_file   : 19
    <eb0>   DW_AT_decl_line   : 542
    <eb2>   DW_AT_decl_column : 13
    <eb3>   DW_AT_type        : <0x52d>
    <eb7>   DW_AT_external    : 1
    <eb8>   DW_AT_declaration : 1
 <1><eb9>: Abbrev Number: 10 (DW_TAG_variable)
    <eba>   DW_AT_name        : (indirect string, offset: 0x310): output_separately
    <ebe>   DW_AT_decl_file   : 19
    <ebf>   DW_AT_decl_line   : 543
    <ec1>   DW_AT_decl_column : 13
    <ec2>   DW_AT_type        : <0x52d>
    <ec6>   DW_AT_external    : 1
    <ec7>   DW_AT_declaration : 1
 <1><ec8>: Abbrev Number: 10 (DW_TAG_variable)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x220): stack_trace_enabled
    <ecd>   DW_AT_decl_file   : 19
    <ece>   DW_AT_decl_line   : 546
    <ed0>   DW_AT_decl_column : 13
    <ed1>   DW_AT_type        : <0x52d>
    <ed5>   DW_AT_external    : 1
    <ed6>   DW_AT_declaration : 1
 <1><ed7>: Abbrev Number: 10 (DW_TAG_variable)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x653): ptrace_setoptions
    <edc>   DW_AT_decl_file   : 19
    <edd>   DW_AT_decl_line   : 550
    <edf>   DW_AT_decl_column : 17
    <ee0>   DW_AT_type        : <0x2b>
    <ee4>   DW_AT_external    : 1
    <ee5>   DW_AT_declaration : 1
 <1><ee6>: Abbrev Number: 10 (DW_TAG_variable)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x9e4): max_strlen
    <eeb>   DW_AT_decl_file   : 19
    <eec>   DW_AT_decl_line   : 551
    <eee>   DW_AT_decl_column : 17
    <eef>   DW_AT_type        : <0x2b>
    <ef3>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef5>: Abbrev Number: 10 (DW_TAG_variable)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xa1c): os_release
    <efa>   DW_AT_decl_file   : 19
    <efb>   DW_AT_decl_line   : 552
    <efd>   DW_AT_decl_column : 17
    <efe>   DW_AT_type        : <0x2b>
    <f02>   DW_AT_external    : 1
    <f03>   DW_AT_declaration : 1
 <1><f04>: Abbrev Number: 10 (DW_TAG_variable)
    <f05>   DW_AT_name        : (indirect string, offset: 0x6e9): xlat_verbosity
    <f09>   DW_AT_decl_file   : 19
    <f0a>   DW_AT_decl_line   : 914
    <f0c>   DW_AT_decl_column : 24
    <f0d>   DW_AT_type        : <0xa42>
    <f11>   DW_AT_external    : 1
    <f12>   DW_AT_declaration : 1
 <1><f13>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f14>   DW_AT_name        : (indirect string, offset: 0x571): xlat_style_private_flag_bits
    <f18>   DW_AT_encoding    : 7	(unsigned)
    <f19>   DW_AT_byte_size   : 4
    <f1a>   DW_AT_type        : <0x2b>
    <f1e>   DW_AT_decl_file   : 19
    <f1f>   DW_AT_decl_line   : 934
    <f21>   DW_AT_decl_column : 6
    <f22>   DW_AT_sibling     : <0xf3f>
 <2><f26>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f27>   DW_AT_name        : (indirect string, offset: 0x28f): PAF_PRINT_INDICES_BIT
    <f2b>   DW_AT_const_value : 5
 <2><f2c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f2d>   DW_AT_name        : (indirect string, offset: 0xadc): PAF_ARRAY_TRUNCATED_BIT
    <f31>   DW_AT_const_value : 6
 <2><f32>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x3ce): PXF_DEFAULT_STR_BIT
    <f37>   DW_AT_const_value : 7
 <2><f38>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0xc32): SPFF_AUXSTR_MODE_BIT
    <f3d>   DW_AT_const_value : 8
 <2><f3e>: Abbrev Number: 0
 <1><f3f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <f40>   DW_AT_name        : (indirect string, offset: 0xce1): find_xlat_flag_bits
    <f44>   DW_AT_encoding    : 7	(unsigned)
    <f45>   DW_AT_byte_size   : 4
    <f46>   DW_AT_type        : <0x2b>
    <f4a>   DW_AT_decl_file   : 19
    <f4b>   DW_AT_decl_line   : 1438
    <f4d>   DW_AT_decl_column : 6
    <f4e>   DW_AT_sibling     : <0xf59>
 <2><f52>: Abbrev Number: 26 (DW_TAG_enumerator)
    <f53>   DW_AT_name        : (indirect string, offset: 0x933): FXL_CASE_SENSITIVE_BIT
    <f57>   DW_AT_const_value : 0
 <2><f58>: Abbrev Number: 0
 <1><f59>: Abbrev Number: 10 (DW_TAG_variable)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x9c0): printing_tcp
    <f5e>   DW_AT_decl_file   : 19
    <f5f>   DW_AT_decl_line   : 1684
    <f61>   DW_AT_decl_column : 20
    <f62>   DW_AT_type        : <0x609>
    <f66>   DW_AT_external    : 1
    <f67>   DW_AT_declaration : 1
 <1><f68>: Abbrev Number: 10 (DW_TAG_variable)
    <f69>   DW_AT_name        : (indirect string, offset: 0x525): errnoent
    <f6d>   DW_AT_decl_file   : 19
    <f6e>   DW_AT_decl_line   : 1882
    <f70>   DW_AT_decl_column : 26
    <f71>   DW_AT_type        : <0x461>
    <f75>   DW_AT_external    : 1
    <f76>   DW_AT_declaration : 1
 <1><f77>: Abbrev Number: 10 (DW_TAG_variable)
    <f78>   DW_AT_name        : (indirect string, offset: 0x835): signalent
    <f7c>   DW_AT_decl_file   : 19
    <f7d>   DW_AT_decl_line   : 1883
    <f7f>   DW_AT_decl_column : 26
    <f80>   DW_AT_type        : <0x461>
    <f84>   DW_AT_external    : 1
    <f85>   DW_AT_declaration : 1
 <1><f86>: Abbrev Number: 10 (DW_TAG_variable)
    <f87>   DW_AT_name        : (indirect string, offset: 0xe24): nerrnos
    <f8b>   DW_AT_decl_file   : 19
    <f8c>   DW_AT_decl_line   : 1884
    <f8e>   DW_AT_decl_column : 27
    <f8f>   DW_AT_type        : <0x32>
    <f93>   DW_AT_external    : 1
    <f94>   DW_AT_declaration : 1
 <1><f95>: Abbrev Number: 10 (DW_TAG_variable)
    <f96>   DW_AT_name        : (indirect string, offset: 0xfd7): nsignals
    <f9a>   DW_AT_decl_file   : 19
    <f9b>   DW_AT_decl_line   : 1885
    <f9d>   DW_AT_decl_column : 27
    <f9e>   DW_AT_type        : <0x32>
    <fa2>   DW_AT_external    : 1
    <fa3>   DW_AT_declaration : 1
 <1><fa4>: Abbrev Number: 15 (DW_TAG_array_type)
    <fa5>   DW_AT_type        : <0x861>
    <fa9>   DW_AT_sibling     : <0xfaf>
 <2><fad>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fae>: Abbrev Number: 0
 <1><faf>: Abbrev Number: 3 (DW_TAG_const_type)
    <fb0>   DW_AT_type        : <0xfa4>
 <1><fb4>: Abbrev Number: 10 (DW_TAG_variable)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xcac): sysent0
    <fb9>   DW_AT_decl_file   : 19
    <fba>   DW_AT_decl_line   : 1887
    <fbc>   DW_AT_decl_column : 28
    <fbd>   DW_AT_type        : <0xfaf>
    <fc1>   DW_AT_external    : 1
    <fc2>   DW_AT_declaration : 1
 <1><fc3>: Abbrev Number: 15 (DW_TAG_array_type)
    <fc4>   DW_AT_type        : <0x8c8>
    <fc8>   DW_AT_sibling     : <0xfce>
 <2><fcc>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><fcd>: Abbrev Number: 0
 <1><fce>: Abbrev Number: 3 (DW_TAG_const_type)
    <fcf>   DW_AT_type        : <0xfc3>
 <1><fd3>: Abbrev Number: 10 (DW_TAG_variable)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x1033): ioctlent0
    <fd8>   DW_AT_decl_file   : 19
    <fd9>   DW_AT_decl_line   : 1888
    <fdb>   DW_AT_decl_column : 30
    <fdc>   DW_AT_type        : <0xfce>
    <fe0>   DW_AT_external    : 1
    <fe1>   DW_AT_declaration : 1
 <1><fe2>: Abbrev Number: 10 (DW_TAG_variable)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x433): personality_names
    <fe7>   DW_AT_decl_file   : 19
    <fe8>   DW_AT_decl_line   : 1890
    <fea>   DW_AT_decl_column : 26
    <feb>   DW_AT_type        : <0x461>
    <fef>   DW_AT_external    : 1
    <ff0>   DW_AT_declaration : 1
 <1><ff1>: Abbrev Number: 10 (DW_TAG_variable)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x855): sysent
    <ff6>   DW_AT_decl_file   : 19
    <ff7>   DW_AT_decl_line   : 1893
    <ff9>   DW_AT_decl_column : 29
    <ffa>   DW_AT_type        : <0x9ad>
    <ffe>   DW_AT_external    : 1
    <fff>   DW_AT_declaration : 1
 <1><1000>: Abbrev Number: 10 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0xc47): ioctlent
    <1005>   DW_AT_decl_file   : 19
    <1006>   DW_AT_decl_line   : 1894
    <1008>   DW_AT_decl_column : 31
    <1009>   DW_AT_type        : <0x100f>
    <100d>   DW_AT_external    : 1
    <100e>   DW_AT_declaration : 1
 <1><100f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1010>   DW_AT_byte_size   : 4
    <1011>   DW_AT_type        : <0x8c8>
 <1><1015>: Abbrev Number: 10 (DW_TAG_variable)
    <1016>   DW_AT_name        : (indirect string, offset: 0x83f): nsyscalls
    <101a>   DW_AT_decl_file   : 19
    <101b>   DW_AT_decl_line   : 1900
    <101d>   DW_AT_decl_column : 17
    <101e>   DW_AT_type        : <0x2b>
    <1022>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1024>: Abbrev Number: 10 (DW_TAG_variable)
    <1025>   DW_AT_name        : (indirect string, offset: 0xe3e): nioctlents
    <1029>   DW_AT_decl_file   : 19
    <102a>   DW_AT_decl_line   : 1901
    <102c>   DW_AT_decl_column : 17
    <102d>   DW_AT_type        : <0x2b>
    <1031>   DW_AT_external    : 1
    <1032>   DW_AT_declaration : 1
 <1><1033>: Abbrev Number: 15 (DW_TAG_array_type)
    <1034>   DW_AT_type        : <0x32>
    <1038>   DW_AT_sibling     : <0x1043>
 <2><103c>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <103d>   DW_AT_type        : <0x2b>
    <1041>   DW_AT_upper_bound : 2
 <2><1042>: Abbrev Number: 0
 <1><1043>: Abbrev Number: 3 (DW_TAG_const_type)
    <1044>   DW_AT_type        : <0x1033>
 <1><1048>: Abbrev Number: 10 (DW_TAG_variable)
    <1049>   DW_AT_name        : (indirect string, offset: 0xeb3): nsyscall_vec
    <104d>   DW_AT_decl_file   : 19
    <104e>   DW_AT_decl_line   : 1903
    <1050>   DW_AT_decl_column : 27
    <1051>   DW_AT_type        : <0x1043>
    <1055>   DW_AT_external    : 1
    <1056>   DW_AT_declaration : 1
 <1><1057>: Abbrev Number: 15 (DW_TAG_array_type)
    <1058>   DW_AT_type        : <0x9b3>
    <105c>   DW_AT_sibling     : <0x1067>
 <2><1060>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1061>   DW_AT_type        : <0x2b>
    <1065>   DW_AT_upper_bound : 2
 <2><1066>: Abbrev Number: 0
 <1><1067>: Abbrev Number: 3 (DW_TAG_const_type)
    <1068>   DW_AT_type        : <0x1057>
 <1><106c>: Abbrev Number: 10 (DW_TAG_variable)
    <106d>   DW_AT_name        : (indirect string, offset: 0x784): sysent_vec
    <1071>   DW_AT_decl_file   : 19
    <1072>   DW_AT_decl_line   : 1904
    <1074>   DW_AT_decl_column : 35
    <1075>   DW_AT_type        : <0x1067>
    <1079>   DW_AT_external    : 1
    <107a>   DW_AT_declaration : 1
 <1><107b>: Abbrev Number: 10 (DW_TAG_variable)
    <107c>   DW_AT_name        : (indirect string, offset: 0x36f): inject_vec
    <1080>   DW_AT_decl_file   : 19
    <1081>   DW_AT_decl_line   : 1905
    <1083>   DW_AT_decl_column : 28
    <1084>   DW_AT_type        : <0x9b8>
    <1088>   DW_AT_external    : 1
    <1089>   DW_AT_declaration : 1
 <1><108a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <108b>   DW_AT_name        : (indirect string, offset: 0xd35): audit_arch_t
    <108f>   DW_AT_byte_size   : 8
    <1090>   DW_AT_decl_file   : 19
    <1091>   DW_AT_decl_line   : 1907
    <1093>   DW_AT_decl_column : 8
    <1094>   DW_AT_sibling     : <0x10b9>
 <2><1098>: Abbrev Number: 22 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0x559): arch
    <109d>   DW_AT_decl_file   : 19
    <109e>   DW_AT_decl_line   : 1908
    <10a0>   DW_AT_decl_column : 15
    <10a1>   DW_AT_type        : <0x2b>
    <10a5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10a8>: Abbrev Number: 22 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x9a6): flag
    <10ad>   DW_AT_decl_file   : 19
    <10ae>   DW_AT_decl_line   : 1909
    <10b0>   DW_AT_decl_column : 15
    <10b1>   DW_AT_type        : <0x2b>
    <10b5>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><10b8>: Abbrev Number: 0
 <1><10b9>: Abbrev Number: 3 (DW_TAG_const_type)
    <10ba>   DW_AT_type        : <0x108a>
 <1><10be>: Abbrev Number: 15 (DW_TAG_array_type)
    <10bf>   DW_AT_type        : <0x10b9>
    <10c3>   DW_AT_sibling     : <0x10ce>
 <2><10c7>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <10c8>   DW_AT_type        : <0x2b>
    <10cc>   DW_AT_upper_bound : 2
 <2><10cd>: Abbrev Number: 0
 <1><10ce>: Abbrev Number: 3 (DW_TAG_const_type)
    <10cf>   DW_AT_type        : <0x10be>
 <1><10d3>: Abbrev Number: 10 (DW_TAG_variable)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x924): audit_arch_vec
    <10d8>   DW_AT_decl_file   : 19
    <10d9>   DW_AT_decl_line   : 1912
    <10db>   DW_AT_decl_column : 34
    <10dc>   DW_AT_type        : <0x10ce>
    <10e0>   DW_AT_external    : 1
    <10e1>   DW_AT_declaration : 1
 <1><10e2>: Abbrev Number: 31 (DW_TAG_structure_type)
    <10e3>   DW_AT_byte_size   : 180
    <10e4>   DW_AT_decl_file   : 21
    <10e5>   DW_AT_decl_line   : 2
    <10e6>   DW_AT_decl_column : 9
    <10e7>   DW_AT_sibling     : <0x139c>
 <2><10eb>: Abbrev Number: 9 (DW_TAG_member)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x1cc): block_ioctl
    <10f0>   DW_AT_decl_file   : 21
    <10f1>   DW_AT_decl_line   : 3
    <10f2>   DW_AT_decl_column : 8
    <10f3>   DW_AT_type        : <0x13b6>
    <10f7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10fa>: Abbrev Number: 9 (DW_TAG_member)
    <10fb>   DW_AT_name        : (indirect string, offset: 0xa7b): btrfs_ioctl
    <10ff>   DW_AT_decl_file   : 21
    <1100>   DW_AT_decl_line   : 6
    <1101>   DW_AT_decl_column : 8
    <1102>   DW_AT_type        : <0x13b6>
    <1106>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1109>: Abbrev Number: 9 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0x722): evdev_write_ioctl_mpers
    <110e>   DW_AT_decl_file   : 21
    <110f>   DW_AT_decl_line   : 9
    <1110>   DW_AT_decl_column : 8
    <1111>   DW_AT_type        : <0x13b6>
    <1115>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1118>: Abbrev Number: 9 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0x6f8): get_sock_fprog_size
    <111d>   DW_AT_decl_file   : 21
    <111e>   DW_AT_decl_line   : 12
    <111f>   DW_AT_decl_column : 17
    <1120>   DW_AT_type        : <0x13c2>
    <1124>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1127>: Abbrev Number: 9 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0x19b): fetch_bpf_fprog
    <112c>   DW_AT_decl_file   : 21
    <112d>   DW_AT_decl_line   : 15
    <112e>   DW_AT_decl_column : 10
    <112f>   DW_AT_type        : <0x13e2>
    <1133>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1136>: Abbrev Number: 9 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0x911): fetch_struct_flock
    <113b>   DW_AT_decl_file   : 21
    <113c>   DW_AT_decl_line   : 18
    <113d>   DW_AT_decl_column : 10
    <113e>   DW_AT_type        : <0x13e2>
    <1142>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1145>: Abbrev Number: 9 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0xc5b): fetch_struct_flock64
    <114a>   DW_AT_decl_file   : 21
    <114b>   DW_AT_decl_line   : 21
    <114c>   DW_AT_decl_column : 10
    <114d>   DW_AT_type        : <0x13e2>
    <1151>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><1154>: Abbrev Number: 9 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0x14c): fetch_struct_iovec
    <1159>   DW_AT_decl_file   : 21
    <115a>   DW_AT_decl_line   : 24
    <115b>   DW_AT_decl_column : 10
    <115c>   DW_AT_type        : <0x13e2>
